{
  "job_id": "1039602",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Thumbnail-Graphic-Designer-1039602",
  "scraped_at": "2025-07-15T15:40:46.646360",
  "title": "Thumbnail / Graphic Designer",
  "type_of_work": "Full Time",
  "salary": "$690 per month / $4.30 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: YouTube Thumbnail / Graphic Designer\n\r\nLocation: Remote (8:00 AM to 4:00 PM Philippine Time Zone)\n\r\nWe are seeking a highly creative and skilled Thumbnail Artist to join our team. As a Thumbnail Artist, you will play a crucial role in capturing the attention of the viewers through captivating thumbnails.\n\r\nResponsibilities:\n\r\n    Design visually appealing thumbnails for different social media videos, ensuring they are eye-catching and informative,.\r\n    Collaborate with the creative team to conceptualize and develop thumbnail ideas that resonate with our target audience.\r\n    Utilize Adobe Photoshop and Adobe Illustrator to create high-quality, optimized thumbnails for various platforms.\n\r\nRequirements:\n\r\n    Proven experience and proficiency in Adobe Photoshop and Adobe Illustrator.\r\n    Exceptional creative and artistic abilities with a keen eye for design, composition, and color.\r\n    Strong understanding of digital marketing principles and the ability to tailor thumbnails to optimize click-through rates.\r\n    Excellent communication and collaboration skills, as you'll be working closely with our creative team in a remote environment.\r\n    Ability to meet deadlines and manage multiple projects simultaneously.\r\n    Self-motivated and able to work independently while adhering to the given guidelines and requirements.\n\r\nWorking Hours:\n\r\nThis is a remote position with working hours from 8:00 AM to 4:00 PM M-F Philippine Time Zone.\n\r\nRates:\n\r\nThe rates are $4.30 per hour, 8 hrs a day, 40 days a week. Payments are made bi-weekly. \n\r\nIf you're passionate about creating visually captivating thumbnails and enhancing digital content engagement, we invite you to apply for this exciting opportunity and be a key contributor to our creative team.\n\r\nTo apply, please send your resume, portfolio showcasing your thumbnail design work, and a brief cover letter explaining why you would be an excellent fit for this role. Please include the word SOFA in your message title otherwise you application won't be considered.",
  "skill_requirements": [
    "Photoshop",
    "Illustrator",
    "Thumbnail & Social Media Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:31:54.165210",
      "reason": "Job first discovered"
    }
  ]
}