{
  "job_id": "1039038",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SEO-Assistant-Project-Manager-with-SEO-skills-and-knowledge-1039038",
  "scraped_at": "2025-07-15T15:49:01.892522",
  "title": "SEO Assistant Project Manager (with SEO skills and knowledge)",
  "type_of_work": "Part Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a rapidly growing coaching group specializing in digital marketing services based in Washington DC, and we are seeking a highly motivated GMB Assistant Project Manager to join our team. \n\r\nAs a Google My Business Assistant Project Manager with SEO expertise at [Company Name], you will be responsible for managing and optimizing our clients' Google My Business (GMB) listings. Your role will include data analysis, strategy development, project management, and SEO implementation to enhance the online visibility and local search rankings of our clients.\n\r\nKey Responsibilities:\r\nGoogle My Business Management:\r\nManage, optimize, and update clients' GMB listings.\r\nEnsure accurate and up-to-date business information, including NAP (Name, Address, Phone), business hours, categories, and photos.\r\nMonitor and respond to customer reviews and questions.\r\nSEO Strategy and Implementation:\r\nConduct keyword research and competitor analysis to identify opportunities.\r\nImplement on-page and off-page SEO strategies to improve local search rankings.\r\nOptimize website content for local SEO.\r\nData Analysis:\r\nTrack and analyze GMB performance, website traffic, and keyword rankings.\r\nProvide insights and reports to clients, highlighting improvements and areas for growth.\r\nUtilize tools like Google Analytics, Google Search Console, and SEO software.\r\nProject Management:\r\nCollaborate with cross-functional teams to ensure the successful execution of SEO strategies.\r\nManage project timelines, budgets, and resources.\r\nMaintain strong communication with clients, addressing their needs and concerns.\r\nStay Updated on Industry Trends:\r\nKeep up-to-date with the latest developments in local SEO, Google My Business, and search engine algorithms.\r\nAttend relevant webinars, conferences, and training to continuously improve skills and knowledge.\n\r\nQualifications:\r\nBachelor's degree in Marketing, Business, or a related field.\r\nProven experience in SEO, local search optimization, and Google My Business management.\r\nProficiency in SEO tools such as SEMrush, Moz, Ahrefs, and Google Analytics.\r\nStrong data analysis skills and the ability to translate data into actionable insights.\r\nExceptional project management and organizational skills.\r\nExcellent communication and client management skills.\r\nGoogle My Business Certification and SEO certifications are a plus.\n\r\nOther Positions Available:\r\nAssistant Quality Controller \n\r\nIf you meet these qualifications and are excited about the opportunity to work with a growing team, we encourage you to apply using the link below. We offer a competitive salary, benefits package, and the opportunity to work with a dynamic and innovative team.",
  "skill_requirements": [
    "SEO",
    "Local SEO",
    "Keyword Research"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:49:01.896928",
      "reason": "Job first discovered"
    }
  ]
}