{
  "job_id": "1079353",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-UXUIGraphic-Designer-1079353",
  "scraped_at": "2025-07-15T14:26:28.321233",
  "title": "Senior UX/UI/Graphic Designer",
  "type_of_work": "Part Time",
  "salary": "Depends on experience",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a digital agency that operates primarily in the travel and tourism space. We have an awesome opportunity for a Graphic/UX Designer to join a dynamic team and drive our fast growth. By joining the marketing team early, you’ll be able to carve out your own role and there’s plenty of opportunity to take the next big step in your career. As a UI/UX Specialist, you will play a pivotal role in enhancing the user experience, from purchase path to engaging email campaigns and dynamic split testing.\n\r\nThe Role:\r\nThis is a senior-level position that requires a seasoned professional who excels in their craft and can deliver polished, high-quality designs. You’ll be a highly valued member who will work closely with the marketing and development team.\n\r\nWhat we need from you:\r\n• 3 - 6 years of professional work experience as a UX/UI Designer, Web Design.\r\n• Strong craft design skills founded in strong visual communication\r\n• Experience in or an understanding of creating and developing a style guide component library.\r\n• Understands the impact of screen design on users, identifies opportunities to improve on-screen interaction, and rationalises design decisions based on evidence\r\n• Knowledge of A/B testing, and test and learn approaches to conversion optimisation.\r\n• Good knowledge of design thinking and inclusive design practices and understanding of accessibility standards\r\n• Expert knowledge of modern design tools (Figma, Adobe XD, Photoshop, Illustrator, and InDesign.)\r\n• Be familiar with HTML/CSS and other current web technologies (preferred).\r\n• Excellent stakeholder management and communication skills..\n\r\nWork is in Australian timezone.\r\nEnglish MUST be at an advanced level.\r\nIf the above sounds like you, please apply. \n\r\nPlease also let us know why you are the right person, explain your experience and tell us why we should hire you as our UX/UI/ Graphic Designer. Your application will include the following questions:\n\r\nPlease provide a link to your portfolio showcasing your work in UX, UI, and graphic design. Highlight a project where you had a significant impact on the user experience or visual design.\r\nHow many years' experience do you have as a User Experience and Interface Designer?\r\nDescribe your design process when tackling a new project. How do you approach user research, wireframing, prototyping, and final design?\r\nCan you share an example of a challenging design problem you faced and how you resolved it? What was the outcome?\r\nHow do you collaborate with cross-functional teams, including developers, product managers, and stakeholders, to ensure your designs are implemented effectively?\r\nWhich design tools and software are you proficient in? Please provide examples of how you've used them in previous projects.\r\nHow do you incorporate user feedback into your design process? Provide an example of a time when user feedback significantly influenced your design.\r\nWhat principles do you follow to ensure that your designs are both visually appealing and functional? Can you share an example of a design that demonstrates these principles?\r\nHow do you prioritise and manage multiple design projects with varying deadlines? Share an example of how you successfully juggled multiple responsibilities.\r\nDescribe a situation where you received critical feedback on your design. How did you handle it, and what changes did you make as a result?\r\nWhat are some current UX/UI design trends that you find exciting or relevant? How do you stay updated with industry trends and incorporate them into your work?\r\nWhat industries or types of projects do you have the most experience working on, and how does that experience benefit your design approach?\r\nWhat's your expected salary?",
  "skill_requirements": [
    "Graphic Design",
    "Web Design & Page Layout",
    "Advertising And Marketing Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:31:06.042449",
      "reason": "Job first discovered"
    }
  ]
}