{
  "job_id": "1090306",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Business-Intelligence-Project-Manager-1090306",
  "scraped_at": "2025-07-15T12:29:42.517825",
  "title": "Business Intelligence Project Manager",
  "type_of_work": "Part Time",
  "salary": "$7.00",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "English level: C1/C2\n\n\r\nLocation: Fully Remote\n\n\r\nRole: Business Intelligence Technical Project Manager [contract, remote]\n\n\r\nRoles & Responsibilities:\n\r\nThe Technical Project Manager plans, coordinates, and facilitates Business Intelligence (BI) projects from start to delivery. The TPM works with data scientists, analysts, developers, and subject matter experts to understand business requirements, translates these requirements into technical and functional specifications, and shepherds them through the software development lifecycle. The TPM owns the progress of the project from the point of scheduling to the point of release to production, clearly communicates the project progress, resolves unknowns, and removes any impediments that keep the team from completing their assigned work.\n\n\r\nDuties:\n\r\nOwns assigned product feature delivery from start to finish.\r\nPartner and build relationships with developers to ensure that projects are developed and delivered to production as efficiently as possible.\r\nQA’s project development.\r\nWill assist with development if project requires.\r\nWorking in partnership with Product and Business stakeholders, flesh out and/or create actionable technical project specifications from business requirements.\r\nUnderstand at a deep level the product features for which the team is responsible, becoming the \"internal subject matter expert\" for systems maintained by the team.\r\nIdentify obstacles to efficient completion of delivery milestones and proactively remove or mitigate them. Adapt project scope in response to deadline changes and/or project obstacles to ensure delivery of valuable business features on the original deadline.\r\nCoordinate, influence and orchestrate with other project teams for cross-team dependencies.\r\nEnsure timely tracking and completion of project deliverables.\r\nFacilitate the project refining and estimation efforts to ensure that the team understands the requirements and has produced a work plan that accounts for known risks and mitigates unknown issues.\r\nCommunicate scope or milestone changes early and clearly to stakeholders to ensure buy-in throughout the organization.\r\nFoster a collaborative environment reinforcing transparency, quality, and continuous learning.\r\nWork interactively with stakeholders and teaUpgrade to see actual infombers identify areas of improvement for the team or team's products.\r\nProvide executive team project reporting- project status, risks, issues and mitigation plan.\n\n\r\nSkills & Qualifications:\n\r\nDeep understanding of Tableau is a must.\r\nC1/C2 level English is a must.\r\nMinimum of 3 years of experience with data warehousing and business intelligence.\r\n3+ years of experience with data integration projects and business intelligence implementation.\r\nAt least 3 years of experience with business intelligence design, development, production, installation, testing, and evaluation.\r\nExperience with reporting, dashboards, and data visualizations to meet business objectives.\r\nStrong understanding of business to technical requirement translation.\r\nDemonstrated ability to lead functional, technical, and strategic discussions to drive successful outcomes.\r\nExcellent written, communication and relational skills.\r\nDeep fluency with spreadsheet and presentation tools.\r\nExperience with both Agile and traditional (e.g., waterfall) development practices.\r\nKnowledge of tracking and reporting tools, JIRA preferred. Affinity with Confluence.\n\n\r\nThank you for considering this opportunity, we look forward to reviewing your application.",
  "skill_requirements": [
    "SQL",
    "Software Development Project Manager",
    "Tableau"
  ],
  "is_active": true,
  "status_history": []
}