{
  "job_id": "1109332",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-Proactive-Driven-and-Strategic-1109332",
  "scraped_at": "2025-07-15T12:28:58.835768",
  "title": "Executive Assistant – Proactive, Driven, and Strategic",
  "type_of_work": "Full Time",
  "salary": "$5",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Title: Executive Assistant (Remote)\r\nLocation: Remote\r\nEmployment Type: Full-Time\n\r\nExecutive Assistant – Proactive, Driven, and Strategic\n\r\nAbout the Role:\n\r\nWe’re looking for a highly driven, strategic, and detail-oriented Executive Assistant to directly support senior leadership in a fast-paced, growth-focused environment. This isn’t just an administrative role — it’s for someone who takes initiative, solves problems before they arise, and thrives on being two steps ahead. You’ll be a trusted right hand to the leadership team, helping manage day-to-day execution while actively contributing to long-term planning and operational improvements.\n\r\n*KEY RESPONSIBILITIES:\n\r\n- Own and streamline executive calendars, inboxes, communications, and logistics with minimal oversight.\n\r\n-Coordinate internal and external meetings, prepare agendas, document action items, and ensure accountability on follow-through.\n\r\n- Track cross-departmental deadlines, drive projects forward, and flag bottlenecks before they become issues.\n\r\n- Act as a strategic gatekeeper and liaison for senior leadership — sharp judgment and clear communication are essential.\n\r\n- Manage travel planning, executive documentation, SOP development, and general administrative support.\n\r\n- Support innovation and business efficiency initiatives — including light content creation and working with AI tools.\n\r\n- Conduct recurring alignment check-ins with leadership to recalibrate goals, review KPIs, and adjust priorities.\n\r\n- Anticipate needs before they are spoken — jump in, take ownership, and figure things out quickly.\n\r\n- Step in wherever needed, no matter how big or small the task — you’re solutions-first and unafraid to lead.\n\r\n* WHO YOU ARE:\n\r\n- High initiative: You don’t wait to be told — you look ahead, take charge, and get it done.\n\r\n- Strategic executor: You combine critical thinking with precise follow-through.\n\r\n- Clear communicator: You convey ideas with confidence and clarity, both written and verbal.\n\r\n- Adaptable: You thrive in a fast-paced, ever-changing environment and can quickly shift priorities.\n\r\n- Detail-obsessed: Nothing slips through the cracks on your watch.\n\r\n- Discreet and trustworthy: You handle confidential matters with maturity and professionalism.\n\r\n- Tech-savvy and resourceful: You’re quick to learn tools, especially if they make things more efficient.\n\r\n- Growth-oriented: You’re excited to evolve with the company and take on more responsibility over time.\n\r\n* REQUIREMENTS:\n\r\n- Minimum 2 years in an executive support, operations, or administrative role.\n\r\n- Experience supporting senior leadership or founders is highly preferred.\n\r\n- Strong proficiency in Google Workspace, Microsoft Office, and project/task management tools (e.g., Asana, Trello, or similar).\n\r\n- Bonus: experience with appointment setting, sales support, or marketing coordination.\n\r\n* Why Join Us?\n\r\nAt K2 Renew, we connect landowners to solar opportunities that protect their land and legacy. As Executive Assistant, you won’t just be organizing — you’ll be helping lead. If you’re proactive, confident, and ready to make things happen, this is your chance to grow alongside a mission-driven company shaping the future of renewable energy.\n\r\n*How to Apply:\n\r\n- Email your resume and cover letter to Upgrade to see actual info your cover letter, please:\n\r\nShare your experience in appointment setting or sales support,\r\nExplain why your initiative and strategic thinking make you the ideal fit for this role.\n\r\nSubject line must be:\r\nExecutive Assistant – [Full Name]\r\n(Applications without this subject line will not be considered.)\n\r\nApplications via this platform will not be accepted. Email only.",
  "skill_requirements": [
    "Email Marketing",
    "Gohighlevel Real Estate",
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": []
}