{
  "job_id": "1115427",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SEO-Fulfillment-Specialist-Part-Time-1115427",
  "scraped_at": "2025-07-15T15:39:42.003569",
  "title": "SEO Fulfillment Specialist (Part-Time)",
  "type_of_work": "Part Time",
  "salary": "TBD",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you detail-oriented, efficient, and have a working knowledge of SEO? Our digital marketing and SEO services company is seeking a SEO Fulfillment Specialist to handle the hands-on processing and fulfillment of SEO trial orders. You will be responsible for executing key SEO tasks, ensuring accurate and timely delivery of services, and supporting our goal of delivering exceptional value to new clients during their trial period.\n\r\nKey Responsibilities:\r\nProcess and fulfill SEO free trial orders, ensuring each task is executed to meet quality standards.\r\nPerform essential SEO work, such as keyword research, meta tag creation, basic on-page optimization, and backlink submissions (as applicable to our trial package).\r\nFollow internal workflows and checklists to ensure consistent delivery of services.\r\nMonitor timelines and prioritize tasks to meet client trial deadlines.\r\nCommunicate status updates and flag issues to the Operations Manager or team lead as needed.\r\nContribute to client satisfaction by ensuring that all trial deliverables are complete, accurate, and impactful.\n\r\nQualifications:\r\nFoundational to intermediate understanding of SEO (on-page, off-page, keyword optimization, etc.).\r\nPrior experience in SEO, digital marketing, or task fulfillment roles preferred.\r\nStrong attention to detail and ability to follow structured processes.\r\nComfortable working independently and handling multiple tasks at once.\r\nGood communication skills and ability to report progress clearly.\r\nFamiliarity with tools like Google Sheets, Trello, Asana, or other workflow platforms.\n\r\nIf you meet these qualifications and are passionate about delivering exceptional customer service, especially with SEO expertise, we invite you to apply using the link below. \n\r\nTo apply, please use this link: Upgrade to see actual info",
  "skill_requirements": [
    "SEO",
    "Local SEO",
    "Keyword Research"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:39:42.005151",
      "reason": "Job first discovered"
    }
  ]
}