{
  "job_id": "1120634",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Urgent-hiring-SEO-Expert-1120634",
  "scraped_at": "2025-07-15T12:28:55.216387",
  "title": "Urgent hiring: SEO Expert",
  "type_of_work": "Full Time",
  "salary": "starts at Php60,000 - Php90,000 + bonuses",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you ready to elevate your SEO skills and work alongside industry leaders? BrandLume is seeking an SEO Marketing Expert to join our team of digital marketing enthusiasts. Together, we'll deliver exceptional results while meeting clients' demands and deadlines.\n\n\r\nJob responsibilities:\r\nExecute tests, collect and analyze data and results, identify trends and insights in order to achieve maximum ROI in paid search campaigns\r\nTrack, report, and analyze website analytics and PPC initiatives and campaigns\r\nConduct SEO audit Manage campaign expenses, staying on budget, estimating monthly costs and reconciling discrepancies.\r\nOptimize copy and landing pages for search engine marketing\r\nPerform ongoing keyword discovery, expansion and optimization\r\nResearch and implement search engine optimization recommendations\r\nResearch and analyze competitor advertising links\r\nDevelop and implement link building strategy\r\nWork with the development team to ensure SEO best practices are properly implemented on newly developed code\r\nWork with editorial and marketing teams to drive SEO in content creation and content programming\r\nRecommend changes to website architecture, content, linking and other factors to improve SEO positions for target keywords\n\r\nRequirements:\r\nMust be able to work 9 AM – 5 PM EST\n\r\nAt least 3 years of experience as an SEO Specialist\r\nVery strong understanding of on-page and off-page SEO\r\nExperience working in a fast-paced SEO or digital marketing agency\r\nHas handled multiple accounts simultaneously\r\nProficient in SEMrush and performing detailed SEO audits\r\nSkilled in keyword research, understanding of search engine algorithms, and ranking methods\r\nExperience with meeting clients and presenting performance reports, audits, and strategic recommendations\r\nAbility to provide custom SEO audits that go beyond tool-generated reports\r\nExperience managing, leading, and executing SEO to-dos and deliverables based on strategy\r\nExcellent command of the English language, both written and verbal\r\nKnowledge of PPC marketing and Google Analytics is a plus\n\n\n\r\nTo apply, fill out this form: Upgrade to see actual info\n\n\r\nWe are filling this position immediately!\n\r\nLooking forward to receiving your application!",
  "skill_requirements": [
    "Off-Page",
    "On-Page",
    "SEO Analysis"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T11:38:20.109969",
      "reason": "Job first discovered"
    }
  ]
}