{
  "job_id": "1125335",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1125335",
  "scraped_at": "2025-07-14T23:09:57.415814",
  "title": "Shopify Full Stack Web Developer",
  "type_of_work": "Full Time",
  "salary": "$2000/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a D2C eCommerce design agency that provides D2C eCommerce graphic designs that grow their brand and convert traffic into customers.  We are looking for an experienced full stack Shopify Developer to design, develop, and manage storefronts. If you are a passionate self starter looking to grow within a team professionally and technically then this is the role for you.\n\r\nWith veritable experience in both Shopify and broader, full-stack development, our ideal candidate will craft online stores with custom code and template modifications, integrate and configure third-party applications, and perform stringent QA before launching. Generating custom-tailored Shopify themes, and altering pre-existing templates.\n\r\nCandidates must have proven experience in Shopify, as well as HTML, CSS, SQL, JavaScript, node.js, jQuery, Backbone.js or similar languages/frameworks.\n\r\nResponsible for the development of the Shopify platform, themes, liquid programming language and corresponding apps:\n\r\n- Optimize site speed performance of Shopify Themes & App integration for load times and conversion rates.\r\n- Shopify website updates/maintenance, themes, uploading/editing new products/photography, discount codes, shipping, website launches, and sales page updates.\r\n- Design UX based from our brand standard and style guide.\r\n- Implement system integrations that are crucial to our success.\r\n- Contribute to the development of open source software, HTML5/CSS/JavaScript,and common web technologies integral to building seamless multi-channel experiences.\r\n- Knowledgeable in security / personal data protection principles and GDPR.\r\n- Developing testing plans and troubleshooting issues related to eCommerce issues.\r\n- Conducting root cause analysis and determining/developing corresponding action Items.\r\n- Convert designs in Figma, Sketch or Adobe into fully functioning web pages and emails.\r\n- Produce Shopify applications based on requirements and technical specifications.\r\n- Debug and troubleshoot issues that occur within first-party and third-party Apps.\r\n- Exercising project leadership during all phases of development.\r\n- Cultivate and implement new ideas that leverage technologies to serve our customers and business.",
  "skill_requirements": [
    "Shopify",
    "Javascript",
    "Fullstack"
  ]
}