{
  "job_id": "1142596",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-YouTube-Manager-1142596",
  "scraped_at": "2025-07-15T12:29:18.314482",
  "title": "Social Media YouTube Manager",
  "type_of_work": "Full Time",
  "salary": "$800/month for 40 hours/week",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you passionate about all things YOUTUBE and want to be PAID WELL to help grow a YouTube channel?\n\r\nDo you have experience managing YouTube channels and measurable results growing YouTube channels? \n\r\nIf you said, YES, please keep reading and apply if you meet the criteria. \n\r\nAs the YouTube Channel manager, you will be responsible for managing and growing our YouTube channel.\n\r\nRESPONSIBILITIES INCLUDE:\n\r\n- YouTube content strategy\r\n- Competitor analysis\r\n- Reviewing channel analytics\r\n- Making recommendations based on channel analytics and performance\r\n- YouTube SEO\r\n- Responding to comments\r\n- Uploading and optimizing videos on YouTube\r\n- Cross-posting on other socials (Instagram, TikTok, Facebook, Twitter)\r\n- Researching collaboration and sponsorship opportunities\n\r\nONLY APPLY IF YOU MEET THE FOLLOWING REQUIREMENTS:\n\r\n- 2 years of direct experience managing YouTube channels. \r\n- Experience conducting YouTube competitor analysis. \r\n- Experience conducting keyword research and finding winning keywords for search. \r\n- Experience reviewing channel analytics and providing advice and recommendations based on analytics. \r\n- Experience suggesting video topics and titles that have performed well (and you have proof (screenshots) that the videos performed well. \r\n- High speed internet.\r\n- Excellent English skills.\n\r\nWORK SCHEDULE AND HOLIDAYS:\n\r\nThis is a full-time, Monday - Friday, 40 hour/week. The specific times you work can be flexible.\n\r\nSALARY:\n\r\n$800/month for 40 hours/week. \n\n\r\nHOW TO APPLY: (If you don't include everything in this list, your application will not be considered)\n\r\n- When applying, put \"I'm a YouTube Expert\" in the subject heading.\r\n- Briefly explain how you meet each of the requirements listed above. \n\n\r\nAFTER YOU APPLY:\n\r\n- If you meet the criteria, we will schedule a video interview on Zoom. Your camera must be on during the interview.\r\n- During the interview, you will be asked to explain your experience.\r\n- During the interview, you will also be asked to share your screen and complete specific tasks to prove you have the qualifications we require.",
  "skill_requirements": [
    "Social Media Management",
    "Thumbnail & Social Media Design",
    "Youtube Marketing"
  ],
  "is_active": true,
  "status_history": []
}