{
  "job_id": "1166437",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1166437",
  "scraped_at": "2025-07-14T23:07:25.129846",
  "title": "Growth Hacker for App Downloads and Subscriptions",
  "type_of_work": "Any",
  "salary": "Tell us your rate",
  "hours_per_week": "60",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us:\r\nWe are an innovative AI app company seeking a fearless and results-driven Growth Hacker to join our team. Our app offers advanced AI capabilities, and we need someone who can drive app downloads and paid subscriptions through any means necessary. If you have a track record of achieving explosive growth and aren't afraid to push boundaries, we want to hear from you.\n\r\nResponsibilities:\n\r\nDevelop and execute unconventional strategies to drive app downloads and increase paid subscriptions.\r\nUtilize a variety of channels, including but not limited to, social media, paid ads, influencer partnerships, content marketing, and viral campaigns.\r\nMonitor, analyze, and optimize growth strategies to maximize ROI.\r\nProvide detailed reports on growth metrics and campaign performance.\r\nStay ahead of industry trends and leverage the latest growth hacking techniques.\r\nRequirements:\n\r\nProven experience in driving significant growth in app downloads and subscriptions.\r\nStrong creative and analytical skills.\r\nProficiency in various marketing and analytics tools.\r\nExcellent communication and project management skills.\r\nAbility to work independently and deliver results in a fast-paced environment.\r\nApplication Instructions:\r\nPlease reply with the following\n\r\nExamples of successful growth campaigns you have executed.\r\nDetailed statistics and results of past projects you have handled.\r\nYour resume and a brief cover letter explaining why you are the right fit for this role.\r\nDeadline: Applications will be reviewed on a rolling basis until the position is filled.\n\r\nWe look forward to seeing your innovative strategies and learning more about how you can drive our app’s growth to new heights!",
  "skill_requirements": [
    "Performance Marketing",
    "Ads Management",
    "Ads Creation"
  ]
}