{
  "job_id": "1180275",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Content-Manager-Full-Time-20-Benefits-Await-1180275",
  "scraped_at": "2025-07-15T13:46:30.561898",
  "title": "Content Manager | Full-Time | 20+ Benefits Await!",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "The content manager is one specialist who plays a special role in building the company's online presence and brand. To do this job well, marketing methods that interest clients must be overseen, and satisfaction with the company's offerings must be guaranteed.\n\r\nEssential Duties\r\n- Create, edit, and update content and content calendar\r\n- Oversee blogs, articles, and content that will be posted and are already posted on the web page\r\n- Reviews copy and corrects content, grammar, and punctuation errors, following prescribed editorial style and formatting guidelines.\r\n- Determines a story's emphasis, length, and format and organizes material accordingly\r\n- Gathers information about events through research\r\n- Ensures that all content meets company standards for journalistic integrity and production quality\r\n- Performs special projects and other duties as assigned\n\r\nRequirements\r\n- Previous experience as a Content Manager\r\n- Candidates must be a strong communicator and highly motivated\r\n- Degree in Journalism, a related field, or work-related experience\r\n- Minimum two-three years experience in content writing\r\n- Excellent communication skills, both oral and written\r\n- Ability to meet deadlines, prioritize assignments, and handle multiple tasks simultaneously\r\n- Knowledge of WordPress, Semrush, Ahrefs, and other SEO tools\r\n- Write stories for the web and other digital platforms\n\r\nContent Manager - Permanent WFH I with 20+ Premium Benefits and Bonuses\r\nWork Schedule: 12:00mn to 8:30am PH Time\n\r\n***The company uses a time tracker and maintains a virtual office setup via Google Meet.\n\r\nFor interested applicants kindly send your CV to Upgrade to see actual info\n\r\nThank you!\n\r\n(Note: DO NOT SEND YOUR APPLICATION through our websites or social media platforms. FAILURE TO COMPLY WITH THIS INSTRUCTION may result in DISQUALIFICATION)",
  "skill_requirements": [
    "Article Writing",
    "SEO",
    "Semrush"
  ],
  "is_active": true,
  "status_history": []
}