{
  "job_id": "1187434",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Property-Manager-1187434",
  "scraped_at": "2025-07-14T23:05:57.998921",
  "title": "Remote Property Manager",
  "type_of_work": "Full Time",
  "salary": "$10  per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "** Property Management Experience REQUIRED**\r\n**AppFolio experience is a PLUS**\n\r\nBay Property Management Group, LLC is seeking an experienced property manager to join our growing team. This individual will be responsible for a portfolio ofUpgrade to see actual infodoors, including single family homes, townhomes, and condos. These doors are located in the Baltimore, Maryland market. This is a primarily customer-service oriented role and will require liaising with tenants, property owners, and other constituents. You will not manage any staff for this role.\n\r\nAbout the Company\r\nBay Property Management Group (BMG) is one of the fastest growing and highly reviewed property management companies in the Mid-Atlantic. We are currently managing over $600 million dollars’ worth of property, have over 5,300 doors under management, and have 140+ staff members. BMG has a friendly and connected team, where hard work and dedication are rewarded. Come join our team and understand why a career in property management is right for you.\n\r\nWhat You Do All Day\n\r\n*Manage all aspects of an assigned property portfolio of approximatelyUpgrade to see actual infodoors.\r\n*Communicate effectively between and on behalf of multiple constituents, including property owners, tenants, regulatory bodies, vendors, staff members and others.\r\n*Provide impeccable customer service to all clients by responding to emails, voicemails, and other communications promptly.\r\n*Manage all work order submissions from tenants in AppFolio, assigning technicians and contractors as appropriate.\r\n*Troubleshoot issues and work orders on behalf of tenants and owners\r\n*Schedule service with maintenance technicians or vendors and follow up to ensure quality of work and completion.\r\n*Approving invoices for maintenance work accurately and in a timely manner, based on provided funds from property owner.\r\n*Maintain low delinquency and budget for property.\r\n*Work collaboratively with multiple constituents to resolve and de-escalate potential issues that may occur.\r\n*Lead and coordinate the turn process for properties that are vacant and being prepared for new tenants, including cleaning, maintenance, compliance, and property preparation.\r\n*Ensure that all properties in assigned portfolio meet all the requisite codes and compliance for the location, included lead certifications, property registration, rental licenses, and other required certifications.\r\n*Complete administrative tasks related to tracking and documenting work.\r\n*Process move outs for security deposit reimbursement.\r\n*Active involvement in lease renewal process.\n\r\nRequired Knowledge, Skills, and Abilities\n\r\n*High school diploma\r\n*Impeccable customer service skills\r\n*Previous experience as a property manager is preferred, but not required.\r\n*Ability to read and write professionally in English\r\n*Knowledge of Microsoft Office Suite, especially Outlook and Excel\r\n*Ability to read and create spreadsheets\r\n*Able to problem solve independently and think quickly\r\n*Able to handle tense and emotional customers professionally\r\n*Ability to handle multiple responsibilities and tasks simultaneously\r\n*Knowledge of basic home repair and maintenance issues, such as filter changes, appliances, seasonal cleaning, and other typical issues.\r\n*Time management skills\r\n*Extremely thorough and detail-oriented, particularly with email and software systems.*\n\r\nSalary: $10 per hour\n\r\nPlease send your resume to Upgrade to see actual info with the email title \"Property Manager - Surname\".                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}