{
  "job_id": "1201484",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Content-Writer-Full-Time-20-Benefits-Growth-Opportunities-1201484",
  "scraped_at": "2025-07-15T13:32:02.348415",
  "title": "Senior Content Writer — Full-Time — 20+ Benefits & Growth Opportunities",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "As a Senior Content Writer, you will be instrumental in shaping our digital presence and refining our communication strategies. You will be responsible for creating compelling, accurate, and impactful content that helps injured victims understand their legal rights and options. This role requires a creative thinker who can turn complex ideas into clear, reader-accessible content.\n\r\nKey Responsibilities:\r\nDevelop and produce high-quality content for landing pages, blogs, news articles, and other web-based formats.\r\nConduct thorough research to ensure the accuracy and relevance of content.\r\nEdit and proofread content to maintain high grammar, punctuation, and style standards.\r\nEnsure all content reflects the firm's voice, tone, and brand guidelines.\r\nApply SEO best practices to boost content visibility and search engine rankings.\r\nCollaborate with cross-functional teams to ensure content meets the firm’s objectives and audience needs.\n\r\nQualifications And Skills:\r\nMinimum of 2 years of experience in content writing, preferably in the legal, healthcare, or real estate industries\r\nExceptional writing and editing skills, with a keen attention to detail\r\nPassion for creating content that resonates with our audience\r\nStrong portfolio of published works demonstrating writing and editing capabilities\r\nProven capability to break down complex information into clear, concise, and engaging content\r\nAbility to adapt writing style to suit different purposes\r\nExcellent verbal and written communication skills\r\nAbility to collaborate effectively with teaUpgrade to see actual infombers\r\nDemonstrated ability to work independently, manage time effectively, and thrive under tight deadlines in a dynamic environment\r\nProficient in Microsoft Office and Google Workspace\n\r\nBasic Requirements:\r\nDevice Specifications: Intel i5 processor or higher with a minimum of 8GB RAM\r\nEquipment: Webcam, speakers, and a microphone or headphones\r\nInternet Speed: Minimum of 100Mbps with a backup connection in case of outages\n\r\nWork Details:\r\nWorking Hours: Monday to Friday, 8 AM to 5 PM Pacific Standard Time | Tuesday to Saturday, 12 AM to 8:30 AM Manila Time\r\nLocation: Anywhere in the Philippines\n\r\nWhy Join Us?\r\nStable employment\r\nCompetitive salary\r\nBi-monthly salary\r\nA-Z benefits, including bonuses and annual raises\r\nWork-life balance \r\nWork-from-home opportunity\n\r\nThe company uses a time tracker and maintains a virtual office setup via Google Meet.\n\r\nInterested applicants may send their resume to Upgrade to see actual info\n\n\r\n(Note: DO NOT SEND YOUR APPLICATION through our websites or social media platforms. FAILURE TO COMPLY WITH THIS INSTRUCTION may result in DISQUALIFICATION)",
  "skill_requirements": [
    "Copywriting",
    "Blogging",
    "Content Management"
  ],
  "is_active": true,
  "status_history": []
}