{
  "job_id": "1205137",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Administrative-Assistant-Scheduler-Cold-Caller-1205137",
  "scraped_at": "2025-07-15T15:44:45.212777",
  "title": "Administrative Assistant/ Scheduler? Cold Caller",
  "type_of_work": "Part Time",
  "salary": "TBD American Dollars",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "PLEASE INCLUDE A VIDEO OF YOUR SELF DESCRIBING THE WORK YOUVE DONE AND WHY YOU ARE FIT FOR THE JOB. MUST BE FLUENT IN ENGLISH\r\nJob Title: Virtual Assistant\n\r\nLocation: Remote\n\r\nPosition Type: FullUpgrade to see actual info-Time\n\r\nOverview:\r\nWe are seeking a highly organized and proactive Virtual Assistant to provide comprehensive administrative support and manage various tasks to help a business owner stay on track. The ideal candidate will be fluent in English, possess strong administrative and social media marketing skills, and have a knack for keeping things in order.\n\r\nKey Responsibilities:\n\r\nAdministrative Tasks:\n\r\nManage and prioritize emails, ensuring timely responses and organization.\r\nSchedule and coordinate meetings, appointments, and travel arrangements.\r\nMaintain and organize digital files and documents.\r\nHandle data entry, document preparation, and basic bookkeeping tasks.\r\nSocial Media Marketing:\n\r\nDevelop, implement, and manage social media strategies across various platforms (e.g., Facebook, Instagram, LinkedIn, Twitter).\r\nCreate and curate engaging content that aligns with the brand’s voice and goals.\r\nMonitor social media channels for trends and insights, and engage with followers.\r\nTrack social media metrics and provide regular reports on performance.\r\nClient Follow-Up:\n\r\nCommunicate with clients via email, phone, or chat to ensure satisfaction and address any concerns.\r\nSchedule follow-up meetings and track client interactions to maintain relationships.\r\nAssist with onboarding new clients and ensure a smooth transition.\r\nOrganizational Support:\n\r\nImplement and manage organizational systems to streamline workflows.\r\nRemain proactive in identifying areas for improvement and propose solutions.\r\nAssist in project management tasks, ensuring deadlines are met and deliverables are on track.\r\nQualifications:\n\r\nProven experience as a Virtual Assistant or similar role.\r\nProficiency in English with excellent written and verbal communication skills.\r\nStrong knowledge of social media platforms and tools.\r\nProficiency in office software (e.g., Microsoft Office, Google Workspace) and task management tools (e.g., Asana, Trello).\r\nExceptional organizational skills with a keen eye for detail.\r\nAbility to multitask and prioritize effectively in a fast-paced environment.\r\nReliable internet connection and a dedicated workspace.\r\nPreferred Skills:\n\r\nExperience with email marketing tools (e.g., Mailchimp, Constant Contact).\r\nBasic graphic design skills (e.g., Canva) for creating social media content.\r\nFamiliarity with CRM systems (e.g., Salesforce, HubSpot, CINC).\r\nBenefits:\n\r\nFlexible work hours and remote work.\r\nOpportunity to work closely with the business owner and grow within the company.\r\nCompetitive compensation based on experience and skills.\r\nIf you are a motivated, detail-oriented individual with a passion for helping businesses succeed, we would love to hear from you. Apply today to join our dynamic team and contribute to our continued growth and success!",
  "skill_requirements": [
    "Social Media Video Editing",
    "Admin Data Processing",
    "Scheduling"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:29:08.698533",
      "reason": "Job first discovered"
    }
  ]
}