{
  "job_id": "1206161",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-Long-Term-Print-On-Demand-Shopify-Store-VA-1206161",
  "scraped_at": "2025-07-15T14:25:02.824165",
  "title": "Experienced Long Term Print On Demand Shopify Store VA",
  "type_of_work": "Any",
  "salary": "3.5/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "**PLEASE DO NOT APPLY UNLESS YOU ARE IN THE TOP 1% OF SHOPIFY VIRTUAL ASSISTANTS**\r\nWe’re looking to add a virtual assistant to our growing team to help with a variety of back-end tasks in Shopify. Our new project is a print on demand store, and we need you have experience in handling POD work flow. The ideal candidate will have EXCELLENT English communication and work well in a team with our other teaUpgrade to see actual infombers. The hours of this job will vary from week to week (10-20 hours a week) but we may need you to work long later and this employment will be long term. Besides, you'll also be a personal excecutive assistant of CEO.\n\r\nWe need you to do the following:\n\r\n--Some jobs of shopify store setting if need, to optimize the whole store if there's small places need to adjust.\r\n--Answer customers messages or emails timely, and keep all customers requests well organized. \r\n--Once orders come, to coordinating our China team to print and fulfill it. We won't use printify/printful to fulfill as we have warehouse and fulfillment team here, what we need is organizing the whole work flow. \r\n--Some jobs of graphic design like banners or social posts. We are already have designers but your graphic techniques can be a plus.\r\n--Collect customers reviews or handle after sale affairs.\r\n--Other works you think necessary on print on demand business but not listed here.\n\r\nWhen you apply please explain your previous experience on POD store and past works. \r\nThank you in advance for your time!",
  "skill_requirements": [
    "Email Marketing",
    "Customer Support"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:28:29.690198",
      "reason": "Job first discovered"
    }
  ]
}