{
  "job_id": "1208657",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Facebook-Media-Buyer-For-Supplement-Brand-1208657",
  "scraped_at": "2025-07-14T23:09:55.920278",
  "title": "Facebook Media Buyer For Supplement Brand",
  "type_of_work": "Full Time",
  "salary": "500 USD Per Month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking a full-time, highly experienced Meta Media Buyer to join our team and take charge of driving our paid media strategy on Meta platforms. The ideal candidate will have a proven track record in managing and scaling successful campaigns in the supplement or related industries.\n\r\nKey Responsibilities:\n\r\nCampaign Management:\n\r\n-Develop, execute, and optimize Meta advertising campaigns to achieve business objectives.\r\n-Organize and implement testing frameworks (A/B tests, multivariate tests) to evaluate creatives, audiences, and bidding strategies.\r\n-Structure campaigns with a focus on scaling while maintaining profitability and efficiency.\n\r\nCollaboration:\n\r\n-Work closely with our internal marketing team, who will provide copy, creative assets, and daily budget monitoring.\r\n-Collaborate with the team to ensure alignment on campaign goals, strategies, and performance metrics.\r\n-Provide actionable insights and recommendations to improve campaign performance.\r\n-Reporting and Analysis:\n\r\n-Monitor and analyze campaign performance data to identify trends, anomalies, and opportunities for improvement.\r\n-Generate detailed reports on campaign performance, including key metrics like ROI, CPA, CTR, and CPC.\r\n-Present findings to stakeholders and suggest adjustments to optimize campaign performance.\n\r\nCommunication:\n\r\n-Maintain clear and consistent communication with the team through Slack and Asana.\r\n-Respond promptly to queries, feedback, and requests from the marketing and management teams.\n\r\nContinuous Improvement:\n\r\n-Stay updated with the latest Meta advertising trends, tools, and algorithm changes.\r\n-Implement best practices and innovative strategies to maintain a competitive edge in the market.\r\n-Attend relevant webinars, workshops, or training sessions to enhance your skills.\n\r\nRequirements:\n\r\nExperience:\n\r\nMinimum of 3 years of experience as a Media Buyer with a focus on Meta platforms.\n\r\nProven track record of managing and scaling successful campaigns, preferably in the supplement or health industry.\r\nSkills:\n\r\n-Strong analytical skills with the ability to interpret data and make data-driven decisions.\r\n-Excellent organizational skills with the ability to manage multiple campaigns simultaneously.\r\n-Proficiency in Meta Ads Manager, Slack, Asana, and other relevant tools.\r\n-High level of responsiveness and reliability.\n\r\nPersonal Attributes:\n\r\n-Self-motivated, proactive, and detail-oriented.\r\n-Ability to work independently as well as part of a team.\r\n-Strong communication skills, both written and verbal.",
  "skill_requirements": [
    "Facebook Ads",
    "Ads Management",
    "Media Buying"
  ]
}