{
  "job_id": "1211513",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Google-Ads-Specialist-WIth-SEO-1211513",
  "scraped_at": "2025-07-15T12:25:10.395427",
  "title": "Google Ads Specialist WIth SEO",
  "type_of_work": "Any",
  "salary": "$1400 full time, $700 half time. Other schedules possible.",
  "hours_per_week": "30",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Experienced Google Ads specialist needed to assist our agency SEM team.  Must have in-depth experience with Google ads including search, display, Pmax and all types of campaign formats. Must be very detail oriented, C2 English, have understanding of US based business processes. ONLY APPLY FOR THIS JOB IF YOU HAVE THE ABOVE LISTED EXPERIENCE.\r\nThe position involves:\r\n- Competitive research (keywords and advertisers)\r\n- Setting up google ads campaigns from start to finish\r\n- Manage all aspects of campaigns to provide our clients best quality leads\r\n- Trustworthy in managing campaigns with budgets from $1000-$50,000 in monthly spend.\r\n- Manage multiple different campaigns\r\n- Reporting on numbers and explaining what they mean\r\n- Developing and implementing plans to keep ads effectiveness growing\n\r\nOther skills include:\r\n- Efficiency - complete tasks quickly without compromising quality\r\n- Completing assigned tasks on time, every time. Dependable.\r\n- Ability to accept instruction and tasks from our SEM Manager\r\n- Creativity - creating clever ads that attract user attention\r\n- Ability to thrive in a fast paced environment\r\n- Comfort level in doing the tedious work of ad management\n\r\nFull time or Part time is acceptable for the right person.  \n\r\nIn your response, provide examples of your experience and knowledge in managing Google ads campaigns. Simple or complex, we need to see that you are ready to hit the ground running!",
  "skill_requirements": [
    "Google Ads",
    "SEO",
    "Search Engine Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:35:33.544921",
      "reason": "Job first discovered"
    }
  ]
}