{
  "job_id": "1217315",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Representative-for-High-Growth-Cleaning-Company-Part-Time-1217315",
  "scraped_at": "2025-07-15T14:42:54.200021",
  "title": "Sales Representative for High Growth Cleaning Company (Part Time)",
  "type_of_work": "Part Time",
  "salary": "$400-1000/month",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a US-based house cleaning company looking for a part-time, home-based Virtual Assistant to support our customer service and operations team. This role will start part-time with a structured 3-week ramp-up period and will require full-time coverage from August 11–14 while our primary teaUpgrade to see actual infomber is on leave. If the fit is strong, there is potential for this to grow into a long-term evening, full time and/or weekend support role.\n\r\nYour daily responsibilities would include:\r\n- Send a daily report detailing completed and ongoing tasks.\r\n- Respond to customer questions via phone call, email, live chat, Facebook messenger, or SMS.\r\n- Take inbound customer service and scheduling requests and make occasional outbound calls.\r\n- Provide service quotes & make sure to follow up with leads.\r\n- Book new jobs, reschedule &/or update service jobs in our booking calendar system.\r\n- Communicate with cleaners and track job progress.\r\n- Hire cleaners\r\n- Flag any urgent issues, customer escalations, or last-minute cleaner problems.\n\r\nWe are invested in our agent’s success. You will go far if you are/have:\r\n- 1–2 years of customer service or VA experience\r\n- A fast learner\r\n- A great communicator\r\n- Calm and collected under pressure\r\n- Highly detail-oriented\r\n- Able to work independently and escalate when needed\r\n- A self-starter who enjoys working remotely\n\r\nThis is a part-time role to start, with full-time hours required August 11–14 (8:30am-6pm CT). You need to have excellent English skills.\n\r\nWork hours during training will be flexible, approximately 10–20 hours per week during Central Time business hours. The week of August 11–14 will require full availability from 8:30am–6pm CT. After that, there is opportunity to continue on a long-term basis with evening or weekend shifts (10–20 hours/week or more where needed).\n\r\nPay is $4–5.5/hr to start, with raises every 6 months.\n\r\nIf accepted, you will be provided with training to help respond to customer queries via phone call, email, live chat, Facebook messenger, & SMS.\n\r\nHow to Apply:\r\nSend an email to Upgrade to see actual info with the subject line: “I want to be a virtual assistant”. Please include a link to your OnlineJobs.ph profile and your resume within the email when you apply, then complete the Google form you will receive in an email.\n\r\nNote: After you send the email to apply, you will receive a response froUpgrade to see actual info with a link to a Google form. Please complete the questions in the Google form to be considered for this position. Forms that are not completed or only partially completed will not be considered. In the form, you will be asked your age. Answer 40 to prove you are paying attention to detail.\n\r\nI look forward to working with you!",
  "skill_requirements": [
    "Inbound Sales",
    "Customer Service",
    "Sales"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:30:26.218040",
      "reason": "Job first discovered"
    }
  ]
}