{
  "job_id": "1232734",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Administrative-Staff-PositionCustomer-Relations-Manager-1232734",
  "scraped_at": "2025-07-14T23:08:57.105101",
  "title": "Administrative Staff Position/Customer Relations Manager",
  "type_of_work": "Full Time",
  "salary": "$4/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Administrative Staff Position/Customer Relations Manager\n\r\nAre you a great communicator with excellent English skills? Are you detail-oriented and eager to learn? If so, we want YOU to join our team! \n\r\nThis is a full-time position, requiring availability from 9 am to 5 pm EST, Monday to Friday. \n\r\nStarting salary of $4/hour, subject to a 90-day performance review for salary increase.\n\r\nQuarterly (90 day) Salary Increases: based on work performance meeting minimum standards \n\r\nPTO ( Paid Time Off): Holiday schedule for Paid time off will be disclosed, with 14 Days PTO/year available for Full Time Employees \n\n\r\nWhat You'll Do:\r\n- Make phone calls and communicate with customers via Go High Level\r\n- Solve customer problems with a professional and friendly approach\r\n- Keep accurate records and follow company processes via Click Up\n\r\nWhat We’re Looking For:\r\n- Excellent American accent and communication skills\r\n- Must have a noise-canceling microphone/headset\r\n- Minimum internet speed of 50 Mbps\r\n- Reliable backup internet connection\r\n- Prior experience or knowledge of Go High Level is a plus.\r\n- Ability to work effectively in a team environment\r\n- Strong leadership skills are preferred\r\n- More than 2 years of customer support experience is a plus\r\n- On Camera 8 hours a day\n\r\nTraining is provided, so if you're motivated and ready to develop new skills, apply now!\n\r\nIf you're interested and believe you have what it takes to be part of our team, we invite you to fill out the form linked below and to submit a 2 minute introductory video introducing yourself and explaining why you would be an excellent fit for the role. Only applicants who have submitted a video will be considered for the position.\n\nUpgrade to see actual info",
  "skill_requirements": [
    "Administrative Management",
    "Admin Data Processing",
    "Virtual Assistant"
  ]
}