{
  "job_id": "1237307",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Administration-with-strong-Odoo-ERP-System-Accounting-Background-1237307",
  "scraped_at": "2025-07-15T14:39:24.025364",
  "title": "Administration with strong Odoo ERP System & Accounting Background",
  "type_of_work": "Full Time",
  "salary": "Negotiable",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Location: Brisbane, Australia  \r\nType: Full-time  \r\nWorking Hours: Australian Business Hours\n\r\nWe are seeking a motivated, honest, and hardworking individual to join our team as office and administration ERP System Specialist with a strong accounting background. Our ideal candidate is a serious professional with fluent English, excellent work ethics, and a drive to learn and grow within our company.\n\r\nAbout the Role:\r\nYou will be working closely with the CEO to manage and streamline business operations using the Odoo ERP system. This position is hands-on and requires a proactive individual who is eager to understand and master the Odoo platform. You will be responsible for overseeing and supporting various aspects of our business operations, including accounting, manufacturing processes, payroll, and general office administration. Your main role will be to act as a key support for day-to-day operations, ensuring that everything runs smoothly through the ERP system.\n\r\nKey Responsibilities:\n\r\n- Gain a deep understanding of how the Odoo ERP system works and operates within our business.\r\n- Oversee production processes and manufacturing orders, ensuring data is accurately tracked and reported.\r\n- Manage and process accounting functions such as invoices, payables, receivables, and payroll.\r\n- Act as the main point of contact for the CEO, providing support and insights through Odoo.\r\n- Call customers through VOIP to follow up on **late payments** and maintain positive customer relations.\r\n- Assist in streamlining and improving our processes using the ERP system.\r\n- Provide training and support to other teaUpgrade to see actual infombers on Odoo functionalities.\r\n- Maintain and update accurate records and reports on company operations.\n\r\nRequirements:\n\r\n- Proven experience with Odoo ERP system.\r\n- Extensive accounting background and knowledge of accounting principles.\r\n- Strong communication skills, fluent English, and a keen eye for detail.\r\n- Ability to work full-time during Australian business hours.\r\n- Highly motivated, honest, and able to work independently.\r\n- Excellent organizational skills and the ability to prioritize tasks effectively.\r\n- Strong problem-solving skills and a proactive attitude.\r\n- Comfortable using VOIP systems to communicate with customers professionally.\r\n- Must include the word \"pizza\" in your resume so we know you've read this post.\n\r\nWhy Join Us?\n\r\n- Be part of a dynamic company with a focus on innovation and excellence.\r\n- Work closely with the CEO and gain valuable experience in business operations.\r\n- A chance to shape and optimize our processes through the Odoo ERP system.\r\n- Competitive salary package and opportunities for career growth.\n\r\nIf you are a dedicated professional looking for a challenging yet rewarding opportunity, and meet the above requirements, please apply by sending your resume and cover letter.\n\r\nApplications without the word \"pizza\" in the resume will not be considered.\n\r\nWe look forward to welcoming a new teaUpgrade to see actual infomber who is eager to contribute and grow with us!",
  "skill_requirements": [
    "Financial Accounting",
    "Office and Administration",
    "Procurement"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:24:40.665530",
      "reason": "Job first discovered"
    }
  ]
}