{
  "job_id": "1237436",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Multimedia-Specialist-1237436",
  "scraped_at": "2025-07-14T23:34:04.402332",
  "title": "Multimedia Specialist",
  "type_of_work": "Part Time",
  "salary": "TBD",
  "hours_per_week": "25",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking a creative and detail-oriented Part-Time Multimedia Specialist to join our team. The ideal candidate will be responsible for designing visually engaging content across various platforms, including social media, websites, and marketing materials. This role requires a strong understanding of design principles and the ability to translate ideas into compelling visuals that align with our brand.\n\r\nResponsibilities:\n\r\nDesign and create graphics  and videos for social media posts, websites, ads, and marketing campaigns\r\nCollaborate with the marketing manager to develop creative assets that support campaign objectives\r\nEnsure all graphics are consistent with brand guidelines and maintain a cohesive visual identity\r\nEdit and enhance existing designs based on feedback from teaUpgrade to see actual infombers\r\nStay updated on design trends to keep visuals fresh and relevant\r\nManage multiple design projects simultaneously and meet deadlines\r\nProvide suggestions for visual improvements and creative input on new projects\n\r\nQualifications:\n\r\nProficiency in graphic design software and video editing (e.g., Adobe Photoshop, Illustrator, Capcut, Premier, Canva)\r\nStrong understanding of typography, color theory, and layout design\r\nExcellent attention to detail and creativity\r\nAbility to work independently and manage time effectively\r\nPortfolio showcasing previous design work\n\r\nTo set your expectations, this role will be fast paced and we don't want beginners as we're looking for someone who can deliver on time and communicates well (this is non-negotiable) this for us means the ideal candidate is adaptable due to their experience working in a similar role - if this isn't you please don't apply.\n\r\nTo apply, please put I'm confident for this role as your subject line and include a short video of why you are ideal for this role and what is your strength and weakness. Please also include your resume and portfolio in your submission - we will not accept applications that don't follow instructions.",
  "skill_requirements": [
    "Video Content Creation",
    "Graphic Design"
  ],
  "is_active": true,
  "status_history": []
}