{
  "job_id": "1246572",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Revit-Families-Modeler-1246572",
  "scraped_at": "2025-07-15T12:33:36.528043",
  "title": "Revit Families Modeler",
  "type_of_work": "Full Time",
  "salary": "500USD/m",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job description\r\nRD Studio is looking for an experienced and talented Revit Families Modeler.\r\nRD Studio is a creative studio that creates high-quality Revit Families, Dynamo Scripts, and Revit Plugins focusing on innovation and functionality.\n\r\nThe job is entirely remote.\n\r\nThis role is a unique opportunity for a Revit Families Modeler looking to push the boundaries of architectural modeling and contribute to various high-profile projects. Join RD Studio and be part of a team that values expertise, creativity, and precision in BIM modeling.\n\r\nRequirements:\n\r\nProven experience in modeling Parametric Revit Families\r\nExperience in creating complex Revit Families, using formulas and nested Families\r\nA robust portfolio showcasing a range of Revit Family models, including complex and challenging geometries.\r\nPractical experience with companies' BIM standards and protocols.\r\nStrong communication skills (in English) to effectively collaborate with teaUpgrade to see actual infombers\r\nA detail-oriented approach emphasizing accuracy, quality, and adherence to modeling guidelines.\r\nGreat advantage:\n\r\nDynamo, Adobe Illustrator, Photoshop, and other architecture software.\n\r\nWork conditions:\n\r\nPart-time or full-time freelance opportunity.\r\nFully remote position.\r\nRegular ZooUpgrade to see actual infoetings for project discussions, feedback, and development updates.\r\nResponsibilities:\n\r\nCreate 2D and 3D detailed and complex Revit Families\r\nCollaborate with architects and designers to understand their needs and translate them into high-quality BIM models.\r\nParticipate in the development and implementation of BIM standards and best practices within the company.\r\nContinuously enhance skills and knowledge in Revit Family modeling and stay abreast of industry developments and software updates.\r\nHow to apply for this position:\n\r\nPlease send us your CV and portfolio (in English only) to our email: Upgrade to see actual info\r\nNo portfolio? Send us a sample of your work in Google Drive.",
  "skill_requirements": [
    "Autocad",
    "Revit",
    "Archicad"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T11:34:48.070614",
      "reason": "Job first discovered"
    }
  ]
}