{
  "job_id": "1253906",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1253906",
  "scraped_at": "2025-07-14T23:08:31.568533",
  "title": "Digital Marketing Coordinator - Dayshift",
  "type_of_work": "Full Time",
  "salary": "Negotiable",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "TITLE:\r\nDigital Marketing Coordinator (aka; Advertising, Media & Communications Manager)\n\r\nBUSINESS:\r\nOur business is a dream to work for…\r\n• We provide content promotion and lead generation to global personalities and professionals.\r\n• Our focus (and soon to be your focus) is to help global personalities and professionals succeed by driving attention to their most powerful educational content and drive leads to their business to increase their sales. To do this, we recruit the best video editors, graphic designers, content writers, paid ad media buyers and more.\n\r\nROLE:\r\nThis role is perfect for you, if…\r\n• You are looking to work in a role of an experienced Digital Marketing Coordinator\r\n• You want to work on multiple clients marketing campaigns, working with media buyers/graphic designers/video editors/content writers\r\n• You have confidence and enjoy speaking professionally with clients (written and verbal)\r\n• You want to work remotely, full time (40 hours) a week - Monday to Friday\r\n• You’re interested in Day Shift hours, during Melbourne, Australia business hours\r\n• You have a University Level Education\r\n• And, you already have advanced skills in building (or running) paid digital advertising campaigns\n\r\nRESPONSIBILITIES:\r\nYour responsibilities will include…\r\n• Build and execute comprehensive project plans for marketing campaigns\r\n• Coordinate with internal and external delivery teams, including clients, graphic designers, content writers, video editors, content writers, media buyers and developers\r\n• Enforce end-to-end message congruency from the ad creative, ad copy, landing page copy, resource, etc\r\n• Define the #1 pain point being solved by the campaign and ensure it hits the desired target market\r\n• Identify project issues, roadblocks or missing requirements quickly and resolve proactively\r\n• If necessary, re-write and optimise content - such as; ad copy, funnel copy, email copy, etc\r\n• Ensure a campaign has the highest chance of success prior to going live\r\n• Document and handover all campaign, funnel and ad resources to media buyer for them to manage post go-live\r\nWe will provide training on how to execute each item above, as long as you are the type of person who has the will to learn and master it.\n\r\nREQUIREMENTS:\r\nTo be considered for this position, you are required to:\r\n• You need to have a proven solid work experience as a digital marketing coordinator of at least 2+ years\r\n• You need to have a Computer/Laptop with at least i5 processor and 8gb of RAM\r\n• You need to have a 2nd computer screen in your home office\r\n• You need to have a fast and reliable Internet connection, with access to a back-up\r\n• You have leadership abilities, decision-making skills, and problem-solving capabilities.\r\n• You have proven experience as a content writer in lead generation, or project manager in a lead generation, or operated in a digital marketing environment.\r\n• You have a results-driven mindset with a commitment to achieving project objectives.\r\n• You have a strong attention to detail and highly organised\r\n• You have a friendly, upbeat and team focused attitude\r\n• Most importantly, you desire to learn and obtain new responsibilities\n\r\nSOFTWARE & TOOLS:\r\n• Zoom - video meetings (internal team and client communication)\r\n• Loom - screen recording software (internal team and client communication)\r\n• Slack - internal communication tool\r\n• ClickUp - task management software\r\n• Google Email (gmail)\r\n• Google Drive\r\n• Google Sheets",
  "skill_requirements": [
    "Content Creation",
    "Facebook Ads"
  ]
}