{
  "job_id": "1257043",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1257043",
  "scraped_at": "2025-07-14T23:08:43.095820",
  "title": "SEO, Marketing and Technical Virtual Admin Assistant Needed",
  "type_of_work": "Part Time",
  "salary": "$8/hr",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're Hiring: SEO, Marketing and Technical Virtual Admin Assistant Needed\n\r\n We are a digital marketing and web design company based in the United States. We are looking for a technical and SEO focused Virtual Assistant to support our marketing, SEO, and website management projects. \n\r\n* Applicants must be very responsive through communication via slack\n\r\nPrimary Role & Focus:\r\nSEO Strategy & Execution: Keyword research, on page SEO, content optimization, and basic technical SEO tasks.\n\n\r\nVirtual Assistant Support: Website updates, content management, admin tasks, and general marketing assistance.\n\n\n\r\nKey Responsibilities:\r\nAssist in building and implementing SEO strategies\n\n\r\nPerform keyword research and on  page SEO optimization\n\n\r\nWrite, edit, and optimize SEO friendly content\n\n\r\nHelp with tasks like updating websites, posting content, and maintaining site functionality\n\n\r\nUpdate and maintain WordPress websites\n\n\r\nSupport with Shopify updates (if experienced)\n\n\r\nAssist with basic technical website tasks (coding experience is a plus)\n\n\r\nHelp with admin, operations, and project tracking\n\n\r\nCommunicate via Slack and participate in video meetings when required\n\n\n\r\n Work Hours & Communication:\r\nMust be able to work across different time zones and have some overlap with US Eastern Time (EST) must be available either early mornings or evening.\n\n\r\nMust have reliable internet connection and be available for scheduled video/audio meetings\n\n\r\nStrong written and verbal English communication skills are required\n\n\r\nComfortable working remotely and managing tasks independently\r\nMust be a self starter and someone who is willing to join a startup style company that is ever growing and evolving\n\n\n\r\n Key Requirements:\r\nSEO experience is required (keyword research, o -page SEO, content optimization, basic technical SEO)\r\nAble to use AI tools effectively to assist in improving workflow\r\nStrong experience with WordPress and Wordpress website builders\n\n\r\nAbility to update websites and manage web content\n\n\r\nGood content writing and editing skills\n\n\r\nFamiliarity with SEO tools (Google Analytics, Google Search Console, SEM Rush etc.)\r\nExperience with CRM software like Go Highlevel is a plus\n\n\r\nShopify experience and basic coding (HTML/CSS) are a plus if you have experience\n\n\r\nOrganized, reliable, detail oriented, and proactive\n\n\r\nExperience using Slack and working with remote teams\r\nPassionate and knowledgeable about SEO and marketing\r\nAble to work on multiple projects varying in scope and complexity\n\n\n\r\nPosition Details:\r\nRemote, 1099 Contractor\n\n\r\nPart-time with potential to grow \n\n\r\nFlexible hours but must have some overlap with US Eastern Time\n\n\r\nApplicants based in the Philippines are welcome and encouraged to apply\n\n\n\r\nIf you're a technically skilled, SEO and experienced marketing Virtual Assistant ready to grow with a remote digital team — we’d love to hear from you!",
  "skill_requirements": [
    "Marketing",
    "SEO",
    "Virtual Assistant"
  ]
}