{
  "job_id": "1258704",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Marketing-Strategist-1258704",
  "scraped_at": "2025-07-15T06:42:48.840100",
  "title": "Senior Marketing Strategist",
  "type_of_work": "Part Time",
  "salary": "TBD",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Boost Media Group:\r\nBoost Media Group is a full-service digital marketing agency dedicated to helping businesses grow their online presence and achieve their marketing objectives. We offer a comprehensive range of services including SEO, content marketing, social media management, and paid advertising campaigns. Our team of experts works collaboratively to deliver tailored strategies that drive results for our diverse client base.\n\r\nJob Overview:\r\nAs a Marketing Strategist at Boost Media Group, you will be responsible for researching, developing, and communicating strategic marketing plans to achieve our company's and clients' business goals. You will lead and optimize marketing efforts for both company and client campaigns, collaborating with cross-functional teams to execute them effectively.\n\r\nKey Responsibilities\n\r\nStrategy Development and Implementation\r\n- Set specific marketing goals aligned with overall business targets\r\n- Design and implement cohesive marketing strategies across various channels\r\n- Develop digital campaigns to increase web traffic and brand awareness\r\n- Ensure brand consistency across all marketing initiatives\n\r\nMarket Research and Analysis\r\n- Conduct in-depth market research to identify new opportunities and trends\r\n- Analyze sales and marketing metrics to inform decision-making\r\n- Forecast market trends and provide insights to guide future strategies\r\n- Monitor and evaluate the effectiveness of marketing campaigns\n\r\nCollaboration and Communication\r\n- Liaise with internal teams to ensure brand consistency\r\n- Collaborate with external stakeholders for successful execution of marketing plans\r\n- Communicate marketing strategies and results to leadership teams\r\n- Address advertising needs and provide recommendations to the marketing team\n\r\nQualifications and Skills\n\r\nEducation and Experience\r\n- Bachelor's degree in Marketing, Communications, or a related field\r\n- Minimum of 2-5 years of experience as a marketing strategist or in a similar role\r\n- Proven track record of successful marketing strategy implementation\n\r\nTechnical Skills\r\n- Proficiency in CRM software and Content Management Systems\r\n- Experience with SEO/SEM and Google Analytics\r\n- Understanding of web design principles\r\n- Familiarity with HTML-5 and website metadata\r\n- Experience with Google Search Console\r\n- Experience with SEMRush is a plus\n\r\nSoft Skills\r\n- Excellent analytical and problem-solving abilities\r\n- Strong communication skills, both verbal and written\r\n- Creative thinking and innovative approach to marketing\r\n- Leadership and team management capabilities\n\r\nAdditional Requirements\r\n- In-depth knowledge of digital and traditional marketing channels\r\n- Ability to work independently and as part of a team\r\n- Strong attention to detail and project management skills\r\n- Must be willing to work and attend meetings during normal business hours in the United States\r\n- Must be comfortable speaking with and working with clients directly in zooUpgrade to see actual infoetings\n\r\nPosition Details\r\n- This is a remote position\r\n- Applicants must have computer or laptop with reliable high-speed internet\r\n- Part-time position averaging 20+ hours per week, with potential for full-time\r\n- Compensation is based on experience\n\r\nBy fulfilling this role, you will play a vital part in increasing our company's and clients' market share, ensuring brand consistency, and driving overall business growth through effective marketing strategies.",
  "skill_requirements": [
    "PPC",
    "SEO",
    "Digital Marketing"
  ],
  "is_active": true,
  "status_history": []
}