{
  "job_id": "1259554",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1259554",
  "scraped_at": "2025-07-14T23:06:15.127527",
  "title": "-->>Web Developer – Build. Optimize. Innovate. – 20+ Benefits!<<--",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Overview:\n\r\nWe are looking for a skilled web developer with experience in modern JavaScript technologies (such as Node. js and React. js) to join our growing development team. This role will involve building high-performance web applications from the back end (server-side logic) to the front end (UI experience). The ideal candidate will have a solid understanding of both front-end and back-end technologies, a passion for clean code, and a drive to provide innovative web experiences.\n\r\nKey Responsibilities:\r\nCollaboration:\r\n-Work closely with the development team to turn project requirements into high-quality web applications.\r\n-Contribute to brainstorming and architectural discussions to ensure scalable, maintainable, and performant code.\r\n-Participate in code reviews to ensure quality and share best practices with the team.\n\r\nWeb Application Development:\r\n-Design, develop, and maintain responsive and high-performance web applications using React.js and Node.js.\r\n-Write clean, maintainable, and efficient code across the full stack, following best practices and ensuring cross-browser -compatibility.\r\n-Develop and integrate RESTful APIs, WebSockets, and third-party services to enhance application functionality.\n\r\nFront-End Development:\r\n-Build and maintain dynamic user interfaces using, with a focus on reusable components, state management (Redux, Context API), and efficient rendering.\r\n-Implement responsive design and ensure the application performs well across devices and browsers.\n\r\nBack-End Development:\r\n-Build and maintain server-side logic, databases, and APIs.\r\n-Work with relational and NoSQL databases (e.g., MongoDB, MySQL, PostgreSQL).\r\n-Integrate front-end applications with back-end systems and databases, ensuring smooth data flow and performance.\n\r\nOptimization & Maintenance:\r\n-Optimize application performance, identifying and fixing performance bottlenecks.\r\n-Maintain high standards for application security and data integrity.\r\n-Continuously monitor and improve existing applications.\n\r\nTesting & Documentation:\r\n-Write unit and integration tests to ensure the reliability and robustness of code.\r\n-Document technical specifications, code, and APIs for internal teams and future development.\n\r\nRequired Skills & Qualifications:\r\n-Proven experience in web development with expertise in Javascript frameworks and libraries such as React.js and Node.js.\r\n-Strong understanding of JavaScript (ES6+) and modern JavaScript features.\r\n-Experience with HTML5, CSS3, and responsive design principles.\r\n-Proficiency with RESTful API design and integration.\r\n-Experience using front-end state management libraries like Redux or Context API.\r\n-Experience working with server-side technologies like Express.js (Node.js framework).\r\n-Solid understanding of databases (relational and/or NoSQL databases such as MongoDB, PostgreSQL, MySQL).\r\n-Strong problem-solving skills and the ability to debug complex issues.\r\n-Excellent communication skills and the ability to collaborate effectively with both technical and non-technical teams.\n\r\nWhy Join Us?\r\n-Competitive salary and benefits package.\r\n-Flexible working hours and remote work options.\r\n-Opportunities for professional growth and learning.\r\n-A collaborative and innovative work environment.\r\n-Access to cutting-edge technologies and projects.\r\n-A supportive team focused on work-life balance and personal development.\n\r\nWork Schedule: 12:00mn to 8:30am PH Time\n\r\nThe company uses a time tracker and maintains a virtual office setup via Google Meet.\n\r\nInterested applicants may send their resume to Upgrade to see actual info\n\n\r\nThank you!\n\r\n(Note: DO NOT SEND YOUR APPLICATION through our websites or social media platforms. FAILURE TO COMPLY WITH THIS INSTRUCTION may result in DISQUALIFICATION)",
  "skill_requirements": [
    "Web Programming",
    "Javascript",
    "Fullstack"
  ]
}