{
  "job_id": "1259639",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Accounting-Associate-1259639",
  "scraped_at": "2025-07-15T15:34:43.689730",
  "title": "Accounting Associate",
  "type_of_work": "Full Time",
  "salary": "$800-1000 USD Per Month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a US Company looking for an enthusiastic person to join our team as an Accounting Associate. The role will be expanded over time based on the skills of the selected candidate, and will provide extensive experience in the solar and renewable energy industries.\n\r\nThe ideal candidate will have:\n\r\n· Understanding and experience with US tax accounting principles or relevant education\n\r\n· Experience using technology to improve and streamline work processes\n\r\n· Ability to use web based systems (CRM, task management, document management)\n\r\n· Exceptional attention to detail\n\r\n· Proficient at solving problems and finding solutions using any available resource\n\r\n· Passionate about digital marketing\n\n\n\r\nThe successful candidate will be expected to:\n\r\n· Utilize Quickbooks Advanced Online and be able to actively configure software to support business processes\n\r\n· Perform bookkeeping, basic project account management\n\r\n· Manage staff timesheets, leave accruals, contractor payments\n\r\n· Prepare and manage operational budgets for the business including overheads and payroll\n\r\n· Manage third-party contractor invoices and expenses / change orders\n\r\n· Developing business cashflow forecasts using Quickbooks and project models\n\r\n· Prepare financial models and information to support tender applications\n\r\n· Our business is strongly supported by technology, and we are looking for people who are adept at working remotely.\n\r\nQualifications\n\r\nBachelor's degree in Accounting, Economics, or Finance or equivalent experience\r\n0 - 3 years' financial analysis and modeling experience\r\nAdvanced knowledge of Excel\\\n\n\r\nAs part of submitting a resume - please answer these questions\r\n1. Please don’t answer this,  what is your favorite color?\r\n2. What qualifications do you have? Please list degrees and professional training (e.g. CA,\r\nCPA, etc.)\r\n3. What experience do you have working with a USA based companies?\r\n4. What accounting software have you used?\r\n5. How good is your English skills?\r\n6. What salary are you looking for?\r\n7. Please don’t answer this,  What is the best TV show currently on Netflix?\r\n8. When could you start the work?\r\n9. Please don’t answer this,  How many days are there in a week?\r\n10. What is your direct experience with Quickbooks Advanced Online?\r\n11. Confirm you are available for the hours described?\r\n12. Confirm what computer equipment and internet connection you have?\r\n13. What languages do you speak? (Rate your skills 1 to 10)\r\n14. Please ask any other relevant questions.\r\n15. Address each of the items under “The successful candidate will be expected”\r\nThe successful candidate will be expected to:\r\n· Utilize Quickbooks Advanced Online and be able to actively configure software to support\r\nbusiness processes\r\n· Perform bookkeeping, basic project account management\r\n· Manage staff timesheets, leave accruals, contractor payments\r\n· Prepare and manage operational budgets for the business including overheads and payroll\r\n· Manage third-party contractor invoices and expenses / change orders\r\n· Developing business cashflow forecasts using Quickbooks and project models\r\n· Prepare financial models and information to support tender applications\r\n· Our business is strongly supported by technology, and we are looking for people who are\r\nadept at working remotely.",
  "skill_requirements": [
    "Financial Accounting",
    "Invoicing",
    "Financial Reporting"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:35:27.291242",
      "reason": "Job first discovered"
    }
  ]
}