{
  "job_id": "1263750",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Ai-Developer-1263750",
  "scraped_at": "2025-07-14T23:08:50.491772",
  "title": "Ai Developer",
  "type_of_work": "Any",
  "salary": "$2500/mo",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re seeking an AI Influencer Clone Developer to design and implement a digital twin of our founder. This includes replicating voice, facial expressions, and conversational style using advanced AI tools. You’ll work with us to build an AI persona capable of producing lifelike content and engaging with audiences.\n\r\nResponsibilities\r\n• Develop a fully-functional AI clone of our founder using state-of-the-art tools (e.g., ChatGPT, ElevenLabs, HeyGen).\n\r\n• Create an AI-powered voice model that mimics tone, pitch, and speech patterns.\n\r\n• Design a realistic 3D/2D avatar that reflects physical features and mannerisms.\n\r\n• Train the AI to replicate conversational style and personality traits for engaging content.\n\r\n• Integrate the AI clone into a content production pipeline (videos, text responses, and live engagement tools).\n\r\n• Ensure ethical and secure use of AI tools to protect brand identity.\n\r\n• Troubleshoot and optimize AI systems for real-world use.\n\r\nRequirements\n\r\n• Proven experience in AI development, synthetic media, or virtual influencer creation.\n\r\n• Expertise in tools such as ElevenLabs, HeyGen, and Chatgbt)\n\r\n• Strong knowledge of machine learning (ML) frameworks\n\r\n• Experience in voice cloning, generative AI, and behavioral training for digital avatars.\n\r\n• Portfolio of past projects in AI-based persona or influencer development.\n\r\n• Ability to meet deadlines and communicate effectively in a collaborative environment.\n\r\nPreferred Qualifications\n\r\n• Background in computer vision, NLP (Natural Language Processing), or related AI fields.\n\r\n• Experience with chatbot integration for automated engagement.\n\r\n• Familiarity with ethical AI guidelines and digital rights management.\n\r\nThis AI clone will be used for video content",
  "skill_requirements": [
    "AI Tools"
  ]
}