{
  "job_id": "1268049",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1268049",
  "scraped_at": "2025-07-14T23:09:28.131159",
  "title": "AI Developor/Specialist",
  "type_of_work": "Any",
  "salary": "750",
  "hours_per_week": "6",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a company focused on helping digital creators and entrepreneurs scale their businesses using automation, AI, and data-driven workflows. We’re looking for a highly skilled AI Workflow Automation Specialist who can design and implement robust workflows to scrape YouTube videos, generate long-form and short-form scripts, ad copy, website copy, and VSLs. The workflow must dynamically adapt to different niches based on onboarding data for multiple clients.\n\r\nThis is a critical role for building scalable, automated solutions that drive real impact for our clients.\n\r\nResponsibilities\n\r\n • Workflow Design and Automation:\r\n • Create end-to-end workflows using tools like Make, Apify, Perplexity, and OpenAI to:\r\n • Scrape YouTube videos based on niche-specific keywords and filters (e.g., low-subscriber channels with high-view videos).\r\n • Automate the generation of:\r\n • Long-form and short-form content scripts.\r\n • Ad copy optimized for various platforms.\r\n • Website copy tailored to client needs.\r\n • Video Sales Letters (VSLs) with high conversion potential.\r\n • Dynamic Niche Switching:\r\n • Design workflows that adapt to different niches based on an onboarding sheet submitted by clients, pulling relevant data dynamically for each project.\r\n • Data Extraction and Filtering:\r\n • Use Apify and Perplexity to scrape and process data from YouTube and other platforms.\r\n • Implement advanced filtering mechanisms to identify high-performing videos from low-subscriber channels.\r\n • AI Integration:\r\n • Leverage OpenAI GPT-4 (or similar models) to generate high-quality, client-specific content.\r\n • Develop and optimize prompts to ensure generated content aligns with client goals and audience needs.\r\n • Workflow Optimization:\r\n • Continuously test and refine workflows to improve accuracy, efficiency, and scalability.\r\n • Monitor workflow performance and ensure timely execution of tasks.\r\n • Collaboration and Communication:\r\n • Work closely with the team to align automation workflows with business objectives.\r\n • Provide regular updates on workflow progress and performance.\n\r\nQualifications\n\r\n • Technical Expertise:\r\n • Proficiency in Make (formerly Integromat) for building and managing complex workflows.\r\n • Experience with Apify for web scraping and data extraction.\r\n • Familiarity with Perplexity AI for advanced data queries and research.\r\n • Strong knowledge of OpenAI GPT-4 for content generation.\r\n • Content Automation Skills:\r\n • Proven experience in generating scripts for long-form and short-form content, ad copy, website copy, and VSLs using AI tools.\r\n • Ability to adapt content tone and style to various niches and client preferences.\r\n • Problem-Solving and Optimization:\r\n • Analytical skills to troubleshoot and resolve workflow issues.\r\n • Creative mindset to optimize workflows for different client needs and scaling demands.\r\n • Project Management:\r\n • Ability to manage multiple workflows simultaneously and meet deadlines.\r\n • Detail-oriented with a focus on delivering high-quality results.\r\n • Communication:\r\n • Strong written and verbal communication skills to explain technical concepts and processes clearly.\r\n • Experience collaborating with cross-functional teams.\n\r\nPreferred Qualifications\n\r\n • Experience in scaling content automation for businesses in the digital product or creator space.\r\n • Knowledge of YouTube Data API and advanced filtering techniques for identifying high-performing videos.\r\n • Familiarity with additional automation tools like Zapier, Airtable, or Pabbly Connect.\r\n • Understanding of SEO, digital marketing trends, and audience engagement strategies.",
  "skill_requirements": [
    "ChatGPT",
    "AI Tools",
    "Make.com"
  ]
}