{
  "job_id": "1271088",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Coordinator-1271088",
  "scraped_at": "2025-07-15T09:21:23.168619",
  "title": "Marketing Coordinator",
  "type_of_work": "Part Time",
  "salary": "USD 450 per month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a creative, results-driven marketer ready to make a real impact?\n\r\nWe’re looking for a skilled and reliable Marketing Coordinator to join our growing vacation rental business at Lunabase.\n\r\nIn this role, you'll own our marketing efforts from strategy to execution—playing a key part in shaping our brand, driving engagement, and growing our community across channels.\r\n________________________________________\n\r\nKey Responsibilities\n\r\nSocial Media Management (Instagram, Facebook, LinkedIn)\r\n•\tManage and grow our presence across key platforms\r\n•\tPlan and publish engaging, high-quality content tailored to our target audiences\r\n•\tEngage with followers, respond to comments/DMs, and foster community\r\n•\tEdit and produce short-form video content (Reels) using CapCut or similar tools\r\n•\tTrack trends and optimize content for reach and relevance\r\n•\tConduct keyword research and implement SEO best practices into social media copy\n \nEmail Marketing & Collateral Development\r\n•\tCreate and manage email campaigns in Klaviyo to drive engagement and retention\r\n•\tDesign branded marketing materials including flyers, brochures, and digital assets\r\n•\tTrack performance metrics and optimize campaigns based on data insights\n\r\nWebsite & Blog Content\r\n•\tMaintain and update our WordPress website to ensure functionality and a smooth user experience\r\n•\tWrite SEO-optimized blog posts aligned with our content strategy and market positioning\r\n•\tMonitor performance and suggest improvements based on analytics\r\n________________________________________\n\r\nRequirements\r\n•\tProven experience in social media management and content creation\r\n•\tStrong writing and communication skills\r\n•\tProficiency in Canva, WordPress, Klaviyo, and CapCut\r\n•\tAbility to manage multiple projects independently and meet deadlines\r\n________________________________________\n\r\nBonus Skills\r\n•\tExperience with Photoshop, Google Analytics, Buffer\r\n•\tFamiliarity with Google Ads, Facebook Ads, or other digital advertising platforms\r\n•\tKnowledge of PPC strategies and campaign execution\r\n________________________________________\n\r\nWhy Join Lunabase?\r\n•\tFlexible, part-time virtual role\r\n•\tDirect impact on a fast-growing vacation rental brand\r\n•\tOpportunity to own creative projects from start to finish\r\n•\tCollaborative and supportive team environment\r\n•\tRoom for professional growth\r\n________________________________________\n\r\nAbout Us:\r\nLunabase is a vacation rental company focused on delivering high-end guest experiences while maximizing profitability for property owners. With a strong presence in markets like Miami and Lake Tahoe, we combine creative branding with data-driven strategies to stand out in a competitive industry.\r\n________________________________________\n\r\nReady to bring your marketing skills to a brand that values innovation and impact? Apply now!",
  "skill_requirements": [
    "Real Estate Marketing",
    "Social Media Management",
    "Graphic Design"
  ],
  "is_active": true,
  "status_history": []
}