{
  "job_id": "1272916",
  "url": "https://www.onlinejobs.ph/jobseekers/job/E-commerce-Content-Writer-1272916",
  "scraped_at": "2025-07-15T12:23:12.073141",
  "title": "E-commerce Content Writer",
  "type_of_work": "Part Time",
  "salary": "TBD",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "NO BEGINNERS WITH NO PROVEN BACKGROUND WILL BE ENTERTAINED.\n\n\r\nWe are looking for a passionate and knowledgeable Health and Wellness Content Writer with a strong background in ecommerce. The ideal candidate will craft engaging, educational, and SEO-optimized content for our store.\n\r\nYour role will involve creating high-quality articles, email campaigns, course content, and marketing materials that resonate with our audience and inspire them to take actionable steps toward better health.\n\r\nKey Responsibilities:\r\nContent Creation: Write well-researched, evidence-based articles, blog posts, email campaigns, and promotional copies.\r\nCourse Development: Collaborate with subject matter experts to create content for online courses, including lesson outlines, video scripts, and downloadable resources. \nEmail Marketing: Craft compelling email sequences to nurture leads, promote courses, and engage with our audience.\r\nSEO Optimization: Conduct keyword research and apply best practices to ensure content ranks highly on search engines.\r\nResearch and Fact-Checking: Stay updated on trends in functional medicine, longevity science, and wellness practices, ensuring all content is accurate and credible.\r\nAudience Engagement: Develop content strategies that resonate with health-conscious readers, building trust and authority in the field.\r\nCollaboration: Work closely with marketing, product development, and design teams to align content with broader business goals.\n\r\nQualifications:\r\nProven experience as a content writer, preferably in health and wellness, with a portfolio showcasing expertise.\r\nStrong understanding of longevity practices, functional medicine principles, and holistic health approaches.\r\nExcellent writing, editing, and proofreading skills with the ability to adapt to different tones and styles.\r\nFamiliarity with SEO and digital marketing best practices.\r\nExperience creating email campaigns, sales copy, and content for online courses.\r\nStrong research skills, with the ability to simplify complex medical or scientific concepts for a general audience.\n\r\nPreferred Skills:\r\nKnowledge of health-related regulations and guidelines (e.g., FDA, HIPAA compliance).\r\nExperience using email marketing platforms like Mailchimp, GoHighLevel\r\nCertification or formal training in nutrition, wellness coaching, or a related field is a plus.\n\r\nApplication Instructions:\n\r\nTo help us get to know you better and understand your approach to medical content writing, please record a short video (2–3 minutes minimum) answering the following questions. Be yourself, speak clearly, and feel free to refer to your experience and examples where relevant.\n\r\n???? Submit a video (2–3 minutes minimum) answering the questions below:\n\r\n1.Tell us about your background in writing for ecommerce.\r\n2. What makes a copy effective - be specific we're metric based so we need you to have an understanding on it as well.\r\n3. How do you ensure the accuracy and credibility of your content?\r\n4. Walk us through your research and fact-checking process.\r\n5. How do you adjust your tone for different audiences?\r\n6. Feel free to mention tools, platforms, or strategies you've used.\n\r\nAnd lastly, please send over your writing samples that fit this position. THIS IS REQUIRED ALONG WITH THE VIDEO.",
  "skill_requirements": [
    "Copywriting",
    "Blogging",
    "Content Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:37:14.712561",
      "reason": "Job first discovered"
    }
  ]
}