{
  "job_id": "1273231",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Graphic-Designers-with-AI-tools-1273231",
  "scraped_at": "2025-07-15T14:28:55.901286",
  "title": "Graphic Designers with AI tools",
  "type_of_work": "Gig",
  "salary": "$4 to $6 per hour",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Our company is pushing the boundaries of creative content by integrating AI into our design processes. We are seeking a few talented AI graphic designers with experience in both traditional and AI graphic design to leverage AI tools and create visually stunning, engaging graphics.\n\r\nJob Overview:\r\nAs one of our AI Graphic Designers, you will be responsible for creating high-quality graphics using AI-driven design tools. You will play a key role in shaping the visual identity of our content by producing eye-catching visuals that captivate our audience.\n\r\nKey Responsibilities:\r\n+ Visual Content Creation: Utilize AI tools like Runway.ai, Midjourney, and other emerging models to create visually stunning content for our books and marketing campaigns.\r\n+ Content Editing: Edit and enhance graphical content to create engaging, shareable content that aligns with our brand and campaign goals.\r\n+ Creative Strategy: Collaborate with the marketing team to develop visual concepts and strategies that resonate with target audiences.\r\n+ Trend Analysis: Stay updated with the latest design trends to incorporate cutting-edge techniques into your work.\r\n+ Project Management: Manage multiple design projects simultaneously, ensuring timely delivery of high-quality content.\r\n+ Optimization: Continuously optimize visuals and video content based on performance analytics to drive engagement and conversion.\n\r\nSkills and Qualifications:\r\n+ Must have experience with traditional graphic design tools: Photoshop, Figma, etc...\r\n+ Proficiency in AI Design Tools: Experience with AI-driven design tools like Runway.ai, Midjourney, and other emerging technologies.\r\n+ Graphic Design Skills: Strong background in graphic design principles, including color theory, typography, and layout design.\r\n+ AI Editing Expertise: Proficiency in AI editing software and techniques for creating great graphic content for our audience.\r\n+ Creative Mindset: Ability to think outside the box and develop innovative visuals that capture attention.\r\n+ Attention to Detail: High level of attention to detail to ensure all content meets quality standards.\r\n+ Adaptability: Willing to explore new AI tools and design trends as they emerge.\r\n+ Experience: Previous experience in AI-driven graphic design or video editing is highly desirable.\n\r\nFlexible Hours: Flexibility to adapt to different time zones and project deadlines.\n\r\nWhy Join Our Team?\r\n+ Creative Freedom: Enjoy the opportunity to innovate and push creative boundaries with the latest AI design tools.\r\n+ Growth Opportunities: Develop your skills in a rapidly growing company at the forefront of AI-driven content creation.\r\n+ Impactful Role: Directly contribute to our campaigns, visual storytelling, and branding efforts.\n\r\nPLEASE READ THIS CAREFULLY:\r\nPlease Do Not submit your application unless and until you read and follow all of these instructions. This is Your First Test to see if you can understand and follow directions. You will Not be considered for this position if you do not follow all of these instructions.\n\r\nWhen you respond, please be sure to include the subject headline \"I HAVE READ YOUR AI Graphic Designer POST.\" Do not put anything else in the subject line.\n\r\nAlso, when you first send us your message, you MUST state at the beginning, such as \"My favorite design tool is AI\" Do not put this in the subject line. Please put it at the beginning of your message to us.\n\r\nIn your message, please provide a short paragraph explaining why you're the best candidate for this position. And provide us with your resume or CV.\n\r\nDo NOT contact us directly. Until we permit you, all communications will go through OnlineJobs.ph\n\r\nYOU MUST FOLLOW ALL OF THESE INSTRUCTIONS PRECISELY. WE ARE LOOKING TO SEE IF YOU CAN FOLLOW INSTRUCTIONS.\n\r\nWe will Not consider you if you can Not follow ALL of these instructions. Why? You may ask.\n\r\nWe figure that if you can't follow instructions before you start working with us, how will you be able to follow them after you start working for us?\n\r\nThank you for reading our ad, and we wish you all the best!\n\n\r\nRegards,\n\n\r\nPeter Nguyen",
  "skill_requirements": [
    "Graphic Design",
    "Coreldraw",
    "AI Tools"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:26:26.742049",
      "reason": "Job first discovered"
    }
  ]
}