{
  "job_id": "1291129",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SALES-MANAGER-REMOTE-1291129",
  "scraped_at": "2025-07-15T15:31:41.438088",
  "title": "SALES MANAGER -REMOTE",
  "type_of_work": "Full Time",
  "salary": "Depends on Experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "WATCH THIS BEFORE SUBMITTING YOUR APPLICATION - Upgrade to see actual info\n\r\nPLEASE APPLY THRU THIS LINK: Upgrade to see actual info\n\r\nWe are a US-based custom manufacturing company and we are looking for dedicated and loyal individuals that can contribute to our goals. We are looking for individuals who Embodies Our Core Values, Serve Others and Own It!\n\n\n\r\nCube Care Sales Managers will need to assist in hiring of a sales force team, training and retaining high quality teaUpgrade to see actual infomber who exhibit our core values. Furthermore, coaches teaUpgrade to see actual infombers on the proper behavior needed to enhance customer service experience and drive sales results. Must be experienced and have previous sales managerial expertise with results/performance of what has been accomplished in the past.\n\n\n\r\nKey Responsibilities: \n\r\nLeads the weekly sales and training meetings.\r\nUnderstands, tracks, and goal driven for sales forecast.\r\nUnderstands turnover rate/percentages.\r\nEnsures daily, weekly and monthly sales quotas are met by each teaUpgrade to see actual infomber and sales team.\r\nUtilizes sales/product training to keep sales team informed of product knowledge, selling skills and operational efficiencies.\r\nPartners with HR Department to ensure proper staffing levels in sales positions and the development of teaUpgrade to see actual infombers.\r\nCollaborates with executive management to develop sales strategies to improve product lines, and sales quotes.\r\nEducates sales team by establishing training/programs of new account sales and growth, probability, improve presentation strategies, competitive strategies, proper use and level of sales support, management of profit/cost expense and execution of contracts.\r\nCommunication (telephone and email) presentation skills including telephonic, zoom and/or other devices and strong interpersonal, rapport building skills.\r\nSelf-starter, goal-driven approach with great and exemplary follow-up skills.\r\nKnowledge of sales techniques and the ability to conduct negotiations.\r\nAbility to work in a fast-paced environment and overcome objections.\r\nCreate a Monthly Sales Plan to work with Sales Team and action plan to accomplish goal.\r\nReview, analyze and act as needed for daily, week and monthly sales reports.\r\nEnsure and attend to all incoming leads are worked and reported daily.\r\nPerform random quality control evaluations with sales representatives.\r\nUnderstand and help with investigation process.\r\nSolid experience in opportunity qualification, pre-call planning, call control, account development, and time management.\n\n\r\nQualifications: \n\r\n2+ Years of Sales Managerial Experience\r\nAbility to read, write, and comprehend simple instructions, short correspondence and memos.\r\nAbility to effectively present information in one-on-one and small group situation to customer and teaUpgrade to see actual infombers.\r\nProven experience in strategic and organizational development, including ability to attract, develop and retain.\r\nAbility to effectively prioritize and execute tasks in a high-pressure environment.\r\nAbility to build a cohesive team and solve conflict among teaUpgrade to see actual infombers.\r\nProficient in business related technology systems.\r\nTrack record of servant leadership; serving others and putting team goals first.\r\nOwners mindset; takes ownership over everything within scope of responsibility while still empowering others to do the same.\r\nAdaptability; flexible to changing market forces and shifting priorities as needed.\r\nAbility to break down complete ideas and communicate them in simple and easy to understand ways.\r\nDemonstrate ability to drive results in the sales leadership role.\r\nDesire to continuously self-improve and team improve.\r\nFamiliarity with CRM platforms.\n\n\r\nSystem Requirements:\n\r\nComputer Processor: Minimum 5th generation Intel i5 processor or equivalent\r\nComputer Memory/RAM: Minimum 4.00 GB\r\nComputer Operating System: Windows 10 or Mac OSX - No Linux, Unix or any operating system other than what is required.\r\nInternet Speed: Running on a 5.0 MBPS plan or higher (Both primary and backup) - If your backup connection cannot serve as your primary connection, that does not qualify as a backup connection\r\nREQUIRED – Headset: Noise-cancelling headset connected via USB port\r\nREQUIRED – Web Cam: At least 3 megapixels capable of 720p recording\n\n\r\nNOTE: The computer system you will be using should not be shared with anyone else and should be dedicated for work only. You are required to have a working headset and camera to be used daily.\n\n\n\r\nWe’re picky. You must be smart, savvy, strategic, fun, and ready to learn fast and work hard. If you’re up for the challenge, we want to hear from you!                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}