{
  "job_id": "1292127",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Phone-Customer-Support-Sales-Representative-1292127",
  "scraped_at": "2025-07-15T06:44:05.344791",
  "title": "Phone Customer Support / Sales Representative",
  "type_of_work": "Full Time",
  "salary": "800-1000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you proactive, an excellent communicator, and results-driven? \n\r\nAt Merge Screens we are looking for a Sales and Partnerships Representative to manage customer interactions and explore new business opportunities in the US market. \n\r\nAt Merge Screens, we specialize in providing cutting-edge automotive technology solutions that transform the driving experience. We sell CarPlay modules and Tesla-style screens that replace the original head unit in vehicles, bringing modern connectivity, entertainment, and convenience to cars that lack these features. Our products are designed to enhance safety and comfort by enabling seamless integration of apps like navigation, music, and calls directly onto the car’s screen. \n\r\nWe’re passionate about improving the driving experience for our customers. Our team offers unmatched customer service, partnering with installers and audio shops across the U.S., and providing tech support through video calls to ensure smooth installation and operation. \n\r\nThis is a role with potential for growth based on performance.\n\r\nWhat will you do? \r\n? Call existing customers to explain the sales process and ensure they are satisfied with their purchase. \r\n? Reach out to customers with abandoned carts to identify their needs or concerns and assist them in completing their purchase. \r\n? Identify and establish new partnerships with relevant businesses to drive sales and collaboration. \r\n? Build trust and long-term relationships with customers and partners. \r\n? Document interactions and keep the CRM updated with key information.\n\r\nWorking Conditions \r\n? Vacations: National holidays of your home country + 15 extra days \r\n? Working time: To be discussed, it would be an afternoon US-time work shift. \n\r\nNext Steps Record and send a 3-minute long audio of yourself talking in English and telling us why you think you would be a good fit and also let us know when would you be able to start.",
  "skill_requirements": [
    "Outbound Sales",
    "Sales Support",
    "Customer Relationship Management"
  ],
  "is_active": true,
  "status_history": []
}