{
  "job_id": "1300928",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SEO-Copyeditor-1300928",
  "scraped_at": "2025-07-15T15:30:41.523401",
  "title": "SEO Copyeditor",
  "type_of_work": "Full Time",
  "salary": "$800/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "NOW HIRING: A-Player SEO Copyeditor (a real human, please)\n\r\nHey there, word nerd.\r\nYes, you — the one silently judging this job description for comma placement and tone consistency.\n\r\nWe run a digital marketing agency that helps clients dominate the first page of Google without sounding like a robot wrote their website. Our content is optimized and human. It’s smart, clear, engaging — and not stuffed with 47 variations of \"best plumber in Dallas.\"\n\r\nRight now, we’re looking to bring on an SEO-savvy Copyeditor to help us clean up and elevate web content for our growing roster of clients. If you’ve got a hawk’s eye for detail, a strong grasp of American English, and a sixth sense for what real people want to read — keep scrolling.\n\r\n# THE ROLE\n\r\n- Title: SEO Copyeditor\r\n- Type: Full-time\r\n- Pay: $800/month\r\n- Fully remote (work from anywhere with Wi-Fi and caffeine)\r\n- Flexible schedule — do your best work when you work best\n\r\n# WHAT YOU’LL BE DOING\n\r\n- Editing and polishing web copy across a variety of industries\r\n- Making sure everything reads like it was written by someone born and raised in the U.S.\r\n- Optimizing content for SEO (without sounding like ChatGPT ate a keyword list)\r\n- Fact-checking, fixing grammar, cutting fluff, and turning “meh” into “wow”\r\n- Ensuring all content is unique, natural, and definitely not AI-generated\n\r\n# WHAT WE’RE LOOKING FOR\n\r\n- A master of clean, concise, native-sounding American English\r\n- Proven experience in SEO copywriting/editing\r\n- Someone who loves a well-placed em dash and despises redundant copy\r\n- Exceptional attention to detail\r\n- Strong research and fact-checking chops\r\n- A reliable internet connection (and ideally, a quiet spot to work)\n\r\nBonus: Experience editing service-based business websites (like pest control, IT, healthcare, etc.)\n\r\n# DO NOT APPLY IF…\n\r\n- You're planning to submit AI-generated samples\r\n- You don't actually read job posts before applying\r\n- You can’t commit to consistent, high-quality work\r\n- Your idea of “editing” is running Grammarly and calling it a day\n\r\n# APPLICATION REQUIREMENTS\n\r\n1. Resume\r\nWe don’t need a novel — but we do need to see your experience. Be sure your resume highlights past copyediting and/or copywriting roles (with dates + responsibilities).\n\r\n2. HUMAN Work Samples\r\nShow us your best human-edited SEO content. This can be live webpages, docs, mockups — just make sure you can explain your role in crafting the copy.\n\r\nNeed a sense of what we’re looking for? Check out these examples from our clients:\r\n- Upgrade to see actual info\r\n- Upgrade to see actual info\r\n- Upgrade to see actual info\r\n- Upgrade to see actual info\r\n- Upgrade to see actual info\n\r\n# NOTE: Submitting AI-generated work will result in automatic disqualification. We will know. And we won’t be nice about it.\n\r\n# NEXT STEPS\n\r\n1. Send your resume + work samples\r\n2. If it looks like a match, we’ll send you a paid test assignment\r\n3. If your test knocks our socks off, you’re in\n\r\nSo — are you the sharp-eyed, SEO-loving, typo-obliterating editor we’re looking for?\n\r\nIf yes, hit that apply button.\r\nIf no... keep scrolling. You’re probably just here for ideas anyway",
  "skill_requirements": [
    "Proofreading",
    "Copyediting",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:30:41.525634",
      "reason": "Job first discovered"
    }
  ]
}