{
  "job_id": "1305126",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1305126",
  "scraped_at": "2025-07-14T23:09:57.134372",
  "title": "Virtual Assistant (Media, Tech & Social Media Focused)",
  "type_of_work": "Any",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Description:\r\nWe are looking for a dynamic and highly organized Virtual Assistant with a passion for media, technology, and social media. This role requires a tech-savvy, detail-oriented individual who can support our operations across content creation, social media management, and administrative tasks. If you have experience in media, digital marketing, or tech, and love staying up to date with industry trends, this is the perfect role for you.\n\n\r\nMust work on Los Angeles timezone.\n\r\nKey Responsibilities:\r\nVarious tasks to Assist CEO\r\nSocial Media posting and using templates\n\n\r\nAdministrative Support – Manage calendars, emails, and coordinate meetings\r\nProject Management – Assist in organizing and tracking tasks across multiple projects using tools like Trello, Asana, or ClickUp\r\nBasic Graphic & Video Editing – (Bonus) Experience with Canva, CapCut, Adobe Suite, or other content creation tools\r\nCustomer Engagement – Respond to inquiries and engage with followers or customers via email and social media\r\nLight Data Analysis – Monitor and report on social media performance, engagement, and campaign results\r\nQualifications:\r\nAt least 1-2 years of experience as a Virtual Assistant, Social Media Manager, or in a media/tech-related role\r\nStrong understanding of social media platforms, content creation, and digital trends\r\nExcellent written and verbal English communication skills\r\nTech-savvy and proficient in Google Workspace (Docs, Sheets, Calendar), Microsoft Office\r\nExperience with social media tools like Buffer, Later, Hootsuite, or Meta Business Suite is a plus\r\nBasic knowledge of AI tools, digital marketing, or influencer marketing is a big advantage\r\nFamiliarity with video editing, graphic design, or podcast editing is a bonus\r\nStrong organizational and time-management skills\r\nReliable internet connection and a quiet work environment\n\r\nWhat We Offer:\r\nOpportunity to work with a fast-growing tech and media company\r\nFlexible work hours and a remote work setup\r\nGrowth opportunities with training and mentorship\r\nIf you're passionate about media, technology, and social media, and want to work in a dynamic digital environment, we’d love to hear from you! Apply now by sending your resume and a brief introduction.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Executive Assistance",
    "Virtual Assistant"
  ]
}