{
  "job_id": "1306571",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Assistant-for-Report-Management-Appointment-Setter-1306571",
  "scraped_at": "2025-07-15T15:41:12.460297",
  "title": "Assistant for Report Management & Appointment Setter",
  "type_of_work": "Part Time",
  "salary": "100",
  "hours_per_week": "5",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Summary: We are looking for a reliable and detail-oriented assistant to help with pulling weekly reports and coordinating follow-up communications with the team every Sunday. Additionally, this role includes setting appointments for life insurance consultations. The ideal candidate will have strong organizational and communication skills, a proactive attitude, and an ability to manage multiple tasks efficiently.\n\r\nKey Responsibilities:\n\r\nReport Management: Pull and organize weekly reports every Sunday from various systems or sources.\r\nTeam Communication: Follow up with teaUpgrade to see actual infombers regarding report details, deadlines, and progress to ensure everything is on track.\r\nAppointment Scheduling: Set up and confirm appointments for life insurance consultations, ensuring all relevant details are communicated clearly.\r\nAdministrative Support: Assist with other administrative tasks as needed, including tracking progress on tasks and managing schedules.\r\nRecord Keeping: Maintain accurate records of reports, communications, and appointments.\r\nQualifications/Requirements:\n\r\nStrong organizational and time-management skills.\r\nExcellent written and verbal communication skills.\r\nAbility to manage multiple tasks and meet deadlines.\r\nComfortable using office tools and software (e.g., Microsoft Excel, Google Sheets, calendar tools).\r\nPrevious experience in administrative or assistant roles preferred.\r\nExperience in appointment setting (preferably for sales or services) is a plus.\r\nDesired Skills:\n\r\nFamiliarity with life insurance terminology or the financial industry is beneficial.\r\nProactive and able to work independently with minimal supervision.\r\nDetail-oriented with the ability to spot discrepancies in reports and follow up effectively.\r\nWork Environment: This is a remote position with flexible hours, though the work must be completed every Sunday to ensure timely communication with the team.\n\r\nHow to Apply: Please send your resume along with a brief cover letter explaining your experience in similar roles and why you're a great fit for this position.",
  "skill_requirements": [
    "Problem Solving",
    "English Proficiency",
    "Technology Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:34:30.125574",
      "reason": "Job first discovered"
    }
  ]
}