{
  "job_id": "1312365",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Administrative-Support-Customer-Service-with-Bookkeeping-Background-1312365",
  "scraped_at": "2025-07-14T23:09:59.377589",
  "title": "Administrative Support & Customer Service with Bookkeeping Background",
  "type_of_work": "Full Time",
  "salary": "PHP28000/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Cannot work for any other organisation when employed with us. Must have good written and verbal English.\n\r\nRole Overview\r\nWe are seeking a highly organized and customer-focused Administrative Support & Customer Service professional with a bookkeeping background to join our team. This role requires excellent verbal and written communication skills, as a key responsibility is handling customer service phone calls and email inquiries related to invoice payments, financial transactions, and account-related matters.\r\nThe ideal candidate will have administrative experience, a strong grasp of bookkeeping principles, and proficiency in Xero. While bookkeeping will not be the primary focus, familiarity with accounts payable, receivable, and reconciliations is essential to support the finance team effectively.\r\nThis role is best suited for someone who is detail-oriented, adaptable, and confident in handling phone interactions with clients, suppliers, and stakeholders.\r\n________________________________________\r\nKey Responsibilities\r\nCustomer Service & Administrative Support\r\n• Answer phone calls from stakeholders, including clients and vendors, regarding invoice payments and account-related inquiries.\r\n• Respond to email inquiries professionally and efficiently.\r\n• Assist with data entry, document management, and maintaining accurate financial records.\r\n• Develop, document, and maintain administrative and financial processes.\r\n• Create and manage spreadsheets, reports, and other documents using Excel and Microsoft Office Suite.\r\n• Support the accounts team with general administrative and clerical tasks.\r\nBookkeeping Support\r\n• Assist in managing accounts payable, receivable, and reconciliations using Xero.\r\n• Ensure financial data is accurate and up to date.\r\n• Process basic NDIS-related financial transactions, such as claims, invoices, and reconciliations.\r\n• Coordinate with the finance team to track and follow up on outstanding payments.\r\nCRM and Communication\r\n• Manage and update CRM systems with accurate data.\r\n• Communicate effectively via phone and email, ensuring clear and professional interactions.\r\n• Draft and send professional correspondence and reports.\r\n• Maintain strong relationships with stakeholders by providing timely and helpful responses.\r\nTeam Collaboration and Learning\r\n• Work closely with the accounts and administrative teams to support daily operations.\r\n• Demonstrate flexibility and willingness to learn new skills and systems.\r\n• Proactively identify process improvements to enhance efficiency.\r\n________________________________________\r\nKey Skills and Attributes\r\nCustomer Service & Communication:\r\n• Excellent verbal and written English communication skills.\r\n• Confident phone manner to handle inquiries from clients and stakeholders.\r\n• Strong customer service mindset with a problem-solving approach.\r\nAdministrative & Organizational Skills:\r\n• Strong attention to detail and accuracy in data entry and documentation.\r\n• Proven ability to follow and develop processes.\r\n• Effective time management and multitasking skills.\r\nTechnical Skills:\r\n• Bookkeeping knowledge, particularly accounts payable, receivable, and reconciliations.\r\n• Proficiency in Xero and/or other accounting software.\r\n• Familiarity with CRM systems (Zoho preferred).\r\n• Advanced knowledge of Excel and Microsoft Office Suite.\r\n• Knowledge of NDIS financial processing is a bonus but not essential.\r\nTeam & Adaptability:\r\n• Ability to work collaboratively within a team.\r\n• Flexibility and eagerness to learn new tools and techniques.\r\n________________________________________\r\nQualifications and Experience\r\n• 2-5 years of experience in administrative support, customer service, and bookkeeping roles.\r\n• Previous experience working with an Australian company preferred.\r\n• Bonus: Knowledge of the NDIS system and processes.\r\n• Formal qualifications in administration, bookkeeping, or finance are advantageous.\r\n________________________________________\r\nTechnical Requirements\r\n• Stable and fast internet connection.\r\n• Reliable electricity supply to ensure uninterrupted work.\r\n• Personal computer or laptop with at least a Core i5 processor or equivalent specifications with an additional screen.\r\n________________________________________\r\nPreferred Attributes\r\n• Familiarity with Australian clients and accounting processes.\r\n• Experience working in a customer service or administrative role within Australia.\r\n• A proactive and solution-oriented mindset.\r\n________________________________________\r\nWhat We Offer\r\n• A supportive and collaborative team environment.\r\n• Opportunities for professional development and growth.\r\n• Work remotely, providing greater flexibility and convenience.\n\r\n________________________________________",
  "skill_requirements": [
    "Customer Service",
    "Administrative Support",
    "Online Bookkeeping"
  ]
}