{
  "job_id": "1312382",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-Zoho-Specialist-Social-Media-Customer-Service-Bookkeeping-Support-1312382",
  "scraped_at": "2025-07-15T07:45:46.924050",
  "title": "Virtual Assistant – Zoho Specialist, Social Media, Customer Service & Bookkeeping Support",
  "type_of_work": "Full Time",
  "salary": "PHP 28,000/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Cannot work for any other organisation when employed with us.\n\r\nRole Overview\n\r\nWe are seeking a tech-savvy and solutions-driven Virtual Assistant with a strong track record in Zoho optimization, workflow automation, social media management, and customer service. The ideal candidate will have expertise in streamlining and automating business processes using Zoho’s suite of applications, including Zoho Flow and Deluge scripting, to boost productivity and drive business growth.\r\nThis role also requires lead generation skills, a strong focus on customer solutions, and experience in social media marketing to enhance brand presence and engagement. Additionally, the candidate should have a solid understanding of bookkeeping principles to support financial operations when needed.\r\nIf you have a passion for optimizing workflows, managing social media, improving customer experiences, and supporting business operations, we’d love to hear from you!\r\n________________________________________\r\nKey Responsibilities\r\nZoho Optimization & Workflow Automation\r\n• Streamline and optimize business processes using Zoho CRM, Zoho Flow, and Deluge scripting.\r\n• Automate workflows to reduce manual tasks, improve efficiency, and enhance customer solutions.\r\n• Maintain and update Zoho CRM data, ensuring accurate customer segmentation and lead tracking.\r\n• Integrate Zoho’s suite of applications with third-party tools to improve operations.\r\n• Develop and implement custom Zoho solutions tailored to business needs.\r\nSocial Media Management & Marketing Strategy\r\n• Develop and execute a content calendar for platforms like LinkedIn, Instagram, Facebook, and Twitter.\r\n• Create and schedule engaging social media posts that align with the company’s marketing goals.\r\n• Design graphics, videos, and captions using Canva and AI tools.\r\n• Implement lead generation strategies through social media and digital marketing.\r\n• Track and analyze social media performance metrics, optimizing strategies for better engagement.\r\n• Engage with audiences, respond to messages and comments, and build an interactive online community.\r\nCustomer Service & Lead Generation\r\n• Handle customer service phone calls professionally, addressing inquiries regarding services, invoices, and accounts.\r\n• Maintain a strong customer solutions approach, ensuring high levels of client satisfaction.\r\n• Provide email support and client communication, ensuring quick and professional responses.\r\nBookkeeping & Financial Support\r\n• Assist in accounts payable and accounts receivable using Xero or similar software if required.  training will be provided\r\n• Coordinate with the finance team to track and follow up on outstanding payments.\r\n• Ensure financial data accuracy and support reporting tasks when needed.\r\n________________________________________\r\nKey Skills and Attributes\r\nZoho & Technical Expertise:\r\n• Proven experience in Zoho CRM, Zoho Flow, and Deluge scripting.\r\n• Ability to optimize and automate business processes to enhance efficiency.\r\n• Strong understanding of Zoho’s suite of applications and their integration with business operations.\r\nSocial Media & Lead Generation:\r\n• Expertise in managing social media platforms and content scheduling tools (e.g., Zoho Social, Hootsuite, etc).\r\n• Experience in branding, audience targeting, and engagement strategies.\r\n• Ability to generate leads and nurture client relationships.\r\n• Strong understanding of SEO and social media analytics.\r\nCustomer Service & Communication:\r\n• Excellent verbal and written English communication skills.\r\n• Confident phone manner to handle customer service and lead inquiries.\r\n• Strong focus on providing customer solutions and enhancing client experiences.\r\nAdministrative & Bookkeeping Knowledge:\r\n• Familiarity with bookkeeping principles and financial processes.\r\n• Experience with Xero or similar accounting software for financial tracking.\r\n• Strong attention to detail and organizational skills.\n\r\n________________________________________\r\nQualifications and Experience\r\n• 2+ years of experience in a Zoho specialist, social media management, customer service, or bookkeeping support role.\r\n• Proven experience in workflow automation and lead tracking using Zoho CRM & Deluge scripting.\r\n• Background in marketing, social media, customer service, or finance preferred.\r\n• Experience working with Australian businesses is a plus.\r\n________________________________________\r\nTechnical Requirements\r\n• Stable and fast internet connection.\r\n• Reliable electricity supply to ensure uninterrupted work.\r\n• Personal computer or laptop with at least a Core i5 processor or equivalent specifications with an additional screen.\r\n________________________________________",
  "skill_requirements": [
    "Zoho CRM",
    "Social Media Management",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": []
}