{
  "job_id": "1313034",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Looking-for-CSR-Ninjas-with-Social-Media-Experience-1313034",
  "scraped_at": "2025-07-15T12:29:44.278570",
  "title": "Looking for CSR Ninjas with Social Media Experience! :)",
  "type_of_work": "Full Time",
  "salary": "$5-8 USD/hr (900-1400/mo)",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "*Please read the entire ad if you're interested in applying*\n\r\nWe are looking for enthusiastic, highly organized, and tech-savvy Virtual Assistants to act as CSR's to help with administrative and social media tasks!  \n\r\nAt NinjaVA, we are committed to matching top-tier candidates with excellent clients in the home services and trades industry who share our values. In this role, you will have the opportunity to work with an awesome client, providing top-notch customer service and administrative support.\n\r\nResponsibilities:\n\r\n- Handle customer inquiries via phone, email, and chat in a timely and professional manner\r\n- Provide administrative support such as data entry, file management, calendar management and scheduling appointments\r\n- Create social media content\r\n- Assist with social media marketing and growth\r\n- Use problem-solving skills to resolve customer issues\r\n- If you’re still reading you have great attention to detail! Please mention your favorite animal in the email's subject line\r\n- Be tech-savvy and have the ability to learn and use new tools and systems\r\n- Knowledge or past use of CRMs is a plus\r\n- Experience in the Home Service Industry is a plus\n\r\nRequirements:\n\r\n- Proven experience in customer service/virtual assistant\r\n- Strong communication and interpersonal skills\r\n- Excellent time-management and organizational skills\r\n- Ability to multitask and prioritize tasks effectively\r\n- High attention to detail\r\n- Proficiency in Microsoft Office Suite and Google Suite\r\n- Knowledge of Jobber and HouseCall Pro a plus\n\r\nIf you are someone who thrives in a fast-paced environment and enjoys taking on responsibility, then we want to hear from you! To apply:\n\r\nSend an email to apply[at]ninjava[dot]com and attach a 60-second video introduction as well as your CV/resume.\r\nDo not submit your application here--your application will not be entertained.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Management",
    "Administrative Support"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:18:52.464594",
      "reason": "Job first discovered"
    }
  ]
}