{
  "job_id": "1314356",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-Marketing-Support-Influencer-Outreach-Admin-Customer-Support-1314356",
  "scraped_at": "2025-07-15T09:26:46.468339",
  "title": "Virtual Assistant – Marketing Support (Influencer Outreach,  Admin, Customer Support)",
  "type_of_work": "Part Time",
  "salary": "200-300",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Part-Time Virtual Assistant (Customer Support, Influencer Outreach & Admin)\n\r\nAbout INÉ:\r\nINÉ is a skincare startup inspired by Japanese beauty rituals and powered by sake kasu—the original fermented rice behind the rice water and kojic Upgrade to see actual info. We create minimalist, effective skincare rooted in nature and tradition.\n\r\nWe’re looking for a proactive, detail-oriented Virtual Assistant to support our Marketing Lead with influencer outreach, customer support, and day-to-day admin. If you’re efficient, resourceful, and a fast learner, we’d love to work with you. Hours and pay can grow with strong performance.\n\r\n?\n\r\nYour Role at INÉ\n\r\nInfluencer Outreach\r\n\t•\tIdentify and reach out to nano/micro influencers who align with our brand\r\n\t•\tDraft outreach emails and DMs that feel personal and on-brand\r\n\t•\tTrack outreach, replies, shipping info, and content delivery\r\n\t•\tCoordinate gifting campaigns and ensure timely follow-ups\r\n\t•\tOrganize and label UGC for reuse across marketing channels\r\n\t•\tResearch trends and recommend new influencer partnerships\r\n\t•\tCreate monthly reports on outreach performance and test new strategies to improve results\n\r\nCustomer & Admin Support\r\n\t•\tRespond to customer emails and DMs in a warm, brand-aligned tone\r\n\t•\tHelp schedule content across socials, email, and blog\r\n\t•\tMaintain and organize influencer and content databases\r\n\t•\tDraft outreach emails for media and partnership opportunities\r\n\t•\tHelp track KPIs and streamline reporting\r\n\t•\tAssist with light project management and ongoing admin support\n\r\n?\n\r\nWhat We’re Looking For\r\nYou are someone who:\r\n\t•\tSpeaks and writes fluent, natural English\r\n\t•\tHas a sharp eye for eliminating AI-sounding or generic language\r\n\t•\tIs organized and reliable with excellent attention to detail\r\n\t•\tLearns and adapts quickly from feedback\r\n\t•\tMakes sound decisions and knows when to ask questions\r\n\t•\tHas clear, professional writing skills\r\n\t•\tHas experience with influencer outreach and/or customer support\r\n\t•\tUnderstands how to automate or streamline workflows (a plus!)\n\r\n?\n\r\nHow to Apply\r\nSend us a short message highlighting your experience with:\r\n\t•\tInfluencer outreach or social media\r\n\t•\tCustomer support or admin\r\n\t•\tAny tools or systems you’re confident using\n\r\nWe’re excited to hear from you!",
  "skill_requirements": [
    "Influencer Marketing",
    "Communication",
    "Customer Relationship Management"
  ],
  "is_active": true,
  "status_history": []
}