{
  "job_id": "1318916",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Product-Development-Private-Label-1318916",
  "scraped_at": "2025-07-15T14:42:45.226720",
  "title": "Amazon Product Development (Private Label)",
  "type_of_work": "Full Time",
  "salary": "monthly/ TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Amazon Product Development\n\r\nWorking Days: Monday to Friday\r\nShift Timings: EST Time Zone\n\r\nJOB DESCRIPTION:\r\nAs an Amazon Product Development, you will be pivotal in expanding our product catalog on the Amazon platform. You will be responsible for identifying commercially viable product ideas, managing the development process from concept to launch, and ensuring each product aligns with our brand identity while achieving profitability targets. This role requires a blend of analytical prowess, creative thinking, and a deep understanding of our customer avatar.\n\r\nRESPONSIBILITIES:\r\n• Conduct comprehensive product research and keyword analysis to identify high-demand products that align with our brand and customer needs.\r\n• Collaborate with the sourcing and production team to manage the end-to-end product development process, ensuring clear processes and timely results.\r\n• Work closely with our China-based sourcing agent to identify supplier options and oversee sampling using the Ignite framework.\r\n• Negotiate pricing and terms with suppliers while maintaining a focus on win-win partnerships.\r\n• Coordinate with freelance designers to create artwork and product designs as needed.\r\n• Evaluate product samples for quality and functionality, ensuring adherence to specifications.\r\n• Establish clear guidelines for product specifications and features, collaborating with the content team for packaging and listing creation.\r\n• Monitor product workflow and deadlines, ensuring that products move through the development process efficiently.\r\n• Validate product concepts through customer feedback and iterate based on insights gained.\n\r\nEXPECTED RESULTS:\r\n• Establish a Product Pipeline Calendar for the next 12 months, facilitating strategic planning and manufacturing ramp-up.\r\n• Development of products with potential for patent, trademark, or copyright protection to safeguard our brand from copycats.\r\n• Meaningful product designs and features that resonate with our customer base.\r\n• Clear understanding of capital requirements for product launches, supported by financial forecasts.\r\n• Prediction of revenue growth from new products, enabling strategic decision-making for acquiring debt if necessary.\r\n• Identify optimal factories for product manufacturing based on the variety of products in the pipeline.\r\n• Validate new products through customer avatar feedback to ensure a high probability of success.\r\n• Delivery of products that meet customer needs and elevate brand awareness.\r\n• Development of intellectual property elements to defend against competitors.\n\r\nREQUIREMENTS:\r\n• Deep understanding of our customer avatar and their product preferences.\r\n• Creative mindset with the ability to develop impactful product concepts.\r\n• Strong organizational skills to manage multiple products in development simultaneously.\r\n• Excellent collaboration and communication skills to work effectively with cross-functional teams.\r\n• Proficiency in English, both spoken and written.\r\n• Proficiency in tools such as Asana, Slack, Excel, Google Suite, Office, and Loom.\r\n• Must be willing to work in the EST time zone and comfortable using a time tracker\n\r\nBenefits: (Terms will be discussed during onboarding)\r\n• Leave Benefits\r\n• Internet and Mobile Allowance\r\n• Health and Dental Insurance\r\n• Entertainment Benefits\r\n• Trip Incentive (outside the country)\n\r\nNote: This job description is not exhaustive, and additional activities, duties, or responsibilities may be assigned as needed.",
  "skill_requirements": [
    "Amazon",
    "Product Analysis",
    "Product Research"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:42:45.228529",
      "reason": "Job first discovered"
    }
  ]
}