{
  "job_id": "1324575",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Web-Developer-WordPress-Lead-Generation-Focus-1324575",
  "scraped_at": "2025-07-15T12:28:18.937603",
  "title": "Web Developer (WordPress & Lead Generation Focus)",
  "type_of_work": "Part Time",
  "salary": "$5/hr - $6/hr",
  "hours_per_week": "25",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for a skilled Web Developer to join our growing creative team at Clear Choice Photo Booth. This role will focus on helping without our current website revision and optimizing our company website to enhance user experience, improve lead generation, and integrate seamlessly with our marketing and CRM systems.\n\r\nResponsibilities:\n\r\n- Assist our team with technical updates to improve SEO optimization and user experience on our website :\r\n       - Upgrade to see actual info\r\n- Work closely with our SEO Specialist and Creative Team to create continual improvements that are visually appealing, and assist with lead generation.\r\n- Implement SEO best practices to improve organic search rankings and site visibility.\r\n- Optimize site performance and speed, ensuring a seamless user experience across all devices.\r\n- Integrate website forms and lead capture tools with our CRM system for automated lead management.\r\n- Continuously update and improve the website by adding new features, pages, and functionalities.\r\n- Troubleshoot and fix bugs, broken links, or performance issues as they arise.\r\n- Ensure website security and best coding practices to protect user data.\n\r\n- 11AMEST  - 4PMEST  Monday - Friday \n\r\nQualifications:\n\r\n- Proven experience as a WordPress Developer (Custom themes and plugins).\r\n- Strong understanding of SEO fundamentals, UX/UI design principles, and site performance optimization.\r\n- Experience integrating websites with CRM tools (e.g., HubSpot, Zoho, or similar).\r\n- Proficiency in HTML, CSS, JavaScript, and PHP.\r\n- Familiarity with Google Analytics, Google Tag Manager, and tracking conversion rates.\r\n- Strong problem-solving skills and ability to work independently with minimal supervision.\r\n- Experience working with marketing teams to align web development with business goals is a plus.",
  "skill_requirements": [
    "Google Analytics",
    "Wordpress",
    "Web Development"
  ],
  "is_active": true,
  "status_history": []
}