{
  "job_id": "1325010",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Video-Editor-Remote-1325010",
  "scraped_at": "2025-07-15T12:28:17.282140",
  "title": "Full-Time Video Editor (Remote)",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a creative storyteller who can turn raw footage into captivating content? Do you have a sharp eye for detail and a passion for delivering high-quality work? If so, we want YOU on our team!\n\r\nAt Vidpros, we value creativity, collaboration, and excellence. As part of our team, you’ll have the opportunity to grow, innovate, and work with cutting-edge tools in a supportive environment.\n\r\n>> Apply now: Upgrade to see actual info/vidproseditor (Only the form submissions will be considered. Other forms of communication will not be entertained.)\n\r\nWhat We’re Looking For:\r\n> Proven Experience: A solid portfolio showcasing your video editing skills.\r\n> Technical Expertise: Proficiency in Adobe Creative Cloud (Premiere Pro, After Effects, etc.).\r\n> Creative Storytelling: Ability to craft engaging narratives that captivate audiences.\r\n>  Attention to Detail: Keen eye for polish and perfection in every project.\r\n>  Time Management: Ability to meet deadlines without compromising quality.\r\n>  Communication Skills: Strong written and spoken English for seamless collaboration.\n\r\nWhy Join Vidpros?\r\n1. Performance Incentives: Twice-a-year bonuses to reward your hard work.\r\n2. Growth Opportunities: Regular salary increases and career development paths.\r\n3. Comprehensive Benefits: HMO subsidy and leave credits for your well-being.\r\n4. Top-Notch Tools: Licensed Adobe Creative Cloud (All Apps) and access to premium assets.\r\n5. Collaborative Culture: Work with a talented team that values creativity and teamwork.\n\r\nWork Schedule:\r\n> Days: Tuesday to Saturday\r\n> Hours: 8 AM – 5 PM (PH Time)\n\r\nReady to Take the Next Step?\r\nIf you’re excited about creating impactful content and growing with a team that values your talent, don’t wait—apply now!\n\r\nWe can’t wait to see what you bring to the table. Let’s create something amazing together!",
  "skill_requirements": [
    "Graphic Design",
    "Video Editing",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T05:27:30.392730",
      "reason": "Job first discovered"
    }
  ]
}