{
  "job_id": "1326489",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1326489",
  "scraped_at": "2025-07-14T23:07:43.548175",
  "title": "Senior Brand Designer",
  "type_of_work": "Any",
  "salary": "$1000/month +",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About The Company\r\nGMD Studio is an independent design studio specialising in DTC and e-commerce lifestyle brands. We partner with brands that care about storytelling, strategy, and conversion-focused design, helping them craft standout visuals and digital experiences that drive engagement and sales. We are a tight knit, fully remote team that loves to collaborate and have fun while creating brands together. We believe in flexibility, normal working hours and a happy, supportive work environment.\n\r\nAs we grow, we’re looking for an experienced designer to join our team—someone with a strong eye for design, attention to detail, and the ability to think beyond aesthetics to create work that converts.\n\r\nAbout the Role\r\nThis role is hands-on and strategic. We need someone who can take ownership of projects, ensure high-quality execution, and bring fresh creative thinking. You’ll work alongside our founder, Georgia, to shape brands, refine visual identities, and elevate the overall design standard across projects.\n\r\nWe’re looking for a designer who is:\r\n? Detail-obsessed – You notice when things are 2px off.\r\n? A strong design thinker – You understand how design serves a strategic purpose, not just how it looks.\r\n? A problem solver – You can make design decisions independently and push projects forward without excessive hand-holding.\r\n? Digitally fluent – You have experience designing for e-commerce, web, social media, and email marketing.\r\n? Proactive and communicative – You keep things moving and know how to manage timelines efficiently.\n\n\r\nKey Responsibilities\r\n???? Branding & Identity – Help craft strong, conversion-driven brand identities, including logos, colour palettes, and brand guidelines.\r\n???? E-Commerce & Web Design – Design high-converting Shopify websites, landing pages, and UI elements (Figma experience required).\r\n???? Email & Social Design – Develop compelling email marketing creatives, ad assets, and organic social graphics.\r\n???? Campaigns & Art Direction – Assist in conceptualising and executing campaigns across digital touchpoints.\r\n???? Design Refinement & Oversight – Act as an extra set of eyes to triple-check work and refine details, ensuring everything is polished and aligned with best practices.\r\n???? Maintain clear communication with clients and your team through Slack & Notion\r\n????Have fun, be creative and speak up if you need help\n\r\nWho We’re Looking For\n\r\nWe’re Looking For Someone Who\r\n???? Has at least 2+ years in a similar role\r\n????Loves designing elevated logos / brand guidelines\r\n???? Has experience using Adobe Illustrator\r\n???? Has experience using Figma\r\n???? Has a portfolio that demonstrates good capabilities with visual brand strategies and layouts\r\n???? Pays close attention to detail and is proactive.\n\r\nSalary is competitive and commensurates with creative capabilities and experience. We’re open to taking a leap of faith on talent with high potential and also open to hiring a more seasoned applicant.",
  "skill_requirements": [
    "Illustrator",
    "Figma",
    "Branding"
  ]
}