{
  "job_id": "1327903",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Web-Designer-Developer-1327903",
  "scraped_at": "2025-07-15T02:23:13.302792",
  "title": "Web Designer & Developer",
  "type_of_work": "Full Time",
  "salary": "26000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "???? Join Our Growing Team at Hills Connect Websites & Marketing! ????\n\r\nPosition: Web Developer (Remote – Philippines)\r\nCMS: WordPress with Breakdance & Oxygen Builder\r\nSalary: 24,000 PHP/month (with performance-based increase opportunities)\r\nLocation: Work from home, collaborate remotely\n\r\n???? Join Our Expanding Digital Marketing Agency! ????\r\nHills Connect Websites & Marketing is an established digital marketing agency based in Melbourne, Australia. We're expanding our technical team and looking for a dedicated web developer to join our collaborative remote workforce.\n\r\nWhat You'll Do:\r\n- Design and develop high-quality websites using WordPress with Breakdance and Oxygen Builder\r\n- Implement technical SEO best practices to optimize site performance\r\n- Collaborate with our SEO and marketing teaUpgrade to see actual infombers on integrated campaigns\r\n- Follow established workflows and document all work in project management systems\r\n- Participate in regular teaUpgrade to see actual infoetings and performance reviews\n\r\nWhat We Offer:\r\n- ???? Competitive Starting Salary: 24,000 PHP per month\r\n- ???? Clear Growth Path: Regular performance reviews with wage increase opportunities for high performers\r\n- ???? Team Environment: Work alongside dedicated SEO copywriters and marketing specialists\r\n- ???? Remote Flexibility: Full-time remote position with structured support\r\n- ????? Professional Tools: Access to premium development tools and resources\n\r\nWho We're Looking For:\r\n- Required: Proven experience in WordPress, Breakdance, and Oxygen Builder\r\n- Technical Skills: Strong web development abilities with focus on performance and SEO\r\n- Professional Attitude: Self-motivated, detail-oriented, and committed to quality\r\n- Communication: Excellent English skills and responsive team collaboration\r\n- Accountability: Comfortable with time tracking and performance monitoring\n\r\nApplication Requirements:\r\n- Portfolio: 3–5 websites you've built using Breakdance or Oxygen Builder\r\n- Resume: Detailed work history and technical experience\r\n- Cover Letter: Explain why you're the perfect fit for Hills Connect\r\n- Sample Work: Complete a brief development task (details provided after screening)\n\r\nPerformance Standards:\r\n- 60-day probationary period with weekly performance reviews\r\n- Clear KPIs: Task completion, code quality, communication responsiveness, and reliability\r\n- Growth Opportunities: High performers receive wage increases and additional responsibilities",
  "skill_requirements": [
    "Web Design & Page Layout",
    "Figma",
    "Wordpress"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:23:13.304872",
      "reason": "Job first discovered"
    }
  ]
}