{
  "job_id": "1327224",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Asset-Management-Analyst-1327224",
  "scraped_at": "2025-07-15T14:30:25.455313",
  "title": "Asset Management Analyst",
  "type_of_work": "Full Time",
  "salary": "$8/h - $10/h",
  "hours_per_week": "35",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Assist with multifamily asset management duties including financial modeling (primarily Excel based analyses), project management, cash management, property valuation analysis\n\r\nAssist in providing operational guidance, financial oversight and consultation to 3rd party property management, marketing, and leasing personnel based upon the strategic plan with respect to each property\n\r\nEnsure assets are being operated in a manner consistent with the project’s business plan, joint-venture operating agreements, and loan documents\n\r\nMonitor and assist with managing property-level capital projects and value-add initiatives\n\r\nPrepare investor, lender, and internal reports on an ad-hoc, monthly, quarterly, and annual basis\n\r\nPrepare ad-hoc analysis in Excel to analyze trends and/or property metrics and assist with special projects, as needed\n\r\nIn conjunction with the construction and property management teams, establish the annual budget (capital and operating) and business plan, as well as provide assistance in the budget reforecast\n\r\nAssist the Asset Management team in conversations with lenders, institutional investors, vendors, and contractors\n\r\nUpdate sell/refinancing/hold analyses on portfolio assets as well as maintaining asset level waterfall analyses\n\r\nAssist, as needed, with the underwriting, due diligence, capital markets and closing/onboarding processes of acquisition opportunities and the property sales of dispositions\n\r\nOrganize and catalogue asset management files and records\n\r\nEducation and Experience:\r\nBachelor’s degree required, preferably in Finance, Accounting, Real Estate or related\r\nTwo years of relevant real estate, finance, investment banking, or private equity experience with a broker/owner/investor/operator (multifamily experience is preferred)\n\n\n\r\nDesired Knowledge, Skills, and Abilities:\r\nOutstanding quantitative and financial modeling skills in Excel,\r\nExcellent time management, writing, presentation, and communication skills\r\nAbility to work individually or on a team\r\nAbility to coordinate and manage multiple assignments and projects and efficiently prioritize tasks\r\nAbility to read and interpret financial statements\n\r\nPay is negotiable depends on the experience. \r\nWork hours will be in day time in EST (New York)\r\nPlease email me your resume and do not send me a link to download. The email is Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:24:55.945836",
      "reason": "Job first discovered"
    }
  ]
}