{
  "job_id": "1333379",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1333379",
  "scraped_at": "2025-07-14T23:07:40.255555",
  "title": "Junior Bookkeeper",
  "type_of_work": "Full Time",
  "salary": "TBD - Based on Experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Tasks:\n\r\nMaintain financial records, including purchases, sales, receipts, and payments.\r\nManage invoice processing and accounts payable/receivable.\r\nAssist in the preparation of monthly financial reports.\r\nReconcile bank statements and other financial accounts.\r\nProcess payroll and maintain payroll information.\r\nEnsure compliance with financial regulations and company policies.\r\nWork with QuickBooks accounting software to record and analyze financial data.\r\nCollaborate with other teaUpgrade to see actual infombers to streamline accounting processes.\r\nProvide support during financial audits.\n\r\nQualifications:\n\r\nBachelor’s degree in Accounting, Finance, or related field.\r\nProven experience in bookkeeping or a related financial role - minimum 2-3 years Experience\r\nProficiency in QuickBooks accounting software - minimum 1 year Experience\r\nStrong knowledge of bookkeeping practices and principles.\r\nProficiency in Microsoft Office, especially Excel.\r\nDetail-oriented with strong analytical and problem-solving skills.\r\nExcellent communication and interpersonal skills.\r\nAbility to work collaboratively in a team environment.\r\nKnowledge of payroll processing and financial regulations.\r\nCapacity to handle sensitive financial information discreetly and ethically.\r\nDemonstrated ability to manage tasks independently, showcasing responsibility and initiative.\n\r\nHourly rate, based on experience\r\nNight Shift - New York Time\r\nWork From Home / Home-based: High-Speed Internet Connection w/ back up and a Desktop or Laptop computer with great specs is A MUST!\n\r\nApplication Instructions – Please Read Carefully:\n\r\nIf you meet all the qualifications above and have the required experience, apply only via the following link:\n\nUpgrade to see actual info\n\r\nApplications submitted through OnlineJobs.ph other than the link above will not be considered.",
  "skill_requirements": [
    "Quickbooks",
    "Bookkeeping",
    "Office and Administration"
  ]
}