{
  "job_id": "1333912",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Manager-Agency-Experience-Marketing-the-Agency-1333912",
  "scraped_at": "2025-07-15T15:30:12.846792",
  "title": "Marketing Manager/ Agency Experience Marketing the Agency",
  "type_of_work": "Full Time",
  "salary": "$10.00 per hour US",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are looking for a full time marketing manager THAT HAS   6+ AGENCY EXPERIENCE  MARKETING AGENCY OFFERINGS. such as websites, social media/content programs. MUST SHOW A LINK TO PORTFOLIO DEMONSTRATING THAT YOU HAVE CREATED LEADS AND CONVERSIONS using CRUpgrade to see actual infotrics, Google analytics metrics and Google/FB/IG ad results.  We are very seasoned.  Using ChatGPT to answer questions and created generic Canva images in not what I am looking for. \n\n\r\n We are a digital marketing agency specializing in the backyard living industry. We create strategic marketing campaigns, advertising, and automation solutions for pool builders, hot tub retailers, and pool service companies. As we continue to grow, we’re looking for a skilled Marketing Campaign Specialist to join our team\n\r\n.Role Overview:\r\nWe need a creative and strategic marketer with agency experience to develop compelling ad campaigns to small businesses across email, social media, and digital platforms. You’ll also craft educational video scripts and use AI tools/prompts to enhance content production. This role requires initiative, problem-solving skills, and the ability to work independently while aligning with our brand and client goals.\n\r\nResponsibilities:\n\r\nDevelop, manage, and optimize email marketing and social media ad campaigns.\r\nWrite engaging and persuasive copy for ads, email sequences, landing pages, and social posts.\r\nCreate educational video scripts that align with marketing goals and resonate with target audiences.\r\nUtilize AI tools and prompt engineering to enhance content ideation, generation, and optimization.\r\nCollaborate with designers, videographers, and strategists to bring campaigns to life.\r\nMonitor campaign performance and make data-driven adjustments to improve results.\r\nStay updated on marketing trends, AI advancements, and advertising best practices.\r\nQualifications:\n\r\n6+  years of marketing agency experience with content development as the primary function (required).\r\nProven track record of developing and managing ad campaigns (email + social).\r\nStrong copywriting skills with the ability to write for different platforms and audiences.\r\nExperience creating video scripts for marketing or educational content.\r\nKnowledge of AI tools for content generation (ChatGPT, Midjourney, or similar).\r\nAbility to work independently, meet deadlines, and manage multiple projects.\r\nFamiliarity with Meta Ads, Google Ads, and marketing automation tools is a plus.",
  "skill_requirements": [
    "Email Marketing",
    "Lead Generation",
    "Social Media Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:25:45.000352",
      "reason": "Job first discovered"
    }
  ]
}