{
  "job_id": "1333920",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Website-DevloperDesigner-1333920",
  "scraped_at": "2025-07-15T15:34:24.068928",
  "title": "Website Devloper/Designer",
  "type_of_work": "Part Time",
  "salary": "TBD ($10-12/HR)",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for a reliable and skilled Website Developer/Designer to create custom websites for various clients, including service-based businesses, eCommerce stores, and other niche industries. While we don’t require websites to be built entirely from scratch, we need someone who can customize themes, integrate functionality, and occasionally write code when needed. This is a gig-based, part-time opportunity with the potential for ongoing work. YOU must have the capability to make similar sites such as Upgrade to see actual info and/or Upgrade to see actual info. Ideally the candidate will be responsive and work diligently in a fast paced environment. \n\r\nResponsibilities:\r\nDesign and develop custom, user-friendly websites using platforms like WordPress, Shopify, Webflow, Wix, or other no-code/low-code solutions.\r\nModify and customize themes/templates to meet specific project requirements.\r\nImplement responsive, conversion-optimized designs that enhance user experience.\r\nWrite and edit code (HTML, CSS, JavaScript, PHP, or Liquid for Shopify) when needed for customization beyond standard template modifications.\r\nIntegrate third-party tools, payment gateways, APIs, and plugins as needed.\r\nEnsure websites are SEO-friendly, mobile-responsive, and performance-optimized.\r\nTroubleshoot and fix technical issues or bugs.\r\nWork collaboratively and communicate project progress effectively.\r\nDeliver projects on time and meet client expectations.\r\nRequirements:\r\nProven experience in website development and design (portfolio required).\r\nExpertise in WordPress, Shopify, Webflow, Wix, or similar platforms.\r\nExperience with HTML, CSS, JavaScript, PHP, or Liquid (Shopify).\r\nStrong UI/UX design skills with attention to detail.\r\nAbility to create custom site functionalities beyond drag-and-drop editors.\r\nFamiliarity with SEO best practices and website performance optimization.\r\nStrong problem-solving skills and ability to work independently.\r\nReliability and responsiveness—we need someone who consistently delivers high-quality work on time.\r\nExcellent communication skills and ability to understand client needs.\r\nCompensation:\r\nProject-based or hourly compensation, depending on scope.\r\nOpportunity for ongoing work and long-term collaboration.",
  "skill_requirements": [
    "Design",
    "Web Design & Page Layout",
    "Website Builder"
  ],
  "is_active": true,
  "status_history": []
}