{
  "job_id": "1334738",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Freelance-Accountant-Staff-1334738",
  "scraped_at": "2025-07-15T12:29:31.051589",
  "title": "Freelance Accountant Staff",
  "type_of_work": "Full Time",
  "salary": "Php 35,000 - Php 40,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re currently looking for a Remote Staff Accountant to join our team! This role is responsible for overseeing daily accounting operations, financial reporting, compliance, and driving process improvements.\n\r\nType: FulUpgrade to see actual info Permanent WFM\r\nShift: Night Shift\n\n\r\nSummary of Key Responsibilities:\n\r\n- Accounting Operations: Oversee daily accounting functions, approve invoices, monitor collections, supervise payroll, ensure accurate journal entries, and perform monthly reconciliations.\n\r\n- Financial Reporting: Prepare and review financial statements, analyze variances, identify trends, and assist with consolidated financial reports.\n\r\n- Internal Controls & Compliance: Implement internal controls, ensure compliance with GAAP and regulations, conduct audits, and coordinate with external auditors.\n\r\n- Budgeting & Forecasting Support: Assist in budget preparation, review departmental budgets, monitor budget adherence, and address deviations.\n\r\n- Process Improvement: Identify and implement efficiency improvements, automate data entry, streamline reconciliations, and train staff on new processes.\n\r\n- Cash Flow Management: Monitor receivables, ensure timely collections, and forecast cash flow for financial stability.\n\r\nKey Qualifications:\r\n- bachelor's in accounting, Finance, or related field (CPA/CMA preferred)\r\n- 5-7 years of accounting experience, including 2+ years in a supervisory role\r\n- Strong knowledge of GAAP, financial reporting, and internal controls\r\n- Experience with accounting software (QuickBooks, Excel)\r\n- Ability to work independently and drive process improvements\n\r\nIf you or someone you know is interested, please reply with a resume Upgrade to see actual info",
  "skill_requirements": [
    "Financial Accounting",
    "Analysis",
    "Team Leadership"
  ],
  "is_active": true,
  "status_history": []
}