{
  "job_id": "1338342",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Creative-Director-1338342",
  "scraped_at": "2025-07-15T06:36:59.909101",
  "title": "Creative Director",
  "type_of_work": "Full Time",
  "salary": "Hourly Rate $7",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a visionary Creative Director? Do you have a passion for leading teams toward innovative success? Are you skilled at transforming feedback into strategic improvements that elevate brand storytelling and creative processes?\n\r\nIf you answer yes to these questions, then we want you to be in our team.\n\r\nWe are an 7-figure eCommerce company that has successfully scaled multiple stores in just two years! We’ve hit our $5m run rate in 2024, and we project to reach up to $10m in 2025…But there’s one thing stopping us.\n\r\nWe’re looking for a Creative Director who is ready to jump into our fast-paced environment and create winning campaigns. If you’re ready to be a key member of our Marketing Team and join something big then keep reading.\n\r\nThis is a golden opportunity for someone who:\r\n- Wants to join a fast-paced team and is highly motivated to grow with the organization\r\n- Brings a wealth of eCommerce experience\r\n- Works best when given the freedom to be the expert you are in an entrepreneurial organization\n\r\nIF you’re someone who believes they fit that role, then we’d love to meet you!\n\r\nWhy us?\r\n- We are paid traffic experts! This is our bread and butter and allows us to go from concept to scale very quickly. \r\n- You will help us in building the brands of tomorrow, today.\r\n- Our team is EVERYTHING and we seek individuals with a growth mindset, what does this mean for you? ; resources, training, guidance and the chance to grow will all be provided when you work with us\r\n- You will have an opportunity to work with an amazing team that is dedicated to supporting each other and growing together\r\n- You will have flexible working arrangements (we are output-focused)\r\nProfit share opportunities (when we win, we want you to win)\n\r\nWHAT WILL THIS ROLE INCLUDE?\r\nCreatively leads accounts and creates overall creative direction.\r\nFollow the specifications of the clients by gathering and studying information and materials.\r\nWork on concepts, designs, and applications with the Creative Team to produce an effective digital advertising campaign.\r\nPrepare layout for printing and/or digital release based on client’s requirements.\r\nPrepare and participate in the production of multimedia output to address requirements.\r\nCreate storyboards and mock-ups of ads as well as prepare pitch and presentation decks.\n\r\nDOES THIS SOUND LIKE YOU?\r\n- Proven experience as a Creative Director for 3+ years.\r\n- Experience creating and managing content for paid traffic\r\n- Experience leading creative teams and choosing content creators\r\n- Detailed oriented and meticulous\r\n- You are a self-starter and can work independently without supervision\r\n- You have excellent written/spoken English skills so that you can easily collaborate with our team\r\n- You are comfortable working with other people remotely\r\n- You are open to change and feedback\r\n- You are proactive and constantly finding new ways to improve your performance\r\n- You take pride in the results that you deliver\n\r\nIf you are serious about this role, go to Upgrade to see actual info send me a video with your face saying the words \"Sunflower Seeds\" at the end.\n\r\nIn your video also answer these three questions:\r\nWhy are you applying for this position and this company?\r\nWhy do you think you are the best candidate for this position?\r\nWhere do you see yourself in 3 years?\n\r\nIf this sounds like you, we welcome you to apply!",
  "skill_requirements": [
    "Advertising",
    "Facebook Ads",
    "Creative Advertising"
  ],
  "is_active": true,
  "status_history": []
}