{
  "job_id": "1338625",
  "url": "https://www.onlinejobs.ph/jobseekers/job/GoHighLevel-GHL-Support-Specialist-Troubleshooting-Customer-Success-10hr-1338625",
  "scraped_at": "2025-07-15T12:28:36.860650",
  "title": "GoHighLevel (GHL) Support Specialist – Troubleshooting & Customer Success | $10/hr",
  "type_of_work": "Full Time",
  "salary": "$1600/mo",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a GoHighLevel (GHL) expert with a passion for problem-solving and helping businesses succeed? We’re looking for a highly skilled GHL Support Specialist to join our fast-growing SaaS company, Enrollio, and provide top-tier customer support and troubleshooting assistance.\n\r\nWhat You'll Do:\n\r\nTroubleshoot and resolve GHL account issues for our clients\r\nProvide responsive and professional customer support via chat, email, and calls\r\nAssist clients with automations, workflows, integrations, and campaign setups\r\nIdentify recurring issues and suggest improvements for our processes\r\nCollaborate with our team to enhance the customer experience\n\r\nRequirements:\n\r\nProven expertise in GoHighLevel – deep understanding of workflows, triggers, campaigns, and integrations\r\nStrong problem-solving skills and ability to troubleshoot technical issues\r\nExcellent English communication skills (written & spoken)\r\nAbility to work independently and manage multiple tasks efficiently\r\nMust be based in the Philippines\r\nAvailability to work full-time, 9 AM - 5 PM EST (Monday-Friday)\n\r\nImportant:\n\r\nTo be considered, you MUST submit a video with your application showcasing your GHL expertise – walk us through a workflow you’ve built, a tricky automation you’ve solved, or any other GHL-related challenge you’ve conquered!\n\r\nStarting Rate: $10/hour\r\nSchedule: Monday to Friday, 9 AM - 5 PM EST\r\nLocation: Remote (Philippines-based)\n\r\nIf you're ready to take on this exciting role and help dance studios optimize their businesses with GHL, apply now!",
  "skill_requirements": [
    "Customer Support",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:29:41.360635",
      "reason": "Job first discovered"
    }
  ]
}