{
  "job_id": "1341399",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Short-Form-Video-Editor-1341399",
  "scraped_at": "2025-07-15T15:34:28.929808",
  "title": "Short-Form Video Editor",
  "type_of_work": "Gig",
  "salary": "$5-10 per video",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Short-Form Video Editor\r\nCompany: Reshape Digital Solutions\n\r\nAbout Us\r\nReshape Digital Solutions is a fast-growing digital media company specializing in short-form video content that captivates and entertains a global audience. We’re looking for a talented Short-Form Video Editor to join our creative team and help produce high-quality, engaging videos. This role requires strong technical adaptability, problem-solving skills, and the ability to work under strict deadlines.\n\r\nJob Description\r\nAre you a skilled video editor with a passion for storytelling? Can you efficiently turn raw footage into eye-catching short-form videos while meeting tight daily deadlines? Do you thrive in a fast-paced environment where self-sufficiency is key? If so, we’d love to have you on our team!\n\r\nResponsibilities\r\n- Edit short-form videos for TikTok, Instagram, and YouTube.\r\n- Transform raw footage into compelling, high-quality content.\r\n- Enhance videos with music, text, graphics, and special effects.\r\n- Collaborate with content creators to align with storytelling goals.\r\n- Stay updated on video editing trends and social media best practices.\r\n- Adhere to strict deadlines (non-negotiable):\r\n          8:00 AM EST – First round of edits due\r\n          11:00 AM EST – Revisions due\r\n          (Monday–Friday availability is mandatory; weekend work is optional for bonuses).\n\r\nRequirements\r\n- Proven experience as a video editor with a strong portfolio.\r\n- Proficiency in Adobe Premiere Pro, Final Cut Pro, or similar software.\r\n- Creative mindset with a strong eye for detail and storytelling.\r\n- Strong understanding of social media video formats and trends.\r\n- Tech-savviness is a must:\r\n- Comfortable learning new systems independently with minimal training.\r\n- Must be able to self-learn using Loom videos without requiring hand-holding.\r\n- Experience with Airtable is a plus, but adaptability to Kanban boards and workflow systems is required.\r\n- Strong communication and collaboration skills.\r\n- Self-motivated and capable of working independently in a remote setting.\r\n- Ability to meet strict deadlines and quickly adapt to feedback.\r\n- Knowledge of the American real estate market is a plus but not required.\n\r\nWhat We Offer\r\n- Competitive pay based on experience.\r\n- Growth opportunities in long-form editing, management, and brand development.\r\n- A collaborative, creative work environment.\r\n- The opportunity to reach and impact a global audience.\r\n- Flexible remote work.\n\r\nHow to Apply\r\nIf you’re excited to create engaging short-form videos and be part of our team, send your resume and portfolio link to Upgrade to see actual info Include a brief cover letter explaining why you’re the perfect fit for this role and use this as your subject line: Applying for Short-Form Video Editors\n\r\nNote: Only shortlisted candidates will be contacted for interviews.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:31:16.265141",
      "reason": "Job first discovered"
    }
  ]
}