{
  "job_id": "1342559",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Legal-Assistant-Medical-Records-RetrievalClaims-Specialist-1342559",
  "scraped_at": "2025-07-15T11:30:33.805570",
  "title": "Legal Assistant (Medical Records Retrieval/Claims Specialist)",
  "type_of_work": "Full Time",
  "salary": "$5/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Sweet James LLP is looking for a Legal Assistant:\n\r\nRequirements:\r\n1. Graduate of 4-yr course\r\n2. STRICTLY has an experience working at least (1) one of the following:\r\n- Personal Injury Law Firm \r\n- Healthcare Account (Law Firm related)\r\n3. Legal assistant experience in a Personal Injury Law Firm is a REQUIREMENT\r\n4. Has an experience working remotely (with own laptop/PC and fast & reliable internet connection)\r\n5. Able to do multitasking and work at a fast pace\r\n6. Open to work on a graveyard shift. Working hours: 8-5PM PST (11PM-8AM PH time)\r\n7. STRICTLY no current online job/work (send your updated resume. If currently employed, please provide a proof of your last day of employment)\r\n8. We are an on-cam (M365 Teams) policy while working and ActivTrak will be installed. This is required.\n\r\nImportant Note: \r\n-Indicate your previous employer, especially law firms (No company name will not be entertained)\r\n-Upload a photo of your working space and a full-screenshot of speed test (https://www.speedtest.net/), has to be 100mbps and above.\r\n-Attach your resume as a file. Resume links will not be entertained\n\r\nIf you agree with all the terms above, please send your UPDATED resume/cv to Upgrade to see actual info for a quick response. Interview hours are in PST time zone, expect to be scheduled in US time (3AM-7AM PH time)\n\r\nPLEASE USE THE FOLLOWING IN THE EMAIL SUBJECT LINE: \"LA Applicant from OnlineJobsPH\"",
  "skill_requirements": [
    "Legal Services",
    "Case Management",
    "Medical Billing"
  ],
  "is_active": true,
  "status_history": []
}