{
  "job_id": "1345980",
  "url": "https://www.onlinejobs.ph/jobseekers/job/HR-Assistant-1345980",
  "scraped_at": "2025-07-15T12:32:42.079024",
  "title": "HR Assistant",
  "type_of_work": "Full Time",
  "salary": "Php 60,000-70,000/mth",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Gelatissimo, Australia's largest gelato chain, is looking for a full-time HR Assistant for our Australian business, reporting to the HR Manager. We’re a fun team based in Sydney (great hours!) and you’ll immediately feel part of our family.\n\r\nKey responsibilities include:\n\r\n• Recruitment process support including posting job ads, screening resumes, coordinating interviews and conducting reference checks\r\n• Source and review talent for open roles through community forums, online job boards and LinkedIn Recruiter\r\n• Maintain employee records in the HRIS (Employment Hero)\r\n• Prepare HR-related documents such as employment contracts, offer letters, and onboarding materials.\r\n• Coordinate onboarding and offboarding processes, including welcome sessions and exit interviews.\r\n• Support payroll processing by validating employee hours and leave breaks when issues arise\r\n• Assist in organizing training sessions, workshops, and staff related activities\r\n• Address employee and inbound HR enquiries\r\n• Ad-hoc support to the HR Manager and Leadership Team as required\n\r\nEssential requirements:\r\n• Minimum 5 years of experience in HR - ideally in a local retail and/or manufacturing environment\r\n• Strong and confident communicator with fluent verbal and written English\r\n• High-speed and stable internet connection (100Mbps+)\r\n• Highly capable technology skills - ability to learn new HRIS systems and manipulate data in Excel\n\r\nIdeal requirements:\r\n• HR management degree \r\n• Some knowledge of Australian workplace laws and awards\r\n• Excellent verbal and written communications skills \r\n• Strong attention to detail and highly organised\r\n• Ability to work independently and collaboratively within a remote team.\r\n• Excellent active listening, empathy and integrity\r\n• Strong references from previous employers\n\r\nTo apply please respond to this ad with answers to the below questions (without the use of ChatGPT):\n\r\n1. Please provide an external link to your CV.\r\n2. Please explain why this job interests you - and what you know about Gelatissimo?\r\n3. Please outline your HR experience to-date - ideally highlighting any retail and/or manufacturing experience.\r\n4. Please describe an example of something you've set-up in Excel or configured in an HRIS solution before",
  "skill_requirements": [
    "HR Management",
    "Attention to Detail",
    "English"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:25:07.741679",
      "reason": "Job first discovered"
    }
  ]
}