{
  "job_id": "1346075",
  "url": "https://www.onlinejobs.ph/jobseekers/job/E-commerce-Email-Marketing-Specialist-1346075",
  "scraped_at": "2025-07-15T12:26:53.439750",
  "title": "E-commerce Email Marketing Specialist",
  "type_of_work": "Part Time",
  "salary": "1000",
  "hours_per_week": "25",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are looking for a talented and experienced E-Mail Marketing Specialist to join our fast-growing e-commerce team. You will work on multiple online stores, starting with Upgrade to see actual info and Upgrade to see actual info, both leading brands in kitchen accessories. Our main markets are The Netherlands, Belgium, and other EU countries, so understanding how to engage these audiences is a big plus.\n\r\nWe have a customer base of over 20,000 and aim to maximize engagement, sales, and brand loyalty through highly effective email marketing.\n\r\nThis is a full-time, long-term, in-house opportunity (NO agencies) for someone passionate about e-commerce and data-driven email marketing.\n\r\nYour Responsibilities:\n\r\n— Develop, plan, and execute high-converting email flows and campaigns using Klaviyo\r\n— Build and optimize pop-ups, lead capture forms, and list-building strategies\r\n— Set up A/B testing on emails, flows, subject lines, CTAs, and pop-ups\r\n— Research and identify high-performing email templates from competitors and leading brands, and adapt them to fit our brand identity\r\n— Manage a healthy mix of informational, selling, and brand-awareness emails\r\n— Analyze performance and continuously optimize through testing and iteration\r\n— Collaborate closely with our design and content teams to ensure brand consistency\n\r\nRequirements:\n\r\n— Proven experience with Klaviyo (flows, campaigns, automation, segmentation)\r\n— Solid knowledge of the e-commerce customer journey and lifecycle marketing\r\n— Skilled in competitor research and email inspiration gathering\r\n— Experienced in A/B testing and making data-driven decisions\r\n— Knowledge of pop-up creation and split-testing\r\n— Familiarity with EU e-commerce audiences is a strong plus\r\n— Fluent in English \r\n— Independent, creative, and proactive mindset\r\n— Experience in the kitchen, home & living, or accessories niche is a plus\r\n— Secret filter: Include the word chef's knife in your subject line to show you actually read this\n\r\nWhat You'll Get:\n\r\n— Competitive hourly rate\r\n— Opportunity to work on our other brands (5+ brands across multiple niches)\r\n— Performance-based bonuses\r\n— Full-time contract with long-term potential\r\n— Be part of an ambitious, friendly, and fast-growing team\n\r\nIMPORTANT:\r\nThis role is strictly for in-house freelancers, no agencies allowed. Also include portfolio.",
  "skill_requirements": [
    "Email Marketing",
    "E-Commerce",
    "Klaviyo"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:32:27.838233",
      "reason": "Job first discovered"
    }
  ]
}