{
  "job_id": "1347618",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Excellent-ResearcherWriterVA-For-A-Full-Time-Position-1347618",
  "scraped_at": "2025-07-15T07:34:08.447800",
  "title": "Excellent Researcher/Writer/VA For A Full-Time Position",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "I am looking for a Full-time Researcher/ Writer/ Virtual Assistant with excellent English skills. Your tasks will include, but will not be limited to the following:\r\n*research and collating data\r\n*creating lists and spreadsheets\r\n*tracking reports\r\n*updating spreadsheets and trackers\r\n*writing scripts and captions\r\n*responding to emails\r\n*creating email campaigns\n\r\nPay is TBD, this will depend on your level of skill and other people who apply to the job.\n\r\nPerks:\r\n*You can work as much as you want. I will pay you a salary but if you work extra hours you will get paid.\r\n*Flexible Vacation, If you need time off just let me know.\r\n*Opportunity to advance/get bonuses, If you do a good job I will give you a raise and bonuses.\n\r\nAbout Me:\r\nI own two companies B Dancewear and Effective Ecommerce and a partner to multiple e-commerce businesses. I have been working with Virtual Assistants for over 6 years and all of my VAs have been very happy to work with me. You will be given a chance to talk with my current VA before you are hired.\n\r\nTo Apply for the job:\r\n1. Change the subject line to \"I Want to Work for You [Insert the name of my mom who is the co-owner of Bdancewear]\"\r\n2. At the top of your message write 2-3 sentences on why you would like this position, and why you are a good fit. Do not write more than that or else your application will be deleted.\r\n3. Write out the name of one of the passion products I featured on my channel (check out my vlogs on my YouTube channel: Travis Marziani)\n\r\nMake sure to follow all the steps above. Do not write more than what I have asked you above. If you do, I will ignore your response. If I will interview you, there will be a short call between us and a video will be required.\n\r\nThis is a great job opportunity with the ability to get bonuses and raises, so I will only look at applicants who really want the job.\n\r\nThank you,\r\nTravis Marziani",
  "skill_requirements": [
    "Email Management",
    "Research",
    "Data Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:27:43.155869",
      "reason": "Job first discovered"
    }
  ]
}