{
  "job_id": "1348589",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Market-Research-Analysts-1348589",
  "scraped_at": "2025-07-14T23:06:01.209659",
  "title": "Market Research Analysts",
  "type_of_work": "Full Time",
  "salary": "SGD 900",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "ABOUT US\n\r\nThe Strivre is a private equity platform now in its third decade of trading. We have a collection of businesses in our belt ranging from technology, recruitment and property, we have had 13 sister businesses in nine countries with a centralized focus mostly on the Asian markets.\r\nAbout ten years ago we created a shared service centre covering the suite of finance/admin/operations/ technology/marketing and have had teams generally in India the Philippines and Malaysia.\n\n\r\nTHE ROLE\n\r\nThe business is looking to expand its team and wants to hire one ambitious members. We have dUpgrade to see actual info to amalgamate the duties combining three of our core functions: \n\r\nDATA RESEARCH\r\nThe guts of the job. Working within our CRM which has 300,000 contacts. Sharpening up our data through codes/tags. Working to timeframes and deliverables producing lists and quality data designed to be used for mailers and marketing. We estimate this to be 50-70% of the job.\r\nADMIN\r\nThis is basic work, managing our CRM, adding in information, and preparing client documents. It is simple work but important and needs a sharp for detail. We estimate this to be 10-30% of the role. \r\nMARKETING\r\nWorking with the head of marketing to produce smart mailers and blogs on a project basis, weekly targets and goals will be based on creating content to send to our communities. You will learn intrinsic marketing skills, sharpen your design skills. Full training is on offer to include external marketing courses. We estimate this to be 20% of the role.\n\n\r\nABOUT YOU\r\n• Lateral thinking, able to think outside the box, not phased by obstacles.\r\n• Happy to accept accountability for goals and targets.\r\n• Prepared to go the extra mile and not clock watch.\r\n• Good grasp of commerce or willing to learn and interested in it.\r\n• Sharp research skills.\r\n• Able to source hard to find data.\r\n• Attention to detail someone who takes pride in quality.\n\r\nThe starting base salary is from SGD 600 for candidates with no prior experience. For experienced applicants, a higher salary will be offered based on qualifications and is open to negotiation.",
  "skill_requirements": [
    "Recruiting",
    "Candidate Sourcing",
    "Talent Acquisition"
  ]
}