{
  "job_id": "1348287",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1348287",
  "scraped_at": "2025-07-14T23:07:51.152181",
  "title": "Marketing Coordinator/Manager",
  "type_of_work": "Full Time",
  "salary": "$400+",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Company: CEG United\n\r\nAbout Us:\r\nCEG United is a dynamic funding firm dedicated to swiftly assisting clients in overcoming financial obstacles through targeted mentorship programs. Our services encompass auditing and correcting personal credit, enhancing credit profiles with personal and business tradelines, and securing funding tailored to our clients’ needs. We are committed to delivering effective solutions that empower our clients to achieve their financial goals.\n\r\nPosition Overview:\r\nWe are seeking a proactive and versatile Marketing Coordinator/Manager to lead our marketing initiatives. This individual will be responsible for developing and executing strategic marketing plans that enhance brand visibility, generate qualified leads, and support our mission of facilitating client funding. The ideal candidate will have a comprehensive understanding of digital marketing channels, content creation, and lead generation strategies within the financial services sector.\n\r\nKey Responsibilities:\r\n 1. Strategic Marketing Planning:\r\n • Develop and implement comprehensive marketing strategies aligned with CEG United’s objectives to promote our credit auditing, tradeline enhancement, and funding services.\r\n • Identify target audiences and tailor marketing efforts to effectively reach and engage potential clients.\r\n 2. Content Creation and Management:\r\n • Produce compelling content that educates potential clients about credit improvement processes, the benefits of tradelines, and funding opportunities.\r\n • Manage content across various platforms, including the company website, blogs, social media, and email newsletters.\r\n 3. Digital Marketing and Lead Generation:\r\n • Execute targeted digital marketing campaigns utilizing SEO, PPC, social media advertising, and email marketing to generate leads.\r\n • Monitor and analyze campaign performance, adjusting strategies to optimize results and ROI.\r\n 4. Brand Management:\r\n • Ensure consistency in brand messaging and visual identity across all marketing materials and channels.\r\n • Enhance brand recognition and reputation within the financial services industry.\r\n 5. Partnership and Networking:\r\n • Identify and cultivate partnerships with relevant industry professionals, organizations, and influencers to expand CEG United’s reach and credibility.\r\n • Represent the company at industry events, conferences, and networking opportunities.\r\n 6. Market Research and Analysis:\r\n • Conduct market research to stay informed about industry trends, competitor activities, and client needs.\r\n • Utilize insights to inform marketing strategies and identify new opportunities for growth.\n\r\nQualifications:\r\n • Education: Bachelor’s degree in Marketing, Business Administration, Communications, or a related field.\r\n • Experience: Minimum of 3 years of experience in marketing, preferably within the financial services or credit repair industry.\r\n • Skills:\r\n • Proficiency in digital marketing tools and platforms, including SEO, PPC, social media management, and email marketing software.\r\n • Strong copywriting and content creation abilities with an emphasis on financial topics.\r\n • Experience with graphic design tools such as Canva or Adobe Creative Suite is a plus.\r\n • Excellent analytical skills with the ability to interpret data and make data-driven decisions.\r\n • Exceptional organizational and project management skills.\r\n • Ability to work independently and collaboratively in a fast-paced environment.\n\r\nBenefits:\r\n • Competitive salary with performance-based incentives.\n\r\n • Opportunities for professional development and career advancement.\r\n • Supportive and collaborative work environment.",
  "skill_requirements": [
    "Marketing",
    "Social Media Management",
    "Video Editing"
  ]
}