{
  "job_id": "1348312",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Website-Developer-1348312",
  "scraped_at": "2025-07-15T04:27:27.357474",
  "title": "Shopify Website Developer",
  "type_of_work": "Full Time",
  "salary": "2000/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About D2C Design\n\r\nD2C Design is a specialized design and optimization agency that partners with ambitious direct-to-consumer brands to drive growth through data-driven design, strategic optimization, and high-converting creative. We transform the digital presence of eCommerce brands to unlock sustainable growth and convert traffic into loyal customers.\n\r\nThe Opportunity\n\r\nWe’re looking for an experienced Web Developer with a strong full-stack background to join our team. You should have expertise in technologies such as HTML, CSS, SQL, JavaScript, Node.js, jQuery, Backbone.js (or similar frameworks), and a passion for building performant, responsive, and beautiful digital experiences.\n\r\nKey Responsibilities\r\n • Craft custom-coded online stores and modify templates.\r\n • Integrate and configure third-party applications.\r\n • Conduct thorough QA testing before launches.\r\n • Generate custom-tailored themes and alter pre-existing templates.\r\n • Apply SEO best practices to optimize websites for search visibility.\r\n • Collaborate with design teams to create seamless, robust, and innovative front-end experiences.\r\n • Work closely with project managers to address and resolve client needs.\n\r\nWork Schedule\r\n • Must be amenable to working in the Pacific Standard Time (PST) zone.\r\n • Monday – Friday | 9:00 AM – 5:00 PM (PST)\n\r\nTechnical Skills Required\r\n • Minimum 1 years of experience in full-stack web development.\r\n • Proficient in HTML5, CSS, JavaScript, and Liquid.\r\n • Familiarity with Node.js, PHP, jQuery, and/or Backbone.js.\r\n • Strong understanding of responsive web design techniques.\r\n • Deep knowledge of web development strategies and SEO implementation.\r\n • Experience with UI/UX design principles.\r\n • Integration of third-party tools and services.\r\n • Security best practices for safeguarding websites.\r\n • Clear documentation of development processes and user guides.\n\r\nSoft Skills Required\r\n • Innovative Problem Solver – Creative in finding efficient solutions.\r\n • Detail-Oriented – Strong eye for design and functionality.\r\n • Adaptive Performer – Thrives in a fast-paced, ever-changing environment.\r\n • Analytical Thinker – Able to approach tasks logically and strategically.\r\n • Collaborative Communicator – Great team player with clear, proactive communication.\r\n • Self-Driven – Takes initiative with minimal supervision.\r\n • Lifelong Learner – Always improving and staying up-to-date with industry trends.\n\r\nWhat We Offer\r\n • Competitive salary\r\n • 100% remote work\r\n • Work with exciting D2C brands\r\n • Access to cutting-edge tools and resources\r\n • Professional development opportunities\r\n • Healthcare benefit\r\n • Yearly performance bonus\n\r\nHow to Apply\n\r\nIf you’re passionate about building exceptional web experiences and want to be part of an inspiring team of designers, developers, and strategists, we’d love to hear from you.\n\r\nPlease send your resume and portfolio to:\n\r\n???? Upgrade to see actual info\r\nSubject line: “D2C Web Developer – [Your Name]”\n\r\nThank you for taking the time to apply — we look forward to welcoming you to the team!",
  "skill_requirements": [
    "Web Programming",
    "Shopify",
    "HTML"
  ],
  "is_active": true,
  "status_history": []
}