{
  "job_id": "1349687",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Manager-of-Digital-Marketing-and-Lead-Generation-1349687",
  "scraped_at": "2025-07-15T10:27:18.057490",
  "title": "Manager of Digital Marketing and Lead Generation",
  "type_of_work": "Full Time",
  "salary": "$6-$8/hr depending on skills and experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a tech-savvy, strategic thinker with a passion for digital marketing and lead generation?\r\nDo you thrive in fast-paced, remote environments where your creativity and initiative directly influence business growth? If so, we want to hear from you.\n\r\nWe’re on the lookout for a Remote Executive Marketing Assistant to support our CEO in scaling our marketing and business development efforts. This role blends creativity with strategy and offers the chance to make a tangible impact from day one.\n\r\nWhat You’ll Be Doing: \nEmail & LinkedIn Campaigns: Own the creation and management of email sequences, newsletters, and LinkedIn outreach to engage and nurture leads.\r\nCRM Management: Use HubSpot (or similar platforms) to track leads, update pipeline stages, and ensure timely follow-ups—no prospect left behind.\r\nContent Repurposing: Turn existing materials into high-impact blog posts, social content, or short-form videos that extend our reach and brand authority.\r\nMarket & Industry Research: Conduct research and synthesize insights into actionable reports to inform marketing and outreach strategies.\r\nPerformance Reporting: Track campaign results and generate weekly/monthly reports to guide data-driven decision-making.\r\nEvent Coordination: Help organize webinars, podcasts, and speaking opportunities to amplify our thought leadership presence.\n\r\nYou Might Be a Great Fit If:\r\nYou’ve managed LinkedIn outreach campaigns or are confident navigating HubSpot, Sales Navigator, or similar tools.\r\nYou’re self-motivated and organized, with a proactive mindset and strong attention to detail.\r\nYou bring experience in B2B marketing, particularly if you've supported C-level executives or small teams.\r\nYou’re a strong writer—capable of crafting compelling content across formats (emails, blogs, social posts).\r\nYou’re resourceful and love learning new tools or systems that improve efficiency.\r\nYou’ve dabbled in basic design (Canva) or video editing—a definite plus.\n\r\nCompany Benefits:\r\n$500 USD Sign-In Bonus if you apply between July 10 to September 25, 2025\r\nCompetitive compensation package\r\nOpportunity to work closely with high-level executives from various industries.\r\nProfessional growth and development.\r\nChance to contribute to the success and growth of our clients.\r\nSupportive and collaborative team environment.\r\nPaid US Federal Holidays\r\nPaid Time Off\r\nHealthcare Package\r\n1 Year Travel Bonus\r\nYear-End Bonus\n\r\nHow to Apply:\r\n1. Complete the Form: Start by filling out the form at Upgrade to see actual info.\r\n2. Video Recording: Ensure you have a professional background when recording your video.\r\n3. Be Authentic: We strongly discourage reading from a script. Instead, be genuine and let your personality shine!\r\n4. Email Confirmation: Make sure to provide a valid email address to receive our application confirmation. If you don’t see the confirmation email, double-check for any spelling errors and resubmit the form with the correct email.\r\n5. Next Steps: If your qualifications meet our criteria, our Recruitment Specialist will reach out to you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}