{
  "job_id": "1349858",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Media-Buyer-Performance-Marketing-Private-label-1349858",
  "scraped_at": "2025-07-15T15:39:50.276905",
  "title": "Media Buyer / Performance Marketing (Private label)",
  "type_of_work": "Full Time",
  "salary": "monthly salary (TBD)",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Media Buyer / Performance Marketing\n\r\nWorking Days: Monday to Friday\r\nShift Timings: EST Time zone\n\r\nJob Description:\r\nWe are seeking a highly skilled Media Buyer / Performance Marketing Specialist with a strong background in the e-commerce industry, preferably with experience working on Shopify and Amazon. The ideal candidate should have 3+ years of experience in managing and optimizing advertising campaigns across multiple platforms, particularly for cosmetics, beauty, personal care, or related product categories.\n\r\nResponsibilities:\r\n• Plan, create, and manage high-performing advertising campaigns on Google Ads, Meta Ads, TikTok Ads, and other relevant platforms.\r\n• Develop and implement data-driven strategies to optimize ad performance and achieve target KPIs.\r\n• Conduct in-depth audience research and market analysis to refine targeting and maximize ROI.\r\n• Monitor, analyze, and report on campaign performance, providing insights and actionable recommendations for continuous improvement.\r\n• Collaborate closely with the marketing and e-commerce teams to align advertising efforts with overall business objectives.\r\n• Stay up-to-date with industry trends, platform updates, and emerging advertising opportunities.\n\r\nRequirements:\r\n• At least 3+ years of experience in media buying or performance marketing, specifically within the e-commerce industry (Shopify & Amazon experience preferred).\r\n• Proven experience in running successful ad campaigns for cosmetics, beauty, personal care, or similar product categories.\r\n• Strong expertise in Google Ads, Meta Ads, TikTok Ads, and other digital advertising platforms.\r\n• Experience with Google Analytics and data-driven decision-making to optimize campaigns.\r\n• Strong analytical and problem-solving skills, with the ability to interpret data and adjust strategies accordingly.\r\n• Excellent communication and collaboration skills.\r\n• Experience with other digital marketing channels is a plus.",
  "skill_requirements": [
    "Performance Marketing",
    "E-Commerce",
    "Media Buying"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:37:03.833227",
      "reason": "Job first discovered"
    }
  ]
}