{
  "job_id": "1349747",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Long-Form-Video-Editor-1349747",
  "scraped_at": "2025-07-15T15:38:30.019647",
  "title": "Long-Form Video Editor",
  "type_of_work": "Gig",
  "salary": "$5-10 per video",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us\r\nReshape Digital Solutions is a fast-growing digital media company specializing in high-quality video content that educates, informs, and engages a global audience. We are seeking a talented Long-Form Video Editor to join our creative team and help produce compelling, polished videos. This role requires technical adaptability, problem-solving skills, and the ability to meet strict deadlines while maintaining exceptional quality.\n\r\nJob Description\r\nAre you a skilled video editor with a passion for storytelling? Can you transform raw footage into engaging, high-quality long-form content for platforms like YouTube, podcasts, and webinars? Do you thrive in a fast-paced environment and take pride in working independently? If so, we’d love to have you on our team!\n\r\nResponsibilities\r\n- Edit long-form videos, including YouTube content, webinars, interviews, and educational videos.\r\n- Structure content for clarity, pacing, and audience engagement.\r\n- Enhance videos with music, transitions, graphics, and special effects.\r\n- Collaborate with content creators to ensure brand consistency and storytelling alignment.\r\n- Stay updated on video editing trends and best practices for long-form content.\r\n- Adhere to strict deadlines (non-negotiable):\r\n          First cut due: 8:00 AM EST\r\n          Revisions due: 11:00 AM EST\r\n(Monday–Friday availability is mandatory; weekend work is optional for bonuses.)\n\r\nRequirements\r\n- Proven experience as a long-form video editor with a strong portfolio.\r\n- Proficiency in Adobe Premiere Pro, Final Cut Pro, or similar editing software.\r\n- Strong storytelling skills and a keen eye for pacing, structure, and audience retention.\r\n- Understanding of social media and YouTube video trends.\r\n- Tech-savvy and adaptable:\r\n         - Ability to learn new systems independently with minimal training.\r\n- Must be comfortable with self-learning through Loom videos.\r\n- Experience with Airtable is a plus, but familiarity with Kanban boards and workflow systems is required.\r\n- Strong communication and collaboration skills.\r\n- Self-motivated and capable of working independently in a remote setting.\r\n- Ability to meet tight deadlines and adapt quickly to feedback.\r\n- Knowledge of the American real estate market is a plus but not required.\n\r\nWhat We Offer\r\n- Competitive pay based on experience.\r\n- Growth opportunities in editing, management, and brand development.\r\n- A collaborative and creative work environment.\r\n- The opportunity to create content that reaches and impacts a global audience.\r\n- Flexible remote work.\n\r\nHow to Apply\r\nIf you’re excited to create engaging long-form videos and be part of our team, send your resume and portfolio link to Upgrade to see actual info a brief cover letter explaining why you’re the perfect fit for this role and use this as a subject line: Applying for Long-Form Video Editor.\n\r\nNote: Only shortlisted candidates will be contacted for interviews.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Video Content Creation",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:31:36.694608",
      "reason": "Job first discovered"
    }
  ]
}