{
  "job_id": "1351505",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Klaviyo-Email-Strategist-and-Copywriter-1351505",
  "scraped_at": "2025-07-15T12:36:47.156559",
  "title": "Klaviyo Email Strategist and Copywriter",
  "type_of_work": "Full Time",
  "salary": "$1,500-$2,000 USD/Month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "!!In order to be considered for the position, please submit a one minute introduction video with application!!\n\r\nShopanova Email Marketing Strategist Job Description\r\nWe are seeking a highly skilled and strategic Email Strategist to join our team. As the Email\r\nStrategist, you will report directly to the Email Team Lead and collaborate closely with them to\r\ndevelop and implement effective email marketing strategies. Your role will be crucial in driving\r\nour clients’ customer engagement, retention, and revenue growth through email campaigns.\r\nYou will be responsible for auditing prospective accounts, analyzing data, optimizing campaign\r\nperformance, and ensuring the successful execution of email initiatives. This position requires a\r\ndeep understanding of email marketing best practices, strong analytical abilities, and the ability\r\nto think strategically.\r\nRole Overview:\r\n? Collaborate with the Email Team Lead to develop and execute email marketing\r\nstrategies aligned with client objectives and industry best practices.\r\n? Conduct thorough analysis of audience segmentation and targeting to identify valuable\r\nopportunities for campaign optimization and personalization.\r\n? Write strong and persuasive sales copy and ensure proper messaging is met in email\r\ncampaigns.\r\n? Work closely with the creative team to ensure effective design.\r\n? Utilize email marketing platforms and tools to manage subscriber lists, segmentations,\r\nA/B testing, and performance tracking.\r\n? Monitor email campaign performance, analyze data, and make data-driven decisions to\r\noptimize campaign performance, improve open rates, click-through rates, conversion\r\nrates, and overall engagement.\r\n? Stay up-to-date with industry trends, email marketing best practices, and emerging\r\ntechnologies to drive innovation and stay ahead of the competition.\r\n? Collaborate with cross-functional teams, including Brand Strategists, to ensure cohesive\r\nmessaging, branding, and alignment across all email efforts.\r\n? Provide regular reports on email campaign performance to the Email Team Lead,\r\noffering insights, recommendations, and actionable next steps.\r\n? Continuously identify opportunities for improvement and implement strategies to\r\nenhance the effectiveness of email marketing initiatives.\r\n? Assist in training and mentoring teaUpgrade to see actual infombers, sharing best practices, and providing\r\nguidance on email marketing strategies.\r\nRequirements:\r\n? Proven experience in marketing, communications, or a related field.\r\n? Proven track record of managing and optimizing successful email marketing campaigns.\r\n? Strong knowledge of email marketing platforms and tools, such as Klaviyo, Mailchimp,\r\nAttentive, or similar.\r\n? Proficient in utilizing segmentation and personalization strategies to drive customer\r\nengagement and conversion.\r\nDocuSign Envelope ID: 9F46834F-7D4A-451D-B6FUpgrade to see actual infoCA70468\n\r\n? Solid understanding of e-commerce marketing principles and customer lifecycle\r\nstrategies.\r\n? Excellent analytical and problem-solving skills, with the ability to interpret data and draw\r\nactionable insights.\r\n? Detail-oriented and highly organized, with the ability to manage multiple campaigns\r\nsimultaneously.\r\n? Strong communication and presentation skills, with the ability to effectively convey\r\ncomplex concepts.\r\n? Self-motivated and results-driven, with a passion for staying ahead of industry trends\r\nand driving continuous improvement in email marketing strategies.\r\n? Ability to work collaboratively in a team environment and adapt to evolving priorities.\r\n? Experience in an agency or e-commerce environment is a plus.\r\nAs the Email Strategist, you will play a pivotal role in developing and executing email marketing\r\nstrategies that drive impactful results. Your expertise and strategic thinking will contribute to the\r\noverall success of our clients’ email marketing initiatives, enhancing customer engagement,\r\nretention, and revenue growth.",
  "skill_requirements": [
    "Email Marketing",
    "Copywriting",
    "Klaviyo"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:29:09.751210",
      "reason": "Job first discovered"
    }
  ]
}