{
  "job_id": "1353811",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-KDP-Ads-VA-Wanted-300month-Long-Term-Work-from-Home-1353811",
  "scraped_at": "2025-07-14T23:10:04.605628",
  "title": "Amazon KDP Ads VA Wanted – $300/month – Long-Term Work from Home",
  "type_of_work": "Part Time",
  "salary": "$300/Month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hi there! \n\r\nI’m looking for a virtual assistant from the Philippines who’s skilled at running Amazon Advertising (PPC) for books published on the Kindle Direct Publishing (KDP) platform.\n\r\nI currently have around 30 books and need help managing ads across the US, UK, Canada, and Australia. The goal is simple: increase monthly profit by running smart, targeted ads—not random guessing.\n\r\nThis is a part-time, long-term role with potential to grow if results are strong.\n\n\r\n What I’m Looking For:\r\n- Experience running Amazon Ads for KDP books  \r\n- Ability to show proof of results or past campaigns  \r\n- A performance-focused mindset (profit over volume)  \r\n- Someone who can work independently, make suggestions, and improve campaigns  \r\n- Great communication and reliable internet  \r\n- Bonus: Familiarity with tools like Publisher Rocket, Helium 10, etc.\n\r\nWhat You’ll Do:\r\n- Launch and manage Amazon ads (mostly **Sponsored Products**)  \r\n- Focus on **high-performing campaigns only**  \r\n- Monitor and optimize ads for profit  \r\n- Adjust bids, pause poor performers, and scale winning campaigns  \r\n- Provide **weekly updates** with ideas and results\n\r\nPay & Details:\r\n- $300/month to start, with potential raises if performance is strong  \r\n- Paid via Wise  \r\n- Flexible working hours – results and consistency matter more than a schedule  \r\n- 100% remote  \r\n- Long-term role with room to grow\n\r\nHow to Apply:\n\r\nPlease answer these questions when you apply (copy/paste and fill in your answers) or send me a video.\n\r\n1. How long have you been running Amazon Ads for KDP books?\r\n2. What’s your general strategy when launching ads for a new book?\r\n3. Can you describe a time you improved ad performance or turned a poor ad profitable?\r\n4. What tools or software do you use to run or optimize Amazon ads?\r\n5. Are you currently working with other clients? If yes, how many?\r\n6. How many hours per week are you available?\r\n7. Can you share a screenshot or report from a past KDP ads campaign you managed?\n\r\nBonus tip: Let me know if you’ve worked with kids’ books or nonfiction books before. Not required—just helpful to know.\n\r\nLooking forward to hearing from you and hopefully working together! ????",
  "skill_requirements": [
    "Amazon Ads",
    "Kindle Direct Publishing (KDP)",
    "Advertising Management"
  ]
}