{
  "job_id": "1356108",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Web-Developer-1356108",
  "scraped_at": "2025-07-15T14:41:51.064313",
  "title": "Senior Web Developer",
  "type_of_work": "Part Time",
  "salary": "Negotiable",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Position Overview:\r\nWe are seeking a highly experienced Senior Web Developer to join our team on a gig/part-time basis. As a Senior Web Developer, you will lead the development, customization, and optimization of websites, ensuring high performance, functionality, and seamless user experience. Experience with WordPress is a must, Bricks Builder or Webflow is a strong advantage.\n\r\nCompany:\r\nWe are a forward-thinking digital marketing and web solutions agency, primarily serving North American clients. Our team thrives on delivering cutting-edge web development solutions that align with our clients’ needs while keeping up with the latest design and functionality trends.\n\r\nResponsibilities:\r\n- Design, develop, and manage custom websites tailored to client specifications using WordPress Elementor Pro.\r\n- Customize themes, plugins, and third-party integrations to enhance website functionality, including E-commerce.\r\n- Ensure mobile-first, responsive designs with an emphasis on speed optimization and SEO-friendly development.\r\n- Utilize Bricks Builder or Webflow for website creation where necessary, and customize user interfaces for optimal client satisfaction.\r\n- Collaborate closely with designers, marketers, and other stakeholders to deliver cohesive and visually engaging websites.\r\n- Conduct regular website maintenance, updates, and performance optimizations.\r\n- Debug and troubleshoot issues related to website functionality, hosting, and plugins.\r\n- Stay up-to-date with the latest web development technologies, especially related to WordPress.\r\n- Manage client communication, providing progress updates, technical advice, and recommendations.\n\r\nRequirements:\r\n- Proven experience as a Senior Web Developer, with a strong portfolio of completed projects.\r\n- Proficiency in WordPress, HTML, CSS, JavaScript, PHP, and MySQL, with the ability to build and customize themes and plugins for WordPress.\r\n- Strong understanding of mobile-first design.\r\n- Understanding of SEO best practices, responsive design, and web performance optimization.\r\n- Excellent communication skills in English, both written and verbal.\r\n- Ability to work independently and remotely with minimal supervision.\r\n- Experience working with North American clients is a plus.\n\r\nLocation:\r\nRemote position open to candidates based in the Philippines.\n\r\nSchedule:\r\nGig or Part-time. Flexible hours depending on project requirements and deadlines.\n\r\nBenefits:\r\n- Competitive compensation based on experience and project scope.\r\n- Opportunity to work on diverse web development projects across various industries.\r\n- Professional growth and development in web development and related technologies.\r\n- Flexible work schedule and remote working environment.\n\r\nHow to Apply:\r\nInterested candidates are invited to send a message with their resume and portfolio showcasing relevant web development projects.",
  "skill_requirements": [
    "Ecommerce",
    "Wordpress",
    "Website Builder"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:37:46.365624",
      "reason": "Job first discovered"
    }
  ]
}