{
  "job_id": "1356809",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Administrative-Assistant-Scheduler-Caller-Social-Media-Manager-1356809",
  "scraped_at": "2025-07-15T15:27:58.404485",
  "title": "Administrative Assistant/ Scheduler/ Caller/ Social Media Manager",
  "type_of_work": "Any",
  "salary": "$3-5/hr",
  "hours_per_week": "30",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Administrative Assistant for Real Estate Company\n\r\nLocation: Remote Job Type: Full-Time\n\r\nAbout Us: We are a dynamic real estate company dedicated to providing exceptional service to our clients. We are seeking a highly organized and proactive Administrative Assistant to join our team and support our operations.\n\r\nResponsibilities:\n\r\nPerform administrative tasks, including managing schedules, preparing documents, and organizing files.\n\r\nCall leads and maintain effective communication with clients.\n\r\nManage and grow our social media presence across various platforms.\n\r\nCreate engaging content and campaigns to enhance brand visibility.\n\r\nUtilize Microsoft Word and Excel for documentation and reporting.\n\r\nCollaborate with the team to ensure smooth day-to-day operations.\n\r\nEnsure proficiency in DocuSign for electronic document handling and transactions.\n\r\nEffectively utilize CRM systems to manage customer relationships and leads.\n\r\nRequirements:\n\r\nProven experience in social media management and content creation.\n\r\nProficiency in Microsoft Word, Excel, DocuSign, and CRM systems.\n\r\nStrong organizational skills and attention to detail.\n\r\nExcellent communication skills, both written and verbal.\n\r\nAbility to multitask and work independently.\n\r\nPrevious experience in administrative roles is a plus.\n\r\nApplication Process: To apply, please submit the following:\n\r\nYour resume.\n\r\nA DISC assessment report.\n\r\nExamples of previous social media projects.\n\r\nA video introduction highlighting your skills and experience.\n\r\nHow to Apply: Send your application to Upgrade to see actual info with the subject line \"Administrative Assistant Application - [Your Name].\"",
  "skill_requirements": [
    "Social Media Content Creation",
    "Administrative Management",
    "Organization"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:31:06.894156",
      "reason": "Job first discovered"
    }
  ]
}