{
  "job_id": "1356094",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-PPC-Manager-Private-Label-1356094",
  "scraped_at": "2025-07-15T15:37:25.728331",
  "title": "Amazon PPC Manager (Private Label)",
  "type_of_work": "Full Time",
  "salary": "monthly basis - $1,000+ (TBD)",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Amazon PPC Manager\n\r\nWorking Days: Monday to Friday\r\nShift Timings: EST Time zone\n\r\nROLE\r\nWe are looking for a skilled and driven PPC Manager with proven experience in the e-commerce industry, specifically working with the private label model. The PPC Manager is responsible for overseeing the brand's Amazon PPC performance. You will co-create PPC strategies with the brand owner by understanding overall business goals and aligning advertising efforts accordingly.\n\r\nFrom launch to scale phases, you will be expected to build, optimize, and manage advertising campaigns, support new product launches, and consistently contribute insights to the broader brand management and product development teams.\n\r\nRESPONSIBILITIES\r\n1. Strategy:\r\n• Document and publish the PPC strategy for internal use.\r\n• Define PPC goals that align with both company-wide objectives and individual product targets.\r\n• Convert brand goals into actionable PPC strategies.\r\n• Identify external factors needed for PPC success (e.g., improved product images, review velocity).\r\n• Update strategies regularly—yearly, quarterly, monthly, weekly—to meet evolving goals.\r\n• Implement processes, workflows, and tools needed to execute strategies.\r\n• Attend leadership meetings to realign on priorities and report on PPC performance.\n\r\n2. Management:\r\n• Develop an organized and effective campaign structure.\r\n• Set and manage bids across ad types.\r\n• Validate keyword research generated by the Product Development team.\r\n• Test placements and monitor performance.\r\n• Oversee Sponsored Products, Brands, Display campaigns, and explore new ad types like Video Ads.\r\n• Feed PPC performance data back into the company to support decision-making.\r\n• Maintain and update internal PPC SOPs.\r\n• Execute PPC campaigns for new product launches.\n\r\n3. Launch:\r\n• Collaborate with Product Development to prepare for launches.\r\n• Work with the SKU Optimization team to re-launch and fine-tune product positioning.\n\r\nRESULTS EXPECTED\r\n• PPC targets are aligned with company goals.\r\n• Accurate measurement of PPC metrics.\r\n• Ongoing optimization of campaign variables (bids, budgets, TOS bid adjusters).\r\n• Launches rank new products within budget.\r\n• Keyword graduation and negative matching are handled efficiently.\r\n• Campaign structure and naming conventions are consistently followed.\r\n• Ad spend is strategically allocated, minimizing waste.\n\r\nREQUIREMENTS\r\n• Proven experience in the e-commerce industry, ideally in a private label Amazon business model.\r\n• Must have experience working in different Amazon marketplaces like US/CA/MX/UK/EU/AU/NZ/Middle East/South East Asia (any of these).\r\n• Deep understanding of Amazon’s advertising ecosystem.\r\n• Hands-on experience managing Sponsored Products, Brands, and Display Ads.\r\n• Strong analytical and data interpretation skills.\r\n• Strategic mindset with the ability to translate business goals into PPC action plans.\r\n• Familiarity with launch strategies and performance tracking tools.\r\n• Experience creating and maintaining SOPs.\r\n• Detail-oriented and highly organized.",
  "skill_requirements": [
    "PPC",
    "Amazon",
    "Amazon PPC"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:35:58.616713",
      "reason": "Job first discovered"
    }
  ]
}