{
  "job_id": "1358512",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Technical-Operations-Specialist-1358512",
  "scraped_at": "2025-07-14T23:08:30.499880",
  "title": "Technical Operations Specialist",
  "type_of_work": "Full Time",
  "salary": "$800",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for a Technical Operations Specialist to play a critical role in optimizing and managing the technical backbone of our agency and client projects.\n\r\nRole Overview:\r\nAs a Technical Operations Specialist, you’ll be responsible for building and maintaining workflows, systems, and automations that improve operational efficiency. You’ll work closely with the team to tackle technical challenges, process data, and create solutions that enhance both internal and client-facing operations.\n\r\nKey Responsibilities:\n\r\n- Automation Builds: Design, implement, and troubleshoot automations using tools like Zapier, Upgrade to see actual info, Noloco, and other relevant platforms.\r\n- Workflow Optimization: Map, document, and improve internal and client workflows using diagramming tools like Figma.\r\n- System Integration: Identify and connect tools and platforms to streamline operations and create seamless workflows.\r\n- Support Client Work: Assist with technical implementation for client projects, including reporting, dashboard creation, and CRM updates.\r\n- Troubleshooting: Quickly identify and resolve technical issues with workflows, integrations, or processes.\n\r\nKey Skills we need:\r\n- Experience with automation tools (Upgrade to see actual info)\r\n- Experience with no-code builders (Noloco)\r\n- Ability to create and understand visual workflows and process diagrams\r\n- Familiarity with CRMs and project management tools\r\n- Problem-solving skills and attention to detail\r\n- Strong communication skills in a team-based setting\r\n- Experience working with service based businesses\r\n- Willingness to learn\n\r\nIf this role sounds like a great fit, we’d love to hear from you! Send us a message that starts with Fluxomate to let us know why you think you are a good fit!",
  "skill_requirements": [
    "Attention to Detail",
    "Problem Solving",
    "Make.com"
  ]
}