{
  "job_id": "1358669",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-to-Chief-Acquisition-Officer-Private-Equity-MA-Focus-1358669",
  "scraped_at": "2025-07-15T12:30:24.729445",
  "title": "Executive Assistant to Chief Acquisition Officer (Private Equity / M&A Focus)",
  "type_of_work": "Part Time",
  "salary": "400-800",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Description:\r\nWe’re hiring a high-performance Executive Assistant to support the Chief Acquisition Officer (CAO) at Patriot Growth Capital, a private equity firm focused on acquiring and growing exceptional small businesses.\n\r\nThis is not your typical VA role. We’re looking for someone with a strong finance, private equity, or startup background who can move fast, think critically, and add value from day one. If you’re someone who thrives in a fast-paced, high-autonomy environment and knows how to stay five steps ahead, we want to hear from you.\n\r\nResponsibilities:\r\n- Research potential acquisition targets and summarize findings\r\n- Prepare financial models and deal briefs for the CAO\r\n- Manage and respond to emails on behalf of the CAO\r\n- Book meetings and manage calendar logistics\r\n- Track acquisition pipeline in our CRM (e.g., HubSpot or Pipedrive)\r\n- Maintain CRM data, notes, and reporting\r\n- Support due diligence with organized documents and data\n\r\nRequirements:\r\n- 2+ years of experience in finance, private equity, M&A, or startups\r\n- Strong skills in Excel/Google Sheets\r\n- Familiarity with CRMs like HubSpot or Pipedrive\r\n- Excellent written and spoken English\r\n- Strong organizational skills and attention to detail\r\n- Available for at least 3 hours overlap between 9 AM–3 PM CST (U.S. Central Time)\r\n- Comfortable using Slack for daily check-ins\n\r\nNice to Have:\r\n- Experience supporting executives or founders\r\n- Background in deal sourcing or investment analysis\r\n- Passion for small business and entrepreneurship\n\r\nHow to Apply:\r\nWhen you apply, please answer these two questions:\n\r\n- Using bullet points, summarize a company you think would be a great acquisition target for a private equity firm. Include the name, industry, annual revenue (est.), and why you think it’s a fit.\n\r\n- Share a screenshot or description of a financial model or deal tracker you’ve built or worked on. What was its purpose and how did you use it?",
  "skill_requirements": [
    "Project Management",
    "Microsoft Excel",
    "Financial Analysis"
  ],
  "is_active": true,
  "status_history": []
}