{
  "job_id": "1359073",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Graphic-Designer-for-E-Commerce-Brand-Static-Ads-Product-Images-1359073",
  "scraped_at": "2025-07-15T12:23:00.965747",
  "title": "Graphic Designer for E-Commerce Brand (Static Ads & Product Images)",
  "type_of_work": "Any",
  "salary": "450",
  "hours_per_week": "45",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re hiring a full-time Graphic Designer to join our e-commerce brand as a dedicated teaUpgrade to see actual infomber — not a freelancer, contractor, or agency. You’ll be working directly with our internal team to create compelling static ads and product images that drive results. We run multiple offers and brands/stores, so you will have variation in your work.\n\r\nWe’ll provide you with ad libraries, swipe files, examples, and templates to help guide your work — but you must already know how to create high-performing static ads. This means being able to take inspiration from competitors and apply those styles to our own products effectively. We’re not here to hand-hold — we need someone who can take initiative and execute confidently.\n\n\r\nWhat You’ll Be Doing:\n\r\nDesigning scroll-stopping static ads for platforms like Facebook, Instagram, etc.\n\r\nCreating product page images that are clean, professional, and conversion-focused (e.g: lifestyle mockups with AI-generated backgrounds, etc.)\n\r\nUsing AI tools and design software to speed up and enhance your workflow\n\r\nMaintaining a consistent visual style across creatives\n\r\nTaking references and examples we provide and producing quality output independently\n\r\nCommunicating clearly and being available during working hours\n\n\r\nRequirements:\n\r\nStrong portfolio with e-commerce product images and static ad creatives\n\r\nAbility to replicate styles seen in winning competitor ads\n\r\nProficient in design tools like Photoshop, Canva, Figma, or similar\n\r\nComfortable using AI tools (e.g., Midjourney, ChatGPT, Grok etc.)\n\r\nCan work fast and independently without constant revisions or direction\n\r\nHigh attention to detail, clean layout skills, and an understanding of what looks good on product pages\n\r\nMust be available during working hours and fully dedicated to our team (we don't want agencies, we don't want to be clients — this is an employee role)",
  "skill_requirements": [
    "Graphic Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:17:13.918235",
      "reason": "Job first discovered"
    }
  ]
}