{
  "job_id": "1360691",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Looking-for-a-content-manager-with-SEO-experience-1360691",
  "scraped_at": "2025-07-15T13:48:07.041431",
  "title": "Looking for a content manager with SEO experience",
  "type_of_work": "Full Time",
  "salary": "$6 USD an Hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for an organized, hardworking, and reliable SEO Content Manager to help us manage our online businesses. You'll be involved in a wide variety of tasks that we could use help with, such as:\n\r\nKeyword Research and Analysis: Carry out extensive keyword research to pinpoint high-performing keywords and phrases relevant to our industry. Examine competitor keywords and strategies to find areas for improvement. Establish and maintain a keyword strategy to drive targeted organic traffic.\n\r\nOn-Page SEO Optimization: Perform a range of tasks designed to enhance online visibility and user engagement to assist with article publishing and optimization. This includes formatting headers to improve readability, crafting SEO-friendly titles to boost search engine rankings, configuring URLs for easier access and better indexing, implementing internal linking to enhance site navigation and increase page views, and selecting and positioning images to make the content more visually appealing and engaging for readers.\n\r\nOff-Page SEO Strategies: Create and carry out off-page SEO tactics, including link-building initiatives, guest blogging, and social media outreach, to boost online visibility. Continuously monitor and assess the backlink profile to guarantee its quality and relevance.\n\r\nContent Strategy and Optimization: Work together with content creators to produce SEO-optimized content that complements the overall marketing strategy. Help identify potential improvements on existing content for better search engine performance and identify other areas for content enhancement. Stay abreast of industry developments and integrate new content strategies when necessary.\n\r\nTechnical SEO: Conduct regular website analysis and audit to identify and resolve technical SEO issues, such as crawl errors, broken links, and site speed issues. Work closely with the web development team to ensure SEO best practices are implemented in website design and development.\n\r\nMentoring and Management: Coordinate with multiple departments and senior management to deliver top-quality content to publish on our websites (yes, plural). Mentor our less experienced SEO specialists on their specific tasks, such as on-page and link-building tactics and strategies. Collaborate with other team leads (Editorial, Graphics, etc.) to improve processes and workflows and implement other solutions.\n\n\r\nSkills/Experience Required:\n\r\n- Excellent English Writing Skills - This is a must\r\n- Great Computer Skills (a fast computer is a plus)\r\n- Expertise with Excel and Google Docs\r\n- At least three years of SEO or Copywriting experience\r\n- Solid Analytical fundamentals\r\n- Knowledge of Keyword research\r\n- Strong understanding of search algorithms and ranking strategies.\r\n- Experience with Google Analytics, Google Search Console, and other SEO tools.\r\n- Fast and reliable internet\r\n- Professional patience and understanding\r\n- HTML knowledge and experience is a plus\r\n- A lot of patience, resilience, problem-solving skills, and attention to detail\n\r\nWe are looking for someone who can commit to a full-time permanent position. \r\nPLEASE DO NOT APPLY IF YOU ARE NOT ABLE TO WORK FOR 40 HOURS A WEEK.\n\r\nONLY INDEPENDENT FREELANCERS ARE REQUIRED. IF YOU ARE FROM AN AGENCY, PLEASE SKIP THIS POSTING.\n\r\nKnowledge and interest in the health and wellness industry is a plus!\n\r\nHow To Apply:\n\r\nBegin your application by drafting a unique message and organically inserting the keyword \"I love coffee\" in your cover/introduction message and your CV/resume to confirm you took the time to read this entire job posting.\n\r\nPlease follow the instructions carefully.\n\r\nAnswer the three questions below:\r\n1. Can you please tell us more about your previous working experience relevant to this job requirement?\r\n2. Which of the required job skills do you feel you are strongest in and why?\r\n3. Besides meeting the skills we mentioned in the job posting, what other skills do you think would be an asset to us? Please be specific. Ex. Photoshop, Proofreading, Writing, Link Building, Social Media Management, etc.\n\r\nWe have a rigorous hiring process. Apply only if you are not willing to take multiple tests and interviews. I'm looking forward to working with you!\n\r\nThanks",
  "skill_requirements": [
    "Copywriting",
    "Article Writing",
    "SEO Analysis"
  ],
  "is_active": true,
  "status_history": []
}