{
  "job_id": "1362795",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Manager-Team-Lead-1362795",
  "scraped_at": "2025-07-15T15:43:59.178529",
  "title": "Marketing Manager (Team Lead)",
  "type_of_work": "Full Time",
  "salary": "$1500-2500AUD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Onsite Training Australia is on a mission to empower 25,000 students annually by 2030—and we need a strategic Marketing Manager to lead the charge.\n\r\nWe’re looking for a proven team leader to take ownership of our Marketing Plan, Projects, and Paid Campaigns across social, search, and automation.\n\r\n???? You MUST bring:\r\nHands-on Paid Social Media expertise (Meta, Google, LinkedIn).\n\r\nExperience leading and delivering end-to-end marketing campaigns.\n\r\nConfidence managing multiple projects with precision and ROI focus.\n\r\nStrong leadership—this role is for doers who can lead teams, not just freelancers.\n\r\n???? You’ll be responsible for:\r\nOwning and executing the marketing strategy.\n\r\nManaging paid ad funnels, automation, and campaign reporting.\n\r\nLeading content, creatives, external vendors, and project timelines.\n\r\nReporting to the CEO and helping shape national visibility.\n\r\n???? Not for you if:\r\nYou’ve never led a team or delivered ROI in a paid campaign environment.\r\nYou dont linke writing procedures or systems\r\nYou dont want to Work Australia hours 8:30am Start (AEST)\n\r\n***To Be considerred for this role a 2 Minute Video of what you wil bring to the role must be included in the Application***\r\n***Applications without this will not be considered***\n\r\nThis is your opportunity to shape the national footprint of a high-performing education brand.\r\nApply now and lead with strategy.",
  "skill_requirements": [
    "Social Media Management",
    "Marketing Management",
    "Project Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:30:31.906111",
      "reason": "Job first discovered"
    }
  ]
}