{
  "job_id": "1365808",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Reel-Editor-3hr-1365808",
  "scraped_at": "2025-07-15T15:40:21.611915",
  "title": "Reel Editor - $3/hr",
  "type_of_work": "Any",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We're looking for a creative and detail-oriented Video Editor to help us turn raw footage into engaging short-form video content for Instagram Reels, TikTok, and YouTube Shorts. You’ll work closely with our content production team to repurpose podcast clips, behind-the-scenes Upgrade to see actual infonts, and business tips into high-performing social media videos.\n\r\nQualifications:\r\n-Strong experience editing short-form content (Reels, Shorts, TikToks)\r\n-Proficiency in software such as CapCut, Adobe Premiere Pro, or Final Cut Pro\r\n-Experience with auto-caption tools (e.g., Captions App, Upgrade to see actual info, CapCut)\r\n-Creative eye for storytelling and pacing\r\n-Good communication skills and reliability\r\n-Strong organizational habits for naming files and working in shared drives\r\n-Bonus: basic design skills (Canva, Photoshop) or interest in AI tools\n\r\nResponsibilities:\r\n-Edit short-form vertical videos (15–90 seconds) using raw footage provided\r\n-Add subtitles, emojis, animations, jump cuts, zooms, and engaging sound effects\r\n-Follow our brand guidelines and editing style templates\r\n-Source background music (royalty-free) when needed\r\n-Upload final videos to shared folders with proper naming conventions\r\n-Collaborate with our team via ClickUp or Notion on task updates and feedback\r\n-Meet 24–72h turnaround times per batch depending on deadlines\r\n-Stay updated with social media trends, Upgrade to see actual info culture, and audio trends",
  "skill_requirements": [
    "Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:35:41.412609",
      "reason": "Job first discovered"
    }
  ]
}