{
  "job_id": "1366928",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1366928",
  "scraped_at": "2025-07-14T23:07:25.789644",
  "title": "Sales Development Specialist",
  "type_of_work": "Full Time",
  "salary": "Starts at $7/hr",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you confident on the phone, naturally organized, and energized by conversations that lead to real opportunities?\r\nIf you're nodding, you might be exactly who we're looking for.\n\r\nWe’re hiring a Sales Development Specialist to help a fast-growing energy brokerage firm connect with more businesses looking for cost-effective commercial electricity contracts. Your role? Own the early stages of the sales process—outbound calling, lead qualification, appointment setting—so the principal broker can focus on closing deals.\n\r\nIf you're someone who enjoys making meaningful connections, staying sharp with details, and knows how to keep conversations moving, this is your chance to make a measurable impact.\n\r\nWhat You’ll Be Doing:\r\nMaking outbound calls to warm/cold leads using vetted lists and databases.\r\nStarting genuine conversations that qualify prospects and build rapport.\r\nSetting appointments and making smooth handoffs to the principal broker.\r\nKeeping records clean and organized in CRMs like Zoho, HubSpot, or Propstream.\r\nFollowing up with leads via phone and email to keep Upgrade to see actual infontum strong.\r\nRe-engaging old/dormant leads and assisting with list management.\r\nOccasionally helping with light admin tasks tied to sales development.\n\r\nYou’ll Thrive in This Role If You:\r\nAre a confident communicator who knows how to build trust quickly over the phone.\r\nHave experience in outbound sales, appointment setting, or SDR roles.\r\nKnow your way around CRM tools and can keep lead data tidy and actionable.\r\nAre comfortable with cold/warm calling and handling basic objections.\r\nStay organized and proactive, managing follow-ups and keeping pipelines moving.\r\nTake pride in being reliable, professional, and a strong first impression for the company.\r\nAre tech-comfortable—you’re fine navigating calling tools, emails, and CRMs.\n\r\nWhat We’re Looking For:\r\nAt least 2 years of experience in sales development or outbound calling roles.\r\nStrong English communication skills, both spoken and written.\r\nConfident in phone outreach, with consistent follow-through.\r\nFamiliar with CRMs like Zoho, HubSpot, Propstream, or similar tools.\r\nA team player who’s coachable, self-motivated, and ready to contribute.\n\r\nCompany Benefits:\r\n$500 USD Sign-In Bonus if you apply between July 10 to September 25, 2025\r\nCompetitive compensation package\r\nOpportunity to work closely with high-level executives from various industries.\r\nProfessional growth and development.\r\nChance to contribute to the success and growth of our clients.\r\nSupportive and collaborative team environment.\r\nPaid US Federal Holidays\r\nPaid Time Off\r\nHealthcare Package\r\n1 Year Travel Bonus\r\nYear-End Bonus\n\r\nHow to Apply:\r\n1. Complete the Form: Start by filling out the form at Upgrade to see actual info.\r\n2. Video Recording: Ensure you have a professional background when recording your video.\r\n3. Be Authentic: We strongly discourage reading from a script. Instead, be genuine and let your personality shine!\r\n4. Email Confirmation: Make sure to provide a valid email address to receive our application confirmation. If you don’t see the confirmation email, double-check for any spelling errors and resubmit the form with the correct email.\r\n5. Next Steps: If your qualifications meet our criteria, our Recruitment Specialist will reach out to you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}