{
  "job_id": "1367593",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Technical-Support-Specialist-Shopify-App-1367593",
  "scraped_at": "2025-07-15T04:27:04.780775",
  "title": "Technical Support Specialist - Shopify App",
  "type_of_work": "Full Time",
  "salary": "$5 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "**PLEASE DO NOT APPLY FOR THIS POSITION IF YOU DO NOT HAVE PREVIOUS WORK EXPERIENCE SUPPORTING SAAS OR ECOMMERCE PLATFORMS**\n\n\r\nThe company is the leading Shopify exclusive reviews & referrals app that helps over 100,000 merchants boost their social proof, increase conversions, build out referrals, and generate beautiful photo and video UGC.\n\r\nAbout the Position:\r\nThis job will be essentially built “by you”, and by the content, you’ll bring to it. However, here is a wide description of the responsibilities this role entails:\n\r\n• Providing high-quality and timely technical assistance for our customers worldwide.\r\n• Assist customers with support cases through email, phone, and live chat.\r\n• Work with our Enterprise CSM team and alongside our R&D and Advance Support to identify and troubleshoot complex technical issues.\r\n• Analyze merchants’ behavior, content suitability, and relevance to determine their effect on user satisfaction.\r\n• Quickly identify issues and provide solutions.\r\n• Develop and maintain positive customer relations and satisfaction.\r\n• Influence the way we support our merchants and improve it to make sure their experience is the best possible.\n\r\nRequirements:\r\n• Excellent English communication skills: verbal, written, and reading is a MUST\r\n• Experience with the Shopify environment is a MUST\r\n• Over 2 years in technical support\r\n• High level of customer service\r\n• Experience with HTML and CSS\r\n• Great interpersonal and accommodation skills\n\r\nWork Schedule:\r\n• This is a full-time job in a permanent work-from-home setup. The team is covering 24/7 support – 5 days a week, 8 hours per shift.\n\n\r\nTO APPLY FOR THIS POSITION, FOLLOW THE INSTRUCTIONS BELOW:\r\n1. Include the phrase \"SHOPIFY\" in your SUBJECT.\r\n2. Send a COVER LETTER with a LINK to your CV/Resume.\n\r\n***APPLICATIONS WITHOUT CVS/RESUMES WILL NOT BE CONSIDERED***",
  "skill_requirements": [
    "Shopify",
    "Technical Support",
    "SaaS"
  ],
  "is_active": true,
  "status_history": []
}