{
  "job_id": "1368792",
  "url": "https://www.onlinejobs.ph/jobseekers/job/VIDEO-EDITOR-B-Roll-Research-Visual-Design-Specialist-1368792",
  "scraped_at": "2025-07-15T12:30:51.774316",
  "title": "VIDEO EDITOR (B-Roll Research & Visual Design Specialist)",
  "type_of_work": "Full Time",
  "salary": "Fair, Competitive Salary + Training + Bonuses",
  "hours_per_week": "45",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re hiring someone who has great creative taste and loves picking the perfect video clips to match a story.\n\r\nIf you’re good at finding B-roll that fits the mood, organizing footage so it’s easy to use, and helping make videos that look great and feel smooth, this could be for you.\n\r\n—-----------------------------------------------------------------------------\n\r\nREAD THE ENTIRE JOB LISTING CAREFULLY. The final step of the hiring process will require the candidate to provide at least 1 former employer/team lead reference and at least 1 character reference. These will be verified prior to extending an offer.\n\r\n--- ABOUT THE TEAM ---\r\nWant to work in a rewarding, fast-paced, start-up atmosphere? Looking for significant growth and performance bonus opportunities? Have a growth mindset, value relationships, and dedicated to getting results? Then we might be a fit!\n\r\nWhat is it like to work with us? HEAR FROM OUR TEAM!   \nUpgrade to see actual info\n\r\nOur Core Values:\r\n1) DELIGHT THE CLIENT:  We consistently exceed expectations by anticipating needs, delivering outstanding service, and creating those “magic Upgrade to see actual infonts” where every client feels seen and heard.\r\n2) MASTER YOUR CRAFT:  We commit to continuous learning, share our expertise openly, and tackle every challenge with precision and a deep sense of duty.\r\n3) FOLLOW THROUGH, ALWAYS:  When we say something will happen, it does—every time. We own every task, ensuring that nothing falls through the cracks, and when mistakes occur, we learn and improve immediately.\n\r\nOur core values are important and the right candidate will share our values. We are building an awesome place to work, not just cutting together videos for our real estate business.\n\r\n--- ABOUT YOU ---\r\nDo you have great creative taste and love finding the perfect B-roll to bring a story to life? Are you proactive, adaptable, and detail-oriented? Do you have a strong sense of pacing, a passion for storytelling, and take pride in keeping media assets organized and easy to use? Do our core values sound like a fit for who you are?\n\r\nThen keep reading to see if we're a fit!\n\r\nResponsibilities:\r\nStorytelling & Editing\r\n- Review all raw assets (A-roll, B-roll, audio, graphics), interpret transcripts, and determine a cohesive story direction\r\n- Create and maintain a shot list, pulling and organizing B-roll to enhance the narrative\r\n- Edit clean, tight, publish-ready videos that align with brand guidelines\r\n- Iterate quickly based on team feedback and meet agreed delivery timelines\n\r\nB-Roll Research & Script Annotation\r\n- Transcribe video content using tools provided or AI software\r\n- Prepare clean transcript documents for each project\r\n- Highlight key narrative Upgrade to see actual infonts and suggest relevant B-roll ideas\r\n- Source B-roll from internal libraries, stock platforms (e.g., Envato, Pexels), or Creative Commons-approved YouTube content\r\n- Link proposed B-roll clips directly into the transcript for easy editor access\n\r\nMedia Management & Organization\r\n- Maintain a structured B-roll folder system by project and theme\r\n- Rename and tag clips with accurate, searchable keywords (e.g., “Charlotte city aerial,” “family walking in park”)\r\n- Keep a centralized, up-to-date B-roll database (Google Sheets, Notion, Airtable, etc.)\r\n- Track reusable clips to reduce redundancy and improve efficiency\n\r\nRequirements:\r\n- A STABLE, HIGH-SPEED INTERNET CONNECTION, REQUIRED (at least 150mbps)\r\n- Experience with Final Cut Pro X (or other editing software, such as Adobe After Effects and Premiere Pro) is required\r\n- Experience with Canva or Photoshop is a plus\r\n- Strong grasp of storytelling, pacing, and visual rhythm required\r\n- Experience organizing and pulling relevant B-roll to strengthen visual narratives, required\r\n- Strong file organization habits and understanding of post-production workflows\r\n- Portfolio of completed long-form video projects, required\r\n- General understanding of brand, content marketing, YouTube, etc, required\r\n- GREAT interpersonal and communication skills, required\r\n- Ability to self-start, work on a tight schedule, and manage multiple project deadlines, required\r\n- Ability to follow directions and a LOVE of completing lots of projects according to consistent specifications, required\r\n- Growth mindset, required\n\r\n--- APPLICATION & RECRUITMENT PROCESS ---\r\nSTEP 1:\r\nFill out the application form through the link below and write \"green kangaroo\" in the Additional Comments field.\nUpgrade to see actual info\n\r\nSTEP 2:\r\nQualified candidates may be invited to participate in two PAID test projects, $20 USD for each test project estimated to be 2-3hrs of work for each (a total of $40 USD!).\n\r\nSTEP 3:\r\nCandidates who advance through the test project rounds will be invited to an interview.\n\r\nSTEP 4:\r\nBefore extending a trial offer, we will conduct a CHARACTER REFERENCE CHECK for the final candidate(s). CONDUCTING A REFERENCE CHECK will be the last step in the hiring process.\n\r\nSTEP 5:\r\nUpon receiving a trial offer, you will be onboarded as a Video Editor with a 90-day PAID trial period. During this period, we expect you to demonstrate your video editing expertise, meet project deadlines, be a team player, and excel at what you do. A successful trial will lead to a permanent offer to join the team.",
  "skill_requirements": [
    "Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:21:19.607410",
      "reason": "Job first discovered"
    }
  ]
}