{
  "job_id": "1370910",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Excellent-Graphic-Designer-Wanted-Great-Pay-Benefits-1370910",
  "scraped_at": "2025-07-15T15:31:28.687030",
  "title": "Excellent Graphic Designer Wanted - Great Pay & Benefits!",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "I am looking for a full-time Graphic Designer. You will be doing a variety of tasks, almost all of which I will create tutorials for you.\n\r\nExperience in Adobe Photoshop is REQUIRED\r\nExperience in Adobe Illustrator is REQUIRED\r\nExcellent written and verbal English communication skills are REQUIRED\r\nKnowledge of video editing is a PLUS\r\nMust be creative and innovative with attention to detail\n\r\nPay: TBD, this will depend on your level of skill and other people that apply to the job.\n\r\nYou will be creating\r\n*Thumbnails for YouTube Videos\r\n*Thumbnails for Shorts and Reels\r\n*Content for Social Media\r\n*Posting Stories To Social Media and editing graphical elements\r\n*Video Editing (I will teach you how to edit videos if you don’t already know how to)\n\r\nPerks:\r\n*You can work as much as you want. I will pay you a salary but if you work extra hours you will get paid.\r\n*Flexible Vacation, if you need time off just let me know.\r\n*Opportunity to advance/get bonuses, If you do a good job I will give you a raise and bonuses.\n\r\nAbout Me:\r\nI own two companies B Dancewear and Effective Ecommerce and a partner to multiple e-commerce businesses. I have been working with Virtual Assistants for over 6 years and all of my VAs have been very happy to work with me. You will be given a chance to talk with my current VA before you are hired.\n\r\nTo Apply for the job:\r\n1. Change the subject line to “I Want to Work for You [Insert the name of my mom who is the co-owner of Upgrade to see actual info here]”\r\n2. At the top of your message write 2-3 sentences on why you would like this position, and why you are a good fit. Do not write more than that or else your application will be deleted.\r\n3. Under that put the following, and include the numbers to make it easy for me to read.\r\n- a. Number of years in graphic design\r\n- b. A sample photo you have edited\r\n- c. A sample thumbnail you have created\n\r\nMake sure to follow all the steps above. This is a great job opportunity with the ability to get bonuses and raises so I will only look at applicants that really want the job. If I will interview you, there will be a short call between us and a video will be required\n\r\nDo not write more than what I have asked you above, if you write more than what is requested above I will ignore your job post.\n\r\nThank you,\r\nTravis Marziani",
  "skill_requirements": [
    "Logo Design",
    "Graphic Design",
    "Thumbnail & Social Media Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:26:43.412140",
      "reason": "Job first discovered"
    }
  ]
}