{
  "job_id": "1370593",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Virtual-Marketing-Adminstrator-1370593",
  "scraped_at": "2025-07-15T15:46:50.336917",
  "title": "Full Time Virtual Marketing Adminstrator",
  "type_of_work": "Full Time",
  "salary": "USD$900/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Please read the full description and follow the instructions at the bottom to apply.\n\r\nAre you detail-oriented and exceptionally organised?\n\r\nDo you love following systems and ticking off checklists?\n\r\nDo you enjoy supporting a marketing team to execute campaigns and content on time and without errors?\n\r\nAnd do you thrive in a fast-paced, remote working environment?\n\r\nIf you answered yes to all 4 questions… keep reading.\n\r\nIf you are self-motivated, disciplined, and love contributing to a high-performing team… then this is the opportunity for you!\n\r\nHere’s what’s in it for you:\n\r\n- $900 USD/month (independent contractor)\r\n- Medical insurance after 6 months\r\n- 13th Month Bonus Pay\r\n- 15 days paid leave per year (accrued)\r\n- 5 days paid sick leave per year (accrued)\r\n- Work from home – forever\r\n- Detailed onboarding and training\r\n- Join a culture-first team, certified by Great Place To Work\r\n- Recognition, rewards, and a remote team that’s got your back\r\n- No guesswork – every process is documented so you can hit the ground running\n\r\nA little about APB:\r\nThe Association of Professional Builders (APB) is a business coaching company for custom home builders. We provide on-demand training and systems through our membership, and we offer one-on-one coaching for builders worldwide.\n\r\nOur members are thriving, and we’re growing fast but sustainably. With a remote team of 30 people across four countries, we’re committed to building a workplace we’re proud of—and we’re officially Great Place To Work Certified.\n\r\nWe protect our team culture and only hire people who live and breathe our values.\n\r\nOur Core Values:\r\n- We never make assumptions—we ask more questions.\r\n- We always do the right thing, even when no one else is looking.\r\n- We celebrate the wins.\r\n- We don’t take things personally.\r\n- We make decisions and own the result.\r\n- We are impeccable with our word.\r\n- We trust but verify.\n\r\n(Hint: We might ask you about these during the interview!)\n\r\nHow To Apply\r\nStep 1:\r\nRecord a video (under 3 minutes) answering:\r\n“What excites you most about working in a marketing support role at a fully remote company?”\r\nMake sure we can clearly see and hear you.\n\r\nStep 2:\r\nSubmit your application via OnlineJobs.ph. Make sure you include:\r\nYour resume\r\nA cover letter tailored to this role\r\nA link to your video from Step 1 \n\r\nStep 3:\r\nResearch APB to prepare for your first interview!\r\nOnly shortlisted candidates will be contacted.",
  "skill_requirements": [
    "Marketing",
    "CRM",
    "Digital Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T05:27:10.542251",
      "reason": "Job first discovered"
    }
  ]
}