{
  "job_id": "1370792",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-Virtual-Assistant-Customer-Service-Dispute-Management-1370792",
  "scraped_at": "2025-07-15T12:24:57.460558",
  "title": "Experienced Virtual Assistant - Customer Service + Dispute Management",
  "type_of_work": "Part Time",
  "salary": "400",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you service-oriented, proactive, and experienced in customer contact? For our rapidly growing e-commerce business, we are looking for an enthusiastic Virtual Assistant to handle customer service and manage disputes across various payment platforms. Are you someone who can solve problems quickly and efficiently, always keeping the customer’s needs at the forefront? Then we are looking for you!\n\r\nAbout the Role\r\nAs a Virtual Assistant Customer Service, you will be responsible for responding to customer inquiries via email and managing payments and disputes on platforms such as Paypal, Stripe, Airwallex, and Klarna. You are the key link between our customers and the company, ensuring that questions, complaints, and disputes are handled quickly and correctly. You will work closely with other teaUpgrade to see actual infombers to provide the best possible customer service and enhance customer satisfaction.\n\r\nWhat Will You Do?\r\nRespond to customer emails about orders, deliveries, and other inquiries.\r\nHandle disputes and issues through payment platforms like Paypal, Stripe, Airwallex, and Klarna.\r\nProactively resolve problems to maintain customer satisfaction and prevent refunds or chargebacks.\r\nStay up-to-date with company information and procedures to assist customers accurately and effectively.\r\nCommunicate with other departments to quickly find accurate solutions to customer queries.\n\r\nWhat Do You Bring?\r\nExperience in customer service, preferably in the e-commerce sector.\r\nKnowledge of and experience with payment platforms such as Paypal, Stripe, Airwallex, and Klarna is a major plus.\r\nStrong communication skills, both written and verbal, in English.\r\nProblem-solving skills and the ability to work under pressure.\r\nIndependence, responsibility, and a keen eye for detail.\n\r\nWhat Do We Offer?\r\nA fixed hourly wage with opportunities for growth and bonuses.\r\nFlexible working hours and the ability to work remotely.\r\nA supportive team always ready to assist and share knowledge.\r\nOpportunities for personal development and training to improve your skills.\r\nAn environment where your ideas and initiatives are valued.\n\r\nAre you excited to join our dynamic team and work together to provide an excellent customer experience? Send us code 'VPC30' + your CV and cover letter. We can't wait to hear from you!                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:22:01.737372",
      "reason": "Job first discovered"
    }
  ]
}