{
  "job_id": "1370592",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Project-Manager-with-Paid-Media-Experience-1370592",
  "scraped_at": "2025-07-15T14:35:13.657376",
  "title": "Marketing Project Manager (with Paid Media Experience)",
  "type_of_work": "Full Time",
  "salary": "$10/hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Company Overview\r\nThis digital marketing consultancy specializes in performance-focused growth strategies for ecommerce and DTC brands. The founder is an experienced operator in paid media, AI implementation, and client relationship management. The company is building a lean, efficient, and high-trust internal team to support a growing client roster with full-funnel marketing execution and systems support.\n\r\nRole Summary\r\nWe are hiring a Marketing Project Manager to help stabilize internal operations, streamline client management, and support paid media fulfillment. This is a hybrid role that combines project coordination, light client communication, and digital marketing execution—with a strong emphasis on paid media structure and follow-through.\r\nThe role will start part-time (20 hours/week) with a goal to expand to full-time within 2 months based on fit and ramp-up. You’ll work directly with the founder, helping turn vision into structure and client opportunities into organized delivery.\n\r\nResponsibilities\n\r\nClient & Project Management\r\nCollect client inputs and campaign requirements, and ensure assets and briefs are organized\r\nBuild out and maintain project dashboards (Notion, Monday, or similar)\r\nHelp define and implement workflows for onboarding, reporting, and fulfillment\r\nCreate templated client proposals from founder’s notes and ideas\r\nMonitor and follow up on tasks delegated to internal and external teaUpgrade to see actual infombers\r\nSupport weekly reporting, light invoicing coordination, and tracking campaign performance metrics\n\r\nCommunication & Coordination\r\nDraft and send client emails, updates, and proposals in professional tone, but with founder’s voice\r\nOccasionally interface with clients via text/email and light voice calls (must be confident, clear, and warm communicator)\r\nTrack client requests, questions, and issues to ensure nothing falls through the cracks\r\nBatch questions for the founder and implement a 1-3-1 problem/solution format when bringing issues forward\n\r\nMarketing Fulfillment Support\r\nAssist with campaign setup and coordination (especially Google Ads/Meta)\r\nTranslate founder direction into execution tasks for the media buyer\r\nReview ad copy, landing pages, or keywords for completeness and logic\r\nHelp QA campaign builds and assist with ad-hoc tasks that improve operational efficiency\n\r\nIdeal Candidate Profile\n\r\n2+ years of experience in digital marketing, with exposure to paid media (Google Ads/Meta) campaigns\r\nStrong project management background: able to bring structure to chaos without micromanagement\r\nProactive communicator who thrives in a fast-moving, vision-led environment\r\nTech-comfortable: can adapt to new platforms quickly and build systems in Notion, Google Drive, or PM tools\r\nSharp problem-solver who comes with solutions, not just questions\r\nComfortable working with founders who are creative and fast-paced (and a little all over the place!)\r\nDetail-oriented without being rigid — able to ship quickly while maintaining quality\r\nStrong written and spoken English; able to interact professionally with clients, but also direct and efficient internally\n\r\nBonus Skills\r\nInterest in AI tools for marketing content creation and automation\r\nExperience hiring or training junior teaUpgrade to see actual infombers\r\nAbility to grow into a leadership role as the team expands                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:24:26.950830",
      "reason": "Job first discovered"
    }
  ]
}