{
  "job_id": "1370818",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Process-Support-Executive-for-HVAC-1370818",
  "scraped_at": "2025-07-15T12:24:28.018846",
  "title": "Process Support Executive for HVAC",
  "type_of_work": "Full Time",
  "salary": "$4 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "***PLEASE DO NOT APPLY FOR THIS POSITION IF YOU DO NOT HAVE PRIOR EXPERIENCE AS AN OFFICE MANAGER OR IN HANDLING ADMINISTRATIVE TASKS***\n\n\r\nThe company empowers small HVAC contractors by giving them access to experienced office managers enhanced by AI technology. We're revolutionizing how small HVAC businesses manage their operations, providing them with top-tier office expertise that was previously out of reach due to cost or availability constraints. Our unique model allows skilled office\r\nmanagers to support multiple businesses efficiently, maximizing their impact in the industry.\n\r\nAbout the Position:\r\nWe’re seeking a detail-oriented Process Support Executive to provide remote support to our US-based HVAC office managers. The ideal candidate will help process administrative tasks, manage documentation, and assist with customer service functions on higher-level strategic support.\n\r\nResponsibilities:\r\n• Create and process invoices for HVAC services and equipment\r\n• Prepare and submit equipment warranty registrations for customers\r\n• Complete and file rebate paperwork for energy-efficient installations\r\n• Create engaging social media content for HVAC businesses\r\n• Assist office managers with administrative tasks and documentation\r\n• Maintain accurate records and follow established procedures\r\n• Coordinate with U.S.-based office managers to ensure smooth workflow\r\n• Support customer service initiatives as needed\n\r\nRequirements:\r\n• Excellent English communication skills: verbal, written, and reading is a MUST\r\n• Previous experience in administrative support is a MUST\r\n• Experience with creating professional social media content\r\n• Proficiency with common office software and digital tools\r\n• Be tech-savvy and quick to learn new software platforms\r\n• Excellent attention to detail and organizational abilities\r\n• Ability to work independently, manage multiple priorities while maintaining accuracy, and committed to meeting deadlines\r\n• Be able to communicate professionally with US-based teaUpgrade to see actual infombers during US working hours\r\n• Enjoy administrative work and helping businesses grow\r\n• Basic understanding of HVAC industry terminology is an ADVANTAGE\n\r\nWork Schedule:\r\n• This is a full-time position in a work-from-home setup. You will be working 8 hours a day, 5 days a week, following the US Time zone.\n\r\nTO APPLY FOR THIS POSITION, FOLLOW THE INSTRUCTIONS BELOW:\r\n1. Include the phrase \"HVAC\" in your SUBJECT.\r\n2. Send a COVER LETTER with a LINK to your CV/Resume.\n\r\n***APPLICATIONS WITHOUT CVS/RESUMES WILL NOT BE CONSIDERED***",
  "skill_requirements": [
    "Customer Support",
    "Office and Administration",
    "Administrative Support"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:28:05.514355",
      "reason": "Job first discovered"
    }
  ]
}