{
  "job_id": "1370831",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Cold-Caller-Real-Estate-Investment-Remote-EST-Hours-1370831",
  "scraped_at": "2025-07-15T15:29:10.002609",
  "title": "Cold Caller – Real Estate Investment (Remote, EST Hours)",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Cold Caller – Real Estate Investment (Remote, EST Hours)\r\nBreak into the most impactful niche in real estate. Change lives. Build wealth. Cold call with purpose.\n\r\nAbout the Opportunity\n\r\nThis is not your typical cold calling job.\n\r\nWe're a fast-growing real estate investment company helping homeowners going through foreclosure or distress. Every call you make has the potential to truly help someone — while building a path to high commissions and long-term growth.\n\r\nWe’re looking for a fluent English speaker with real sales experience, natural empathy, and the drive to become a top 1% closer.\n\r\nIf you’ve got the voice, the heart, and the ambition — we’ve got the training, leads, and opportunity.\n\n\r\nSchedule\n\r\nFull-time: 8am–5pm EST\n\r\nPart-time options available (minimum 5 hours/day, must overlap EST)\n\n\r\nCompensation\n\r\nBase pay + performance bonuses\n\r\nBonuses for:\n\r\nEvery qualified appointment set\n\r\nEvery deal closed from your call\n\r\nOngoing raises for consistent performers\n\r\nAccess to our exclusive industry mastermind (used by 7-figure investors)\n\n\r\nWhat You’ll Do\n\r\nCall homeowners directly from our pre-qualified lists\n\r\nBuild real conversations — no robotic script reading\n\r\nIdentify pain points, listen with empathy, and offer help\n\r\nSet up appointments for our acquisitions team to make offers\n\r\nUse CRM daily to track outcomes, notes, and follow-ups\n\n\r\nRequirements\n\r\nFluent English speaker (clear, confident, warm voice)\n\r\nSales experience is required (cold calling preferred)\n\r\nGenuine empathy — this is about people, not pressure\n\r\nConsistent, reliable, coachable, and relentless\n\r\nStrong internet connection, quiet workspace, and quality headset\n\n\r\nWhy Join Us\n\r\nReal opportunity to make $2K–$6K/month or more\n\r\nBe part of a mission-driven team that helps people every day\n\r\nGrow in one of the most fulfilling, recession-proof niches in real estate\n\r\nYou’ll learn from top closers, scripts, and strategy\n\r\nWeekly training + personal sales coaching\n\n\r\nApply Now\n\r\nClick Apply and include a 30-second voice note introducing yourself and sharing why you're interested in this role.\n\r\nWe’re hiring now, and we're only bringing on the top 1% who want to win with us.",
  "skill_requirements": [
    "Real Estate",
    "Cold Calling",
    "Sales"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:24:48.926271",
      "reason": "Job first discovered"
    }
  ]
}