{
  "job_id": "1372985",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Administrative-Assistant-1372985",
  "scraped_at": "2025-07-15T14:26:19.277371",
  "title": "Administrative Assistant",
  "type_of_work": "Full Time",
  "salary": "$600-$1000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Department: Corporate and Securities\n\r\nJob Description:\n\r\nWe are seeking a skilled and experienced Legal Assistant who possess expertise in preparing legal forms, particularly related to entity formations and government filings. Additionally, the candidate should have a strong background in preparing and drafting various corporate documents, including articles of incorporation, bylaws, shareholder agreements, and resolutions, along with proficiency in handling government forms.\n\r\nKey Responsibilities:\n\r\nLegal Form Preparation:\n\r\n1. Demonstrate proficiency in preparing legal forms, focusing on entity formations and government filings.\r\n2. Ensure accuracy and compliance with relevant regulations and guidelines.\n\r\nCorporate Document Drafting:\n\r\n1. Draft and prepare various corporate documents, such as articles of incorporation, bylaws, shareholder agreements, and resolutions.\r\n2. Maintain a keen eye for detail to ensure precision in legal documentation.\n\r\nAdministrative Support:\n\r\n1. Conduct phone intakes, addressing inquiries with professionalism and efficiency.\r\n2. Manage calendars and schedules, coordinating phone calls and appointments.\r\n3. Communicate effectively and clearly with clients and teammates, fostering positive relationships.\r\n4. Exhibit initiative in addressing tasks and responsibilities, contributing to the overall efficiency of the legal team.\n\r\nJob Requirements:\n\r\n1. Proven experience in preparing legal forms, including entity formations and government filings\r\n2. Familiar in preparing and drafting various corporate documents (articles of incorporation, bylaws, shareholder agreements, and resolutions) and government forms\r\n3. Can do phone intake, calendar, scheduling phone calls, and clearly and effectively communicating with clients and teammates. Taking initiative is imperative\r\n4. Proficient in the English language with excellent communication skills, both written and verbal, with the capacity to interact professionally with clients and teaUpgrade to see actual infombers.\r\n5. You MUST be detail-oriented and capable of maintaining accuracy in legal documentation.\n\r\nSpecific Requirements:\n\r\n(a) Proficiency in the English language\r\n(b) Minimum of 1 year of administrative experience\r\n(c) Must have reliable power\r\n(d) Reliable internet\r\n(e) Work PST hours\r\n(f) Must own a personal laptop (Windows or Mac) with a valid, fully licensed operating system. Minimum specifications: Windows 10 or macOS 12, Intel Core i5-1235U 1.30 GHz processor (or Apple M1/M2 equivalent), and at least 16GB of RAM.\r\n(g) Must complete a speed test, meet system specification requirements, and meet laptop specification requirements.\n\r\nAdditional Skills:\n\r\n• Time Management Skills\r\n• Problem-Solving Skills\r\n• Proficient in Microsoft Office suite\r\n• Well-organized, detail-oriented, ability to multi-task with great follow-up skills\r\n• Experience in managing multiple priorities, administrative coordination, and logistics\n\r\nHours: 8:30 am—5:00 pm, PST, Monday through Friday; however, the work schedule can be negotiated with the department head.\n\r\nSalary: $600-$1000 a month plus $75 supplemental pay to use toward insurance                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:20:30.488748",
      "reason": "Job first discovered"
    }
  ]
}