{
  "job_id": "1374679",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-for-Online-Arbitrage-High-Standards-High-Rewards-1374679",
  "scraped_at": "2025-07-15T14:35:22.856521",
  "title": "Virtual Assistant for Online Arbitrage (High Standards - High Rewards)",
  "type_of_work": "Full Time",
  "salary": "600",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you ready to be pushed beyond your limits and become elite?\r\nWe are looking for a highly motivated Virtual Assistant with previous experience in Online Arbitrage to join a fast-moving, results-driven team.\r\nContext:\r\n•?  ?Our business is on track to hit $10 million in online arbitrage revenue this year.\r\n•?  ?Last year alone, we did over $7 million in top-line revenue with just myself, one purchasing VA, and one admin VA — proving what a small, skilled team can accomplish.\r\n•?  ?I know exactly what good leads look like — your performance will be tracked closely based on profit per ASIN and other KPIs (key performance indicators).\r\n•?  ?This will not be an easy role at the start.\r\n•?  ?I'm looking for someone who is hungry to work, willing to put in 10+ hours a day initially, and already has basic sourcing skills.\r\n•?  ?Once you prove you have real potential, the workload will become more manageable, and I will personally help you become a highly skilled, highly paid sourcing machine.\r\nImportant:\r\n•?  ?Your position will always be based on hitting KPIs — from day one through your entire time with the company.\r\n•?  ?Put not written by ai in the title (I will check if it was written by ai)\r\n•?  ?After proving yourself for a few months, you will have the opportunity to earn profit-sharing bonuses based on the ASINs you find that perform well.\r\n•?  ?I like to pay above industry standard for real results — I reward strong performance, not effort without outcomes.\r\nWhat You Get:\r\n•?  ?High upside: High base pay + future profit-sharing opportunities.\r\n•?  ?Opportunities for bonuses, raises, and paid vacations for consistent, strong performance.\r\n•?  ?A clear and fast path for growth — but only if you can deliver at a high level.\r\nQualifications:\r\n•?  ?Proven experience in online arbitrage sourcing.\r\n•?  ?Basic sourcing skills already in place.\r\n•?  ?Highly motivated and willing to put in the effort.\r\n•?  ?Strong communication skills.\r\n•?  ?No other employers — if you work for someone else, do not apply. This is a full commitment role.\r\nTo Apply:\r\n1.? ?Submit 5 leads that you believe I would want to see.\r\no Include the source, cost, Amazon selling price, estimated profit, and ROI.\r\n2.? ?Tell me:\r\no What you’re best at (cite your sourcing methods manual sourcing, tactical arbitrage, reverse sourcing, storefront stalking, etc.)\r\n Why you like each product and why you recommend I purchase it.(a few sentences)\r\nFinal Reminder:\r\nThis will be tough at the beginning. I am difficult to work for because I expect high standards  but if you are serious and willing to earn it, you will become one of the best in this space, and you will be paid like it.\r\nI'm not trying to discourage you from applying. I'm simply making sure you don’t waste your time  or mine — if you're not truly willing to put the work in.\n\nUpgrade to see actual info\nUpgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:34:59.021436",
      "reason": "Job first discovered"
    }
  ]
}