{
  "job_id": "1374865",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1374865",
  "scraped_at": "2025-07-14T23:06:15.623271",
  "title": "Social  Media Manager",
  "type_of_work": "Any",
  "salary": "$5 - $6 / Hour",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking creative and dynamic Social Media Managers to join our team. The ideal candidates will be responsible for managing client social media presence across various platforms, creating engaging content, and fostering meaningful interactions with the audience. This role requires a passion for social media, a keen eye for detail, and the ability to stay up-to-date with the latest trends and technologies.\n\r\nQualifications:\r\n- Must have 2+ years of experience as a Social Media Manager\r\n- Must be residing from Cebu, Davao or Manila, and its neighboring cities\r\n- Proven experience in social media management and content creation.\r\n- Proficiency in video editing software (e.g., Adobe Premiere Pro, Final Cut Pro, or similar).\r\n- Familiarity with AI tools and their application in content creation.\r\n- Strong research skills and the ability to stay updated on social media trends.\r\n- Excellent organizational skills for scheduling and managing multiple platforms.\r\n- Strong communication skills and the ability to engage effectively with an online community.\r\n- Creativity and a passion for storytelling through visual and written content.\r\n- Ability to work independently and meet deadlines.\n\r\nKey Responsibilities:\n\r\n1. Content Creation:\r\n   - Develop and curate high-quality, engaging content for social media platforms.\r\n   - Create and edit videos, particularly for Reels\r\n   - Utilize AI tools to enhance content creation and streamline processes.\n\r\n2. Video Editing:\r\n   - Edit and produce visually appealing and compelling video content.\r\n   - Ensure all videos are on-brand, high-quality, and optimized for each platform.\n\r\n3. Research:\r\n   - Conduct research on industry trends, competitor activities, and audience preferences.\r\n   - Identify new opportunities for content creation and engagement.\n\r\n4. Scheduling:\r\n   - Plan and schedule posts using social media management tools.\r\n   - Maintain a consistent posting schedule across all platforms.\n\r\n5. Engagement:\r\n   - Actively engage with followers, respond to comments and messages, and foster a positive community atmosphere.\r\n   - Monitor engagement metrics to improve strategy and performance.\n\r\n6. Direct Message (DM) Management:\r\n   - Handle incoming DMs professionally and promptly.\r\n   - Address customer inquiries, feedback, and concerns effectively.\n\r\nFor interested applicants, please fill out this form:  \nUpgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}