{
  "job_id": "1377572",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Inside-Sales-Representative-Health-Life-Insurance-1377572",
  "scraped_at": "2025-07-15T12:33:49.926639",
  "title": "Inside Sales Representative - Health / Life Insurance",
  "type_of_work": "Part Time",
  "salary": "$5 per hour + uncapped bonuses",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "This role is open to NEWLY LICENSED health or life insurance agents only. \n\r\nMy-Medicare-Expert is hiring!\n\r\nSell health insurance to seniors in the U.S.  Earn uncapped bonuses on top of your basic pay of $5 per hour.\n\r\nIf you are highly motivated, reliable, and currently seeking career growth opportunities, we'd love to hear from you!\n\r\nInitially, your main responsibilities will be to convert cold leads into warm leads and set appointments or perform live transfers for a Medicare agent.  You will be speaking with seniors in the US, ages 64 and older. The ideal prospect is someone who already has Medicare Supplement Insurance or is planning on retiring.  \n\r\nHave the opportunity to work in an office setting in BGC where you get to work alongside the company owner and a team of highly motivated individuals, reaching your financial goals while making a difference in the lives of seniors in the U.S.   Learn more about the company here – Upgrade to see actual info.\n\r\nSKILLS YOU MUST HAVE:\r\n1. EXCELLENT English-speaking skills - a neutral accent or sounding like you are a native English speaker is a must\r\n2. Ability to think FAST & overcome customer objections.\r\n3. Ability to build rapport and connect with people over 60.\n\r\nREQUIREMENTS YOU MUST MEET:\r\n1. Minimum 2 years' experience in outbound lead generation, telemarketing, or appointment setting.\r\n2. Knowledgeable sbout health and life insurance.  Some basic knowledge about the US Medicare system -- i.e., The different parts of Medicare / Medicare Advantage VS Medicare supplements--is a plus.\r\n3. Ability to use the \"WhatsApp'' application.\r\n3. Quiet home-office environment – no background noise in your working area.\r\n4. High speed internet (ethernet connection) -- minimum of 50 mbps upload/downloan speed.\r\n5. Personal computer/laptop with i3 processor or equivalent.\r\n6. USB headset with active noise cancelation.\r\n7. Ability to work any 4-hour shift between 9am to 7pm PST.\n\r\nTO APPLY:\r\n1. Send your application to Upgrade to see actual info and use “Inside Sales Representative” for the subject line.\r\n2. Attach the following:\r\na. Your resume - include 2 character references\r\nb. A voice recording of a casual self-introduction with deatails not on your resume or cover letter. Maximum of 30 seconds.\r\nc. A voice recording of you reading the text from the following document -- Upgrade to see actual info\r\nd. A cover letter where you talk about what you like about this job opportunity and why we should hire you.\r\ne. Include your WhatsApp number in your email signature\n\r\nNOTE:\r\n1. Use Vocaroo for your voice recordings and send the link. Do not attach audio files to your email.\r\n2. Applications that have incomplete information or do not follow instructions will not be considered.\r\n3. Only shortlisted applicants will be contacted byUpgrade to see actual info.\r\n4. Candidates selected for this position will be required to memorize all information within the Medicare Insurance 7 Facts Report as seen here – Upgrade to see actual infodicareinsurance.report.",
  "skill_requirements": [
    "Outbound Sales",
    "English Speaking",
    "Appointment Setting"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:27:43.679400",
      "reason": "Job first discovered"
    }
  ]
}