{
  "job_id": "1377780",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Urgent-Full-time-Outbound-Call-Representative-w-Lead-Generation-Experience-Cebu-Based-1377780",
  "scraped_at": "2025-07-15T15:46:19.622398",
  "title": "Urgent Full-time Outbound Call Representative w/ Lead Generation Experience -Cebu Based",
  "type_of_work": "Full Time",
  "salary": "Php35,000 - Php45,000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking a versatile and detail-oriented Outbound Call Representative with Lead Generation Experience preferably from Cebu, Philippines, to join our team at Summer VA. In this role, you will be responsible for lead research, making outbound calls to potential customers, introducing our services, and nurturing relationships to move them through the sales pipeline.\n\r\nResponsibilities:\n\r\n- Identify leads through cold calling, social media, email campaigns, and inbound inquiries.\r\n- Qualify leads by assessing their needs, interests, and fit for our services.\r\n- Make outbound calls to introduce services and highlight their benefits.\r\n- Record and track lead details in CRM or spreadsheets.\r\n- Follow up with leads to build relationships and move them through the sales pipeline.\r\n- Adjust conversations naturally while adhering to provided scripts.\r\n- Collaborate with sales teams for smooth lead transitions.\r\n- Perform other related tasks to fully support the team as required.\n\r\nQualifications:\r\n- Previous experience in lead generation, outbound sales, telemarketing, or customer service preferred\r\n- Excellent communication and interpersonal skills\r\n- Exhibits remarkable composure and possesses exceptional patience when dealing leads\r\n- Ability to work independently and as part of a team in a fast-paced environment\r\n- Comfortable using spreadsheet and CRM software and other sales tools.\r\n- Possesses excellent English proficiency with clear and articulate communication, maintaining a neutral accent without\r\nnoticeable influence from applicant’s first language\n\r\nIf you're interested in applying, please send your application to Upgrade to see actual info (hr at sign summerva . com) along with the requirements listed below:\n\r\nResume, screenshot of computer specifications, screenshot of internet speed test, and video recording where you introduce yourself and elaborate on your experiences.\n\r\nOr send your application atUpgrade to see actual info\n\r\nTogether, let’s optimize business operations and drive success!!!",
  "skill_requirements": [
    "Outbound Sales",
    "Lead Generation",
    "Outbound Calls"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:46:19.624570",
      "reason": "Job first discovered"
    }
  ]
}