{
  "job_id": "1377775",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Takeoff-Estimator-CIVIL-STRUC-ARCH-1377775",
  "scraped_at": "2025-07-15T08:35:03.785530",
  "title": "Remote Takeoff Estimator (CIVIL, STRUC, ARCH)",
  "type_of_work": "Any",
  "salary": "$4.25 to $4.75/hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are currently looking to add to our growing team. We are a USA-based takeoff & estimating service company. This position is for remote in-house estimators/Quality Control Reps. Please read the job details and respond accordingly to our questions to be considered. Thank you!\n\r\nWe are looking for Immediate Hire:\n\r\nPosition 1: Structural Estimators like wood/Lumber package, steel framing, and metal framing\r\nPosition 2: Architectural Estimators like Drywall, Div 9 Finishes, Div 7 Thermal and Moisture\r\nPosition 3: Civil Estimators like Concrete and Earthworks\n\n\r\nJob Details-You will be performing takeoffs and some quality control tasks\n\r\n1. Full-time work available and even over time based on Performance & Quality Of Work-We can offer stable consistent work to the right person (Full Time Preferred)\r\n2. Some training is provided but must have prior experience\r\n3. Must have 5+ Years of experience\r\n4. Must have an engineering or architectural degree or equal estimator experience\r\n5. Must Speak English\r\n6. Must have Planswift Software (No Exception, please don't apply if you don't have this software)\r\n7. Must have good math skills\r\n8. Must be able to work independently in a fast-paced environment\r\n9. Must know how to use Microsoft excel\r\n10. USA takeoff experiences a PLUS but not necessary\r\n11. Must be a team player\r\n12. Must be able to work daytime EST\r\n13. Must be able to work some weekends, depending on workload\r\n14. Must be very responsive\r\n15. Must be reliable and available during your shift.\n\r\nWe have a base starting pay rate per this job post, if you prove your skills we do offer pay raises and bonuses. We also have many management positions to which you can be promoted to.\n\r\n****To be considered please send the following answered questions****\n\r\n1. Have you read the job description above thoroughly and can you comply with most requirements?\r\n2. Do you have experience in Lumber Framing, Concrete, Earthworks, and Drywall? This area is particularly busy for us, so any experience would be PLUS. Please elaborate.\r\n3. Tell us about your related experience\r\n4. What is your area of expertise?\r\n5. Why should we hire you?\r\n6. Do you have a home office?\r\n7. How is your internet Speed?\r\n8. How many years of actual takeoff and estimating experience do you have? with US experience?\r\n9. What is your availability and how soon can you start?",
  "skill_requirements": [
    "Estimate",
    "Planswift",
    "Quantity Surveying"
  ],
  "is_active": true,
  "status_history": []
}