{
  "job_id": "1377584",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Online-arbitrage-working-with-one-of-the-largest-OA-stores-1377584",
  "scraped_at": "2025-07-15T15:42:56.013585",
  "title": "Online arbitrage (working with one of the largest OA stores)",
  "type_of_work": "Full Time",
  "salary": "500-800 usd",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you ready to be challenged, pushed to your limits, and trained to become world-class?\r\nWe’re looking for a driven, detail-oriented Virtual Assistant with proven experience in Online Arbitrage to join a high-performing, fast-growing team.\r\n???? About Us\r\n• Our business is on track to generate $10 million in revenue this year through online arbitrage.\r\n• In the past year alone, we crossed $7 million in sales with just myself, one purchasing VA, and one admin VA — proof that a small, elite team can accomplish massive results.\r\n• We know exactly what quality sourcing looks like — and your performance will be \r\n• Include “ai” in your application title when you apply \r\n• racked closely using metrics like profit per ASIN and other key KPIs.\r\n???? What We’re Looking For\r\nThis isn’t just another VA job. It’s a full commitment, high-accountability role for someone who:\r\n• Already has solid sourcing skills (manual sourcing, reverse sourcing, storefront stalking, etc.).\r\n• Is hungry to learn and grow, and can commit to getting the job done.\r\n• Thrives in a results-driven environment and is willing to push beyond average.\r\nYes, the beginning will be intense — but if you have the mindset and potential, you’ll be personally trained to become a highly paid, elite sourcing machine.\r\n???? What You Get\r\n• Competitive base pay + future profit-sharing on high-performing ASINs.\r\n• Bonuses, raises, and paid vacations for consistent high-level performance.\r\n• A clear and fast growth path — but only if you deliver.\r\n• I’m looking for somebody long-term. One of my virtual assistance has worked for me for almost 2 years and another one for a year.\r\n???? Expectations\r\n• Performance is everything. Your role and income will always be tied to clear KPIs.\r\n• This is a full-time, no-side-hustles role. If you have other clients, do not apply.\r\n• You’ll start with intense work hours. Once trust and consistency are proven, your schedule will become more flexible.\r\n•       Paid trial period\r\n? Requirements\r\n• Proven experience in online arbitrage sourcing.\r\n• Strong communication skills.\r\n• Deep motivation and resilience — no shortcuts.\r\n• Willingness to be coached and held to high standards.\r\n???? To Apply\r\n1. Submit 5 sample leads you believe are winners ( need to be good right now)\r\nMake sure to submit leads with the initial application\r\no Source\r\no Buy cost\r\no Amazon selling price\r\no Estimated profit\r\no ROI\r\n2. Briefly tell me:\r\no What sourcing methods you’re best at.\n\r\nFinal Word\r\nThis role isn’t easy. I have high standards, and I expect performance. But if you’re ready to go all in, I will invest in your growth, and you’ll become one of the best in this business.\r\nHigh standards bring high rewards.\r\nHere are a few recent interviews I have had\nUpgrade to see actual info\nUpgrade to see actual info",
  "skill_requirements": [
    "Amazon",
    "Keepa",
    "Online Arbitrage"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:27:21.092414",
      "reason": "Job first discovered"
    }
  ]
}