{
  "job_id": "1377143",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Operations-Process-and-Accounting-Coordinator-1377143",
  "scraped_at": "2025-07-15T13:27:43.379338",
  "title": "Sales Operations Process and Accounting Coordinator",
  "type_of_work": "Full Time",
  "salary": "P40,000 to P50,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "POSITION SUMMARY\r\nThe Sales Operations Process and Accounting Coordinator is responsible for auditing, tracking, and logging all sales transactions with accuracy and timeliness. This role plays a critical part in supporting both in-office and event-based activities by ensuring that all transactions are properly processed, recorded, and followed up on when issues arise, such as failed payments or delays. The coordinator works closely with the sales team and external partners, including our sister company, to streamline the processing of shared products. Additionally, this role is essential in maintaining, updating, and creating SOPs to reflect the latest process changes and improvements. The coordinator is responsible for identifying and reporting non-adherence to established processes to the Senior Sales Operations Manager.\n\r\nThis position is 100% remote.\n\r\nABOUT CARDONE VENTURES\r\nOur mission is to help business owners achieve their personal, professional, and financial goals through the growth of their businesses. We work in dozens of verticals and provide strategic business guidance through courses, live events, partnerships, and investments. Our core values are the backbone of our business and guide our hiring process: we are inspirational, disciplined, accountable, transparent, aligned, and results oriented. This company operates nationally and is growing by the day. \n\r\nWondering what it's like to work here? Come check this:\nUpgrade to see actual info/watch?v=PIIv7sYj1Ns\n\r\nSUCCESS LOOKS LIKE\r\n- Accurate and timely processing of all sales transactions, resulting in a smooth and efficient sales operation.\r\n- Building streamlined processes that prevent transaction delays and ensure seamless collaboration between the sales team and external partners.\r\n- Creating a system of transparency and accountability in transaction handling that drives consistency and trust across the organization.\n\n\r\nOBJECTIVES\r\n- Ensure the accuracy and timely processing of all sales transactions, maintaining a high standard of compliance with established SOPs.\r\n- Oversee the auditing process of transaction logs to identify discrepancies and implement corrective actions, fostering accountability within the sales team.\r\n- Develop and refine SOPs that reflect best practices, ensuring they are effectively communicated and adhered to across the organization.\r\n- Collaborate with the sales team and external partners to streamline transaction processes, enhancing operational efficiency and reducing payment delays.\r\n- Lead regular training sessions for the sales team on transaction procedures and best practices, driving a culture of continuous improvement and compliance.\r\n- Implement a proactive follow-up system for failed payments, significantly reducing turnaround time and improving cash flow.\r\n- Regularly assess transaction performance metrics, identifying trends and areas for improvement to optimize overall transaction management.\r\n- Foster a culture of transparency and accountability, ensuring all stakeholders understand their roles in the transaction process.\n\n\n\r\nCOMPETENCIES\r\n- Ability to accurately log and track all sales transactions, ensuring compliance with established processes.\r\nProficient in auditing sales transactions and identifying discrepancies or potential risks.\r\n- Ability to develop and update SOPs in collaboration with sales and operations teams, ensuring all procedures are up-to-date and accessible.\r\n- Strong communication skills for reporting transaction issues and collaborating with external partners, such as the sister company.\r\n- Demonstrates attention to detail when auditing and reviewing transaction logs to ensure accuracy and compliance.\r\n- Ability to manage follow-ups on failed payments or delayed deals, ensuring timely resolution.\r\n- Proficient in CRM systems and other financial or sales tracking software to record transactions and generate reports.\r\n- Ability to collaborate effectively with the Senior Sales Operations Manager and other stakeholders to address non-adherence to SOPs.\r\n- Strong organizational and time management skills, especially when handling multiple transactions simultaneously.\r\n- Capable of working under pressure to meet tight deadlines while maintaining a high standard of accuracy.\n\n\r\nEDUCATION AND EXPERIENCE\r\n- At least 3 year’s experience in a sales environment \n\r\nPHYSICAL REQUIREMENTS\r\n- Prolonged periods sitting at a desk and working on a computer\n\n\n\r\nCOMMITMENT TO DIVERSITY\r\nAs an equal opportunity employer committed to meeting the needs of a multigenerational and multicultural workforce, Cardone Ventures recognizes that a diverse staff, reflective of our community, is an integral and welcome part of a successful and ethical business. We hire local talent at all levels regardless of race, color, religion, age, national origin, gender, gender identity, sexual orientation, or disability, and actively foster inclusion in all forms both within our company and across interactions with clients, candidates, and partners.\n\r\nIf this position caught your eye, send us your resume! For best consideration, please complete the online application form:\nUpgrade to see actual info/Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}