{
  "job_id": "1378335",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Appointment-Setter-Work-From-Home-1378335",
  "scraped_at": "2025-07-14T23:20:50.391389",
  "title": "Appointment Setter (Work From Home)",
  "type_of_work": "Full Time",
  "salary": "20000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Lead Generation & Prospecting: \n\r\nResearch and identify potential clients through various channels (online platforms, networking, etc.).\n\r\nInitiate contact with prospects via cold calls, emails, and social media outreach. Client Engagement: Present and promote products or services to prospective clients.\n\r\nConduct initial conversations to understand customer needs and pain points. \n\r\nQualify leads based on established criteria. \n\r\nPipeline Management: Maintain an organized pipeline of leads and opportunities. \n\r\nSchedule meetings or demos for senior sales representatives or account managers. \n\r\nCollaboration & Reporting: Work closely with the sales team to align strategies and handoff qualified leads. \n\r\nProvide regular updates and reports on lead status, market trends, and customer feedback. \n\r\nMarket Research & Insights: Stay informed about industry trends, competitor offerings, and market dynamics. \n\r\nIdentify potential new markets or industries for expansion. \n\r\nTargets & Performance: Meet or exceed monthly and quarterly KPIs, including lead generation and conversion targets. \n\r\nContinuously improve outreach methods based on feedback and results. \n\r\nSalary: 20,000.00 Monthly\n\r\nQualifications: \n\r\n-College Graduate \r\n-with atleast 1 yr experience in BP0/Call Center/Customer Service/Appointment Setter \n\r\nTo move forward, please connect with us on Microsoft Teams using the link details:\r\n???? Ms. Kiah MS Teams: Upgrade to see actual info\n\r\nOnce connected, kindly provide the following details:\n\r\nFirst Name:\r\nMiddle Name:\r\nLast Name:\r\nGender: \nEmail:\n\r\nWe look forward to speaking with you soon!",
  "skill_requirements": [
    "Outbound Sales",
    "English Speaking",
    "Appointment Setting"
  ],
  "is_active": true,
  "status_history": []
}