{
  "job_id": "1379960",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Full-Stack-Developer-Next-JSSupabase-1379960",
  "scraped_at": "2025-07-15T12:22:48.183146",
  "title": "Senior Full-Stack Developer (Next JS/Supabase)",
  "type_of_work": "Full Time",
  "salary": "Php 180,000 / month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "***PLEASE READ ON HOW TO APPLY***\n\r\nJob Title: Senior Full-Stack Developer (API Integrations & Multi-Tenant Platforms)\r\nLocation: Remote\r\nWorking Hours: UK\r\nSalary Range: Php 180,000 per month\r\nA MUST: Minimum of 8 years of solid full stack development\n\r\nJob Specification:\n\r\nAbout the Role\r\nWe are looking for a skilled Full-Stack Developer to help build and scale a multi-tenant platform with deep API integrations, security-focused architecture, and an adaptable admin dashboard. The platform handles high volumes of user data, integrates with multiple third-party services, and requires robust security and performance optimizations.\r\nThis role is ideal for someone who enjoys solving complex problems, working with modern technologies, and delivering seamless integrations across multiple services. Experience in financial services, credit data, or regulated industries is a plus, but not required.\n\r\nKey Responsibilities\r\nAPI Development & Integrations\r\nImplement and maintain integrations with third-party data providers and CRM systems.\r\nWork with REST APIs, webhooks, and authentication mechanisms like OAuth and API keys.\r\nEnsure secure and efficient data exchange between services.\r\nMulti-Tenant Architecture & Admin Dashboard\r\nEnhance a multi-brand, multi-tenant admin platform with role-based access.\r\nImplement dynamic UI configurations, allowing different branding and settings per client.\r\nOptimize database design and queries to support scalability and data isolation.\r\nSecurity & Data Protection\r\nEnsure data encryption in transit and at rest.\r\nImplement robust authentication, authorization, and access controls.\r\nApply best practices for API security, credential storage, and compliance.\r\nPerformance & Scalability\r\nOptimize backend processes and database queries for speed and efficiency.\r\nMonitor system health, logging, and error handling to ensure smooth operation.\r\nDesign scalable solutions to accommodate future growth.\n\r\nTech Stack\r\nFrontend: React, Next.js, Tailwind CSS\r\nBackend: Node.js, Supabase (or PostgreSQL/Firebase)\r\nAPI Integrations: REST APIs, Webhooks, PostMessage (iFrame communication)\r\nSecurity & Authentication: HTTPS, OAuth, API key authentication, role-based access\r\nInfrastructure: Vercel, Serverless Functions, Cloud-hosted databases\n\r\nWho We’re Looking For\r\nStrong experience in JavaScript/TypeScript, React, and Next.js.\r\nProficiency with PostgreSQL and working with structured and semi-structured data.\r\nExperience integrating and securing third-party APIs.\r\nFamiliarity with multi-tenant application design and role-based security.\r\nAbility to troubleshoot and optimize complex systems.\n\r\nBonus Skills\r\nExperience in financial services, credit data, or regulated industries.\r\nExposure to Supabase, Firebase, or other cloud-native databases.\r\nKnowledge of Vercel and domain management automation.\r\nStrong focus on scalability, performance, and security best practices.\n\r\n***PLEASE READ ON HOW TO APPLY***\n\r\nHow to Apply:\r\nTo apply for this role, please submit a link to your resume and a brief Loom video (max 2 minutes) introducing yourself and highlighting your skills relevant to the role. In your video, please address the following:\r\nA short introduction of yourself and why you're interested in this role.\r\nYour previous experience as a Full Stack Developer and specific experience with Next JS/Supabase\r\nKey skills or qualifications that make you a strong fit for this position.\n\r\nPlease note: Applications without a video will not be reviewed. We look forward to welcoming a passionate developer who prioritizes clean code, performance optimization, and delivering exceptional user experiences.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:32:41.408642",
      "reason": "Job first discovered"
    }
  ]
}