{
  "job_id": "1380126",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Assistant-for-INTL-E-commerce-Brands-1380126",
  "scraped_at": "2025-07-15T15:43:30.121239",
  "title": "Marketing Assistant for INTL E-commerce Brands",
  "type_of_work": "Full Time",
  "salary": "Negotiable / DOE",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a US-based company with multiple commerce brands - Upgrade to see actual info, Upgrade to see actual info - looking for a versatile, creative, and highly motivated Marketing Assistant to supercharge our marketing, growth, and sales!\n\r\nYou'll be in charge of managing and executing sales and promotional campaigns, email newsletters, content for blog posts, social media, and more. This position is 100% remote-based work.\n\r\nJob Responsibilities:\r\n• Planning, coordinating and executing marketing campaigns for sales and giveaways, etc.\r\n• Creating and sending email newsletters for sales, giveaways, blog posts, etc.\r\n• Working on automated email templates to get more sales\r\n• Project management with other teaUpgrade to see actual infombers for graphics, videos, writing, etc.\r\n• Planning and creating content (with the help of writers) for our website in the form of updates and blog posts\r\n• Find new and creative ways to market our business and sell products\r\n• Gather and analyze marketing data and metrics to make informed decisions\n\r\nWe offer a friendly team and environment communicating internally via Slack and managing projects on ClickUp. To build off of your current skills and experience, we provide additional instructions, examples, and training for everything we’ll require of you. If you’re up for the challenge of managing a multitude of marketing channels with the aim of growing an organization we're looking for you!\n\r\nRequired Qualifications:\r\n• Near-native English speaking and writing skills\r\n• 2-3 years of marketing experience\r\n• Graphic Design / Video Editing skills\r\n• Content and/or Copywriting abilities\r\n• Track record for creating and executing successful marketing campaigns\r\n• Resourceful - The ability to find different resources and get things done\n\r\nPreferred skills - BONUS if you have additional experience or skills in the following areas:\r\n• Online Advertising\r\n• Sales experience\r\n• Public Relations (PR)\r\n• SEO\n\r\nWhen submitting your application, please respond to the following in numbered format. For questions that ask for your thoughts or experience, answer in complete sentences using proper grammar and punctuation. For the others, kindly provide accessible links or file attachments to your work samples.\n\r\n1. How many years of work experience do you have in marketing?\r\n2. What are your thoughts on AI?\r\n3. Share 1–2 examples of successful marketing campaigns you’ve worked on. Walk us through the process from ideation to execution, and include the final results.\r\n4. Provide at least one writing sample (e.g., blog article or sales copy).\r\n5. Share examples of social media posts you’ve created (Facebook, Instagram, Twitter, etc.).\n\r\nNote: Please ensure that any links you submit are viewable (no access requests needed).\n\r\nPlease write \"I AM A MARKETING WHIZ\" in the SUBJECT LINE so I know you did read the entire job description.",
  "skill_requirements": [
    "Copywriting",
    "Graphic Design",
    "Sales"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:40:24.245137",
      "reason": "Job first discovered"
    }
  ]
}