{
  "job_id": "1381914",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-1381914",
  "scraped_at": "2025-07-14T23:10:09.656820",
  "title": "Video Editor",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Position Summary\r\nWe’re looking to grow our creative team with a versatile and highly skilled Creative Designer who excels in graphic design and video editing. If you’re passionate about creating engaging visual content and have an eye for detail, this is an exciting opportunity to work on high-impact projects for some of the biggest automotive brands in the world.\r\nYou’ll collaborate with our in-house U.S. creative team to bring concepts to life across digital channels from ad creatives and motion videos to social media content and beyond. If you also have experience with motion graphics, that’s a huge plus.\r\nKey Responsibilities\r\n? Design compelling static and animated creatives for digital ads, social media, and marketing materials\r\n? Edit short and long-form videos for use across social media platforms like TikTok, Instagram Reels, YouTube, and internal communications\r\n? Apply text overlays, music, transitions, and motion graphics to enhance visual storytelling\r\n? Work with brand guidelines and ensure visual consistency across all assets\r\n? Collaborate with copywriters, media buyers, and account managers to align visuals with marketing objectives\r\n? Handle multiple creative requests with tight deadlines and high accuracy\r\nRequirements\r\n? At least 3 years of professional experience in graphic design and video editing\r\n? Proficiency in design tools such as Adobe Photoshop, Illustrator, Premiere Pro, After Effects, or similar\r\n? Strong portfolio showcasing digital ad creatives, social posts, and video projects\r\n? Experience creating content for social platforms like Meta, TikTok, and YouTube\r\n? Solid understanding of layout, typography, color theory, and motion timing\r\n? Ability to follow brand guidelines while bringing fresh creative ideas\r\n? Strong organizational and communication skills\r\n? Must be available to work 8 AM – 5 PM PST, Monday to Friday\r\n? Reliable internet connection and a distraction-free remote setup\r\nNice to Have\r\n? Experience with motion graphics and animation using Adobe After Effects\r\n? Familiarity with Canva, Figma, or similar collaborative tools\r\n? Knowledge of export settings, fi le formats, and optimizing content for various platforms\r\n? Automotive or performance marketing creative experience\r\nWhat We Offer\r\n? Opportunity to work on campaigns for top automotive manufacturers\r\n? Ongoing training and a chance to grow your skills alongside a professional U.S. creative team\r\n? Overtime hours available based on workload and performance\r\n? A supportive, team-first culture that values quality, speed, and innovation\r\nReady to create high-performing content seen by thousands of viewers daily?\r\nApply now and let’s build something amazing together.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}