{
  "job_id": "1381287",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Success-Representative-1381287",
  "scraped_at": "2025-07-15T12:34:33.328297",
  "title": "Customer Success Representative",
  "type_of_work": "Full Time",
  "salary": "1000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Company: Conserva\r\nLocation: Remote (Must work according to Eastern Standard Time)\r\nSchedule: Full-time, Monday–Friday, 11AM–8PM EST\n\n\r\nAbout Conserva:\r\nConserva is a forward-thinking company dedicated to administering solar system warranties and services. We pride ourselves on delivering exceptional customer support and high-quality service to our clients, all while fostering an inclusive, remote-first work culture. We are excited to welcome talented professionals to join our dynamic team.\n\r\nPosition: Inbound Customer Success Representative\n\r\nWhat You’ll Do:\n\r\n- Handle incoming customer inquiries via phone, email, or chat with a focus on delivering prompt, friendly, and effective service.\r\n- Assist customers with questions regarding solar system warranties, services, and troubleshooting.\r\n- Provide clear and accurate information to help resolve issues or direct customers to the appropriate departments.\r\n- Document customer interactions and update records in our CRM system with precision.\r\n- Collaborate with teaUpgrade to see actual infombers to continuously improve service quality and customer satisfaction.\r\n- Adhere to daily, weekly, and monthly performance targets while maintaining a positive customer experience.\r\n- Provide assistance on other internal tasks as needed.\n\r\nWhat We’re Looking For:\n\r\n- Exceptional Communication: Excellent command of English (both verbal and written) is essential for clear and empathetic customer interactions.\r\n- Customer-Centric Mindset: You’re patient, attentive, and committed to ensuring each customer feels heard and supported.\r\n- Problem-Solving Skills: Ability to troubleshoot and resolve customer concerns effectively.\r\n- Organizational Skills: Strong time-management and record-keeping skills are vital in a remote setting.\r\n- Experience: Previous experience in customer service or a related field is preferred, but enthusiastic and motivated candidates are welcome.\r\n- Remote Readiness: A reliable internet connection, a quiet workspace, and the discipline to work remotely are required.\r\nWhat We Offer:\n\r\nCompetitive Compensation: $1,000 USD per month (with two pay days per month).\n\r\nCareer Growth: Opportunities for professional advancement and development through ongoing training and mentorship.\n\r\nInclusive, Remote-First Environment: Join a diverse international team dedicated to supporting your success—no matter where you’re located.\n\r\nIndustry Impact: Be part of a company that is committed to renewable energy and sustainable solutions.\n\r\nReady to Make a Difference?\r\nAs the first step of the process, please use Upgrade to see actual info to create a free short video of yourself speaking and include the link to this video in your application message.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:34:29.437662",
      "reason": "Job first discovered"
    }
  ]
}