{
  "job_id": "1381826",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-Representive-1381826",
  "scraped_at": "2025-07-15T14:24:24.840066",
  "title": "Customer Service Representive",
  "type_of_work": "Full Time",
  "salary": "500",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Opening: Experienced Customer Service VA (Shopify + Fashion Dropshipping) – Long-Term Role. We’re on the lookout for a skilled and dependable Customer Service Virtual Assistant to join our fast-moving, fashion-focused e-commerce business. If you have a strong background in Shopify customer support and are familiar with the pace and demands of fashion dropshipping, this could be the perfect long-term opportunity for you.\n\r\nWhat We’re Looking For:\n\r\nAt least 2 years of experience in e-commerce customer support\n\r\nMust have hands-on experience with Shopify\n\r\nComfortable working with Google Sheets\n\r\nExcellent written English with a professional, friendly tone\n\r\nFast learner who works efficiently and communicates clearly\n\r\nReliable high-speed internet connection\n\r\nHaving backup internet and/or power is a big advantage\n\r\nFull-time availability and commitment to a long-term position\n\r\nYour Personality & Work Style:\n\r\nYou’re proactive, dependable, and solution-oriented\n\r\nYou take full ownership of your tasks and follow through\n\r\nYou can stick to SOPs but aren’t afraid to think independently\n\r\nYou bring positive energy and enjoy being part of a team\n\r\nYou’re looking for stability, personal growth, and a secure long-term role\n\r\nWhat You’ll Be Doing:\n\r\nResponding to customer inquiries via email using Shopify and our helpdesk tools\n\r\nProcessing returns, refunds, and order adjustments\n\r\nHandling shipping issues and tracking updates\n\r\nKeeping internal records organized in Google Sheets\n\r\nCommunicating with suppliers when necessary\n\r\nSubmitting weekly updates and reporting recurring issues\n\r\nWhat We Offer:\n\r\nA stable, long-term position within a supportive team\n\r\nOn-time weekly payments\n\r\nA respectful, high-performance remote work culture\n\r\nOpportunities to grow and take on more responsibility over time\n\r\n100% remote – work from the comfort of your home\n\r\nHow to Apply:\n\r\nPlease send us the following:\n\r\nA brief introduction about yourself\n\r\nYour resume\n\r\nA short video (1–2 minutes) introducing yourself and explaining your Shopify customer service experience\n\r\nA screenshot of your internet speed test (from speedtest.net)\n\r\nLet us know if you have backup internet and/or power\n\r\nImportant: This role is only open to candidates with proven experience in Shopify, Google Sheets, and e-commerce customer service. Please do not apply if you do not meet these requirements.\n\r\nWe're excited to welcome someone who’s fast, experienced, and ready to grow with us long-term. Think you're the right fit? We’d love to hear from you.",
  "skill_requirements": [
    "Shopify",
    "Customer Service",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:24:24.841648",
      "reason": "Job first discovered"
    }
  ]
}