{
  "job_id": "1381911",
  "url": "https://www.onlinejobs.ph/jobseekers/job/DesignFabrication-Engineer-With-Signage-Industry-Experience-1381911",
  "scraped_at": "2025-07-14T23:06:04.905011",
  "title": "Design/Fabrication Engineer (With Signage Industry Experience)",
  "type_of_work": "Full Time",
  "salary": "$800-$1000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Design/Fabrication Engineer\n\r\nA Design/Fabrication Engineer in the Signage Industry plays a crucial role in conceptualizing, designing, and developing signage systems that align with client requirements, manufacturing capabilities, and industry standards.\n\r\nJob Overview:\r\nThe Design/Fabrication Engineer is responsible for creating and refining engineering designs for custom signage projects, working closely with production, project management, and sales teams to ensure manufacturability and cost-effectiveness. This role requires expertise in CAD software, material selection, structural analysis, fabrication processes and to develop signage solutions that meet aesthetic, functional, and durability requirements.\n\n\r\nKey Responsibilities:\n\r\n1. Signage Design & Development\r\n- Develop 2D and 3D CAD drawings for various signage types, including channel letters, pylon signs, monument signs, LED displays, and architectural signage.\r\n- Ensure designs comply with ADA regulations, UL standards, and local building codes.\r\n- Select appropriate materials (aluminum, acrylic, PVC, vinyl, steel, LED modules, etc.) for each project.\r\n- Work with project managers and clients to customize signage according to brand guidelines and location constraints.\n\r\n2. Technical Documentation & Manufacturing Support\r\n- Prepare detailed engineering drawings, exploded views, and Bill of Materials (BOMs) for fabrication teams.\r\n- Collaborate with manufacturers to troubleshoot design-to-production challenges.\r\n- Ensure signage designs are structurally sound and weather-resistant for outdoor applications.\n\r\n3. Prototype & Testing\r\n- Develop and test sign prototypes before full-scale production.\r\n- Conduct stress analysis and durability tests to ensure long-term performance.\r\n- Optimize designs to reduce costs without sacrificing quality.\n\r\n4. Collaboration & Communication\r\n- Work with sales teams to interpret customer specifications and provide feasibility feedback.\r\n- Assist installation teams by providing mounting and structural reinforcement details.\r\n- Maintain communication with vendors and suppliers for custom components and specialty materials.\n\r\n5. Process Improvement & Innovation\r\n- Research and implement new fabrication technologies and materials to enhance signage quality.\r\n- Improve existing design methodologies for increased efficiency and cost-effectiveness.\n\n\r\nRequired Qualifications & Skills:\n\r\n• Education: Bachelor's degree in Mechanical Engineering, Industrial Design, or related field.\r\n• Experience: Minimum 3-5 years in signage design or related industry.\r\n• Technical Proficiency:\r\n• Expertise in AutoCAD, SolidWorks, Adobe Illustrator, or CorelDRAW.\r\n• Familiarity with LED lighting integration and wiring schematics.\r\n• Knowledge of CNC routing, laser cutting, and sheet metal fabrication.\r\n• Problem-Solving & Analytical Skills: Ability to troubleshoot structural, aesthetic, and installation challenges.\r\n• Regulatory Knowledge: Understanding of building codes, ADA signage guidelines, and UL requirements.\r\n• Strong Communication Skills: Ability to present and explain technical concepts to both technical and non-technical stakeholders.\n\n\r\nPreferred Qualifications:\r\n• Experience in architectural signage and wayfinding systems.\r\n• Background in electrical systems for illuminated signage.\r\n• Familiarity with project management tools (e.g., Upgrade to see actual info)\n\n\n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}