{
  "job_id": "1381944",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Software-Developer-Nextjs-React-Native-1381944",
  "scraped_at": "2025-07-15T15:40:19.623520",
  "title": "Software Developer (Next.js | React Native)",
  "type_of_work": "Full Time",
  "salary": "Php 180,000 / month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "***PLEASE READ ON HOW TO APPLY***\n\r\nJob Title: Software Developer\r\nLocation: Remote\r\nWorking Hours: UK\r\nSalary Range: Php 180,000 per month\r\nA MUST: Minimum of 8 years of solid experience\n\r\nJob Specification: We’re looking for talented Software Developers to join our remote-first team. In this role, you’ll be responsible for building and maintaining responsive, high-performing full-stack web applications using Next.js, Tailwind CSS, and Supabase - as well as developing cross-platform mobile applications using React Native.\r\nOur ideal candidate writes clean, maintainable code, takes ownership of their work, and thrives in a fast-paced startup environment where autonomy, communication, and craftsmanship are valued.\n\r\nKey Responsibilities\r\nBuild and maintain full-stack web applications using Next.js, Tailwind CSS, and Supabase.\r\nDevelop and deploy mobile applications using React Native for both iOS and Android.\r\nImplement responsive UI designs and efficient backend logic.\r\nIntegrate and maintain third-party APIs.\r\nCollaborate asynchronously with a remote team across different time zones.\r\nParticipate in code reviews, share knowledge, and continuously improve engineering practices.\r\nWrite testable, well-documented, and scalable code for both web and mobile platforms.\n\r\nRequired Skills\r\nStrong proficiency in TypeScript, React, and Next.js.\r\nExperience with React Native and mobile development tools (e.g., Expo, Xcode, Android Studio).\r\nDeep understanding of Tailwind CSS and responsive design principles.\r\nExperience working with Supabase and relational databases (e.g., PostgreSQL).\r\nAbility to read and integrate third-party API documentation.\r\nFamiliarity with CI/CD pipelines, version control (Git), and modern development workflows.\r\nAbility to work independently, manage time effectively, and communicate clearly in a remote environment.\r\nSolid problem-solving skills and attention to detail.\n\r\n***PLEASE READ ON HOW TO APPLY***\n\r\nHow to Apply:\r\nTo apply for this role, please submit a link to your resume and a brief Loom video (max 2 minutes) introducing yourself and highlighting your skills relevant to the role. In your video, please address the following:\r\nA short introduction of yourself and why you're interested in this role.\r\nYour previous experience as a Full Stack Developer and specific experience with Next JS/Supabase\r\nKey skills or qualifications that make you a strong fit for this position.\n\r\nPlease note: Applications without a video will not be reviewed. We look forward to welcoming a passionate developer who prioritizes clean code, performance optimization, and delivering exceptional user experiences.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:24:01.415966",
      "reason": "Job first discovered"
    }
  ]
}