{
  "job_id": "1382977",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Eligibility-and-BenefitsInsurance-Verification-Care-Concierge-Specialist-1382977",
  "scraped_at": "2025-07-15T15:43:52.737339",
  "title": "Eligibility and Benefits/Insurance Verification/ Care Concierge Specialist",
  "type_of_work": "Full Time",
  "salary": "500-800",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Join Our Innovative and Impactful Team as a Remote Eligibility and Benefits/Care Concierge Specialist!\r\nWe invite you to join us in making a difference in the lives of families and individuals seeking autism diagnosis, with the flexibility and autonomy provided by contracted remote work. At Autism Diagnosis Group, we are at the forefront of transforming autism diagnosis and support.\n\r\nLocation: Remote\n\r\nAbout Us:\r\nWe are a pioneering startup dedicated to transforming the landscape of autism diagnosis through remote evaluations. Our mission is to provide accessible, comprehensive, and accurate autism diagnostic services to individuals and families, regardless of their location. We are looking for passionate individuals to join our innovative team.\n\r\nThe Process:\r\nAs part of the interview process, we will expect you to do a small presentation so please only apply if you are able to do a presentation. Also, as we get a lot of interview requests, in your request, please indicate why this would be a good opportunity for you, a little about your background and, most importantly, what is the answer to 3+9. Yes, its a very simple answer, but we want someone who will pay attention to details and be interested in this job.\n\r\nPosition Overview:\r\nWe are seeking a dedicated Eligibility and Benefits/Care Concierge Specialist to be the primary point of contact for our clients. The Eligibility and Benefits/Care Concierge Specialist will help families and individuals schedule autism diagnostic evaluations, support them in assembling pre-visit assessments, guide them through the diagnostic process, and provide additional support after a diagnosis, while representing our company with professionalism and empathy.   Additionally, a major part of your day to day will be running eligibility and benefits checks for families and individuals.  \n\r\nKey Responsibilities:\r\n• Verifying patient eligibility and benefits accurately and timely\r\n• Recording information clearly and consistently\r\n• Communicating information quickly with teaUpgrade to see actual infombers  to ensure smooth patient flow and experience\r\n• Contact individuals and families and advise of financial responsibilities including out-of-network insurance options\r\n• Communicating information quickly with teaUpgrade to see actual infombers  to ensure smooth patient flow and experience\r\n• Knowledge of payor portals to understand benefits.\n\n\r\nOther Responsibilities\r\n • Assist families and individuals in scheduling autism diagnostic evaluations\r\n • Walk clients through the diagnostic process and set expectations\r\n • Collect and verify necessary information (e.g., insurance, pre-visit assessments) ahead of upcoming appointments\r\n • Serve as the face of the company, providing excellent customer service and support\r\n • Communicate effectively with clients, addressing any questions or concerns\r\n • Maintain accurate records and documentation\r\n • Help patients navigate care following a diagnosis (e.g., research clinicians/care centers in their area and provide a referral)\r\n • Perform ad hoc research projects to help improve our team's operations\n\r\nQualifications:\r\n • Fluency in English, ability to work largely EST or PST hours\r\n • Private work-from-home set-up to avoid disruptions\r\n • Excellent communication and interpersonal skills\r\n • A resourceful and resilient attitude, ability to manage your own work\r\n • Strong organizational skills and attention to detail\r\n • Experience in customer service\r\n • Proficient in Microsoft Office and experience with EHR systems is a plus!\r\n • Experience in prior authorization and insurance processes.\r\n • Knowledge of medical terminology and clinical guidelines.\n\r\nWhat We Offer:\r\n • Competitive compensation\r\n • Flexible remote working opportunities\r\n • A supportive and innovative work environment and the opportunity to make an impact in the field of autism diagnosis",
  "skill_requirements": [
    "Claims Processing",
    "Prior Authorization",
    "Insurance Verification"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:25:29.467232",
      "reason": "Job first discovered"
    }
  ]
}