{
  "job_id": "1382543",
  "url": "https://www.onlinejobs.ph/jobseekers/job/CPA-Bookeeper-Must-work-with-Odoo-1382543",
  "scraped_at": "2025-07-15T14:33:41.354139",
  "title": "CPA / Bookeeper - Must work with Odoo",
  "type_of_work": "Any",
  "salary": "$400/Month",
  "hours_per_week": "15",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking a detail-oriented and technically proficient Certified Public Accountant (CPA) with a specialization in Odoo ERP to join our team. The ideal candidate will be responsible for managing financial operations within the Odoo platform, ensuring accounting best practices are followed during ERP implementation, configuration, and ongoing financial operations.\n\r\nKey Responsibilities:\r\nLead the configuration and customization of Odoo Accounting modules (Accounts Payable, Accounts Receivable, General Ledger, Payroll, etc.)\r\nEnsure compliance with GAAP and other regulatory accounting standards within the Odoo environment.\r\nCollaborate with cross-functional teams (IT, operations, sales, etc.) to integrate accounting with other ERP modules.\r\nAnalyze and validate data migration from legacy systems to Odoo.\r\nMonitor financial transactions and reporting in Odoo to ensure accuracy and efficiency.\r\nTrain and support finance and accounting staff on Odoo functionalities and workflows.\r\nParticipate in audits and provide financial reports using Odoo’s reporting tools.\r\nOptimize workflows and suggest best practices for financial processes within Odoo.\n\r\nQualifications:\r\nCPA license (active or in good standing).\r\n3+ years of accounting experience, with at least 1-2 years working directly with Odoo ERP.\r\nStrong understanding of Odoo’s Accounting and Finance modules.\r\nExperience with Odoo v13 or later preferred.\r\nFamiliarity with tax compliance, multi-currency, and multi-company setups within Odoo.\r\nProficiency in Excel and financial analysis tools.\r\nExcellent analytical, organizational, and communication skills.\r\nPreferred:\r\nOdoo functional certification.\r\nExperience with Odoo Studio or Python for automation/customization.\r\nBackground in ERP implementation or accounting systems migration.",
  "skill_requirements": [
    "Accounting",
    "Bookkeeping",
    "Odoo"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:29:11.274554",
      "reason": "Job first discovered"
    }
  ]
}