{
  "job_id": "1383461",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Support-VA-Experienced-Shopify-Fashion-E-commerce-1383461",
  "scraped_at": "2025-07-15T14:41:10.409092",
  "title": "Customer Support VA Experienced (Shopify & Fashion E-commerce)",
  "type_of_work": "Any",
  "salary": "500",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you an experienced Virtual Assistant with a passion for fashion and top-tier customer service? We're a fast-paced e-commerce brand in the fashion dropshipping space, and we’re seeking a Customer Support VA who’s tech-savvy, detail-oriented, and ready to grow with us.\n\r\nIf you’re skilled in Shopify, confident in your communication, and organized in handling support operations, we’d love to hear from you.\n\r\nWhat You’ll Bring to the Table:\r\nA minimum of 2 years in e-commerce customer support\n\r\nSolid, hands-on knowledge of the Shopify platform\n\r\nFluent, professional English writing skills\n\r\nFamiliarity with Google Sheets for tracking and internal updates\n\r\nHigh-speed internet with reliable performance (speed test screenshot required)\n\r\nBonus if you have backup internet and/or power supply\n\r\nCommitted to a full-time schedule and looking for long-term growth\n\r\nIdeal Candidate Profile:\r\nYou take initiative and don’t wait to be told what to do\n\r\nYou’re dependable and deliver consistent results\n\r\nYou’re comfortable working with SOPs but can also adapt and think on your feet\n\r\nYou enjoy problem-solving and turning customer issues into positive experiences\n\r\nYou’re looking for a stable role with room to expand your responsibilities\n\r\nDay-to-Day Tasks Include:\r\nResponding to customer queries via email and helpdesk tools\n\r\nManaging returns, refunds, and order modifications\n\r\nAddressing shipping delays, tracking requests, and other logistics concerns\n\r\nKeeping data organized in shared Google Sheets\n\r\nCoordinating with suppliers for updates and problem resolution\n\r\nProviding clear weekly updates and raising recurring issues to management\n\r\nWhat You’ll Get in Return:\r\nA secure, long-term role with a reliable e-commerce brand\n\r\nWeekly payments delivered on time\n\r\nA strong, supportive remote culture that values your input\n\r\nFlexibility to work from home\n\r\nOpportunities to expand your responsibilities and grow your role\n\r\nReady to Apply?\r\nPlease send us the following:\n\r\nA brief written introduction about who you are\n\r\nYour up-to-date resume\n\r\nA short video (1–2 minutes) describing your customer support background and Shopify experience\n\r\nA screenshot of your internet speed (speedtest.net)\n\r\nMention if you have a backup power source or internet connection\n\r\nNote: Only candidates with proven experience in Shopify, Google Sheets, and e-commerce customer support will be considered.",
  "skill_requirements": [
    "Customer Support",
    "Customer Service",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:41:10.411255",
      "reason": "Job first discovered"
    }
  ]
}