{
  "job_id": "1383459",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-Virtual-Assistant-Experienced-Shopify-Fashion-Dropshipping-1383459",
  "scraped_at": "2025-07-15T14:29:34.892082",
  "title": "Customer Service Virtual Assistant (Experienced) (Shopify + Fashion Dropshipping)",
  "type_of_work": "Full Time",
  "salary": "500",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Now Hiring: Experienced Customer Service Virtual Assistant (Shopify + Fashion Dropshipping)\r\nFull-Time | Remote | Long-Term Opportunity\n\r\nAre you a seasoned Customer Support VA with a passion for fashion and e-commerce? We’re a fast-growing online fashion dropshipping brand searching for a dedicated, skilled, and reliable Virtual Assistant to handle customer service operations and help deliver an exceptional shopping experience.\n\r\nThis is a long-term, full-time remote role ideal for someone who thrives in a dynamic, fast-paced environment and has hands-on experience with Shopify and fashion dropshipping.\n\r\nWho We're Looking For:\r\n2+ years experience in e-commerce customer support\n\r\nProficient with Shopify (essential)\n\r\nConfident using Google Sheets for tracking and data entry\n\r\nStrong written English – clear, friendly, and professional tone\n\r\nSelf-starter with a quick learning curve and solid organizational skills\n\r\nReliable internet connection (screenshot required)\n\r\nBackup internet and/or power is a strong plus\n\r\nReady for a long-term commitment and career growth\n\r\nYour Work Style & Personality:\r\nYou’re proactive, dependable, and love solving problems\n\r\nYou take ownership and follow through on your responsibilities\n\r\nYou follow SOPs but also think independently when needed\n\r\nYou bring positive energy and value team collaboration\n\r\nYou want stability, growth, and to become part of something long-term\n\r\nKey Responsibilities:\r\nRespond promptly to customer inquiries via email and Shopify helpdesk tools\n\r\nProcess returns, refunds, and resolve order-related issues\n\r\nHandle shipping inquiries and tracking updates\n\r\nMaintain accurate internal records in Google Sheets\n\r\nLiaise with suppliers for order and shipping concerns\n\r\nShare weekly progress reports and highlight recurring issues\n\r\nWhat We Offer:\r\nA stable, long-term remote role in a supportive team\n\r\nWeekly on-time payments\n\r\nRespectful, high-performance remote work culture\n\r\nOpportunities to grow into expanded roles\n\r\n100% work-from-home flexibility\n\r\nHow to Apply:\r\nTo be considered, please send the following:\n\r\nA short introduction about yourself\n\r\nYour resume\n\r\nA 1–2 minute video introducing yourself and your Shopify customer support experience\n\r\nA screenshot of your internet speed test (use speedtest.net)\n\r\nConfirmation of whether you have backup internet and/or power\n\r\nImportant: Only applicants with proven Shopify, Google Sheets, and e-commerce customer support experience will be considered. Please do not apply if you do not meet these requirements.",
  "skill_requirements": [
    "Shopify",
    "Customer Service",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:29:34.893664",
      "reason": "Job first discovered"
    }
  ]
}