{
  "job_id": "1383196",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Media-Buyer-Meta-Ads-Expert-1383196",
  "scraped_at": "2025-07-14T23:09:39.563929",
  "title": "Media Buyer / Meta Ads Expert",
  "type_of_work": "Full Time",
  "salary": "CAD 1000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Title: Media Buyer / Meta Ads Expert\r\nLocation: [Insert Location or \"Remote\"]\r\nJob Type: [Full-time / Part-time / Contract]\r\nDepartment: Marketing / Performance Marketing\n\r\nAbout Us:\r\nOmega Ads is a fast-growing E-commerce brand dedicated to delivering exceptional products/services to our audience. We are seeking a results-driven and data-savvy Media Buyer / Meta Ads Expert to join our performance marketing team. If you live and breathe paid traffic, and Meta Ads Manager is your playground, we want to hear from you.\n\r\nKey Responsibilities:\r\nPlan, execute, and optimize paid media campaigns on Meta platforms (Facebook, Instagram).\n\r\nManage campaign structures, ad sets, and creatives for maximum performance and efficiency.\n\r\nConduct A/B testing of creatives, copy, audiences, and landing pages to drive conversions.\n\r\nMonitor campaign performance daily and make data-driven decisions to scale or pivot.\n\r\nReport on KPIs, ROAS, CAC, CPM, CTR, and other relevant metrics to key stakeholders.\n\r\nCollaborate with creative and content teams to develop high-converting ad creatives.\n\r\nStay up to date with Meta ad platform changes, trends, and algorithm updates.\n\r\nConduct audience research and competitor analysis to inform targeting strategy.\n\r\nImplement tracking and attribution strategies (Meta Pixel, Events Manager, UTM tagging, etc.).\n\n\r\nRequirements:\r\n3+ years of hands-on experience running Meta Ads with demonstrable results.\n\r\nProven track record of managing large-scale paid campaigns with positive ROAS.\n\r\nStrong analytical skills and proficiency in tools like Meta Ads Manager, Google Analytics, etc.\n\r\nKnowledgeable with Hyros for Ad Optimization and Tracking\n\r\nExperience with funnel strategies, including lead generation, e-commerce, retargeting, and lookalike audiences.\n\r\nExcellent understanding of ad policies, attribution windows, and iOS 14+ impact.\n\r\nAbility to write compelling ad copy and collaborate on creative concepts.\n\r\nStrong communication and organizational skills.\n\r\nBonus: Experience with other platforms (Google Ads, TikTok, LinkedIn, etc.) is a plus.\n\r\nWhat We Offer:\r\nCompetitive salary and performance bonuses\n\r\nRemote-friendly culture\n\r\nOpportunity to work with a passionate, high-performing team\n\r\nCareer growth opportunities in a fast-paced environment\n\r\n15th and 30th Salary Schedule\n\r\nHow to Apply:\r\nSubmit your resume and a brief cover letter outlining your Meta Ads experience and key campaign results. Portfolios or case studies are highly encouraged. Email us at Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}