{
  "job_id": "1383722",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Customer-Service-Represantive-VA-1383722",
  "scraped_at": "2025-07-15T15:43:25.614979",
  "title": "Shopify Customer Service Represantive VA",
  "type_of_work": "Full Time",
  "salary": "3$ per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a growing fashion e-commerce company operating multiple Shopify stores, and we're looking for a highly experienced, fast, and tech-savvy Customer Service Representative to join our remote team.\n\r\nThis is not an entry-level role. You must have real experience using Shopify, be comfortable working at high speed, and know how to use ChatGPT to improve your efficiency and communication.\n\r\nWhat You’ll Do\r\nAs our Customer Service Rep, you’ll handle incoming customer support requests via email (and sometimes chat), resolve order-related questions, process refunds or reshipments when needed, and provide high-quality service that reflects our brand.\n\r\nKey Responsibilities\r\n• Respond to at least 15+ customer emails per hour\r\n• Resolve Shopify-related inquiries (order status, tracking, returns, issues)\r\n• Use Shopify admin to find order details, create refunds, edit orders, etc.\r\n• Work efficiently with ChatGPT to improve response speed and tone\r\n• Maintain a friendly, professional, and brand-aligned voice\r\n• Report common customer complaints or product issues\r\n• Follow internal guidelines and escalation protocols\r\n• Work independently and stay focused during your shift\n\r\nRequirements\r\n• Proven experience handling customer support in Shopify\r\n• Able to confidently use Shopify to search, edit, and manage orders\r\n• Fast and accurate typing skills (you’ll need to keep up with the pace)\r\n• Stable and fast internet connection, with a backup in case of outages\r\n• Comfortable using ChatGPT to support customer communication\r\n• Fluent in English (written is most important)\r\n• Reliable, proactive, and able to work independently\r\n• Available for part-time or full-time work depending on your availability\r\n• You must be organized, responsive, and customer-focused\n\r\nNice to Have (but not required)\r\n• Experience using customer service tools like Gorgias, Zendesk, etc.\r\n• Fashion or dropshipping industry experience\r\n• Previous experience managing multiple stores or brands\n\r\nWhat We Offer\r\n• Long-term remote work\r\n• Flexible hours and workload based on your performance\r\n• Supportive international team\r\n• Clear systems, SOPs, and workflows\r\n• Opportunity to grow into other roles if you perform well\n\r\nHow to Apply\r\nTo apply, please send:\r\n• Your resume\r\n• A short message explaining your Shopify customer service experience\r\n• Your average email reply speed (how many emails per hour you currently handle)\r\n• A quick note confirming your internet speed and backup setup\n\r\nThis role is for someone who’s fast, experienced, organized, and tech-savvy. If you’re confident in your Shopify and customer support skills — we’re excited to meet you.",
  "skill_requirements": [
    "Shopify",
    "Google Sheets",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:28:18.314318",
      "reason": "Job first discovered"
    }
  ]
}