{
  "job_id": "1383076",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Assistant-Manager-With-Experienced-Digital-Marketing-1383076",
  "scraped_at": "2025-07-15T12:35:48.823832",
  "title": "Assistant Manager With Experienced Digital Marketing",
  "type_of_work": "Full Time",
  "salary": "Depending on Experience",
  "hours_per_week": "48",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Title: Assistant Manager With Experienced Digital Marketing \r\nLocation: Remote\r\nSalary: Depending on Experience\r\nSchedule: Full-time, 6 days a week, Monday to Saturday (EST Time)\r\nCompany: 3w\n\r\nAbout the Role:\r\nJoin a growing and dynamic company where your skills and experience will make a real impact! We are looking for a highly organized and detail-oriented Project Manager Assistant to support our project management team. The ideal candidate will have at least five years of experience in a similar role, demonstrating exceptional communication, problem-solving, and multitasking abilities. This position plays a key role in ensuring projects run smoothly, deadlines are met, and stakeholders remain informed.\n\r\nKey Responsibilities:\r\nSupervise and motivate teaUpgrade to see actual infombers to meet performance goals\r\nEnsure high standards of customer service and operational efficiency\r\nAssist with scheduling, training, and staff development\r\nHandle customer issues, inventory, and reporting as needed\r\nDeveloping and executing integrated marketing strategies to generate leads and boost brand engagement.\r\nCandidate is highly organized, dependable, and comfortable working in a fast-paced, fully remote environment.\r\nRunning the day-to-day execution of all projects (launches, webinars, client onboarding, VA workflow, etc.)\r\nHelping maintain and improve internal systems, workflows, and SOPs\r\nCommunicating with clients, helping us meet their needs better\r\nKeeping documents, campaign trackers, and tools up to date\r\nHelping with documentation tasks when needed\n\n\r\nQualifications & Requirements Must-Have: \r\nOnly candidates with proven leadership and management experience will be considered.\r\nA strong track record in management is required.\r\nProven management experience \r\nStrong leadership and communication skills\r\nAbility to multitask and manage time effectively\r\nProblem-solving mindset and attention to detail\r\nComfortable with operational systems and basic reporting tools\r\nMust be adaptable, dependable, and solution-oriented.\n\n\r\nWhy Join Us?\r\nBe part of a fast-growing company with exciting career opportunities.\r\nWork in a collaborative and innovative environment.\r\nProfessional growth and development opportunities.\n\r\nIf you are interested and meet the qualifications, please email your updated resume with the subject line \"Assistant Manager.\"\n\r\nQualified candidates will be contacted for an initial interview. We appreciate your interest in joining our team!",
  "skill_requirements": [
    "Performance Marketing",
    "CRM",
    "Project Management"
  ],
  "is_active": true,
  "status_history": []
}