{
  "job_id": "1383114",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Performance-Analyst-Real-EstateTitle-Insurance-Industry-1383114",
  "scraped_at": "2025-07-14T23:09:19.873266",
  "title": "Performance Analyst (Real Estate/Title Insurance Industry)",
  "type_of_work": "Full Time",
  "salary": "Based on years of experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "PLEASE APPLY THROUGH THIS LINK: \nUpgrade to see actual info\n\r\nAbout Us:\r\nWith over 100 years of combined industry experience, the Community Minerals team specializes in the purchase of mineral or royalty rights all over the US. We have earned a stellar reputation with hundreds of satisfied customers and an “A” Rating with the Better Business Bureau. With our proven track record, we continue to serve mineral owners in several states with transparency, accountability, and a personalized experience to meet individual needs.\n\r\nJob Summary:\r\nThe Performance Analyst will be responsible for processing business processes and initiatives to ensure the attainment of the organization’s goals and objectives. This role is also responsible for activities that support the creation and management of dashboards and reports, which will guide the management’s decision-making process. \n\r\nJob Description:\r\nBuilding and designing reports from multiple data sources, exported from varied systems and tools\r\nGenerating and updating daily, weekly, monthly, and yearly KPI reports to be used in tracking and evaluating team performance \r\nWork in direct partnership with leadership to understand the organization's needs around data analysis and data processing aimed toward implementing data-driven decisions \r\nAccountable for real-time reporting, documenting, and diagnosing trends on key performance metrics. \r\nImplementing processes for data collection, cleanup, maintenance, analysis, forecasting, and validation for organization-wide data \r\nExecute marketing response forecasts and own the development and implementation of staffing and metric models, reporting, and analysis. \r\nDevelop, maintain, and update process-related handbooks for all aspects of the role\n\n\r\nQualifications:\r\nEducation:\r\nBachelor’s Degree in Mathematics, Statistics, Computer Science, Economics, Data Science or a related field\n\r\nExperience:\r\n1-3 years of experience in performance metric analysis\r\nProven experience in data analysis, report generation, and performance analysis is required\r\nExperience in data analysis tools and software is a plus\r\nExperience with cross-functional teams and collaborating with leadership is a plus\r\nPrior US Title Company work experience highly preferred\n\r\nTechnical Skills:\r\nProficiency in CRM Software\r\nMust have Structured Query Language Skills \r\nIntermediate to advanced proficiency in Microsoft Excel/ Google Sheets\r\nInquisitive and analytical to understand root causes and patterns in data\r\nExperience in workforce management with a call center company is an advantage \r\nStrong knowledge of data collection, data clean-up, and data visualization techniques\r\nFamiliarity with statistical analysis and forecasting techniques\n\r\nAdditional Skills:\r\nExcellent Organization skills to handle multiple tasks within set deadlines \r\nExcellent oral and written communication skills to effectively convey information and develop presentations for multiple levels of the organization\r\nStrong quantitative skills in data management and application of statistical tools and models \r\nProblem-solving and analytical skills\r\nAbility to work independently and as part of a team \n\r\nSystem Requirements:\r\nTo ensure optimal performance and functionality while using different web and application tools, please make sure that your systeUpgrade to see actual infoets the following requirements:\n\r\nOperating System:\r\n- Windows: Windows 8.1 (64-bit) or higher\r\n- macOS: macOS 10.13 (High Sierra) or higher\n\r\nProcessor:\r\n- Intel: Skylake-class 6th Gen i3, i5, or i7 processor or higher\r\n- AMD: Excavator-class (2015) processor or higher\n\r\nMemory (RAM):\r\n- A minimum of 8 GB of RAM is required.\n\r\nJob Type: Full-time\n\n\r\nBenefits:\r\nHealth insurance\r\nLife insurance\r\nSchedule: 8-hour shift",
  "skill_requirements": [
    "Data Analytics",
    "Microsoft Excel",
    "SQL"
  ]
}