{
  "job_id": "1383758",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-and-Data-Analyst-1383758",
  "scraped_at": "2025-07-15T14:35:02.235873",
  "title": "Sales and Data Analyst",
  "type_of_work": "Full Time",
  "salary": "up to $1500",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Please Read The Entire Job Description and Requirements for Applying to this role\n\r\nWe’re seeking a highly organized and detail-oriented Sales Coordinator to support a U.S.-based sales and marketing team. This remote position requires someone who thrives in structured environments, enjoys working with data, and can independently manage multiple priorities after onboarding.\n\r\nYou’ll play a critical role in keeping product listings accurate, tracking sales performance, managing internal coordination, and supporting both pre- and post-sales efforts. If you’re analytical, loyal, and ready to commit to a long-term opportunity with a stable team—this role is for you.\n\n\r\nPerks & Benefits\n\r\n- Paid in **USD**, every **15th and 30th** of the month\r\n- Up to **14 days of Paid Time Off** annually\r\n- Observance of **Philippine Regular Holidays** (paid)\r\n- **100% remote** – work from anywhere in the Philippines\r\n- Training provided and integration into U.S. company systems\r\n- Develop hands-on experience with sales operations, marketing, and analytics\n\n\n\r\nWhat You’ll Do\n\r\n- Manage and update product content (titles, descriptions, etc.) across platforms\r\n- Verify accuracy of online product listings and submit corrections when needed\r\n- Handle setup of new product items for customers\r\n- Run and interpret sales reports to identify data inconsistencies, trends, and opportunities\r\n- Provide internal sales support by maintaining notes, tracking action items, and assisting during campaigns\r\n- Coordinate with logistics and inventory teams for accurate supply chain updates (VMI support included)\r\n- Track marketing initiatives and assist with event-related materials\r\n- Schedule and post content on TikTok; track engagement and effectiveness\r\n- Maintain clear documentation and communication logs with house accounts\r\n- Proactively monitor team performance and propose process improvements\r\n- Act as a backup support for other internal roles when needed\n\r\nWho You Are\n\r\n- At least **2 years of experience** in a sales coordinator or administrative role\r\n- Proficient in **Excel** (VLOOKUPs, filters, pivot tables) and **data entry**\r\n- Comfortable with tools like **Microsoft Office**, **Zoom**, and **Teams**\r\n- Experience with Canva or similar design tools is a plus\r\n- Familiarity with logistics or manufacturing environments is an advantage but not required\r\n- Detail-oriented with **strong analytical thinking** (\"Does this make sense?\")\r\n- Excellent English communication skills – written, verbal, and active listening\r\n- Self-starter who can work independently after training\r\n- Committed to **long-term collaboration** and team growth\r\n- Degree in Business Administration or relevant field preferred\n\r\nHow to Apply\n\r\n1. Submit your **updated resume**\r\n2. Submit a **video introduction** explaining your interest and relevant experience\r\n4. Please see the Homework Assignment instruction via this link and try completion it as soon as you are able to: Upgrade to see actual info\n\r\nLet us know ahead if you need to submit your resume and loom link 1st and proceed in completing the homework assignment.\n\r\nThis is an exciting opportunity to become an integral part of a collaborative, U.S.-based team. If you’re organized, process-driven, and looking for a stable remote role with growth potential—apply now!",
  "skill_requirements": [
    "Admin Data Processing",
    "Data Analytics",
    "Sales"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:30:21.317273",
      "reason": "Job first discovered"
    }
  ]
}