{
  "job_id": "1383717",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1383717",
  "scraped_at": "2025-07-14T23:08:02.815612",
  "title": "Leasing and Maintenance Coordinator - ResMan expert",
  "type_of_work": "Full Time",
  "salary": "$7 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Key Responsibilities:\n\r\nProperty Operations Support: Assist the onsite and back end team in overseeing the day-to-day operations of residential properties.\n\r\nResMan Reports: Assist in the preparation and customization of reports based on what the owners/management needs.\n\r\nMarketing & Leasing: Backend assistance with marketing vacant units, conducting property showings, processing rental applications, and ensuring that the leasing process runs smoothly.\n\r\nVendor Management: Assist with vendor management, including securing bids for services, reviewing contracts, and ensuring vendors meet quality and service standards.\n\r\nCompliance & Documentation: Ensure properties remain in compliance with local, state, and federal regulations. Maintain accurate and up-to-date property files and records.\n\r\nQualifications:\n\r\nNON NEGOTIABLE: At least 2 years of proven experience with ResMan Software\n\r\nTechnical Skills: Proficient in Microsoft Office Suite (Excel, Word, PowerPoint).\n\r\nCommunication: Excellent written and verbal communication skills with the ability to interact effectively with tenants, vendors, and teaUpgrade to see actual infombers remotely.\n\r\nOrganizational Skills: Strong attention to detail, ability to manage multiple tasks simultaneously, and work independently in a remote environment.\n\r\nProblem-Solving: Ability to address issues quickly and efficiently, with a customer service-oriented mindset.\n\r\nKnowledge: Basic understanding of real estate laws, tenant-landlord regulations, and property maintenance procedures.\n\r\nRemote Work Capability: Must have a reliable internet connection, home office setup, and the ability to work independently in a remote work environment.",
  "skill_requirements": [
    "Property Management",
    "Real Estate"
  ]
}