{
  "job_id": "1386619",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1386619",
  "scraped_at": "2025-07-14T23:08:27.932542",
  "title": "Sales Development Representative (SDR)",
  "type_of_work": "Any",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Digital Flo isn't just another \"AI agency\" — we're engineers of AI-first client acquisition systems that think, speak, and convert like your best teaUpgrade to see actual infomber, 24/7. Our AI Social Flo System™ represents our conviction that true business freedom comes from intelligent systems that operate with precision, consistency, and relentless efficiency.\r\nWe don't build businesses to create jobs. We build businesses to create freedom — for ourselves and our clients.\n\r\nWe're looking for a tech-savvy, systems-oriented SDR who understands that the future isn't hiring more people—it's building smarter systems.\n\r\nKey Responsibilities:\r\n-Problem-First Qualification: Apply our Problem-First Doctrine to qualify prospects based on their operational pain points, not just industry labels\r\n-Strategic Outreach: Craft personalized, high-impact outreach campaigns \r\n-System Optimization: Provide feedback to continuously improve our AI qualification and conversation systems\r\n-Appointment Setting: Work with our AI agents to ensure qualified prospects are seamlessly moved to booked calls\r\n-Data Analysis: Monitor performance metrics and suggest improvements to our client acquisition engine\n\r\nWho We're Looking For:\r\nSomeone who values automation and systems over manual labor\r\nA strategic thinker who can identify businesses with our specific pain point criteria:\r\n-Lead leakage issues\r\n-People-dependent operations\r\n-Scaling limitations\r\n-Brand inconsistency\r\nAn action-oriented professional who makes decisions based on value, not just cost\r\nA clear communicator who can articulate complex value propositions\n\r\nRequirements:\r\n2+ years of sales development or related experience\r\nExperience with CRM systems and sales automation tools\r\nDemonstrated ability to qualify leads based on complex criteria\r\nStrong analytical skills and data-driven decision making\r\nExcellent written and verbal communication\r\nComfort with technology and willingness to learn new systems\r\nSelf-motivated with the ability to work independently\n\r\nWhat Sets This Role Apart:\r\nYou won't be making hundreds of cold calls daily or sending generic templates. You'll be partnering with AI to work smarter:\r\nOur AI handles initial outreach and follow-up at scale\r\nYou focus on strategic prospects and high-value conversations\r\nYou'll help train AI systems rather than being replaced by them\r\nYou'll work with businesses ready for transformation, not those resistant to change\n\r\nWhy Join Digital Flo:\r\nBe at the forefront of AI-enhanced sales development\r\nWork with a team that values systems thinking and innovation\r\nDevelop skills that position you for the future of sales\r\nCompensation structure that rewards quality over quantity\r\nOpportunity to influence the evolution of our AI systems\n\r\nHow to Apply:\r\nSubmit your resume and a short Loom intro video sharing your experience in the Sales Development role.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}