{
  "job_id": "1386397",
  "url": "https://www.onlinejobs.ph/jobseekers/job/eCommerce-Specialist-1386397",
  "scraped_at": "2025-07-15T07:46:03.117978",
  "title": "eCommerce Specialist",
  "type_of_work": "Full Time",
  "salary": "$7/hour + bonuses",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Please read this carefully to the end. If you do not, I will not respond to your application. Attention to detail is key.\n\r\nI am looking for a highly capable and proactive eCommerce Manager to help oversee the day-to-day operations of our online storefronts (Shopify and Amazon). This is for a FULL-TIME role, with opportunity for greater growth and responsibility as we scale.\n\r\nOur company manages multiple eCommerce brands, including gear, apparel, and supplements — all tied to the martial arts and fitness space. You will play a key role in ensuring the smooth operation, growth, and profitability of these online stores.\n\r\nKey Responsibilities:\r\neCommerce Management (Primary Focus)\r\nOversee and maintain Shopify and Amazon Seller Central storefronts\n\r\nManage product listings, pricing, and inventory levels across platforms\n\r\nCoordinate with manufacturers, printers, or fulfillment centers (e.g., Printful, local vendors, or private suppliers)\n\r\nHandle order issues, returns, and customer service messages from both platforms\n\r\nTrack and reconcile sales, inventory, and shipping data\n\r\nEnsure smooth product launches, including uploading creatives, scheduling promotions, and coordinating logistics\n\r\nAdvertising & Marketing\r\nSet up and optimize ads on Amazon (PPC, Sponsored Products, etc.)\n\r\nManage Shopify-integrated ad campaigns using Facebook Ads or Google Shopping\n\r\nHelp write ad copy, select creatives, and track performance\n\r\nCoordinate with the content team to develop product marketing materials, videos, and launch campaigns\n\r\nContent Creation & Product Assets (Bonus)\r\nCreate or coordinate product images, mockups, and social content using Canva or Adobe tools\n\r\nCollaborate on product descriptions and email campaigns\n\r\nManage customer reviews and social proof generation strategies\n\r\nSoftware & Tools (Must Have Experience With at Least Some of These):\r\neCommerce Platforms: Shopify, Amazon Seller Central\n\r\nAdvertising: Amazon Ads, Meta Ads Manager, Google Ads\n\r\nProject Management (Preferred): Slack, ClickUp\n\r\nDesign/Marketing Tools: Canva, Adobe Photoshop or Illustrator (bonus)\n\r\nAnalytics & Reporting: Google Sheets, Shopify Analytics, Amazon Seller Reports\n\r\nFulfillment/Production Tools: Printful, Pirate Ship, Oberlo, or similar\n\r\nWhat We’re Looking For:\r\nAt least 2 years managing Shopify and/or Amazon stores\n\r\nStrong communication skills — especially for working with vendors and manufacturers\n\r\nExperience running and optimizing eCommerce ads\n\r\nAbility to solve problems independently, prioritize tasks, and keep things moving\n\r\nClear understanding of product launch timelines, inventory planning, and customer experience\n\r\nThis role is part-time or project-based with flexible hours, but we need someone reliable, self-motivated, and excited to take ownership over the eCommerce side of the business.\n\r\nTo ensure you’ve read this entire listing, please respond with the word “triangle” in your application and list the software you have experience with.\n\r\nLet me know if you want a version geared more toward Print-on-Demand or Warehouse-based operations — or if you’d like to combine this with brand ambassador/influencer strategy too.",
  "skill_requirements": [
    "Amazon",
    "Seller Central",
    "Shopify"
  ],
  "is_active": true,
  "status_history": []
}