{
  "job_id": "1386230",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Fba-Product-Research-No-Experience-1386230",
  "scraped_at": "2025-07-15T14:39:10.373899",
  "title": "Amazon Fba Product Research (No Experience)",
  "type_of_work": "Full Time",
  "salary": "$350",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Schedule: Monday to Friday, 8 PM to 4 AM EST\r\nCompensation: 350/month \n\r\nDo not apply if:\n\r\nYou currently work for another Amazon seller\r\nYou use lead lists, Facebook groups, or recycled leads\r\nYou rely on ChatGPT or AI-generated answers (we verify recordings using AI)\r\nYou cannot commit to our schedule or follow instructions carefully\n\r\nRequirements:\n\r\nFluent in English\r\nStable internet connection (Cloudflare Speed Test screenshot required)\r\nHigh attention to detail\r\nWilling to learn and follow SOPs independently and within a team\r\nTime Doctor must be installed and active throughout the shift\r\nInclude the word \"Probation\" in your subject line or your application will be ignored\n\r\nTo apply, send the following:\n\r\nResume in PDF format\r\nA screenshot of your Cloudflare speed test\r\nA voice or video recording answering all 9 questions below\r\nVoice or video recording — answer these questions:\n\r\n-What interests you about Amazon product research, and why do you think you're a good fit for learning this skill from scratch?\r\n-Have you used any online research tools before? If not, are you comfortable learning tools like Keepa and SellerAmp SAS without relying on step-by-step coaching?\r\n-If you were given basic guidelines and examples, how would you go about finding profitable products without copying others or using lists?\r\n-How do you keep yourself organized when learning something completely new that involves a lot of data and repetition?\r\n-Have you used Google Sheets or Excel before? If not, how do you plan to quickly become confident using them to track leads and performance?\r\n-What is your availability, and are you fully committed to working our shift with no overlap with other jobs or Amazon clients?\r\n-Tell me about a time you had to learn something fast on your own. What was the situation, and what steps did you take?\r\n-How do you keep yourself focused during repetitive or solo tasks without someone constantly checking your work?\r\n-When you're working alone, what personally drives you to keep going — even when things feel repetitive or slow?\n\r\nYou’ll be contacted with an interview link if your application passes our initial review.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:24:36.726619",
      "reason": "Job first discovered"
    }
  ]
}