{
  "job_id": "1386206",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1386206",
  "scraped_at": "2025-07-14T23:09:51.449995",
  "title": "Business Process Coordinator",
  "type_of_work": "Full Time",
  "salary": "P50,000 to P55,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "POSITION SUMMARY\r\nThe Business Process Coordinator researches, analyzes, and recommends improvements to an organization's business processes in order to improve overall organizational performance. This individual will also study operational and performance data to identify trends and opportunities for improvement. The Process Coordinator position is highly independent yet is responsible to all departments within our organization. You will need to deliver results in a fast-paced and ambiguous environment and be a specialist in both complex technical and business matters.\n\r\nThis position is 100% remote. \n\r\nABOUT CARDONE VENTURES\r\nOur mission is to help business owners achieve their personal, professional, and financial goals through the growth of their businesses. We work in dozens of verticals and provide strategic business guidance through courses, live events, partnerships, and investments. Our core values are the backbone of our business and guide our hiring process: we are inspirational, disciplined, accountable, transparent, aligned, and results-oriented. This company operates nationally and is growing by the day.\n\r\nWondering what it's like to work here? Come check this:\nUpgrade to see actual info/watch?v=PIIv7sYj1Ns\n\n\r\nSUCCESS LOOKS LIKE\r\n- Develop, document, and enhance processes and workflows to ensure consistent, efficient, and scalable operations.\r\n- Create clear, user-friendly Standard Operating Procedures (SOPs) and process documentation that drive accountability and transparency throughout the organization.\r\n- Leverage tools and technology like LUpgrade to see actual info, Asana, and G-Suite to build visual workflows and project plans that are easy to understand and execute.\r\n- Collaborate with teaUpgrade to see actual infombers to capture process details via video transcription, follow up to ensure deliverables are met, and maintain updated systems for continuous improvement.\n\r\nOBJECTIVES\r\n- Participate in the effort to define, document, and refine processes, procedures, and workflows for business operations based on company best practices\r\n- Develop functional and process expertise to create and streamline SOPs\r\n- Leverage technology to enable process efficiency, data analysis, and process capability\r\n- Update and maintain systems across the organization for end-user efficiency in platforms like Trainual, in-house LMS, Asana, etc\r\n- Document SOPs from other departments via video transcription\r\n- Follow up with teaUpgrade to see actual infombers for accountability towards the due date completion\n\n\r\nCOMPETENCIES\r\n- Robust and proven business acumen\r\n- Proficiency in process documentation tools.\r\n- Ability to identify and accurately document complex processes so that teaUpgrade to see actual infombers can understand them, use them, and be held accountable to fulfilling them\r\n- Proficiency in using tools like Microsoft Visio, LUpgrade to see actual info, or other process mapping software to create visual representations of workflows and processes.\r\n- Assists in the creation of templates to be used across the organization\r\n- Quality control processes, existing and newly created processes\r\n- Substantial experience with project management software (e.g.,Asana)\r\n- Substantial experience with process flow chart software (e.g.,LUpgrade to see actual info)\r\n- Substantial experience with G-Suite (Slides and Docs)\n\n\r\nEDUCATION AND EXPERIENCE\r\n- Bachelor’s Degree in Business or related field, or equivalent work experience preferred\n\r\nPHYSICAL REQUIREMENTS\r\n- Prolonged periods of sitting at a desk and working on a computer\n\n\r\nCOMMITMENT TO DIVERSITY \n\r\nAs an equal opportunity employer committed to meeting the needs of a multigenerational and multicultural workforce, Cardone Ventures recognizes that a diverse staff, reflective of our community, is an integral and welcome part of a successful and ethical business. We hire local talent at all levels regardless of race, color, religion, age, national origin, gender, gender identity, sexual orientation, or disability, and actively foster inclusion in all forms both within our company and across interactions with clients, candidates, and partners.\n\r\nIf this position caught your eye, send us your resume! For best consideration, please complete the online application form:\nUpgrade to see actual info/Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}