{
  "job_id": "1387326",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1387326",
  "scraped_at": "2025-07-14T23:09:52.752389",
  "title": "Email Designer for Klaviyo (FULLTIME-WFH)",
  "type_of_work": "Full Time",
  "salary": "up to 40,0000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Apply by submitting an application form:  Upgrade to see actual info\n\r\nWhy Join Us?\r\nGrowth Opportunities: Thrive in an environment full of growth prospects.\r\nVibrant Team Culture: Be part of a dynamic and supportive team.\r\nComprehensive Training: Benefit from training designed for go-getters ready to apply their energy and skills.\n\r\nAbout Us\n\r\nWe are a premier e-commerce growth agency that specializes in running Facebook and Instagram ads for e-commerce brands. As a Premium Agency Partner with Meta, we're at the cutting edge of digital advertising.\n\r\nPerks Include:\r\n- Paid public holidays\r\n-Generous leave entitlements\r\n-Unlimited bonus potential\r\n- Career growth pathway – we’re here to develop leaders, not just freelancers or side hustlers!\n\r\nAbout the Role – Email Designer\r\nWe’re looking for a talented Email Designer to create high-converting, visually engaging emails that drive results.\n\r\nYou’ll play a key role in crafting responsive, mobile-optimized designs that enhance user experience, align with brand identity, and contribute to the success of our email marketing campaigns.\n\r\nWhat You’ll Do:\r\n- Design & edit high-quality emails that engage audiences and boost conversions.\r\n-Develop mobile-first, responsive e-commerce email experiences.\r\n-Create visually compelling emails aligned with campaign goals & KPIs.\r\n-Maintain brand consistency across all email designs.\r\n-Test email renderings across multiple clients/ISPs and optimize for mobile & dark mode.\r\n-Analyze email performance and recommend creative improvements.\r\n-Collaborate with strategists & retention specialists to refine campaigns.\r\n-Build & optimize email templates in Klaviyo.\r\n-Proactively communicate with key stakeholders.\r\n-Participate in teaUpgrade to see actual infoetings, development projects, and training sessions.\n\r\nWhat We’re Looking For:\r\n-1+ year of experience in email design, graphic design, or digital marketing.\r\n-Strong understanding of branding, typography, layout, and photography.\r\n-Experience designing for e-commerce and performance-driven campaigns.\r\n-Proficiency in Adobe Creative Suite & Figma.\r\n-Experience building email templates in Klaviyo (basic coding knowledge is a plus).\r\n-Detail-oriented, organized, and a strong creative problem solver.\r\n-Excellent communication skills with the ability to present design decisions with logic & data.\r\n-A self-starter passionate about learning and improving design processes.\n\n\r\nWho You Are:\r\n- A creative thinker who enjoys challenges and problem-solving.\r\n- A team player who values collaboration and feedback.\r\n- Someone who takes pride in delivering WOW-worthy work.\r\n- A detail-oriented designer who understands the impact of great visuals.\r\n- Dedicated to achieving mutual goals that align with the company’s mission and vision.\n\r\nIf you’re passionate about email design and want to create work that drives real impact, we’d love to hear from you!\n\r\nJob Requirements:\r\n-Shift Hours: Flexible to work in sync with either AUS or USA timezones\r\nAUS: 9 AM - 6 PM PHT\r\nUSA: 7 PM - 4 AM PHT\n\r\n-High proficiency in Adobe Creative Cloud Applications & Figma.\r\nAdvanced English proficiency (both written & spoken).\r\n-Fast & reliable PC/MAC that supports Adobe Creative Cloud.\r\n-Stable internet connection with a backup available.\r\n-Strong critical thinking skills and ability to work autonomously.\r\n-Open to feedback and committed to continuous skill improvement.\r\n-Passionate about personal growth – never satisfied with the status quo.\r\n-Highly organized and able to manage multiple projects daily.\r\n-Experience with ClickUp (or similar platforms); Klaviyo knowledge is a plus.\r\n-Previous experience working with a remote team and/or marketing agency.",
  "skill_requirements": [
    "Email Marketing",
    "Graphic Design",
    "Klaviyo"
  ]
}