{
  "job_id": "1387568",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Worker-Compensation-Paralegal-1387568",
  "scraped_at": "2025-07-15T12:36:48.389093",
  "title": "Worker Compensation Paralegal",
  "type_of_work": "Full Time",
  "salary": "$8 per/h",
  "hours_per_week": "50",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Worker Compensation Paralegal – Full-Time | Remote \n\r\nWe’re Hiring!\r\nWorker's Compensation Paralegal?We’re looking for an experienced Workers' Compensation Paralegal to manage casework from start to finish, support attorneys in litigation, and serve as a key point of contact for clients and stakeholders. This is a remote position.\n\n\r\n???? Responsibilities:\r\n-Oversee and manage all aspects of Workers' Compensation and Civil Litigation cases\r\n-Maintain organized case files, including legal documents, correspondence, and evidence\r\n-Conduct legal research on case law, statutes, and regulations\r\n?-Draft legal documents such as complaints, motions, and discovery requests\r\n-Ensure timely and accurate filing of legal documents\r\n-Serve as the primary point of contact for clients\r\n-?Provide case updates and gather information from clients and witnesses\r\n-Support the discovery process by preparing interrogatories\r\n-?Organize materials and documentation for attorneys\r\n-Assist in trial preparation, including assembling exhibits and coordinating logistics\r\n-Aid in settlement negotiations and analyze settlement offers\r\n-Ensure compliance with employment laws and stay updated on legal developments\r\n-Mentor junior paralegals, legal assistants, and support staff\r\n-?Handle billing and other administrative responsibilities\r\n-Identify and recommend areas for process improvement\r\n-Commit to ongoing education and skill development in employment law\r\n-Maintain positive relationships with clients, opposing counsel, and key stakeholders\n\r\n? Requirements:\r\n-Minimum 2 years of experience  in worker compensation law. \r\n-Proficient in using Merus Case Software.\r\n-Experience bilingual.\r\n-Strong research, writing, and organizational skills\r\n-Proficient in legal software and case management tools\r\n-Effective communicator with the ability to manage client relationships\r\n-Paralegal certificate or relevant degree required\n\r\n???? Work Schedule:\r\nMonday to Friday (8am-6pm PST) \n\r\n???? Salary & Benefits:\r\n-Stable\r\n-Work From Home\r\n-Competitive monthly salary\r\n-Long-term opportunity with room for growth\n\r\n???? How to Apply:\r\n Click the “Apply” button on this post and make sure to include the following:\r\n        1. Your updated resume\r\n        2. A short cover letter highlighting your relevant experience\r\n        3. Subject line: “OLJ Application – [Your Full Name] – [Job Title]”\n\r\nWe look forward to finding the right fit to grow with our team. Thank you!",
  "skill_requirements": [
    "Case Studies Writing",
    "Legal Research",
    "Paralegal"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:21:50.013051",
      "reason": "Job first discovered"
    }
  ]
}