{
  "job_id": "1387491",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Lazada-Store-Manager-Private-Label-1387491",
  "scraped_at": "2025-07-15T15:36:19.835586",
  "title": "Lazada Store Manager (Private Label)",
  "type_of_work": "Full Time",
  "salary": "To be discussed (monthly uSD)",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Lazada Store Manager\n\r\nJob Type: Full-time\r\nWorking Timings: EST Time Zone\n\r\nJob Description:\r\nAs a Lazada Store Manager, you will be responsible for managing and optimizing our Lazada store to drive sales and enhance the customer experience. You will work closely with various departments, including marketing, customer service, and inventory management, to ensure our online store operates smoothly and efficiently.\n\r\nKey Responsibilities:\r\n• Oversee daily operations of the Lazada store, including product listings, pricing, and inventory management.\r\n• Develop and implement strategies to increase sales and improve conversion rates on the Lazada platform.\r\n• Coordinate with the marketing team to plan and execute promotional campaigns, discounts, and special offers.\r\n• Ensure high levels of customer satisfaction by addressing customer inquiries and resolving issues promptly.\r\n• Monitor and analyze sales performance, traffic, and other key metrics. Generate reports to provide insights and recommendations for improvement.\r\n• Work with the product team to ensure accurate and attractive product descriptions, images, and specifications.\r\n• Conduct regular competitor analysis to stay ahead of market trends and adjust strategies accordingly.\r\n• Ensure compliance with Lazada policies and guidelines.\n\r\nQualifications:\r\n• At least 2 to 3 years of experience managing Lazada Global or in any of the Southeast Asian countries.\r\n• Strong understanding of e-commerce best practices.\r\n• Proficiency in using Lazada Global Seller Center and other e-commerce tools.\r\n• Excellent communication and organizational skills.\r\n• Ability to analyze data and make data-driven decisions.\r\n• Creative problem-solving abilities.\r\n• Ability to work independently and as part of a team.\r\n• Must be willing to work in EST time zone and be comfortable using a time tracker.",
  "skill_requirements": [
    "E-Commerce",
    "Brand Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:25:04.877975",
      "reason": "Job first discovered"
    }
  ]
}