{
  "job_id": "1388325",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Recruiter-1388325",
  "scraped_at": "2025-07-15T15:35:24.166850",
  "title": "Sales Recruiter",
  "type_of_work": "Full Time",
  "salary": "$3,000 - $8,500/month",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re seeking experienced recruiters to find and attract qualified salespeople, door-to-door canvassers, and appointment setters. The role involves sourcing qualified candidates online and getting them to apply for open job opportunities listed on our platform. You’ll be compensated for each candidate you sourced if they’re hired and approved.\n\r\nNOTE: This is a high-volume recruiting opportunity. We’re looking for recruiters with experience in sourcing and placing thousands of candidates for multiple positions. (Recruiting Agencies are welcome to apply.)\n\n\r\nRESPONSIBILITIES:\r\n· Source and identify qualified candidates through various online channels, including job boards, social media, and networking platforms.\r\n· Conduct virtual interviews and screenings to assess candidate qualifications, skills, and experience.\r\n· Build and maintain a pipeline of qualified candidates for current and future sales openings.\r\n· Provide guidance and support to candidates throughout the recruitment process, including explaining job responsibilities, company culture, and compensation structure.\r\n· Collaborate with hiring managers to understand team needs and ensure alignment in candidate selection.\r\n· Stay up-to-date on best practices to attract top talent in the sales field.\n\n\r\nQUALIFICATIONS:\r\n· Proven experience in recruiting, preferably in the sales industry.\r\n· Strong understanding of qualities and skills needed for success in sales roles.\r\n· Excellent communication skills, both written and verbal, with the ability to engage and build relationships with candidates remotely.\r\n· Ability to work independently, manage multiple priorities, and meet deadlines.\r\n· Strong organizational skills and attention to detail.\r\n· High level of professionalism, confidentiality, and integrity.\n\n\r\nREQUIREMENTS:\r\n· Recruitment Tools\r\n· Job Boards Access\r\n· Talent Network Access\n\n\r\nCOMPENSATION:\r\n· $100-$1,000/Recruit\r\n· Performance Bonuses\n\n\r\nPERKS:\r\n· Flexible remote work environment.\r\n· Reimbursement for recruitment expenses.\r\n· Opportunity for career growth and development within the organization.\n\n\r\nTO APPLY, YOU MUST SUBMIT A SHORT VIDEO OF YOURSELF EXPLAINING WHY YOU THINK YOU’RE THE BEST FIT FOR THIS ROLE.",
  "skill_requirements": [
    "Recruiting",
    "Candidate Sourcing",
    "Talent Acquisition"
  ],
  "is_active": true,
  "status_history": []
}