{
  "job_id": "1388689",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-CSA-1388689",
  "scraped_at": "2025-07-15T14:29:36.924265",
  "title": "Virtual CSA",
  "type_of_work": "Part Time",
  "salary": "10,000PH - 15,000PH",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We're Hiring: Virtual Customer Service Assistant (Full-Time, Remote) ????\n\r\nAre you a dedicated, detail-loving, and proactive Virtual Assistant looking for a long-term role with a supportive, fast-paced team? Do you thrive under pressure, enjoy solving problems, and take pride in your communication and organizational skills?\n\r\nIf you bring a can-do attitude, love staying organized, and are ready to grow with a thriving business—we want to hear from you!\n\r\n What We’re Looking For:\r\n? Excellent English Skills\n\r\nStrong speaking, writing, listening, and reading abilities\r\nAmerican English accent preferred for client-facing communication\r\n? Tech-Savvy & Resourceful\n\r\nProficient with Google Sheets, Google Docs, Google Photos, Canva\r\nComfortable using project management tools and picking up new systems quickly\r\n? Communication Superstar\n\r\nClear, professional written and verbal communication is a must\r\nConfident managing email, messages, and client interactions\r\n? Detail-Oriented & Organized\n\r\nYou notice the small things and take a proactive approach to problem-solving\r\n? Reliable & Accountable\n\r\nYou meet deadlines, own your responsibilities, and never leave things unfinished\r\n? Adaptable & Growth-Minded\n\r\nYou welcome feedback, adapt to change, and love learning new skills\r\n? Team-Oriented with Strong Work Ethic\n\r\nYou’re responsive, collaborative, and committed to your role\r\n? Tech Requirements\n\r\nHigh-speed internet\r\nReliable computer with camera and speaker\r\nMust have camera on during shift hours\r\n???? Availability\n\r\nMust be available to work Monday–Friday, 8 AM–5 PM EST, and some Saturdays\n\r\n???? Key Responsibilities:\r\nManage general office and admin tasks\r\nSupport project organization and scheduling\r\nAssist with marketing, email communication, and writing/editing tasks\r\nCreate visual content and designs using Canva\r\nUpload, organize, and manage content in Google platforms\r\nTackle day-to-day tasks with flexibility and a problem-solving mindset\r\n???? Why You’ll Love Working With Us:\r\nWe’re a values-driven team that believes in mutual growth and success. When you thrive, we thrive—so we invest in your journey with us.\n\r\nPerks & Benefits Include:\n\r\n???? Two weeks of paid vacation\r\n???? Quarterly performance bonuses\r\n???? 13th-month pay (for consistently reliable teaUpgrade to see actual infombers)\r\n???? Opportunities to grow and take on more responsibility over time\n\r\nHow to Apply: \nEmail your application to Upgrade to see actual info with your answers (written or audio-recorded) to the following questions:\n\r\nHave you ever been given multiple tasks at once? How did you manage them?\r\nShare an example of a time you made a difficult decision.\r\nWhat is your favorite hobby and why?\r\nWhat’s your favorite childhood memory?\r\nShare a link to your OnlineJobs.ph profile.\r\nTell us about yourself and your family in 5 sentences.\r\n???? Important: Please indicate the position you are applying for in the subject line of your email (e.g., Virtual Customer Service Assistant Application).\r\n???? This is a full-time position. If you're interested in part-time work, please let us know in your email.\n\r\nIf you're ready to join a team that values your input, rewards hard work, and truly supports your growth—we can’t wait to hear from you. Apply now and let’s build something amazing together!",
  "skill_requirements": [
    "Customer Support",
    "Phone Support",
    "English Speaking"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:13:12.022712",
      "reason": "Job first discovered"
    }
  ]
}