{
  "job_id": "1388663",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Graphic-Designer-Signage-1388663",
  "scraped_at": "2025-07-15T14:42:53.098918",
  "title": "Graphic Designer - Signage",
  "type_of_work": "Full Time",
  "salary": "800",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "**About Us:**\r\nWe are a leading national signage company specializing in large-scale commercial signage solutions across multiple industries including retail, healthcare, hospitality, and corporate environments. As we continue to innovate and expand, we are seeking a talented **Graphic Designer** with a strong background in **signage design** and a keen interest in leveraging **AI tools** to enhance creative workflows and production efficiency.\n\r\n**Position Overview:**\r\nThe ideal candidate will have deep experience working with national signage programs and an understanding of ADA, wayfinding, environmental, and branded signage design standards. Proficiency in Adobe Creative Suite is a must, and experience with AI-based design tools (e.g., Midjourney, DALL·E, Firefly, or ChatGPT for ideation/workflows) is highly valued.\n\r\n**Responsibilities:**\n\r\n* Design signage layouts, mockups, and production-ready files for national signage programs\r\n* Translate brand guidelines into cohesive signage design systems\r\n* Collaborate with project managers, fabricators, and clients to ensure accuracy and intent\r\n* Utilize AI tools to accelerate design iterations, ideation, and asset generation\r\n* Produce presentation decks, renderings, and photo-realistic signage visualizations\r\n* Ensure compliance with ADA and local signage code requirements\n\r\n**Qualifications:**\n\r\n* 3+ years of experience in graphic design with a focus on signage (preferably for national clients)\r\n* Proficiency in Adobe Illustrator, Photoshop, InDesign; experience with CAD or signage-specific software a plus\r\n* Familiarity with architectural plans and environmental design concepts\r\n* Working knowledge of AI design tools such as Midjourney, Firefly, or similar\r\n* Strong typographic, layout, and branding skills\r\n* Attention to detail and the ability to manage multiple projects with tight deadlines\n\r\n**Bonus Skills:**\n\r\n* Experience with 3D rendering software (e.g., SketchUp, Rhino, or 3ds Max)\r\n* Knowledge of print production, materials, and fabrication techniques\r\n* Experience with interactive or digital signage\n\r\n**What We Offer:**\n\r\n* Competitive compensation based on experience\r\n* Flexible work environment\r\n* Opportunity to work on high-profile national projects\r\n* A creative team that embraces innovation, including the integration of AI in design\n\r\n**How to Apply:**\r\nPlease submit your **portfolio**, **resume**, and a brief cover letter outlining your signage experience and how you’re currently using AI in your design process",
  "skill_requirements": [
    "Architectural Services",
    "Adobe",
    "Graphic Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:41:24.314692",
      "reason": "Job first discovered"
    }
  ]
}