{
  "job_id": "1388688",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-Social-Media-Manager-1388688",
  "scraped_at": "2025-07-15T12:30:01.059284",
  "title": "Experienced Social Media Manager",
  "type_of_work": "Part Time",
  "salary": "10,000PH - 13,000PH",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re Hiring: Social Media Manager / Virtual Assistant (Remote)\n\r\nAre you a detail-oriented, driven individual with a passion for digital marketing and social media? We're looking for a dedicated Social Media Virtual Assistant to join our team and grow with us long-term.\n\r\n???? What We’re Looking For:\r\n? Committed & Reliable\r\nYou show up consistently, meet deadlines, and take pride in your work.\n\r\n? Excellent English Skills\r\nClear communication is key—both spoken and written.\n\r\n? Project Management Experience\r\nFamiliar with tools like Google Sheets, Google Docs, Metricool, and Canva.\n\r\n? Organized & Deadline-Focused\r\nYou know how to prioritize and multitask without losing sight of the big picture.\n\r\n? Creative & Strategic Thinker\r\nYou understand analytics, spot trends, and create data-driven campaigns that get results.\n\r\n? Marketing Tool Proficiency\r\nExperience with Meta Ads, Facebook, Instagram, TikTok, Pinterest, LinkedIn? Even better!\n\r\n? Tech-Savvy with Strong Equipment\r\nFast internet, a reliable computer, a good camera, and clear audio are must-haves.\n\r\n? Adaptable & Proactive\r\nYou’re a problem-solver who isn’t afraid to ask for help when needed—and never ghosts.\n\r\n???? Key Responsibilities:\r\n???? Social Media Strategy & Engagement\n\r\nLaunch and manage data-driven campaigns.\r\nMonitor trends and tweak strategies for engagement.\r\nTarget niche audiences with precision.\r\nEngage with followers to build trust and grow community.\r\n???? Video Editing & Content Creation\n\r\nUse Canva or similar tools to create short, polished video clips.\r\nAdd transitions, music, effects, and captions to tell compelling visual stories.\r\nCollaborate with video editors to ensure brand consistency.\r\n???? Analytics & Insights\n\r\nMonitor social performance using Google Analytics, Metricool, and more.\r\nAssist in ad management (Meta Ads, TikTok, Pinterest, etc.)\r\nTrack content performance and report key metrics.\r\n???? Communication Tools\n\r\nUse WhatsApp to stay in sync with the team and streamline communication.\r\n???? Why Work With Us?\r\n???? Permanent, long-term position with room to grow\r\n????? 1 week of paid vacation\r\n???? 13th-month pay\r\n???? Performance bonuses\r\n???? A supportive and invested team culture\r\n???? We want you to thrive—and we’ll help you do it\n\r\n? How to Apply:\r\nSend your application to Upgrade to see actual info with your answers (written or audio-recorded) to the following questions:\n\r\nDescribe a time you used your communication skills to explain something complex. How did you make sure your message was understood?\r\nShare an example of an important goal you set and how you reached it.\r\nHow do you manage multiple tasks and deadlines at the same time?\r\nGive an example of a difficult decision you had to make and how you handled it.\r\nWhat is your favorite place to visit, and where would you travel if given the chance?\r\nDescribe your past experience with wire services (if any).\r\nShare a link to your OnlineJobs.ph profile.\r\nTell us about yourself and your family in 5 sentences.\r\n???? Please note: All candidates will complete a short trial task before moving forward in the selection process.\n\r\nWe’re excited to hear from you and build something great—together.",
  "skill_requirements": [
    "Content Creation",
    "Social Media Management",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:16:22.411713",
      "reason": "Job first discovered"
    }
  ]
}