{
  "job_id": "1388640",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-Male-Candidates-Only-1388640",
  "scraped_at": "2025-07-15T15:43:11.475941",
  "title": "Executive Assistant (Male Candidates Only)",
  "type_of_work": "Full Time",
  "salary": "$5-$6",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Remote | Full-Time | EST Time Zone\n\r\nAbout the Role\r\nWe are looking for a male Executive Assistant to support a business owner involved in various industries including property restoration, medical supply, construction management, and holding companies. This role requires someone highly proactive, detail-oriented, and trustworthy, with strong administrative and organizational skills.\n\r\nThis is not your typical admin role—our ideal candidate will act as a right hand to the owner, helping manage tasks across multiple entities, keep operations on track, and drive special projects forward. It's a dynamic, high-trust position with long-term potential and room to grow.\n\r\nKey Responsibilities\n\r\nProvide daily administrative support across multiple businesses\n\r\nCoordinate intercompany transactions, invoices, and correspondence\n\r\nAssist with special projects such as medical supply sourcing and legal/financial documentation\n\r\nOrganize digital files, operational SOPs, and project reports\n\r\nDraft/edit internal forms, documents, and business communications\n\r\nManage project calendars, meeting schedules, and deadline tracking\n\r\nAssist with financial organization, including receipts, QuickBooks data, and reporting\n\r\nSupport and improve workflows and systems across teams\n\r\nConduct light research and communicate with vendors, partners, and clients\n\r\nWork collaboratively with other virtual teaUpgrade to see actual infombers\n\r\nQualifications\n\r\nMinimum of 2 years experience in Executive Assistance, Project Coordination, or Operations Support\n\r\nStrong organizational and multitasking skills\n\r\nProficiency in Microsoft Outlook, Excel, and QuickBooks Desktop\n\r\nExcellent English communication skills (written and verbal)\n\r\nExperience in multiple business functions is a plus\n\r\nHigh integrity and discretion when handling sensitive information\n\r\nSelf-motivated and resourceful—able to work independently and problem-solve on the go\n\r\nHow to apply: Please send us your CV, Intro video and Active Whatsapp number",
  "skill_requirements": [
    "Bookkeeping",
    "Online Bookkeeping",
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:31:44.385131",
      "reason": "Job first discovered"
    }
  ]
}