{
  "job_id": "1389209",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Legacy-Executive-Assistant-1389209",
  "scraped_at": "2025-07-15T15:32:46.330375",
  "title": "Legacy Executive Assistant",
  "type_of_work": "Full Time",
  "salary": "PHP 25,000–35,000 (USD $450–$650)",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Legacy Executive Assistant (Remote, Full-Time)\n\r\nAbout Us:\r\nWASHINGTON CONSTRUCTION is a well-established construction and renovation company serving Western Washington. We are seeking a reliable, detail-oriented Legacy Executive Assistant to support our owner/manager with daily administrative tasks and communications.\n\r\nKey Responsibilities:\n\r\n- Manage calendars and schedule appointments\r\n- Screen emails, organize digital files, and assist with document preparation\r\n- Help coordinate meetings and follow-ups with teaUpgrade to see actual infombers and clients\r\n- Prepare simple reports, letters, and basic spreadsheets\r\n- Perform light research, data entry, and maintain company records\r\n- Assist with reminders, tasks, and day-to-day organization\n\r\nRequirements:\n\r\n- At least 1–2 years of experience as an executive, administrative, or virtual assistant (remote experience preferred)\r\n- Good written and spoken English (upper intermediate or higher)\r\n- Proficiency with Google Workspace (Docs, Sheets, Gmail, Calendar) and/or MS Office\r\n- Detail-oriented, organized, and reliable\r\n- Able to work independently with minimal supervision\r\n- Construction or real estate admin experience a plus, but not required\n\r\nHow to Apply (ALL Steps Required):\n\r\n1. Update your onlinejobs.ph profile:\n\r\n- Upload proof of your IQ score (120+) from a recognized test provider (such as TestGorilla, Mensa, or similar) to your onlinejobs.ph profile.\r\n- Update your English level to C1 or higher (include proof if possible, such as IELTS, TOEFL, or Cambridge).\n\r\n2. Send your application:\n\r\n   - Submit your resume and a brief introduction describing your admin experience and why you’d be a good fit for this role.\n\r\n3. Complete BOTH required online assessments:\r\n   *(Use the same email address as your onlinejobs.ph profile for both tests. Only candidates who complete both will be considered.)*\n\r\n   - [Legacy Executive Assistant Assessment – Part 1](Upgrade to see actual info)\r\n   - [Legacy Executive Assistant Assessment – Part 2](Upgrade to see actual info)\n\r\nApplications missing any step will not be reviewed.\n\r\n*We use these assessments to ensure you have the essential skills and attention to detail needed to succeed in this role. Only qualified candidates will advance to the interview stage.*\n\r\nCompensation & Schedule:\n\r\n- Monthly Salary: PHP 25,000–35,000 (USD $450–$650), depending on experience\r\n- Full-time, remote (night shift for PH applicants; Pacific Time business hours)\r\n- Long-term position with potential for future growth\n\r\n*We welcome applicants who are serious, organized, and ready to support our growing team!*\n\r\nWASHINGTON CONSTRUCTION is an equal opportunity employer. We value a diverse team and welcome applicants from all backgrounds.\n\r\n*Apply now and join a professional, supportive work environment!*",
  "skill_requirements": [
    "Communication",
    "Organization",
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:22:28.359077",
      "reason": "Job first discovered"
    }
  ]
}