{
  "job_id": "1389964",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-E-Commerce-Bookkeeper-Xero-Specialist-Full-Time-US-Hours-Up-to-2300Month-1389964",
  "scraped_at": "2025-07-15T14:27:10.404357",
  "title": "Senior E-Commerce Bookkeeper & Xero Specialist (Full-Time, US Hours, Up to $2,300/Month)",
  "type_of_work": "Full Time",
  "salary": "Up to $2,300",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Litcessory is a fast-growing e-commerce brand that specializes in accessories for Philips Hue lighting, with a presence on Amazon, Walmart, Shopify, and more. We’re searching for a full-time Senior Bookkeeper who’s an expert in Xero and thrives in a structured, detail-oriented environment. This role is ideal for someone who takes full ownership of accounting processes—from reconciling multi-channel transactions and managing sales tax filings to producing clean financial statements that guide decision-making.\n\r\nYou’ll be responsible for ensuring accurate, timely books and providing clarity in our numbers to support smart growth.\n\r\nWHAT YOU’LL DO:\n\r\n•Own and maintain the full accounting cycle in Xero—bookkeeping, reconciliation, and monthly closing\r\n•Build, document, and manage workflows for recurring tasks (sales imports, payroll, invoicing, and more)\r\n•Track SKU-level inventory, COGS, and reconcile across third-party reports\r\n•Investigate and resolve discrepancies in data, payments, and inventory\r\n•Ensure bills and vendor payments are timely and properly verified\r\n•Manage tracking categories for insightful management reporting\r\n•Prepare and file accurate monthly sales tax and VAT returns in the US and EU\r\n•Oversee bank feeds and reconcile all financial accounts monthly\r\n•Prepare year-end financials in collaboration with our external tax team\r\n•Produce monthly financial reports, monitor KPIs, and advise on cash flow trends\r\n•Contribute to ongoing improvements in accounting processes and Xero integrations\r\n•Collaborate with leadership on budgets, forecasting, and financial planning\n\r\nREQUIREMENTS:\r\n•Educational Background: A bachelor’s degree in accounting, finance, or a closely related field.\r\n•Certification: CPA, CMA, or equivalent credential preferred (shows ownership & rigor).\r\n•Experience: At least 3 years of accounting experience, with a minimum of 2 years focused on e-commerce accounting. Experience with Amazon marketplace is a plus.\r\n•Software Proficiency: Expert level proficiency in Xero and Excel/Google Sheets.\r\n•Regulatory Knowledge: Experience with US and EU accounting regulations and filings, including knowledge of regulatory US/EU VAT and sales tax filings.\r\n•Independence and Problem Solving: Ability to work independently, investigate variances, reconcile multi-source data, and present root-cause findings.\r\n•Ownership & accountability: Track record of running the full close cycle with minimal oversight.\r\n•Detail orientation / quality control: Demonstrated low-error work; includes establishing internal checks.\r\n•Eagerness to Learn and Adapt: Must be eager to learn, adapt, and grow with our constantly evolving company.\r\n•Data Manipulation Skills: Comfortable with manual data manipulation for importing into Xero.\r\n•Exclusivity: This is a full-time position requiring exclusive commitment to our company.\r\n•Adaptability in Process Documentation: Adept at creating, documenting, and implementing accounting processes.\r\n•Availability: Must be available to work 40 hours a week, within an 8-hour block between 6 AM - 6 PM Eastern Time, Monday - Friday.\r\n•Communication: Clear, proactive status reporting in English—both written and live.\n\n\r\nTO APPLY:\r\nVisit the link below and fill out the required information to start the application process:\n\nUpgrade to see actual info.com/litcessoryxerobookkeeper",
  "skill_requirements": [
    "Xero",
    "Bookkeeping",
    "Amazon"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:39:48.236630",
      "reason": "Job first discovered"
    }
  ]
}