{
  "job_id": "1389383",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Legacy-Construction-Project-Manager-1389383",
  "scraped_at": "2025-07-15T15:40:13.077944",
  "title": "Legacy Construction Project Manager",
  "type_of_work": "Full Time",
  "salary": "PHP 35,000–55,000 (USD $650–$1,000)",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Legacy Construction Project Manager (Remote, Full-Time)\n\r\nAbout Us:\r\nWASHINGTON CONSTRUCTION is a well-established construction and renovation company serving Western Washington. We are seeking a reliable, detail-oriented Legacy Construction Project Manager to oversee multiple projects and support our team with daily project coordination, scheduling, and communication.\n\r\nKey Responsibilities:\n\r\n- Track project schedules, milestones, and deadlines using Google Sheets or Excel\r\n- Coordinate with subcontractors, field workers, and suppliers via phone, email, or messaging\r\n- Update management on project progress and flag issues or delays\r\n- Prepare and send basic project reports and status updates\r\n- Help organize and maintain digital project files and records\r\n- Support material order tracking and delivery scheduling\r\n- Ensure projects stay on track, within budget, and meet company quality standards\r\n- Assist with routine communications between office and field staff\n\r\nRequirements:\n\r\n- At least 2 years of experience as a project manager, project coordinator, or scheduler (construction or renovation industry preferred)\r\n- Good written and spoken English (upper intermediate or higher)\r\n- Proficiency with Google Workspace (Sheets, Docs, Gmail, Calendar) and/or MS Office\r\n- Detail-oriented, organized, and reliable\r\n- Able to work independently with minimal supervision\r\n- Strong time management and communication skills\r\n- Experience coordinating multiple projects and teams remotely is a plus\n\r\nHow to Apply (ALL Steps Required):\n\r\n1. Update your onlinejobs.ph profile:\n\r\n   - Upload proof of your IQ score (120+) from a recognized test provider (such as TestGorilla, Mensa, or similar) to your onlinejobs.ph profile.\r\n   - Update your English level to C1 or higher (include proof if possible, such as IELTS, TOEFL, or Cambridge).\n\r\n2. Send your application:\n\r\n   - Submit your resume and a brief introduction describing your construction/project management experience and why you’d be a good fit for this role.\n\r\n3. Complete BOTH required online assessments:\r\n   *(Use the same email address as your onlinejobs.ph profile for both tests. Only candidates who complete both will be considered.)*\n\r\n   - [Legacy Construction Project Manager Assessment – Part 1](Upgrade to see actual info)\r\n   - [Legacy Construction Project Manager Assessment – Part 2](Upgrade to see actual info)\n\r\nApplications missing any step will not be reviewed.\n\r\n*We use these assessments to ensure you have the essential skills, organizational ability, and attention to detail needed to succeed in this role. Only qualified candidates will advance to the interview stage.*\n\r\nCompensation & Schedule:\n\r\n- Monthly Salary: PHP 35,000–55,000 (USD $650–$1,000), depending on experience\r\n- Full-time, remote (night shift for PH applicants; Pacific Time business hours)\r\n- Long-term position with potential for future growth\n\r\n*We welcome applicants who are dependable, organized, and ready to help deliver successful projects on time and on budget!*\n\r\nWASHINGTON CONSTRUCTION is an equal opportunity employer. We value a diverse team and welcome applicants from all backgrounds.\n\r\n*Apply now and join a professional, supportive work environment!*",
  "skill_requirements": [
    "Construction Project Manager",
    "Communication",
    "Organization"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:23:16.914586",
      "reason": "Job first discovered"
    }
  ]
}