{
  "job_id": "1389568",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Inventory-and-Systems-Operations-Specialist-1389568",
  "scraped_at": "2025-07-15T15:34:16.953138",
  "title": "Inventory and Systems Operations Specialist",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "49",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Inventory and Systems Operations Specialist\r\nWorking Hours: 9:00 AM to 7:00 PM HKT (Monday to Friday) including 1-hour lunch break and 9:00 AM to 1:00 PM HKT (Saturday)\n\r\nThis role manages the backend technical operations of the supply chain — ensuring that inventory, pricing, SKU data, workflows, and dashboards are clean, current, and actionable. The person in this position serves as the backbone of CIN7, ClickUp, and internal data integrity, driving accuracy across the supply chain and operations.\n\r\nResponsibilities:\n\r\n• Own and manage CIN7: update all inventory data, stock levels, pricing, and product records.\r\n• Maintain and optimize the master product list, including SKUs, supplier information, cost/pricing structures, and lifecycle updates.\r\n• Conduct weekly and monthly reconciliations between inventory platforms (e.g., Dear, MYM, CIN7).\r\n• Manage and continuously improve ClickUp task workflows, templates, and project boards related to operations and supply chain.\r\n• Ensure all project deadlines and dependencies are reflected and up to date in ClickUp.\r\n• Build and update Google Sheets dashboards to monitor stock levels, inventory movements, purchase plans, and data health.\r\n• Track stock movements, flag discrepancies, and perform error audits across all systems.\r\n• Support the team with forecasting and purchasing insights based on accurate data and trends.\r\n• Coordinate with purchasing, sales, and finance teams to ensure alignment on inventory and pricing.\r\n• Help create and maintain SOPs for CIN7, ClickUp, and dashboard tools.\n\r\nQualifications:\n\r\n• Minimum 3 years of experience in inventory/data operations or a supply chain analyst role.\r\n• Proficient in CIN7 or similar inventory management systems.\r\n• Advanced skills in Google Sheets, including QUERY, VLOOKUP, pivot tables, and error-checking.\r\n• Experienced in using ClickUp for workflow automation and project tracking.\r\n• Skilled in building and maintaining dashboards (Google Sheets, Data Studio, or similar tools).\r\n• Strong attention to detail and data management discipline.\r\n• Solid understanding of inventory flow, product lifecycle, and cost control.\r\n• Proactive in identifying and correcting data discrepancies.\r\n• Systems thinker who enjoys building clean processes and solving operational issues.\r\n• Confident managing complex spreadsheets, workflows, and integrations.\r\n• Takes ownership of backend operations to ensure accuracy and efficiency.\r\n• Bonus: Experience in hardware, ecommerce, or logistics-based environments.\n\r\nEssential Requirements for Remote Work:\r\n• Reliable Laptop or Desktop Computer.\r\n• Stable and high-speed internet connection.\r\n• Power source and backup internet connection in case of electricity interruptions.\n\r\n***How to Apply***\n\r\nTake the next step by completing our application form:\nUpgrade to see actual info/Upgrade to see actual info/f/3j1fc-35945/HQ578HNFWTW3B7LXDL\n\r\nNote: Only successful candidates will be contacted for the next phase of the selection process. We appreciate your time and interest in joining our team.",
  "skill_requirements": [
    "Inventory Management",
    "Clickup",
    "Google Sheets"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:34:16.957744",
      "reason": "Job first discovered"
    }
  ]
}