{
  "job_id": "1389327",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Administrative-Assistant-General-Business-Support-1389327",
  "scraped_at": "2025-07-15T14:29:42.758561",
  "title": "Virtual Administrative Assistant – General Business Support",
  "type_of_work": "Any",
  "salary": "To be discussed",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role:\r\nA growing business owner is seeking a Virtual Administrative Assistant to help manage daily operations and streamline communication. This is a versatile role perfect for someone who thrives on structure, follow-through, and making processes run smoothly.\n\n\r\nResponsibilities:\r\n- Manage and monitor inboxes, schedule appointments, and maintain calendars\r\n- Track and follow up on to-dos, deadlines, and recurring business tasks\r\n- Coordinate meetings, take notes, and send out summaries\r\n- Assist with internal team communication and client follow-ups\r\n- Help organize business files and maintain digital systems\n\n\r\nQualifications:\r\n- Proven experience as a remote admin assistant or similar role\r\n- Excellent time management and organizational skills\r\n- Strong written and verbal English communication\r\n- Proficiency with Google Workspace, Zoom, and other remote tools\r\n- Experience with task management software (e.g., ClickUp, Asana)\n\r\nHow to Apply\r\nIf you’re excited to apply and be part of our team, send your resume and portfolio link to Upgrade to see actual info a brief cover letter explaining why you’re the perfect fit for this role, and use this as a subject line: Applying for Virtual Administrative Assistant – General Business Support\n\r\nNote: Only shortlisted candidates will be contacted for interviews.",
  "skill_requirements": [
    "Administrative Management",
    "Calendar Management",
    "Email Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:29:42.760061",
      "reason": "Job first discovered"
    }
  ]
}