{
  "job_id": "1389570",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Google-Sheets-Dashboard-Expert-1389570",
  "scraped_at": "2025-07-15T12:29:11.847989",
  "title": "Google Sheets & Dashboard Expert",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "49",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Google Sheets & Dashboard Expert\r\nWorking Hours: 9:00 AM to 7:00 PM HKT (Monday to Friday) including 1-hour lunch break and 9:00 AM to 1:00 PM HKT (Saturday)\n\r\nThis role manages the backend technical operations of the supply chain — ensuring that inventory, pricing, SKU data, workflows, and dashboards are clean, current, and actionable. The person in this position will be responsible for building and maintaining dynamic, multi-layered dashboards in Google Sheets, supporting operational decisions through data accuracy and structured reporting.\n\r\nResponsibilities:\n\r\n• Build, manage, and continuously optimize live dashboards in Google Sheets to monitor stock levels, inventory movements, purchasing trends, and data integrity.\r\n• Design structured reporting templates and tools to ensure clarity, consistency, and actionable insights across the supply chain.\r\n• Maintain and optimize the master product list in Google Sheets, including SKUs, supplier information, cost/pricing structures, and product lifecycle updates.\r\n• Conduct regular audits and reconciliations between Google Sheets, CIN7, and other systems to ensure data accuracy and alignment.\r\n• Track inventory movements across platforms, identify discrepancies, and perform corrective data audits.\r\n• Provide purchasing, sales, and finance teams with accurate, dashboard-driven insights to support decision-making.\r\n• Manage and improve ClickUp task workflows, templates, and project boards related to operations and supply chain reporting.\r\n• Ensure that all project deadlines and dependencies are reflected accurately in ClickUp.\r\n• Support the creation and continuous improvement of SOPs for dashboard reporting, inventory data management, and system integrations.\n\n\r\nQualifications:\n\r\n• Minimum 2 years of experience in inventory/data operations or a supply chain analyst role.\r\n• Advanced skills in Google Sheets, including QUERY, VLOOKUP, pivot tables, and error-checking.\r\n• Experience with Looker Studio or similar data visualization tools.\r\n• Proven experience in building and maintaining structured, multi-tab dashboards for operational and executive use.\r\n• Strong understanding of inventory flow, product lifecycle stages, and cost/pricing structures.\r\n• Highly analytical with exceptional attention to detail and accuracy in data handling.\r\n• Skilled in data reconciliation and resolving discrepancies across multiple systems.\r\n• Familiar with inventory management platforms such as CIN7, DEAR, or similar tools.\r\n• Experienced in using ClickUp or equivalent tools for project tracking and workflow automation.\r\n• Able to document and maintain standard operating procedures (SOPs) for dashboards and data processes.\r\n• Self-motivated, reliable, and comfortable working in a fully remote, results-driven environment.\r\n• Bonus: Experience working in e-commerce, hardware, or logistics-related industries.\n\n\r\nEssential Requirements for Remote Work:\r\n• Reliable Laptop or Desktop Computer.\r\n• Stable and high-speed internet connection.\r\n• Power source and backup internet connection in case of electricity interruptions.\n\r\n***How to Apply***\n\r\nTake the next step by completing our application form:\nUpgrade to see actual info/Upgrade to see actual info/f/3j1fc-35945/HQ578HNFWTW3B7LXDL\n\r\nNote: Only successful candidates will be contacted for the next phase of the selection process. We appreciate your time and interest in joining our team.",
  "skill_requirements": [
    "Inventory Management",
    "Admin Data Processing",
    "Google Sheets"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:44:52.783306",
      "reason": "Job first discovered"
    }
  ]
}