{
  "job_id": "1389572",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Channel-Executive-1389572",
  "scraped_at": "2025-07-15T15:40:52.803885",
  "title": "Sales Channel Executive",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "49",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Sales Channel Executive\r\nWorking Hours: 9:00 AM to 7:00 PM HKT (Monday to Friday) including 1-hour lunch break and 9:00 AM to 1:00 PM HKT (Saturday)\n\r\nWe are looking for a fast, organized, and proactive Sales Channels Executive to help move aging inventory through non-traditional sales channels and direct B2B outreach. This role is not about managing an online shop — it's about using alternative platforms, tools, and communication methods to get inventory into the hands of the right buyers quickly. The role requires someone who can think creatively, act quickly, communicate clearly, and follow through with persistence.\n\r\nThis is a remote position, ideal for someone who is experienced in B2B sales support, platform-based listings, and high-speed communication across email and phone.\n\r\nResponsibilities\r\n• Aging Inventory Movement: Take full ownership of promoting and moving aging inventory through alternative sales channels, B2B networks, and creative outreach.\r\n• B2B Lead Generation & Outreach: Identify, contact, and follow up with potential B2B buyers via email and phone to generate sales opportunities and partnerships.\r\n• Platform Management: Post and maintain inventory on appropriate online platforms (e.g., classifieds, B2B directories, trade forums) to increase visibility and inbound inquiries.\r\n• Rapid Response Communication: Act as the first point of contact for inbound and outbound communication — all emails and phone calls must be answered promptly, professionally, and with urgency.\r\n• Follow-up Execution: Ensure every lead or inquiry is followed up quickly and thoroughly, keeping Upgrade to see actual infontum until a clear outcome is reached.\r\n• Tracking & Coordination: Maintain accurate logs of communication, inventory postings, outreach status, and buyer pipelines in shared trackers or CRM tools.\r\n• Cross-Team Collaboration: Coordinate with internal sales and operations teams to ensure availability, pricing, and delivery readiness are aligned with sales efforts.\n\r\nRequirements\r\n• Experience in B2B sales, inventory coordination, or sales support — especially in managing unsold or aging stock.\r\n• Excellent communication skills — written and verbal — with a focus on speed, clarity, and persuasiveness.\r\n• Confident making and receiving phone calls; professional tone and persistence are key.\r\n• Strong follow-up discipline — nothing gets missed or delayed.\r\n• Highly organized, proactive, and able to juggle multiple outreach activities simultaneously.\r\n• Comfortable working remotely and independently, with strong self-management.\r\n• Familiarity with tools like Google Workspace, Excel/Sheets, CRM software, WhatsApp Business, and online classified/trade platforms.\r\n• A background in automotive, electronics, machinery, or hardware sales is a plus, but not required.\n\n\r\nEssential Requirements for Remote Work:\r\n• Reliable Laptop or Desktop Computer.\r\n• Stable and high-speed internet connection.\r\n• Power source and backup internet connection in case of electricity interruptions.\n\n\r\n***How to Apply***\n\r\nTake the next step by completing our application form:\nUpgrade to see actual info/Upgrade to see actual info/f/3j1fc-35945/HQ578HNFWTW3B7LXDL\n\r\nNote: Only successful candidates will be contacted for the next phase of the selection process. We appreciate your time and interest in joining our team.",
  "skill_requirements": [
    "Clickup",
    "Sales",
    "Back Office Support"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:34:37.604255",
      "reason": "Job first discovered"
    }
  ]
}