{
  "job_id": "1390389",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-Representive-1390389",
  "scraped_at": "2025-07-15T14:27:45.627333",
  "title": "Customer Service Representive",
  "type_of_work": "Full Time",
  "salary": "3 usd per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re looking for a skilled Customer Support Representative with experience in Shopify and fashion e-commerce/dropshipping to join our team.\n\r\nThis role starts part-time but is intended to grow into a full-time, long-term position. We're looking for someone reliable, fast, and eager to grow with a close, supportive team.\n\r\nRequirements:\r\nMinimum 2 years experience in customer service for Shopify stores\n\r\nFamiliarity with fashion e-commerce or dropshipping is a must\n\r\nComfortable using Google Sheets and basic documentation tools\n\r\nExcellent written and verbal communication in English\n\r\nFast learner and efficient in handling systems and communication\n\r\nStrong attention to detail and able to work independently\n\r\nStable internet connection (having backup for power/internet is a big plus)\n\r\nLooking for a long-term opportunity and team culture fit\n\r\nResponsibilities:\r\nRespond promptly and professionally to customer emails and support tickets\n\r\nHandle returns, refunds, shipping/tracking concerns, and complaints\n\r\nKeep Google Sheets updated with accurate customer and order information\n\r\nCommunicate with suppliers when needed\n\r\nSpot trends in customer issues and help suggest improvements\n\r\nKeep the internal team informed with regular updates\n\r\nWhat We Offer:\r\nPart-time start, with the opportunity to grow into full-time\n\r\nA stable, long-term remote role\n\r\nWeekly payments\n\r\nA collaborative, encouraging, and high-performance work environment\n\r\nReal opportunities for growth and advancement\n\r\nA tight-knit team where your input truly matters\n\r\nTo Apply, Please Send:\r\nA short introduction about yourself\n\r\nYour resume\n\r\nA short 1–2 minute video explaining your relevant experience\n\r\nA screenshot of your internet speed test from speedtest.net\n\r\nYour current location and if you have internet/power backup\n\r\nImportant: Only apply if you have direct, hands-on experience with Shopify and Google Sheets in a real e-commerce environment. Applications without these qualifications will not be considered.\n\r\nWe’re excited to find someone who’s ready to start part-time, grow into full-time, and become a valuable part of our team for the long term.",
  "skill_requirements": [
    "Customer Support",
    "Customer Service",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:27:45.630002",
      "reason": "Job first discovered"
    }
  ]
}