{
  "job_id": "1392469",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1392469",
  "scraped_at": "2025-07-14T23:06:26.452839",
  "title": "Experienced AU end to end mortgage broking administrator",
  "type_of_work": "Full Time",
  "salary": "AUD800",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Compulsory experience - Connective Mercury Nexus and AOL experience a MUST!\n\r\nMortgage Must-Dos: Responsibilities at a Glance\n\r\n• Collating all applicant documentation to ensure applications meet established time frames\r\n• Gathering and renaming supporting documents for loans in designated cloud drive & CRM, and ensuring they meet aggregator and lender compliance requirements\r\n• Preparing serviceability calculators for clients by interpreting financial data (bonus if experienced in this area)\r\n• Requesting pricing discounts and negotiating strong offers by providing competing bank offers\r\n• Ordering property valuations\r\n• Preparing loan lodgements on AOL and Loan App\r\n• Preparing RP data searches and property reports\r\n• Performing data validations\r\n• Running files through the compliance checklist\r\n• Adhering to strict timeframes and deadlines when preparing loan applications\r\n• Collecting information from lenders for existing clients and preparing a database\r\n• Timely follow up with lenders, and key stakeholders. Good record keeping habits on the file update as required.\r\n• Bank statements and living expenses analysis for applicants (bonus if experienced in this area)\r\n• Familiarity in generating credit reports and reviewing them, addressing items of concern\r\n• Verifying potentially fraudulent items, such as conflicting addresses, and flagging them to the broker\r\n• Researching lender offerings and preparing product comparison reports (bonus if experienced in this area)\r\n• Generate and identify compliance requirements in the CRM and completing data entry requirements required for lodgement\r\n• Preparing outstandings for the lenders and various stakeholders to get the file approved, and be prepared for settlement\r\n• Familiarity with pre-lodgement, lodgement preparation, approval, pre-settlement and post-settlement tasks, or can follow a template to complete tasks\r\n• Managing and assisting existing clients with requests (e.g., repricing, refixing loans, loan variations)\r\n• Ad-Hoc projects, help setting up process guide/system and automation upgrade projects, training of junior mortgage broking assistants and loan processors (when required).\n\r\nLoan Processing:\r\n• Chasing lenders for status updates and keeping the broker and applicant informed\r\n• Chasing valuation status update\r\n• Handling administration and fielding calls from applicants, responding to email/email management for the group and personal mailbox\r\n• Preparing post-settlement activities\r\n• Handling any rework\r\n• Booking appointments and managing calendars and travel schedules\r\n• Providing marketing, sales, and operational support (when required)\r\n• Keying information into the broker CRM and keeping records up to date\r\n• Attaching scanned files to CRM records\r\n• Assisting with lead generation, marketing, sales, and operational tasks (when required)\n\r\nRequirements\r\nLoan-Approved Skills and Experience\r\n• A college degree (preferred but not necessary with the right experience), someone with high initiative and ability to think out of the box and multitask\r\n• A minimum of one year of end-to-end Australian loan processing experience preferred\r\n• Recent experience using Mercury Nexus CRM and Apply Online (AOL)\r\n• Preferably, experience in similar roles at a residential/commercial mortgage lending institution. Other areas like personal/car loan processing may also be considered.\r\n• Exceptional attention to detail and ability to handle stress\r\n• Strong analytical and numeracy skills\r\n• Ability to assess complex loan applications, including analysis of Australian financial statements\r\n• High proficiency in Excel, Word, and web-based processing systems\r\n• Excellent phone manner and strong verbal and written communication skills\r\n• Ability to interact effectively within a team environment\r\n• Sales support previous experience and critical thinking highly regarded but not necessary\r\n• Initiative and pro-activeness to resolve issues and complete tasks diligently\n\r\nExperience working for an Australian mortgage broker is essential",
  "skill_requirements": [
    "Mortgage",
    "Sales Support",
    "Loan Processing"
  ]
}