{
  "job_id": "1392563",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Associate-SDR-Executive-Assistant-1392563",
  "scraped_at": "2025-07-15T12:33:52.918986",
  "title": "Sales Associate (SDR) & Executive Assistant",
  "type_of_work": "Full Time",
  "salary": "45000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Sales Associate (Remote – UK Timezones)\n\r\nJoin a fast-growing CFO advisory and tax consultancy helping entrepreneurs scale with confidence.\n\r\nWe’re GrowFactor — a modern accountancy and CFO advisory firm supporting business owners in the UK and Dubai. We partner with founders, tax-savvy entrepreneurs, and ambitious companies looking to scale smartly and reduce tax risk.\n\r\nWe’re growing fast and need a reliable, organised, and proactive Sales Associate to support our CEO in qualifying inbound leads, following up with prospects, and helping more business owners benefit from our expertise.\n\r\n?\n\r\n???? What You’ll Do\r\n • Be the first point of contact for inbound leads from our referral partners and marketing channels\r\n • Pre-qualify leads using our framework and assess fit before CEO involvement\r\n • Book calls using our calendar system and ensure pre-call forms are completed\r\n • Join Zoom calls to take notes, manage follow-ups, and draft proposal outlines\r\n • Send proposals using templates and manage CRM updates\r\n • Own follow-up process (email + phone + CRM reminders) to move leads through the pipeline\r\n • Track performance of outreach and suggest improvements to copy/process\n\r\nSupport the CEO with light executive assistant tasks — including inbox management, meeting scheduling, CRM hygiene, and follow-ups\n\r\n • Act as the central point of contact for new and existing referral partners\r\n • Track all referrals to and from our business and ensure timely updates, status reports, and thank-you follow-ups\r\n • Maintain a high standard of communication and trust on behalf of the CEO with both leads and partners\n\r\n?\n\r\n???? Who You Are\r\n • Detail-oriented, responsive, and highly organised\r\n • Confident on email and Zoom — you can build rapport and ask smart questions\r\n • Comfortable working with senior entrepreneurs and advisors\r\n • Proactive, a self-starter, and not afraid to chase up leads or take ownership\r\n • Experienced in B2B sales support, account management, or customer success\n\r\nTrustworthy and reliable with access to sensitive client and partner information\n\r\n • Proactive in managing tasks, chasing updates, and anticipating next steps\r\n • Comfortable in a fast-moving founder-led environment where priorities can shift quickly\n\n\r\n?\n\r\n???? Bonus Points If You Have\r\n • Experience with GoHighLevel, or other CRM tools\r\n • Familiarity with tax, accountancy, or financial services (not essential)\r\n • Based in a UK-friendly timezone (PH with flexible hours)\n\r\n?\n\r\n???? What We Offer\r\n • Full-time flexibility — ideally 40 hours/week to start\r\n • Fully remote role with autonomy and trust\r\n • Training and mentoring from our founder/CEO\r\n • Opportunity to grow into a more senior sales or client-facing role\r\n • Be part of a high-performing, modern financial services team\n\r\n?\n\r\n? To Apply\n\r\n****Send us a short video or Loom (under 3 minutes) explaining:*****\r\n • Why this role interests you\r\n • Your experience with lead qualification or sales support\r\n • Your timezone and availability\n\r\nWe’re looking to hire quickly — if you’re organised, reliable, and want to grow in a sales/advisory-led company, apply now.",
  "skill_requirements": [
    "CRM",
    "Sales",
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:36:07.981209",
      "reason": "Job first discovered"
    }
  ]
}