{
  "job_id": "1392585",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Sales-Enablement-Specialist-Remote-1392585",
  "scraped_at": "2025-07-14T23:09:38.368639",
  "title": "Marketing & Sales Enablement Specialist (Remote)",
  "type_of_work": "Full Time",
  "salary": "$6-$8/hr depending on skills and experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a strategic marketer who understands how great marketing empowers sales? Do you enjoy jumping into fast-moving environments where your creativity and attention to detail make an immediate difference? If so, we’d love to work with you.\n\r\nWe’re looking for a Marketing & Sales Enablement Specialist to help drive marketing initiatives across two closely connected businesses in the building materials sector. This fully remote role will have a special focus on reenergizing our brand while supporting ongoing marketing efforts in Milwaukee. You’ll be key in building visibility, enabling the sales team, and making sure our message hits the right audience, in the right way, at the right time.\n\r\nWhat You’ll Be Doing\r\nMarketing Execution:\r\nRefresh and tailor marketing playbooks and materials for both Minneapolis and Milwaukee markets.\r\nCoordinate closely with our external agency to align on brand strategy and execution.\r\nSupport showroom efforts—help run local campaigns, prep for events, and create branded collateral.\r\nDesign or enhance visuals using Canva (or a similar tool) to support both sales and marketing.\r\nKeep a pulse on our social media presence—especially B2B engagement and inbound leads.\n\r\nSales Enablement\r\nWork side-by-side with the sales team to update leave-behinds, presentations, and other collateral.\r\nHelp activate localized go-to-market strategies like newsletters, showroom promotions, and email outreach.\r\nTrack showroom performance and conversion rates to refine what’s working and what needs adjusting.\r\nPlay a role in Account-Based Marketing (ABM)—helping us reach key decision-makers like builders, designers, and remodelers.\n\r\nWhat We’re Looking For\r\nComfortable designing in Canva or similar platforms—quickly creating clean, branded materials.\r\nSolid understanding of B2B marketing—ideally within the construction, design, or home improvement space.\r\nFamiliar with ABM strategies and how to execute targeted outreach.\r\nHands-on experience with CRM platforms like HubSpot or Salesforce for tracking leads and activity.\r\nStrong writing chops—able to craft or polish content for emails, sales materials, and outreach campaigns.\r\nProactive, resourceful, and able to thrive in a fast-paced environment where things aren’t always fully mapped out.\r\nA true team player—someone who takes ownership, collaborates well, and knows how to move things forward.\n\r\nCompany Benefits:\r\n$500 USD Sign-In Bonus if you apply between July 10 to September 25, 2025\r\nCompetitive compensation package\r\nOpportunity to work closely with high-level executives from various industries.\r\nProfessional growth and development.\r\nChance to contribute to the success and growth of our clients.\r\nSupportive and collaborative team environment.\r\nPaid US Federal Holidays\r\nPaid Time Off\r\nHealthcare Package\r\n1 Year Travel Bonus\r\nYear-End Bonus\n\r\nHow to Apply:\r\n1. Complete the Form: Start by filling out the form at wkf.ms/3AnjFVK.\r\n2. Video Recording: Ensure you have a professional background when recording your video.\r\n3. Be Authentic: We strongly discourage reading from a script. Instead, be genuine and let your personality shine!\r\n4. Email Confirmation: Make sure to provide a valid email address to receive our application confirmation. If you don’t see the confirmation email, double-check for any spelling errors and resubmit the form with the correct email.\r\n5. Next Steps: If your qualifications meet our criteria, our Recruitment Specialist will reach out to you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}