{
  "job_id": "1392578",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Power-BI-Analyst-1392578",
  "scraped_at": "2025-07-15T10:24:19.740995",
  "title": "Power BI Analyst",
  "type_of_work": "Full Time",
  "salary": "$8-$10 depending on skills and experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a Power BI pro who loves turning messy data into clear insights?\r\nDo you get excited about building dashboards that actually drive decisions—and fixing the ones that don’t? If that sounds like you, keep reading.\n\r\nWe’re a fast-growing, private equity-backed manufacturer looking for a Power BI Analyst who’s ready to dive in, get their hands dirty with real business data, and create high-impact reporting across departments. You’ll be working closely with our Director of FP&A and BI, and you’ll have the opportunity to shape how data flows through the business—right from SQL to the executive dashboard.\n\r\nThis isn’t a “maintain what’s already built” role. We need someone who thrives in an evolving environment and enjoys building, optimizing, and improving dashboards that support Sales, Engineering, Quality, Production, HR, and more.\n\r\nWhat You’ll Own:\r\nDesign and build high-performance dashboards that serve real business needs across departments.\r\nImprove performance of ~25 existing dashboards—fix refresh issues, speed up load times, and optimize queries.\r\nWrite and troubleshoot SQL queries, mostly from a custom ERP (Infor Sightline or similar).\r\nIntegrate additional data sources—Excel, SharePoint, Salesforce, and more—into your reports.\r\nHandle ad hoc reporting and extend dashboards with fresh visuals or new functionality.\r\nWork directly with stakeholders to translate business questions into actionable data.\r\n(Optional but valuable) Support data storytelling by summarizing trends into clear narratives.\n\r\nWho You Are:\r\nExperienced with Power BI—you’re confident in DAX, data modeling, and creating clean, intuitive dashboards.\r\nStrong in SQL—you can join tables, build views, and debug queries without blinking.\r\nYou’ve worked with ERP data before and know how to navigate the quirks (Infor Sightline experience is a bonus).\r\nYou’re comfortable pulling data from different platforms—SharePoint, Excel, Salesforce—and blending it all together.\r\nYou’re a great communicator who can listen to business needs and turn them into simple, visual reports.\r\nYou’re self-driven, used to wearing multiple hats, and not afraid to take ownership of a full BI workflow.\r\nBonus points if you’ve worked in manufacturing, private equity, or cross-functional environments.\n\r\nCompany Benefits:\r\n$500 USD Sign-In Bonus if you apply between July 10 to September 25, 2025\r\nCompetitive compensation package\r\nOpportunity to work closely with high-level executives from various industries.\r\nProfessional growth and development.\r\nChance to contribute to the success and growth of our clients.\r\nSupportive and collaborative team environment.\r\nPaid US Federal Holidays\r\nPaid Time Off\r\nHealthcare Package\r\n1 Year Travel Bonus\r\nYear-End Bonus\n\r\nHow to Apply:\r\n1. Complete the Form: Start by filling out the form at wkf.ms/3AnjFVK.\r\n2. Video Recording: Ensure you have a professional background when recording your video.\r\n3. Be Authentic: We strongly discourage reading from a script. Instead, be genuine and let your personality shine!\r\n4. Email Confirmation: Make sure to provide a valid email address to receive our application confirmation. If you don’t see the confirmation email, double-check for any spelling errors and resubmit the form with the correct email.\r\n5. Next Steps: If your qualifications meet our criteria, our Recruitment Specialist will reach out to you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}