{
  "job_id": "1393758",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Executive-Assistant-CV901-1393758",
  "scraped_at": "2025-07-15T15:46:45.481397",
  "title": "Senior Executive Assistant CV901",
  "type_of_work": "Full Time",
  "salary": "CAD $1100-$1500",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a growing team based in Vancouver, BC, Canada, seeking a dedicated professional to work remotely as a Senior Executive Assistant. The successful candidate will assist in supporting the CEO, sales team and provide administrative support while focusing on maintaining relationships among internal departments and external vendors. Our company is in the custom printed packaging industry where we collaborate and provide solutions to CPG brands, food processing companies, retail product businesses, and medical product manufacturers.\n\r\nDo not apply if:\r\n- You have no marketing skills or B2B sales experience \r\n- You are not ready to add value to prospects before selling\r\n- You are looking for an easy job. This is for someone hungry for success. \n\r\nApplication Process:\r\nApplicants are required to include a 60 seconds selfie video recording, cover letter, resume, and any relevant work samples and references.\r\nSubmissions lacking a cover letter or resume will not be considered.\r\nIn your cover letter, please elaborate on your relevant experiences within this industry and express your motivations for joining our team. In the 60 seconds selfie video, tell us briefly what you know about our company. The video does not need any fancy editing. If you can’t make a 60-second video of yourself, you will not be right for this role. \n\n\r\nYour role in the organization will include the following:\n\r\nOrganizational Support:\r\n- Provide high-level administrative support to the executive, including managing schedules, coordinating departments, and handling correspondence.\r\n- Organize internal systems, files and documents for optimal information flow, ensuring accuracy and efficient business productivity.\r\n- Manage business emails, phone calls, and other communications, filtering and prioritizing messages as needed. Ensuring urgent messages are flagged for immediate attention and drafting responses to routine inquiries.\r\n- Help resolve issues and challenges by identifying solutions and taking appropriate action.\r\n- Taking initiatives to improve SOP to ensure efficient business functionality and productivity.\r\n- Assisting with HR duties such as screening new applicants\n\r\nInterdepartmental support:\r\n- Perform data entry and maintain an effective electronic filing system.\r\n- Coordinating team functions by interpreting messages.\r\n- Preparing daily reports to the executive and weekly reports to other internal teams.\r\n- Draft and send quotes promptly and accurately to support sales functions.\r\n- Assist with monthly bookkeeping book keeping / payroll / miscellaneous and complex priorities.\n\r\nVendor support and coordination:\r\n- Act as a liaison, to facilitate efficient communication with vendors, answering inquiries and assisting with needs, demonstrating exceptional judgment in problem-solving.\r\n- Ensure all inquiries are responded to in a timely manner between the parties.\r\n- Maintain relationships with external vendors to ensure smooth communication.\n\n\r\nQualifications:\r\n- Excellent verbal and written communication skills that allow you to articulate vital information to different audiences\r\n- Excellent interpersonal skills that enables you to develop strong relationships with others\r\n- Fluent in English with a professional communication style.\r\n- Clear, professional phone presence.\r\n- Ability to listen, interpret messages, and execute tasks effectively.\r\n- Strong organizational abilities and meticulous attention to detail.\r\n- Solutions-oriented, accountable, and self-motivated.\r\n- Professional with business maturity and a positive attitude.\r\n- Proficient in Google Workspace and MS Offices especially Excel.\r\n- Familiarity with ERP type system - Zoho Books / Analytics / BIGIN\r\n- Familiarity with the sales cycle and an understanding of sales strategies and techniques.\r\n- Minimum of 5 years full-time experience as an Executive Assistant.\r\n- Experience or familiarity with the custom printed packaging industry, especially with pouch bags, boxes, and labels.\r\n- Technical knowledge related to procurement, printing materials and production processes, is highly desirable.\n\n\r\nHours and Compensation:\r\n- Working hours: 10 AM to 7 PM (include 1-hour unpaid break to be determined mutually), Sunday through Thursday (PST TIME, Vancouver BC, Canada). Excluding Canadian weekends and certain BC / PH statutory Holidays.\r\n- Training will be provided in only specific areas depending on what the candidate is not familiar with.\n\r\nAfter completing one year of service, teaUpgrade to see actual infombers are entitled to 5 business days of paid vacation time. Performance-based year-end bonus is also offered up to 1 month as an additional incentive.\n\n\r\nNote: We appreciate all applications, but only those selected for an interview will be contacted.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}