{
  "job_id": "1393795",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Experience-Associate-Remote-Coterie-Baby-Inc-1393795",
  "scraped_at": "2025-07-15T12:26:11.134446",
  "title": "Customer Experience Associate (Remote) – Coterie Baby, Inc.",
  "type_of_work": "Full Time",
  "salary": "$625/Month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Company \n\r\nCoterie Baby, Inc. is a modern baby care brand offering high-quality, eco-friendly diapers and wipes for a premium diapering experience. We pride ourselves on a customer-centric approach, ensuring parents have a beloved brand they can trust. \n\r\nJob Overview\n\r\nCoterie is seeking a Customer Experience Associate who is passionate about delivering exceptional service to our customers. In this non-technical support role, you will be the friendly face (or voice) of our company, helping customers with their orders, product inquiries, and any issues to ensure each interaction reflects our commitment to excellence. If you love taking care of others and delighting customers in every interaction, we want you on our team!\n\r\nKey Responsibilities\n\r\n• Customer Support: Promptly respond to customer inquiries via email, and text messages, providing accurate information and empathetic solutions.\n\r\n• Order Assistance: Help customers with orders, subscriptions, tracking shipments, and processing returns or exchanges as needed.\n\r\n• Customer Delight: Go the extra mile to wow our customers – propose creative solutions or little touches that turn a good customer experience into a great one.\n\r\n• Feedback & Improvement: Gather customer feedback and collaborate with the team to improve products and processes, ensuring we continuously elevate the customer experience.\n\r\n• Team Collaboration: Work closely with our US and PH teaUpgrade to see actual infombers, keeping everyone updated on customer issues and trends. You’ll attend weekly virtual teaUpgrade to see actual infoetings and occasional training sessions to stay aligned with our customer experience strategy.\n\r\nQualifications\n\r\n• Experience: 1+ year in customer service or support (e-commerce or retail preferred).\n\r\n• Communication: Absolutely perfect English – superb written and spoken communication skills are a must. You can convey empathy and clarity in writing with no grammar errors.\n\r\n• Skills: Familiarity with customer support tools (helpdesk software like Zendesk or Kustomer, chat platforms)\n\r\n• Customer Focus: Service-minded attitude – you genuinely enjoy helping people and take pride in solving problems. A strong desire to delight customers and make their day better is essential.\n\r\n• Problem-Solving: Detail-oriented and resourceful. Able to troubleshoot order issues or complaints calmly and find solutions independently.\n\r\n• Work Setup: Reliable internet (high-speed connection) and ability to adapt to new software and processes quickly.\n\r\nWork Hours & Schedule\n\r\nThis is a full-time (40 hours/week) remote contract position. Our Team works 24/7 which means we have both evening and day shifts available. Every associate gets at least 1 weekend day off (if requested). Holiday shifts may occasionally be required, with overtime or additional pay as applicable. \n\r\nCompensation & Benefits\n\r\n• Competitive Salary: Starting at $625 USD per month (approximately PHP 35,000) base pay, with potential for performance-based bonuses for achieving customer satisfaction targets.\n\r\n• 13th Month Pay: We provide a 13th month bonus pay every year, aligned with Filipino employment traditions.\n\r\n• Performance Incentives: In addition to base pay, you’ll have bonus potential! We offer performance bonuses based on metrics and  raises based on your results and improvement.\n\r\n• Paid Training & Growth: Paid training is provided to get you up to speed on our products and tools. We invest in continuous skill development – expect mentorship and access to resources to help you grow with us.\n\r\n• Monthly Internet Stipend: We also provide a monthly internet allowance to ensure you have a stable connection for work.\n\r\n• Work-from-Home Setup: This role is 100% remote – no commuting!\n\r\n• Team Culture & Perks: Join a supportive, friendly team. We have weekly video meetings to stay connected and fun occasional team-building activities. You’ll be part of a company that values its people – 100% of employees say Coterie is a great place to work!Upgrade to see actual info. Plus, we celebrate your milestones (like birthdays and other special occasions) with small gifts or bonuses as a token of appreciation. \n\r\nHow to Apply\n\r\nReady to elevate the customer experience for a brand parents love? Apply now by sending us your resume and a short voice or video introduction. In your intro, tell us why you’re excited to work with Coterie and share an example of a time you made a customer happy. We can’t wait to meet you!                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:23:27.900737",
      "reason": "Job first discovered"
    }
  ]
}