{
  "job_id": "1393274",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-for-Dropshipping-Ads-Creative-Research-Savvy-1393274",
  "scraped_at": "2025-07-14T23:09:27.381498",
  "title": "Video Editor for Dropshipping Ads – Creative & Research-Savvy",
  "type_of_work": "Part Time",
  "salary": "600-1000",
  "hours_per_week": "30",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Our e-commerce company is hiring! We’re looking for a full-time Video Editor who specializes in creating high-converting ad creatives for dropshipping products. This role is perfect for someone who understands the world of e-commerce, knows how to edit videos that convert to sales, and can research and source creatives from competitor ads (e.g., through Facebook Ad Library or similar tools).\n\r\nKey Responsibilities:\r\n- Create scroll-stopping video ads for Upgrade to see actual info products for Facebook.\r\n- Research and analyze competitor ads using tools like Facebook Ad Library, PPSpy, Minea, or manual deep dives to find effective video angles and winning formats.\r\n- Repurpose raw materials (product pages, supplier videos, images) into high-converting creatives.\r\n- Add voiceovers, subtitles, callouts, and other attention-grabbing elements.\r\n- Ensure creatives match the product positioning and communicate benefits clearly and visually.\n\r\nRequirements:\r\n- Proven experience in video editing for e-commerce/dropshipping.\r\n- Ability to find and reverse-engineer winning ads from competitors.\r\n- Proficiency with video editing tools (e.g., Adobe Premiere Pro, Final Cut Pro, CapCut, etc.).\r\n- Experience with subtitles, voiceovers, hooks, and fast-paced ad formats.\r\n- Basic knowledge of what makes an ad convert (angles, CTAs, problem-solution framing).\r\n- High attention to detail – please include ???facebook ad library” as your answer to the first application question.\r\n- Must be accountable, fast, and reliable.\n\r\nCompensation & Growth Path:\r\nTrial period (1 month): $6–$10/hour (based on experience).\r\nAfter a successful trial: fixed fee per creative + significant bonus potential based on ad performance.\r\nLong-term opportunity to grow with a performance-driven team in a high-potential niche.\n\r\nWhy Work With Us?\r\n- 100% remote, flexible hours\r\n- Paid bi-weekly (13x/year)\r\n- Work directly with the founder\n\r\nJoin a fast-growing dropshipping brand with serious ad spend!\r\nBig room for growth, bonuses, and creative freedom\n\r\nIf you're passionate about e-commerce, skilled in creative video editing, and love diving into competitive research—apply now and show us what you can do!\n\r\nKind regards,\r\nJeremy Vos",
  "skill_requirements": [
    "Video Editing",
    "Market Research"
  ]
}