{
  "job_id": "1394483",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Stack-Developer-Senior-Level-of-10-years-1394483",
  "scraped_at": "2025-07-15T15:29:07.990502",
  "title": "Full Stack Developer - Senior Level of 10+ years",
  "type_of_work": "Full Time",
  "salary": "DOE",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re looking for a Senior Full Stack Developer who’s passionate about building exceptional web applications and solving real-world problems for growing businesses. This is your chance to be part of a fast-moving team that values technical excellence, collaboration, and making an impact.\n\r\nIf you’re highly skilled in React, Next.js, Nest.js and Node.js, and comfortable working US business hours, we’d love to meet you.\n\r\nKey Responsibilities\r\n • Lead the design, development, and deployment of high-performance web applications.\r\n • Work across the stack using React, Next.js, Nest.js and Node.js to build scalable, maintainable features.\r\n • Collaborate with product managers, designers, and fellow engineers to ship high-quality solutions.\r\n • Own development cycles from concept to deployment—including testing, documentation, and performance optimization.\r\n • Implement and maintain robust, well-tested APIs and backend services.\r\n • Contribute to architectural decisions and help mentor junior developers as needed.\n\r\nRequirements\r\n • Minimum of 10+ years of hands-on experience as a Full Stack Developer.\r\n • Expertise with React, Next.js, Nest.js and Node.js in production environments.\r\n • Proficiency with REST APIs, modern JavaScript/TypeScript, and async programming.\r\n • Strong experience with Git and collaborative workflows (e.g., GitHub, GitLab).\r\n • Excellent debugging, optimization, and problem-solving skills.\r\n • Clear written and verbal communication.\r\n • Availability to work full-time during US business hours.\n\r\nPreferred Qualifications\r\n • Experience with AWS services (e.g., Lambda, S3, API Gateway, EC2).\r\n • Familiarity with CI/CD pipelines, DevOps practices, and infrastructure as code.\r\n • Experience with serverless architectures and performance-focused applications.\n\r\nWhat We Offer\r\n • Competitive compensation based on experience and contribution.\r\n • Flexible, remote-friendly role aligned with US time zones.\r\n • Opportunities for continuous learning, mentorship, and career growth.\r\n • A supportive, collaborative team culture that values quality and innovation.\r\n • The chance to work on meaningful projects that drive real business value.\n\r\nIf you’re a seasoned developer ready to take ownership and grow with a team that values your expertise—apply now and let’s build something great together.",
  "skill_requirements": [
    "React JS",
    "Nest JS",
    "Next JS"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:29:07.992302",
      "reason": "Job first discovered"
    }
  ]
}