{
  "job_id": "1394862",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Audit-Controls-Specialist-Team-Lead-1394862",
  "scraped_at": "2025-07-15T15:45:58.446111",
  "title": "Audit & Controls Specialist (Team Lead)",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Company: Contentas Ventures\r\nLocation: Remote (Philippines)\r\nRole Type: Full-time\n\n\r\nAbout Us:\n\r\nContentas Ventures is a venture capital firm based in Europe. We support our portfolio companies with hands-on services across finance, compliance, HR, marketing, and sales, helping them grow with speed and confidence.\n\r\nOur growing remote team plays a vital role in delivering these services with professionalism and reliability. We believe in building lean, high-performing teams that value ownership, clarity, and continuous improvement.\n\r\nJoin us and help shape the operational backbone of some of the most exciting startups in Europe.\n\n\r\nAbout the Role:\n\r\nWe are hiring a Team Lead (Audit & Controls Specialist) to oversee a remote accounting team delivering shared finance and compliance services to our growing portfolio of startups. This role spans leadership, quality control, and cross-functional coordination.\n\n\r\nResponsibilities:\n\r\n- Supervise a team of 5 specialists (AR, AP, Reconciliation, Reporting & Compliance, Payroll & HR)\n\r\n- Review outputs, ensure process consistency, and coach teaUpgrade to see actual infombers\n\r\n- Lead audit preparation and internal control efforts\n\r\n- Coordinate deadlines, KPIs, and escalations with stakeholders\n\r\n- Drive continuous improvement and knowledge sharing across the team\n\n\r\nQualifications:\n\r\n- 5+ years in accounting or audit roles, with at least 2 in team leadership\n\r\n- Experience with international clients\n\r\n- Deep knowledge of financial workflows and audit principles\n\r\n- Strong communication, project coordination, and mentoring skills",
  "skill_requirements": [
    "Accounting Management",
    "Internal Auditing",
    "Team Leadership"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T05:36:09.893175",
      "reason": "Job first discovered"
    }
  ]
}