{
  "job_id": "1394149",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Media-Specialist-1394149",
  "scraped_at": "2025-07-14T23:07:12.044584",
  "title": "Media Specialist",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Position Summary\r\nWe’re expanding our media team and looking for experienced, results-driven individuals ready to thrive in a fast-paced and dynamic environment. This is a unique opportunity to work closely with our in-house U.S. marketing team and support digital campaigns for some of the biggest car manufacturers in the world.\r\nAs a Media Specialist, you will play a key role in executing, monitoring, and optimizing paid media campaigns across Google, Meta (Facebook/Instagram), TikTok, and more. This position offers hands-on exposure to high-budget accounts, advanced campaign strategies, and collaboration with a top-tier team.\r\nWe are seeking candidates with at least 3 years of paid media experience who are detail-oriented, accountable, and eager to contribute to a collaborative team.\r\nKey Responsibilities\r\n? Manage and optimize paid media campaigns across platforms (Google, Meta, TikTok, etc.)\r\n? Pull, analyze, and update daily campaign performance reports\r\n? Monitor budgets, pacing, and bidding strategies to ensure efficiency and strong ROI\r\n? Support A/B testing and creative optimization to improve campaign results\r\n? Collaborate with U.S.-based marketing and creative teams\r\n? Follow established workflows and ensure quality assurance in campaign execution\r\nRequirements\r\n? Minimum 3 years of hands-on experience managing paid media campaigns across Meta Ads Manager, Google Ads, TikTok Ads, etc.\r\n? Strong attention to detail and ability to follow directions precisely\r\n? Analytical skills with the ability to interpret data and optimize accordingly\r\n? Proficiency in Google Sheets/Excel for tracking and reporting\r\n? Familiarity with ad tracking (UTM parameters, Meta Pixel, GA4, etc.)\r\n? Reliable internet connection and a quiet, professional workspace\r\n? Must be available to work 8 AM – 5 PM PST, Monday to Friday\r\nWhat We Offer\r\n? Opportunity for overtime work and performance-based bonuses\r\n? Training on internal tools, reporting processes, and workflow systems\r\n? Work with a highly experienced U.S. marketing team and major global brands\r\n? Clear path for career growth and skill development within a fast-growing company\r\nReady to join a high-performing digital media team?\r\nApply today and bring your skills to an exciting, fast-moving industry.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}