{
  "job_id": "1394915",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Instagram-Virtual-Assistant-Fluent-English-Speaker-1394915",
  "scraped_at": "2025-07-15T15:48:09.139337",
  "title": "Instagram Virtual Assistant - Fluent English Speaker",
  "type_of_work": "Full Time",
  "salary": "$2/hr base + high-earning commissions",
  "hours_per_week": "56",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Join Our Team as an Instagram Virtual Assistant (VA)\n\r\nAre you a creative, detail-oriented individual with a passion for Instagram marketing? We're looking for a talented Instagram VA to join our fast-growing team and help us manage and grow multiple client accounts using innovative strategies.\r\nIf you're ready to take on a dynamic, full-time role where your skills will make a real impact, keep reading—this could be the opportunity you've been waiting for!\r\n________________________________________\n\r\nWhat You'll Be Doing\n\r\nAs our Instagram VA, you'll play a key role in helping our clients grow their online presence. Your responsibilities will include:\r\n• Managing 3+ organic Instagram accounts per client.\r\n• Researching and curating niche-specific content for each client.\r\n• Writing captivating captions that resonate with target audiences.\r\n• Posting content consistently and strategically.\r\n• Engaging with followers by replying to comments and DMs.\r\n• Tracking and organizing account data using Google Sheets, Airtable and other CRM tools.\r\nThis role is perfect for someone who thrives in a fast-paced environment, can think on their feet, and brings creativity to the table when challenges arise.\r\n________________________________________\n\r\nWhat We're Offering\n\r\n• Full-time position: Work Monday to Saturday, 7 PM - 3 AM Philippine Time (PHT).\r\n• Incentive-based pay: After a paid probationary period, you'll have the opportunity to earn commissions that can exceed your base salary, depending on your performance and results. The harder you work, the more you can earn!\r\n• Growth opportunities: Pay raises, promotions, and leadership roles are available for those who consistently deliver exceptional results and demonstrate dedication.\r\n• Comprehensive training: We'll provide all the tools and knowledge you need to succeed during your first month.\r\n________________________________________\n\r\nWhat You'll Need to Succeed\n\r\nTo excel in this role, you'll need:\r\n• A computer with a fast internet connection.\r\n• Access to Instagram, Telegram, Google Meets, Google Sheets, Airtable, and email.\r\n• A strong command of written English, with the ability to type fluently and convey personality through text.\r\n• Attention to detail and the ability to follow instructions precisely.\r\n• A creative mindset to adapt to changing trends and traffic patterns.\r\n• A passion for growth and a willingness to learn.\r\n________________________________________\n\r\nPreferred Experience\n\r\n• Using Google Sheets and Airtable for tracking and organizing data.\r\n• Familiarity with the Instagram platform.\r\n• Previous experience not required; full training provided.\r\n________________________________________\n\r\nImportant Note About Hours\n\r\nThis is a night shift position. You must be able to work 7 PM - 3 AM Philippine Time (PHT), 7 days a week. Please ensure these hours align with your lifestyle before applying.\r\n________________________________________\n\r\nHow to Apply\n\r\nWe want to hear from you! To apply, follow these steps carefully:\r\n1. Send us a message with the following introduction: \r\nThis is (YOUR NAME), and I am excited to join your team and work for your agency. I would like to apply for the Instagram VA position. Today is (THE DAY and MONTH YOU SEND THIS EMAIL, e.g., Dec 24). Thank you.\n\r\n2. Fill out this form (link provided). Applications without the completed form will NOT be considered.\nUpgrade to see actual info\r\n________________________________________\n\r\nWhy Join Us?\n\r\nThis is your chance to join a supportive, fast-growing team where your contributions will be valued and rewarded. If you're ready to take the next step in your career, we can't wait to hear from you!",
  "skill_requirements": [
    "Social Media Management",
    "Google Sheets",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T11:40:23.056566",
      "reason": "Job first discovered"
    }
  ]
}