{
  "job_id": "1394392",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Content-Quality-Analyst-1394392",
  "scraped_at": "2025-07-15T12:22:41.679796",
  "title": "Content Quality Analyst",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re hiring a Content Quality Analyst to help ensure the quality and consistency of web content across our firm’s website. This junior-level role is well-suited for someone who’s detail-oriented, organized, and comfortable working within legal subject matters. You should be confident reviewing content with a critical eye, open to learning, and willing to speak up when you spot issues or areas for improvement. You’ll also work with other teams to keep everything consistent and up to standard across the site. A legal background isn’t required, but the ability to understand legal concepts and apply established guidelines accurately is essential.\n\r\nKey Responsibilities\r\n-Review web content for legal marketing compliance, factual and conceptual accuracy, grammar, and readability.\r\n-Conduct regular audits of web pages for both content and technical issues.\r\n-Ensure SEO best practices are implemented throughout all content (keywords, meta tags, headers, etc.).\r\n-Perform basic technical checks (e.g., internal links, alt text, metadata, formatting).\r\n-Coordinate with different teams to ensure consistent application of content standards.\r\n-Track content updates and maintain documentation of reviews and recommendations.\r\n-Support the development of internal content standards and style guides.\n\r\nQualifications And Skills\r\n-Excellent attention to detail and the ability to identify content inconsistencies or errors.\r\n-Strong organizational and time management skills.\r\n-Ability to follow complex editorial, legal, and brand standards accurately.\r\n-Fast learner with the ability to adapt to legal content and digital platforms.\r\n-Strong written communication and analytical skills.\r\n-Familiarity with legal terminology, especially in the U.S. legal landscape (preferred).\r\n-Understanding of basic website development concepts such as HTML tags and page structure (preferred).\n\r\nBasic Requirements\r\n-Device Specifications: Intel i5 processor or higher with a minimum of 8GB RAM\r\n-Equipment: Webcam, speakers, and a microphone or headphones\r\n-Internet Speed: Minimum of 100Mbps with a backup connection in case of outages\n\r\nWork Details\r\nWorking Hours: Monday to Friday, 8 AM to 5 PM Pacific Standard Time | Tuesday to Saturday, 12 AM to 8:30 AM Manila Time\n\r\nLocation: Anywhere in the Philippines\n\r\nWhy Join Us?\r\n-Stable employment\r\n-Competitive salary\r\n-Bi-monthly salary\r\n-A-Z benefits, including bonuses and annual raises\r\n-Work-life balance \r\n-Work-from-home opportunity\n\r\nIf interested, kindly send your resume to Upgrade to see actual info\n\r\nStart Your Journey With Us\r\nIf you enjoy working behind the scenes to make sure content is clear, accurate, and up to standard, this role might be a strong match. You're the kind of person who notices the small things, like an awkward phrase, a broken link, a detail that doesn’t quite add up, and you take pride in getting it right. You’ll be part of a collaborative team that values quality and attention to detail, steady support, and room to grow in a stable, long-term role. If that sounds like the kind of environment you’re looking for, we’d like to hear from you.",
  "skill_requirements": [
    "Article Writing",
    "External Audit",
    "Writing"
  ],
  "is_active": true,
  "status_history": []
}