{
  "job_id": "1395020",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Scheduling-Coordinator-EST-Shift-Full-Time-1395020",
  "scraped_at": "2025-07-15T14:28:42.744822",
  "title": "Remote Scheduling Coordinator – EST Shift | Full-Time",
  "type_of_work": "Full Time",
  "salary": "800-960 CDN",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us\r\nStellar Personnel is a fast-growing Canadian staffing company serving hospitality, events, and logistics clients across the country. We work with some of the most recognizable venues and brands in Canada.\n\r\nWe are hiring a Remote Staffing Coordinator to support our shift fulfillment operations. This role is ideal for someone with strong experience in staffing logistics, worker communication, and operational problem-solving.\n\r\nKey Responsibilities\r\nAssign and monitor shifts using Nowsta\n\r\nCommunicate with contractors and teaUpgrade to see actual infombers via Slack\n\r\nTrack shift completion, attendance, and fulfillment in Google Sheets\n\r\nRespond to last-minute changes, cancellations, or coverage gaps professionally and efficiently\n\r\nEnsure accurate and timely updates to all platforms and internal logs\n\r\nFollow escalation procedures and SOPs as required\n\r\n Required Skills & Experience\r\nMinimum 3 years of experience in high-volume staffing coordination\n\r\nProven ability to manage multiple shifts, workers, and client accounts simultaneously\n\r\nProficient in Slack, Nowsta, and Google Sheets\n\r\nExcellent written and spoken English\n\r\nStrong attention to detail and a high level of responsiveness\n\r\nAble to work full-time night shift (PH time: 9:30 PM–6:00 AM)\n\r\nReliable internet and a quiet, dedicated home workspace\n\r\n Schedule & Commitment\r\nFull-time: 40 hours/week\n\r\nLong-term opportunity with consistent workload\n\r\nWhat You Can Expect\r\nStructured workflows and systems for clarity and efficiency\n\r\nCollaborative team environment with clear communication channels\n\r\nExposure to large-scale staffing operations across Canada\n\r\nReal opportunity to grow and take ownership of critical scheduling functions\n\r\nTo Apply:\r\nSubmit your OnlineJobs.ph profile and include a brief note summarizing your experience with high-volume staffing and your proficiency with Slack, Nowsta, and Google Sheets. Shortlisted applicants will proceed to an assessment.",
  "skill_requirements": [
    "Attention to Detail",
    "Critical Thinking",
    "Decision Making"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:27:56.832427",
      "reason": "Job first discovered"
    }
  ]
}