{
  "job_id": "1395950",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-Graphic-Designer-for-E-Commerce-1395950",
  "scraped_at": "2025-07-15T09:36:05.066563",
  "title": "Experienced Graphic Designer for E-Commerce",
  "type_of_work": "Full Time",
  "salary": "$400+/month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Location: Remote\r\nShift: Monday to Friday, 9:00 AM - 14:00 PM EST (New York Time)\n\r\nAbout the Role:\r\nWe are seeking a highly creative and detail-oriented Graphic Designer to join our e-commerce team. The ideal candidate will have a strong portfolio showcasing their ability to create visually compelling designs that drive conversions. This is a long-term role with opportunities for advancement.\n\r\nResponsibilities:\r\n1. Design engaging infographics for social media posts, Amazon listings, and Shopify store.\r\n2. Edit and produce high-quality videos using a mix of video clips and photos.\r\n3. Create product labels and packaging designs that align with brand guidelines.\r\n4. Collaborate with the team to ensure designs meet marketing and sales objectives.\r\n5. Be open to feedback and revisions, with patience and a collaborative mindset to refine designs for optimal impact.\n\r\nRequired Skills:\r\n- Proven creative ability with a strong portfolio of work.\r\n- Expertise in creating conversion-focused visuals (photos, videos, and graphics).\r\n- Proficiency in design tools such as Adobe Creative Suite (Photoshop, Illustrator, Premiere Pro, After Effects, etc.).\r\n- Strong understanding of e-commerce platforms (Amazon, Shopify) and trends.\r\n- Excellent attention to detail and ability to meet deadlines.\n\r\nHow to Apply:\r\nPlease send your resume, portfolio, and examples of the following :\r\n- Product label designs\r\n- Product packaging designs\r\n- Infographic designs\r\n- Video editing",
  "skill_requirements": [
    "Video Content Creation",
    "Infographics",
    "Graphic Design"
  ],
  "is_active": true,
  "status_history": []
}