{
  "job_id": "1396164",
  "url": "https://www.onlinejobs.ph/jobseekers/job/eCommerce-Admin-1396164",
  "scraped_at": "2025-07-15T15:38:23.812859",
  "title": "eCommerce Admin",
  "type_of_work": "Full Time",
  "salary": "$90-$120",
  "hours_per_week": "35",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Our Company Security Parts is based on our website  Upgrade to see actual info where we are providing an easy way to find online the correct parts and accessories of door hardware. \r\nWe are providing on our website an easy lookup way for people who are looking to find the correct part or accessory of their specific model of hardware such as exit devices , locksets, door closers, and more.    \r\nFor each individual model, customers can find their respective categories and subcategories of all the parts and accessories, as well we give the diagrams of the lock where the customer can buy via clicking on the diagram the parts he is looking for. \r\nPlease give a look on our site  Upgrade to see actual info where you can find out how it works\n\r\nJob should be done on our local time zone which is EST eastern standard time between the hours of 9 AM -5 PM\r\nJob is based on the following tasks:\r\n- Analyzing the Pricebooks and Part Manuals, each series have many models, and the respective parts and accessories.\r\n- Adding all the parts to the site (which may by sometimes over 1500 parts for a brand)\r\n- Create models (a page to find all parts of a specific model) at their brand and series / product type.\r\n- Put the right diagrams to each model, then link the parts to the diagrams.\r\n- Categorize the parts at each model with categories and subcategories\r\n- Ensuring that all parts are sorted appropriately on our filter system by product type, part type, and brand/series/model. \n\r\nImportant for us is an employee that is:\r\n- Here to learn and deepen his understanding of the door hardware industry \r\n- Have a focused mind to catch things instinctively when appropriate, also to catch off the small details between the thousands of parts.\r\n- Asking clarifying questions when instructions are not fully clear, as it's always better to seek understanding than to proceed incorrectly.\r\n- Available and committed to maintaining consistent communication with your US office during working hours.",
  "skill_requirements": [
    "Ecommerce",
    "Product Listing"
  ],
  "is_active": true,
  "status_history": []
}