{
  "job_id": "1396769",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Part-Time-Influencer-Marketing-Officer-1396769",
  "scraped_at": "2025-07-15T12:35:06.582765",
  "title": "Part-Time Influencer Marketing Officer",
  "type_of_work": "Part Time",
  "salary": "$250/MO-$700/MO",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "[About the Role]\r\nWe are currently recruiting multiple part-time social media influencer marketing specialists. Applicants should be result-oriented. Among all the qualities we look for in our recruitment, integrity, responsibility and proactiveness are the most valued.\n\r\nPlease note that you need to prepare your own tools for searching and contacting influencers for this position.\n\r\nYour main responsibilities include: discovering and recruiting influencer resources, maintaining cooperative relationships with influencers, and promoting products and enhancing brand awareness through their influence.\n\r\nOutstanding performers will have the opportunity to participate in other business projects, such as social media operation, creative projects, integrated marketing communication projects, etc.\n\nUpgrade to see actual info Identification & Recruitment:\r\n- Proactively utilize the tools and methods you already have to identify and seek out relevant influencers on various platforms such as Douyin, Instagram, and YouTube.\r\n- Evaluate potential influencers based on audience characteristics, engagement rates, content quality, and brand fit.\r\n- Manage the entire influencer onboarding process, from initial contact to contract negotiation (templates will be Upgrade to see actual info Management & Execution:\r\n- Effectively communicate with influencers to clearly articulate campaign objectives, deliverables, and brand guidelines.\r\n- Collaborate with influencers to develop compelling and authentic content that resonates with their audience.\r\n- Monitor campaign performance and track key metrics, such as reach, engagement, website traffic, and conversions.\r\n- Ensure all influencer content adheres to brand guidelines and legal Upgrade to see actual info Tracking & Reporting:\r\n- Track and report on campaign performance, providing insights and recommendations for optimization.\r\n- Contribute to internal ranking and evaluation processes to measure the effectiveness of influencer partnerships.\n\n\nUpgrade to see actual info Confidentiality:\r\n- Adhere to strict confidentiality standards regarding internal information, campaign strategies, influencer agreements, and others as Upgrade to see actual info Understanding & Research:\r\n- Rapidly research, study, and understand our products across various categories to effectively communicate their benefits to influencers.\r\n- Develop clear and concise product briefs for influencers, highlighting key features and messaging Upgrade to see actual info\r\n- Minimum of 1 year of related experience in influencer marketing.\r\n- Proven ability to identify, recruit, and manage relationships with influencers.\r\n- Established tools and methodologies for influencer search and evaluation.\r\n- High sense of responsibility.",
  "skill_requirements": [
    "Email Marketing",
    "Influencer Marketing",
    "eMail Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:27:48.549532",
      "reason": "Job first discovered"
    }
  ]
}