{
  "job_id": "1396819",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Real-Estate-Appointment-Setter-Voice-Remote-1396819",
  "scraped_at": "2025-07-14T22:27:41.156909",
  "title": "Real Estate Appointment Setter (Voice | Remote)",
  "type_of_work": "Full Time",
  "salary": "$480/month starting rate",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Real Estate Appointment Setter (Voice | Remote)\n\r\nOpen to Beginners – No Sales Involved! With or without BPO Experience!\r\nWork From Home | Full-Time\n\r\nAre you a people person who loves talking and making others feel at ease? Do you enjoy meaningful conversations more than hard selling? We’re looking for a Voice-Based Appointment Setter to support our real estate consulting team by making calls to interested leads, building trust, and scheduling qualified meetings, without sounding like a pushy salesperson. \n\r\nAbout the Role\r\nYou’ll be the warm, helpful voice that represents our founder, Mr. Fariborzi, when reaching out to prospective clients interested in real estate opportunities in Dubai. These are not cold calls, these are warm or semi-cold leads who’ve shown interest. Your role is not to sell anything, it’s to guide, qualify, and schedule.\n\r\nThis is not a sales role. Think of it as a high-end client concierge — your job is to:\r\nStart warm, natural conversations (no scripts-only robots here!)\r\nAsk thoughtful qualifying questions (with the help of our script)\r\nBook Google Meet appointments with interested, qualified clients\r\nSend gentle reminders so they actually show up\r\nBe that calm, kind voice that makes clients feel like they’re in good hands\n\r\nKey Responsibilities\r\nCall warm or semi-cold leads using our approved calling system\r\nQualify leads based on goals, budget, location preferences, etc.\r\nBook meetings directly into the calendar with reminders\r\nSend friendly follow-ups via WhatsApp and email\r\nTrack key lead details using our ClickUp system\n\r\nWhat We’re Looking For\r\nFluent spoken English with a soft, neutral, or calming accent\r\nAble to build rapport quickly and sound trustworthy, not salesy\r\nComfortable using Google Meet and WhatsApp, with the willingness to learn ClickUp\r\nMust have stable internet, a laptop/PC, and a smartphone\r\nBonus: Experience in appointment setting or customer support/BPO\n\r\nCompensation & Schedule\r\nBase Pay: $480 USD/month\r\nBonuses:\r\n$ for every appointment you successfully book that actually shows up.\r\nGet $$$ additional bonus for every deal that closes from a client you helped bring in.\r\nWork Hours: Full-time, work from home | Monday to Friday | 2 PM – 10 PM PHT (flexible within range)\n\r\nApply Now:\r\nFill out this quick form to show us what you’ve got:\r\n[Add an ‘h’ at the beginning and paste it into your browser]\nUpgrade to see actual info/Upgrade to see actual info/f/rdm8x-64858/NH9BO4ZX553KYQ7HX6",
  "skill_requirements": [
    "Customer Service",
    "Outbound Calls",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": []
}