{
  "job_id": "1397711",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Assistant-1397711",
  "scraped_at": "2025-07-15T12:28:37.376027",
  "title": "Sales Assistant",
  "type_of_work": "Any",
  "salary": "30,000 PHP/Month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a leading customised clothing and promotional products supplier in Australian market. It is essential for the candidates to have relative industry experience.\n\r\nAs a Business Development Manager, you will play a pivotal role in driving our company's growth by expanding our client base, nurturing relationships with current clients, and re-engaging with previous clients. Your responsibilities will encompass three major parts:\n\r\n• New Client Development:\r\n• Identify and prospect potential clients within the target market.\r\n• Conduct market research to understand client needs and preferences.\r\n• Develop and implement strategies to acquire new clients and secure new business opportunities.\r\n• Build and maintain a robust pipeline of leads through proactive outreach and networking efforts.\r\n• Current Client Order Follow-Up:\r\n• Act as a primary point of contact for existing clients, ensuring their orders are processed smoothly and efficiently.\r\n• Communicate with clients to gather feedback, address concerns, and ensure satisfaction with our products and services.\r\n• Coordinate with internal teams to fulfil client orders accurately and within agreed timelines.\r\n• Upsell and cross-sell additional products and services to existing clients based on their evolving needs.\r\n• Previous Clients Reactive:\r\n• Revive relationships with previous clients and explore opportunities for re-engagement.\r\n• Conduct outreach campaigns to reconnect with dormant clients and understand reasons for disengagement.\r\n• Propose tailored solutions to win back previous clients and regain their trust and loyalty.\r\n• Follow up on inquiries and requests from previous clients promptly and professionally.\n\r\nRequirements:\n\r\n• Proven track record in business development, sales, or account management within the uniform and promotional products industry.\r\n• Strong understanding of the Australian market and its dynamics.\r\n• Excellent communication, negotiation, and interpersonal skills.\r\n• Ability to work independently and collaboratively in a fast-paced environment.\r\n• Goal-oriented mindset with a focus on achieving and exceeding targets.\r\n• Proficiency in using ERP software (like Odoo) and other sales tools.\r\n• Flexibility to adapt to Australian Eastern (AEST) working hours.\r\n• Preferable if you could speak fluent Mandarin, but it is not essential\r\n• Preferable if you have Graphic Design skills can design and use Mailchimp, but not essential.\n\n\r\nBenefits:\r\n• Competitive salary package with performance-based incentives.\r\n• Opportunities for career advancement and professional development.\r\n• Supportive and collaborative team environment.\r\n• Exciting prospects to contribute to the growth and success of a dynamic company.\n\r\nIf you are a driven and results-oriented individual with a passion for business development in the uniform and promotional products industry, we invite you to join our team and make a meaningful impact. Please submit your resume and cover letter outlining your relevant experience and why you are the ideal candidate for this position. We look forward to hearing from you!\n\r\nApplication Deadline: 31 July 2025\n\r\nPlease email your cover letter and resume to Upgrade to see actual info\n\r\nBUCK SPORTS PTY LTD\r\nJob Types: Full-time, Permanent\r\nPay: Php30,000.00 - Php38,000.00 per month\n\r\nBenefits:\r\n• Flexible schedule\r\n• Flextime\r\n• Promotion to permanent employee\r\n• Work from home\n\r\nSchedule:\r\n• 8 hour shift\n\r\nSupplemental Pay:\r\n• Performance bonus\r\n• Yearly bonus\n\r\nApplication Question(s):\r\n• Do you have clothing and promotional products knowledge ?\n\r\nExperience:\r\n• B2B sales: 3 years (Required)\n\r\nLanguage:\r\n• Mandarin (Preferred)\n\r\nApplication Deadline: 07/31/2025\r\nExpected Start Date: 08/01/2025",
  "skill_requirements": [
    "Lead Generation",
    "English Speaking",
    "Outbound Calls"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:33:13.924075",
      "reason": "Job first discovered"
    }
  ]
}