{
  "job_id": "1397717",
  "url": "https://www.onlinejobs.ph/jobseekers/job/MARKETING-MANAGER-1397717",
  "scraped_at": "2025-07-15T09:30:00.599532",
  "title": "MARKETING MANAGER",
  "type_of_work": "Any",
  "salary": "AUD10/hour",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "As a Marketing Manager in the AU mortgage industry, you’ll independently spearhead the marketing calendar and execution of the business overall strategies including innovative SEO strategies and craft compelling content that resonates to the Australian market. This position offers you the chance to leave a legacy, driving traffic and engagement with top-tier content across the company’s website, landing pages, and social media to generate quality leads for this business. In this role, you will develop and implement cutting-edge strategies to boost organic search rankings, create and optimize high-quality content, paid lead generation, email marketing campaigns with existing databases, facebook group nurturing and perform keyword research and competitor analysis. Join us and be at the forefront of one of Australia’s biggest industries, where your creativity and expertise can truly make a difference.\n\r\nMortgage and Lending Success: Your Role in the Foundation of Our Team\r\nSEO & Content Strategy\r\n• Develop and implement a best-in-class SEO strategy to improve organic search rankings and drive traffic.\r\n• Create, manage, and optimize high-quality, engaging content across various platforms, including blogs, landing pages, and social media.\r\n• Conduct keyword research, competitor analysis, and performance tracking to continuously enhance content performance.\n\r\nWebsite Development & Enhancement\r\n• Oversee website development projects, ensuring user-friendly design, search engine optimization, and regular updates with fresh content.\r\n• Collaborate with web developers and designers to enhance site functionality, speed, and conversion rates.\r\n• Implement A/B testing and other optimization techniques to improve user experience and drive conversions (including integration to the CRM, chatbot and AI integration strategies)\r\n• Work on lead generation and remarketing campaigns to direct traffic onto website\n\r\nSocial Media Management\r\n• Manage and grow the company’s presence across social media platforms, including Facebook, Instagram, LinkedIn, Twitter, Tik Tok and others.\r\n• Develop and execute a content calendar to ensure consistent posting and engagement across channels.\r\n• Create, manage, and optimize paid social media campaigns to generate leads and boost brand awareness.\r\n• B2C leads or B2B referral arrangements through LinkedIn/Facebook/Instagram or Tik Tok platforms \n\r\nLead Generation & Funnel Development\r\n• Design and implement lead generation strategies, including email marketing campaigns, landing pages, and gated content, to attract qualified leads.\r\n• Monitor and analyse funnel performance, making data-driven decisions to improve conversion rates at each stage.\r\n• Collaborate with the sales team to align marketing efforts with sales goals and ensure a steady flow of leads.\n\r\nAdvertising & Campaign Management\r\n• Create and manage digital advertising campaigns, including Google Ads, display ads, and social media ads.\r\n• Optimize ad performance through continuous monitoring and testing, adjusting strategies to maximize ROI.\r\n• Track and report on the performance of all marketing campaigns, providing insights and recommendations for improvement\n\r\nOther ad hoc marketing tasks\n\r\n• Projects and campaigns to implement marketing strategies, review training modules, delegate/nurture work to interns/junior staff\r\n• Work with current marketing contractors, and monitor the performance and effectiveness of current campaigns – suggest improvements.\n\r\nAnalytics & Reporting\r\n• Utilize analytics tools such as Google Analytics, SEMrush, and social media insights to track performance metrics.\r\n• Generate regular reports on campaign performance, website traffic, SEO, and lead generation efforts.\r\n• Provide actionable insights based on data to refine marketing strategies and drive continuous improvement.\n\r\nRequirements\r\nNailing It: The Skills You’ll Need to Join Our Crew\r\n• Bachelor’s degree in marketing, Business, Communications, or a related field.\r\n• Preference with experience working with Australian companies, and particularly the local financial industry.\r\n• 3-5+ years of experience in digital marketing, with a strong focus on SEO, lead generation, content creation, and social media management. An independent all-round marketing manager or ready to step into the role as one implementing marketing schedules and working directly with the CEO of the business.\r\n• To be able to have graphic design skills or ability in using Canva (or similar) and video editing tools is a plus, or know how to use outsource solutions to get the project completed.\r\n• Proven track record of driving traffic, generating leads, and supporting sales teams through effective marketing strategies.\r\n• Expertise in website development, including a solid understanding of HTML, CSS, and CMS platforms (e.g., WordPress).",
  "skill_requirements": [
    "Marketing",
    "Marketing Management",
    "Social Media Marketing"
  ],
  "is_active": true,
  "status_history": []
}