{
  "job_id": "1397951",
  "url": "https://www.onlinejobs.ph/jobseekers/job/All-Star-Customer-Support-Agent-Needed-1397951",
  "scraped_at": "2025-07-15T02:35:01.791992",
  "title": "All Star Customer Support Agent Needed",
  "type_of_work": "Part Time",
  "salary": "$4.50/hour",
  "hours_per_week": "18",
  "date_updated": "Jul 14, 2025",
  "job_overview": "EMAIL/CHAT CUSTOMER SUPPORT AGENT NEEDED.\n\r\nWe need a reliable customer support agent who is experienced in handling customer concerns, support issues, and technical issues.\n\r\nWe need someone who is quick to learn new features and is tech-savvy.\n\r\nWe are a graphic design software in a startup remote environment and we’re looking for someone to help take care of our customer’s concerns.\n\r\nThe job includes:\n\r\n- Customer Support (Email & Chat) for our multiple software products\r\n-  Technical Support (Email & Chat) for our multiple software products\r\n- Hands-on software learning\r\n- Learning product-specific features from the documentation available on Google Sheets, Google Docs, and Confluence\r\n- Copying, pasting, and updating email templates\r\n- Coordinating with our software programmers and relaying software tech issues\r\n- Generating email/chat replies by providing the BEST solution to the customer\r\n-  Figuring out solutions on your own and being proactive\r\n-  Zoom calls/teaUpgrade to see actual infoetings\r\n-  Updating documentation/protocol\r\n- Using our Customer support software, which is HelpScout\r\n- You would do other small, miscellaneous tasks like copying and pasting, or collecting data on spreadsheets or folders\n\r\n*You will work with minimal supervision, manage your own time effectively, and maintain control over your role and responsibilities. \n\r\nRequirements: (Please read everything CAREFULLY!)\n\r\n- Weekend work is a MUST, as that’s when most support tickets come in, around 30 mins per day\r\n- You should also be fluent in English with good written skills\r\n- You must have a fast and reliable internet connection, with your own laptop/PC to do your tasks\r\n- You must have strong attention to detail, focus, and presence of mind\r\n- You should be professional and be able to handle criticism and feedback without taking things personally\r\n- You should be a fast learner and be able to adapt to change quickly.\r\n- You must be able to work well with the team\r\n- You must be flexible, detail-oriented, hardworking, and dependable\n\r\nWorking Schedule: (Please read everything CAREFULLY!)\n\r\n-  Part time position with 20 hours per week including weekends (30 mins per day only during weekends)\r\n- If additional hours are required on top of your part time work, we will pay you the same hourly rate\r\n- You'll start as PART TIME (20 hours per week, 5 hours per day during Mondays, and your other hours - spread across the week)\r\n- Log in time starts at 6 PM Manila time\r\n- If we think you are performing well, we might consider transitioning you to a full time position in the coming months\n\r\nHow to apply:\n\r\nStart your cover letter with “I know I’m your all-star customer support agent because” … followed by why you think you are perfect for this role.\n\r\nTell us:\n\r\n- Why you’re the best applicant for the role\r\n- Your experiences\r\n- When can you start working\n\r\nYou will start PART-TIME, and depending on your performance, you COULD transition into a FULL-TIME job eventually.\n\r\nIf you fit the above skills and experience requirements, we shall be interviewing and hiring on a first-come, first-served basis immediately.\n\r\n!!!! DO NOT APPLY if you have not read the job post well and if you're not willing to commit to a long-term job.\r\nWe need people who want to LEARN and GROW with the team and not the opposite.\n\r\nWe are not playing around here.\n\r\nApplications that do not follow the cover letter requirements will be DISREGARDED.\n\r\nLet's not waste each other's time here.  :)                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}