{
  "job_id": "1398557",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Product-Development-Coordinator-1398557",
  "scraped_at": "2025-07-15T07:31:14.269634",
  "title": "Product Development Coordinator",
  "type_of_work": "Full Time",
  "salary": "500",
  "hours_per_week": "30",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us:\r\nWe are a fast-growing premium plush toy brand that designs unique, high-quality products with a playful and elegant twist. To keep up with our rapid development cycles, we’re looking for a proactive and detail-oriented Sourcing & Sample Production Coordinator to help us accelerate our sample-making process and streamline supplier communication.\n\r\nYour Responsibilities\n\r\nAs our Sourcing & Sample Production Coordinator, you will play a key role in bringing our plush toy designs to life by working closely with manufacturers and suppliers.\n\r\nResearch, evaluate, and contact potential production partners (primarily overseas)\n\r\nSend out technical drawings, 3D models, and specification sheets to suppliers\n\r\nRequest and manage quotes for sample production\n\r\nFollow up on timelines, approvals, and logistics\n\r\nCoordinate the delivery of samples and track their status\n\r\nMaintain clear documentation and communication between design, sourcing, and logistics teams\n\r\nAssist in negotiating prices, production timelines, and terms when needed\n\r\nYour Profile\r\nWe’re looking for someone who is both technically competent and highly organized.\n\r\nPrevious experience in sourcing, purchasing, or coordinating sample production (especially for consumer goods, textiles, or toys)\n\r\nBasic understanding of CAD files, technical drawings, and 3D models (you won’t design, but must be comfortable handling and sharing them)\n\r\nFluent in English (written & spoken); Mandarin or other relevant languages are a plus\n\r\nStrong communication and follow-up skills\n\r\nHighly detail-oriented with excellent time management\n\r\nExperience working with overseas suppliers (China, Turkey, etc.) is a big advantage\n\r\nWhat We Offer\r\nA flexible, remote-first position with creative freedom\n\r\nThe opportunity to work with a young, design-driven brand\n\r\nRoom to grow into a long-term position as the brand expands\n\r\nInsight into the entire product development process—from concept to final product",
  "skill_requirements": [
    "Project Management",
    "Supplier Sourcing",
    "Negotation"
  ],
  "is_active": true,
  "status_history": []
}