{
  "job_id": "1398858",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SEO-Content-Strategist-1398858",
  "scraped_at": "2025-07-15T15:37:43.356309",
  "title": "SEO Content Strategist",
  "type_of_work": "Part Time",
  "salary": "USD $6 -$9 per hour",
  "hours_per_week": "10",
  "date_updated": "Jul 14, 2025",
  "job_overview": "This is a part-time remote role wokring directly with our U.S. and Philippine-based marketing team to build, manage, and refine SEO strategy. We are hiring a skilled SEO expert who knows how to rank, write, and convert.\n\r\nWe need someone who can own the SEO strategy, create optimized content, and drive qualified organic traffic across our two WordPress-based sites. You’ll be expected to take initiative: run technical audits, develop keyword strategies, write your own optimized landing pages and blog content, and collaborate with our team to move the needle.\n\r\nThis role will begin with a heavier workload to clean up and optimize both sites, then shift into ongoing monthly work focused on performance growth.\n\r\nResponsibilities\r\nAudit both websites for technical SEO issues and prioritize fixes\r\nCreate full-funnel keyword strategies targeting B2B and B2C buyers\r\nWrite and submit optimized landing pages, blog content, and product copy for approval\r\nSet up and refine on-page SEO (headings, internal links, metadata, etc.)\r\nOptimize and structure content for semantic relevance and featured snippets\r\nAnalyze competitor content and backlink strategies\r\nCollaborate with our in-house marketing team\r\nTrack SEO KPIs in SEMrush, Search Console, and GA4\r\nMonitor and manage indexing, site health, site speed, and mobile optimization\r\nHelp maintain and improve local SEO and Google Business profiles\n\r\nRequired Skills & Tools\r\n5+ years of hands-on SEO experience with measurable results\r\nStrong writing skills: clear, concise, and optimized for search intent\r\nExpert-level experience with SEMrush, Ahrefs, GA4, Search Console\r\nFluent in WordPress SEO (including plugins like RankMath or Yoast)\r\nAbility to prioritize and write content across both short- and long-tail queries\r\nExperience implementing schema markup and structured data\r\nUnderstanding of internal linking, content silos, and topical authority\r\nBasic understanding of HTML/CSS and technical SEO elements\r\nExcellent communication and responsiveness\n\r\nNice to Have\r\nFamiliarity with the apparel, print, or promo products industry\r\nExperience with Printavo, Inksoft, or Chipply\r\nCRO knowledge (CTAs, layout, messaging hierarchy)\r\nSome experience with backlink building \r\nComfort editing or briefing designers for SEO-friendly layouts\n\r\nWhy This Role?\r\n100% Remote\r\nFlexible hours with clear deliverables\r\nLong-term potential with room to grow \n\r\nHow to Apply:\r\nSend your resume and your LinkedIn profile URL.",
  "skill_requirements": [
    "SEO",
    "Semrush",
    "Content Management"
  ],
  "is_active": true,
  "status_history": []
}