{
  "job_id": "1398325",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Administrative-Assistant-with-Quick-Books-Experience-Remote-1398325",
  "scraped_at": "2025-07-15T15:33:03.277261",
  "title": "Executive / Administrative Assistant  with Quick Books Experience (Remote)",
  "type_of_work": "Full Time",
  "salary": "$800 - $1200",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "OM IT Engineering is looking for a highly organized and experienced executive/Admin assistant with Quickbooks experince. You must have Quickbooks online experience with the following tasks :-\r\nProficiency in QuickBooks Online (QBO) with hands-on experience managing invoicing, estimates, expense coding, and vendor payments within Quickbooks. Don't apply if you don't have this experience. \n\r\nKey Responsibilities\r\n3-5 years of experience in executive or administrative support roles\r\nProficiency in QuickBooks Online (QBO) with hands-on experience managing invoicing, estimates, expense coding, and vendor payments\r\nExperience supporting financial operations in a small business or professional services environment\r\nStrong organizational skills with the ability to manage multiple priorities and deadlines\r\nExcellent written and verbal communication skills\r\nHigh level of discretion and professionalism in handling confidential information\r\nProficient in Google Workspace or Microsoft Office Suite, with strong spreadsheet skills\r\nComfortable learning and using cloud-based tools like Monday, Trello, or Slack\r\nSelf-starter mindset with a focus on proactive support and reliable follow-through\n\r\nAccounting & Project Management\r\n- Enter clients and projects into QuickBooks Online and Monograph\r\n-  Set up and maintain project estimates, phases, staffing allocations, and budgets\r\n-  Manage invoicing (15th and 30th), statements (30th), and billing follow-ups\r\n-  Process and code expenses: courier, FedEx, printing, consultant payments\r\n-  Track reimbursable costs and ensure accurate project-level accounting",
  "skill_requirements": [
    "Quickbooks",
    "Back Office Support",
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:28:52.220165",
      "reason": "Job first discovered"
    }
  ]
}