{
  "job_id": "1398859",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Operations-Coordinator-Short-Term-Rentals-1398859",
  "scraped_at": "2025-07-14T23:08:13.519947",
  "title": "Virtual Operations Coordinator (Short-Term Rentals)",
  "type_of_work": "Full Time",
  "salary": "$360 to $480 USD for month ($3/hr)",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Description\r\nWe’re a U.S.-based short-term rental management company looking for a sharp, reliable, and emotionally intelligent Virtual Assistant to join our team. You’ll be taking over a key role that supports guest communication and daily operations across multiple properties.\n\r\nWe’re not looking for someone who waits to be told what to do. We need someone who takes ownership, thinks ahead, and solves problems with common sense and good judgment.\n\r\nResponsibilities\r\n- Respond to guest messages via Airbnb, Vrbo, and SMS with clarity and professionalism\r\n- Handle booking coordination, check-in/out logistics, and basic troubleshooting\r\n- Communicate with cleaners and vendors to ensure turnarounds happen on time\r\n- Place and track orders and restock supplies as needed\r\n- Update internal trackers and summarize daily guest activity\r\n- Follow established SOPs and document new workflows as the business evolves\n\r\nRequirements\r\n- Excellent spoken and written English—clear, calm, and professional\r\n- Emotionally intelligent and guest-friendly communication style\r\n- Comfortable placing calls to guests or vendors when needed\r\n- Familiarity with Airbnb, Vrbo, Upgrade to see actual info, and STR operations is a strong plus\r\n- Self-motivated and able to work independently with minimal oversight\r\n- Stable internet connection with backup\r\n- Willing to complete a voice sample, Loom intro, and internet speed test\n\r\nTo Apply\r\n- Send an email directly to Upgrade to see actual info with the subject line: \"I want to be a call center agent\"\r\n- Once you send an email, you will receive a reply froUpgrade to see actual info with a google form.  The form will ask your age.  To show that you are paying attention, enter your age as \"40,\"",
  "skill_requirements": [
    "Short Term Rentals",
    "English Speaking",
    "Customer Service"
  ]
}