{
  "job_id": "1398126",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Outreach-Coordinator-1398126",
  "scraped_at": "2025-07-15T11:38:35.499319",
  "title": "Social Media & Outreach Coordinator",
  "type_of_work": "Part Time",
  "salary": "$200-280/mo",
  "hours_per_week": "10",
  "date_updated": "Jul 14, 2025",
  "job_overview": "ROLE SUMMARY\r\nWe at Glyph Consulting are seeking a dynamic and organized individual to join our team as our Social Media & Outreach Coordinator. This pivotal role will support Glyph’s Accounts Director in securing business leads via creative social media posts & interaction, inbound & outbound lead curation, and market research. The ideal candidate will excel in their written communication and task management, with a keen eye for detail, a proactive approach to problem-solving, and an ability to improvise when necessary.\n\r\nWHO ARE GLYPH CONSULTING?\r\nGlyph Consulting is a boutique talent consultancy launched in early 2024 that's become a trusted partner for real estate media agencies looking to scale with the right people. Since our founding, we have supported over 40 hires across 30+ real estate media companies throughout the United States, helping creative entrepreneurs move out of the weeds and into true leadership. Our work blends strategic hiring, operational clarity, and a whole lot of people sense. We talk with you, identify your business woes, and streamline a path to success.\n\r\nROLE & RESPONSIBILITIES\r\n- Manage Glyph’s social media accounts and content calendar with focuses on posts & stories, follower generation, and audience engagement. \r\n- Engage with previous Glyph clients to collaborate on social media posts and/or generate lead referrals.\r\n- Conduct market research and manage outreach to support the Accounts Director in organic lead curation.\r\n- Organize and maintain a CRM system for all of Glyph’s clients— past, present, and future.\r\n- Deliver regular updates to the Operations Director, escalating roadblocks as needed, in a daily standup meeting.\r\n- Assist the Accounts Director with tasks and administrative support as needed.\n\r\nSKILLS & QUALIFICATIONS\r\n- You have at least one year of experience in a marketing, administrative, or social media-focused role.\r\n- You have a strong understanding of social media platforms and content optimization (Instagram, TikTok, LinkedIn, etc).\r\n- You are proficient in working with Google Suite, Canva, and other editing tools.\r\n- You understand the importance of attention to detail.\r\n- You possess strong problem-solving and decision-making skills.\r\n- You are professional and showcase a positive attitude and excellent customer service skills.\n\r\nCOMPENSATION, WORK HOURS & BENEFITS\r\n- Pay will be $5.00-7.00 USD per hour (based on experience). \r\n- Work schedule will be 10 hours per week, with potential to scale up to 20 hours per week after 3 months of employment.\r\n- Availability will be required outside of standard business hours (8:00A-6:00P) in order to attend meetings with the Operations Director and/or the Accounts Director.\r\n- Potential to develop a long-term growth/salary track after 6 months of employment.\n\r\nGlyph HR & Talent Consulting provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Management",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": []
}