{
  "job_id": "1398144",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Assistant-Outreach-Specialist-1398144",
  "scraped_at": "2025-07-15T12:28:51.436181",
  "title": "Assistant Outreach Specialist",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "As an Assistant Outreach Specialist, you will support the growth of our online presence through hands-on link-building efforts, including guest posting, citation submissions, and outreach coordination. Your work will directly impact the company’s SEO goals by securing high-quality backlinks and maintaining relationships with publishers. You’ll collaborate with the SEO team, monitor tools like Ahrefs, and ensure the smooth execution of outreach campaigns—all while working in a fast-paced, detail-oriented environment.\n\r\nKey Responsibilities\r\n-Execute link-building strategies with a focus on guest posting and citation submissions\r\n-Use Ahrefs to identify backlink opportunities, track performance, and audit competitor links\r\n-Assist in managing and maintaining outreach lists and relationships with bloggers and webmasters\r\n-Follow up on outreach communications and track responses\r\n-Apply foundational SEO knowledge to ensure links are relevant, natural, and aligned with best practices\r\n-Assist in crafting email outreach templates and proposals when needed\r\n-Perform basic analysis using Ahrefs, and support in reporting outreach KPIs\r\n-Collaborate with teaUpgrade to see actual infombers to support broader SEO campaigns\r\n-Maintain accurate records of outreach activity in shared documents\r\n-Ensure consistency, attention to detail, and accuracy in all tasks\r\n-Stay updated on industry trends and be open to learning new tools or methods\r\n-Perform other related tasks as needed\n\n\r\nQualifications and Skills\r\n-Hands-on experience with link building—especially guest posting and/or citation link outreach\r\n-Foundational understanding of SEO concepts and terminology\r\n-Proficiency with Ahrefs\r\n-Bonus: Familiarity with Semrush, Moz, and Google Workspace (comfortable with basic functions and formulas)\r\n-Strong attention to detail and proactive attitude\r\n-Able to work independently with minimal supervision\r\n-Excellent written and verbal communication skills\r\n-Strong organizational and multitasking skills\r\n-Willingness to learn, adapt, and take initiative\r\n-Demonstrates sound judgment and common sense in work tasks\n\n\r\nBasic Requirements\r\n-Device Specifications: Intel i5 processor or higher with a minimum of 8GB RAM\r\n-Equipment: Webcam, speakers, and a microphone or headphones\r\n-Internet Speed: Minimum of 100Mbps with a backup connection in case of outages\n\n\r\nWork Details\r\n-Working Hours: Monday to Friday, 8 AM to 5 PM Pacific Standard Time | Tuesday to Saturday, 12 AM to 8:30 AM Manila Time\r\n-Location: Anywhere in the Philippines\n\n\r\nWhy Join Us?\r\n-Stable employment\r\n-Competitive salary\r\n-Bi-monthly salary\r\n-A-Z benefits, including bonuses and annual raises\r\n-Work-life balance\r\n-Work-from-home opportunity\r\n-The company uses a time tracker and maintains a virtual office setup via Google Meet\n\n\r\nFor interested applicants, kindly send your CV to Upgrade to see actual info\n\r\n (Note: DO NOT SEND YOUR APPLICATION through our websites or social media platforms. FAILURE TO COMPLY WITH THIS INSTRUCTION may result in DISQUALIFICATION.)",
  "skill_requirements": [
    "SEO",
    "Local SEO",
    "Link Building"
  ],
  "is_active": true,
  "status_history": []
}