{
  "job_id": "1398937",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Associate-Revenue-Manager-for-Short-Term-Rentals-1398937",
  "scraped_at": "2025-07-14T23:09:35.624363",
  "title": "Associate Revenue Manager for Short Term Rentals",
  "type_of_work": "Part Time",
  "salary": "240",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About RevTopia\r\nWe optimize short-term rental revenue for property managers with 10+ listings. We use data, automation, and market insights to drive growth.\n\r\nRole Overview\r\nYou’ll support our senior revenue team. You’ll monitor performance, analyze data, and suggest pricing moves. You’ll learn advanced revenue-management tools and grow into a fully independent revenue manager.\n\r\nKey Responsibilities\n\r\n- Pull daily and weekly pacing reports.\r\n- Update pricing profiles in PriceLabs and native platforms (Airbnb, VRBO).\r\n- Create and analyze competitive comp sets and market trends.\r\n- Flag at-risk dates and propose manual overrides.\r\n- Prepare simple Excel/Google Sheets dashboards.\r\n- Track conversion metrics and occupancy shifts.\r\n- Document pricing decisions and ROI impact.\r\n- Communicate with operations to implement minimum-stay and rate changes.\r\n- Assist in client calls by summarizing data insights.\n\r\nMust-Have Qualifications\n\r\n- 1–2 years experience in hospitality analytics or revenue support.\r\n- Strong Excel or Google Sheets skills (pivot tables, formulas).\r\n- Basic understanding of short-term rental platforms (Airbnb, VRBO).\r\n- Clear, concise written and verbal communication.\r\n- Detail-oriented and deadline-driven.\r\n- Comfortable with repetitive data pulls and updates.\r\n- Familiarity with PriceLabs\n\r\nNice-to-Have\r\n- Experience with Google Looker Studio.\r\n- Basic SQL or database-query knowledge.\r\n- Exposure to Slack and Zapier workflows.\n\r\nWhat We Offer\r\n- Starting salary $3/hr\r\n- Growth path to full Revenue Manager role.\r\n- Mentorship in advanced pricing strategies.\r\n- Performance based salary increases every 90 days\n\n\r\n-Send an email directly to Upgrade to see actual info with the subject line: Big Daddy Warbucks\r\n- Once you send an email, you will receive a reply froUpgrade to see actual info with a google form. The form will ask your age. To show that you are paying attention, enter your age as \"40\"",
  "skill_requirements": [
    "Short Term Rentals",
    "Financial Analysis",
    "Revenue Management"
  ]
}