{
  "job_id": "1399413",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Inventory-Manager-1399413",
  "scraped_at": "2025-07-15T15:38:00.279027",
  "title": "Amazon Inventory Manager",
  "type_of_work": "Full Time",
  "salary": "TBD (USD monthly basis)",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Description: Inventory Manager\n\r\nRemote Work - EST Time Zone\r\nMonday to Friday\n\r\nJob Description:\r\nWe are a private label company, and we are seeking a highly skilled and experienced Amazon Inventory Manager to join our dynamic team. As an integral part of our operations, you will be responsible for overseeing and optimizing the inventory management process on our Amazon platform. The ideal candidate will have a minimum of 3 years of relevant experience, with expertise in shipping products in containers, a comprehensive understanding of creating FBA (Fulfillment by Amazon) shipping labels, and working with multiple 3PL Warehouses, domestic and internationally.\n\r\nKey Responsibilities:\n\r\n1. Inventory Management:\r\n• Develop and implement effective inventory control strategies to optimize stock levels.\r\n• Monitor and analyze inventory performance, ensuring accuracy and timely updates.\r\n• Collaborate with cross-functional teams to forecast demand and prevent out-of-stock or overstock situations.\r\n• Utilize the Shopify platform to manage and streamline the inventory process.\n\r\n2. E-commerce Platform Expertise:\r\n• Manage inventory listings on e-commerce platforms like Shopify and Amazon.\r\n• Ensure product listings are accurate and up-to-date, including managing SKUs, pricing, and descriptions.\r\n• Coordinate with marketing and sales teams to align inventory levels with promotional activities and sales forecasts.\n\r\n3. Shipping and Logistics:\r\n• Oversee the entire shipping process, including coordinating sea freight from China to various international destinations.\r\n• Ensure efficient and cost-effective transportation of goods, working closely with suppliers and shipping companies.\r\n• Implement best practices for packaging, labeling, and shipping to ensure products are delivered safely and on time.\n\r\n4. FBA Management:\r\n• Demonstrate proficiency in creating FBA shipping labels and managing shipments through Amazon's Fulfillment by Amazon program.\r\n• Ensure compliance with Amazon's FBA requirements and guidelines.\r\n• Manage FBA inventory levels, optimizing for storage costs and order fulfillment efficiency.\n\r\n5. Data Analysis:\r\n• Use analytical tools to assess inventory trends and identify areas for improvement.\r\n• Generate reports and provide insights to enhance decision-making processes.\r\n• Monitor key performance indicators (KPIs) to track inventory health and performance.\n\r\n6. Collaboration and Communication:\r\n• Collaborate with internal teams to optimize inventory turnover and maintain high in-stock rates.\r\n• Communicate effectively with manufacturers, suppliers, and logistics partners to facilitate smooth operations.\r\n• Provide regular updates to management on inventory status and any potential issues.\n\r\nQualifications:\r\n• Minimum of 3+ years of experience in inventory management, preferably within the e-commerce industry. Candidates with less experience may be considered based on skills and relevant experience.\r\n• Proven experience with Shopify and Amazon FBA, including creating and managing FBA shipping labels.\r\n• Strong understanding of international shipping logistics, particularly from India/China to North America/UK/EU, and other regions.\r\n• Excellent analytical and problem-solving skills.\r\n• Strong communication and interpersonal skills.\r\n• Proficiency in relevant software and tools for inventory management.\n\n\r\nApplicants MUST HAVE all the qualifications mentioned above.",
  "skill_requirements": [
    "Amazon",
    "Inventory Management",
    "Supply Chain Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:41:25.699663",
      "reason": "Job first discovered"
    }
  ]
}