{
  "job_id": "1399564",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Project-Manager-1399564",
  "scraped_at": "2025-07-15T10:24:55.552053",
  "title": "Project Manager",
  "type_of_work": "Full Time",
  "salary": "$8-$10 depending on skills and experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Overview:\r\nAre you someone who thrives in structure, drives execution without micromanaging, and brings clarity to chaos? We’re seeking a proactive Project Manager to lead cross-functional coordination and ensure Upgrade to see actual infontum across 20+ high-priority initiatives.\n\r\nYou’ll be the connective tissue between strategy and execution—working closely with leadership and an experienced on-site Senior PM to make sure nothing falls through the cracks. From tracking progress to clearing blockers, you’ll own the systems that keep everyone focused and accountable.\n\r\nKey Responsibilities:\r\n1. Project Coordination & Accountability\r\nKeep initiative progress up-to-date through dashboards and internal reporting\r\nAct as the central point of follow-up to remove blockers and maintain Upgrade to see actual infontum\r\nAlign execution teams with strategic goals and timelines\n\r\n2. Tool & Process Ownership\r\nImplement and manage tools like Wrike, JIRA, Smartsheet, or Google Sheets\r\nDevelop systems for documentation, tracking, and reporting\r\nLead the setup and cadence of Gantt charts, dashboards, and weekly reviews\n\r\n3. Execution Support\r\nPartner with the on-site Senior PM to fill capacity gaps and maintain prioritization\r\nIdentify inefficiencies and streamline workflows across departments\n\r\n4. Cross-Departmental Communication\r\nLiaise with department heads and project owners to clarify objectives\r\nDrive onboarding and ensure roles are clearly defined\r\nSurface risks early and communicate them with clarity\n\r\n5. Continuous Improvement & Risk Management\r\nSpot trends in delays or misalignment and implement scalable solutions\r\nTake a systems-thinking approach to drive operational excellence\n\r\nQualifications:\r\n5+ years of hands-on project or program management experience\r\nBackground in BPO, SaaS, or remote-first teams is highly preferred\r\nExpertise in project management tools (e.g., JIRA, Wrike, Upgrade to see actual info, Smartsheet)\r\nProven track record building dashboards and performance systems\r\nClear, confident communicator—both written and verbal\r\nStrong sense of ownership and ability to bring calm to complexity\r\nComfortable driving accountability across cross-functional teams\n\r\nCompany Benefits:\r\n$500 USD Sign-In Bonus if you apply between July 10 to September 25, 2025\r\nCompetitive compensation package\r\nOpportunity to work closely with high-level executives from various industries.\r\nProfessional growth and development.\r\nChance to contribute to the success and growth of our clients.\r\nSupportive and collaborative team environment.\r\nPaid US Federal Holidays\r\nPaid Time Off\r\nHealthcare Package\r\n1 Year Travel Bonus\r\nYear-End Bonus\n\r\nHow to Apply:\r\n1. Complete the Form: Start by filling out the form at wkf.ms/3AnjFVK.\r\n2. Video Recording: Ensure you have a professional background when recording your video.\r\n3. Be Authentic: We strongly discourage reading from a script. Instead, be genuine and let your personality shine!\r\n4. Email Confirmation: Make sure to provide a valid email address to receive our application confirmation. If you don’t see the confirmation email, double-check for any spelling errors and resubmit the form with the correct email.\r\n5. Next Steps: If your qualifications meet our criteria, our Recruitment Specialist will reach out to you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}