{
  "job_id": "1399001",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-in-AI-Company-w-13th-Month-Pay-1399001",
  "scraped_at": "2025-07-15T14:33:24.615432",
  "title": "Executive Assistant in AI Company (w/ 13th Month Pay)",
  "type_of_work": "Full Time",
  "salary": "1200-1500",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are looking for an Executive Assistant to assist our Community Manager. This position is essential for managing community activities, events, and various administrative tasks.\n\r\nYou’ll work in close partnership with our Community Manager, and may be expected to work directly with the members of our community in the process.\n\r\nWe’re an AI Company and we make the best AI writing tool for authors!\n\r\nThis is a full-time role; candidates with side gigs or other ongoing commitments will not be considered.\n\r\nKey Responsibilities:\n\r\nCommunity Support\r\n• Work through community queues, disbursing rewards and reimbursements.\r\n• Process and publish videos to our various channels.\r\n• Moderation support, including in our Upgrade to see actual info server and Plugins ecosystem.\n\r\nAdministrative Support\r\n• Schedule and coordinate community events, meetings, and classes.\r\n• Handle rescheduling and support logistics for both internal and external events.\n\r\nContent Management\r\n• Assist with the preparation and distribution of newsletters and changelog posts.\r\n• Assist in preparing updates and other communications.\r\n• Support asset creation for events, YouTube videos, and other published content.\r\n• Update content across various platforms like Upgrade to see actual info, Luma, and Airtable.\n\r\nProject Management\r\n• Update and maintain various internal documentation sources.\r\n• Conduct research projects, collecting and analyzing data from (and/or for) the community.\r\n• Organizing the data and preparing reports. report feedback or reports.\r\n• Track and report on the progress of various projects and tasks.\r\n• Assist in setting up and/or testing new processes and tools, such as integrating new platforms or features.\n\r\n• Ad hoc Tasks\n\r\nQualifications:\n\r\n• Availability: Able to work during 9am-6pm Eastern Time.\r\n• English Proficiency: Excellent spoken and written English skills.\r\n• Experience: Preferred experience as a writer. (Bonus points for a background in fiction writing.) Familiarity with online communities, and/or experience as a community support agent.\r\n• Familiarity with technology and willingness to learn new tools (experience with Zapier or similar automation tools is a plus).\r\n• Additional Skills: The ideal candidate is flexible and a fast learner, comfortable with tools such as Upgrade to see actual info, Airtable, Notion, Loom, Luma, and Figma.\r\n• Skills: Strong organizational and multitasking skills, and the ability to work independently and as part of a team.\n\r\nTo apply, please send your resume along with an Intro Video here or at Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:35:05.590086",
      "reason": "Job first discovered"
    }
  ]
}