{
  "job_id": "1400299",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Sales-Manager-Digital-Advertising-1400299",
  "scraped_at": "2025-07-15T12:24:33.495092",
  "title": "Remote Sales Manager – Digital Advertising",
  "type_of_work": "Full Time",
  "salary": "600 usd/ mo",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Overview:\r\nWe are a growing digital advertising agency looking for a results-driven Sales Manager to lead and support our remote sales team. You’ll be responsible for monitoring KPIs, coaching sales associates, and making sure the team consistently hits monthly sales targets. This role is perfect for someone with a background in digital marketing, online media sales, or guest post/native advertising.\n\r\nResponsibilities:\n\r\nTrack and review sales associates’ daily and weekly performance\r\nProvide regular coaching and support to improve conversions and outreach quality\r\nEnsure the team achieves monthly sales goals\r\nReview and refine sales processes and outreach strategies\r\nReport sales updates and performance insights to upper management\r\nTrain new teaUpgrade to see actual infombers and conduct performance reviews\n\r\nQualifications\r\nAt least 3-5 years of experience in sales leadership or team management\r\nStrong background in digital advertising, native ads, or content partnerships is preferred\r\nExperience in BPO or outbound sales is a plus\r\nExcellent in KPI tracking, performance coaching, and pipeline management\r\nOrganized, proactive, and excellent in written/spoken English\r\nFamiliar with tools like Google Sheets, Upgrade to see actual info, Zoho Mail/ Workspace.\n\r\nHow to Apply:\r\nSend your resume and a brief intro message explaining why you’re a great fit for this role. Mention any experience in digital advertising or managing remote sales teams.",
  "skill_requirements": [
    "Backlinks Management",
    "Advertising Management",
    "Sales Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:28:38.082391",
      "reason": "Job first discovered"
    }
  ]
}