{
  "job_id": "1400928",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Still-Hiring-Operations-Executive-at-MADX-Digital-1400928",
  "scraped_at": "2025-07-15T03:48:38.438921",
  "title": "Still Hiring! Operations Executive at MADX Digital",
  "type_of_work": "Full Time",
  "salary": "700",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "MADX Digital is looking for a detail-oriented Operations Assistant to support our day-to-day agency operations. If you're someone who loves turning chaos into structure, thrives on organizing tasks, and enjoys working behind the scenes to keep everything running smoothly—we want to hear from you!\n\r\nMAIN FOCUS\r\nExecute day-to-day operational tasks and support the Operations Manager/Director with administrative and coordination duties.\n\n\r\nKEY RESPONSIBILITIES\n\r\nDaily & Weekly Ops Support\r\nMaintain and update department KPI trackers and dashboards.\r\nRun weekly hygiene checks on Trello boards, documentation, and project statuses.\r\nHelp coordinate internal meetings (retros, planning sessions, etc.) and take notes.\r\nMonitor and log operational issues reported by departments.\n\r\nTeam Onboarding & Offboarding\r\nSet up tools and access for new hires (Slack, Trello, Notion, Google Workspace).\r\nEnsure onboarding checklists are completed and documentation is shared.\r\nAssist with offboarding tasks and account removals when needed.\n\r\nReporting & Documentation\r\nPrepare internal reports (portfolio KPI updates, project timelines, issue logs).\r\nSupport the creation and updating of SOPs, process docs, and agency playbooks.\r\nHelp maintain organized, up-to-date records in Notion, Airtable, and Drive.\n\r\nProject & Process Support\r\nAssist with internal operations projects (e.g., improving onboarding, resource planning).\r\nTake responsibility for recurring admin processes (weekly reminders, team capacity tracking).\r\nHelp track hiring pipelines and interview schedules.\n\r\nWHAT GOOD LOOKS LIKE\r\nYou consistently meet deadlines and stay on top of recurring tasks without needing reminders.\r\nYou spot things that are missing, messy, or unclear — and fix them or raise them early.\r\nYour updates and documentation are clean, accurate, and easy for others to follow.\r\nYou’re proactive in asking, “How can I help?” and you take ownership of your work.\n\r\nWHAT WE OFFER\r\nCompensation: Commensurate to experience\r\nRemote-first: Work from anywhere in the world\r\nFlexible work environment with a collaborative team culture\r\nOpportunities to work with innovative SaaS brands\r\nProfessional development and learning opportunities\r\nClear processes and room to suggest improvements\n\r\nQUALIFICATIONS\r\n? Must-Haves\r\n2+ years experience in an administrative, operations, or support role.\r\nStrong business acumen and professional maturity; able to separate personal and professional responsibilities.\r\nHigh emotional intelligence (EQ) with the ability to collaborate effectively and handle sensitive information discreetly.\r\nExcellent attention to detail and task management skills.\r\nStrong written English and ability to communicate with cross-functional teams.\r\nComfortable with tools like Notion, Trello, Google Workspace, Slack, and Airtable.\r\nA growth mindset and eagerness to learn how operations work in a digital agency.\n\r\n???? Nice-to-Haves\r\nExperience working remotely with distributed teams.\r\nFamiliarity with SEO, content, or digital marketing teams (even loosely).\r\nExperience supporting hiring, onboarding, or documentation tasks.\n\r\nHOW TO APPLY\r\nInterested candidates should submit their resume and a brief cover letter explaining why they’re a great fit for this role to Upgrade to see actual info include \"MADX Operations Executive Application - [Your Name]\" in the subject line.\n\r\nSelected candidates will be invited for an interview to assess experience and fit for the role.",
  "skill_requirements": [
    "Administrative Support",
    "Organization",
    "Task Prioritization"
  ],
  "is_active": true,
  "status_history": []
}