{
  "job_id": "1401315",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1401315",
  "scraped_at": "2025-07-14T23:07:15.290129",
  "title": "Marketing Coordinator (Facebook Ads & Google Ads)",
  "type_of_work": "Full Time",
  "salary": "$1000-$1200/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a results-driven digital marketer who knows how to turn ad spend into real growth? We're looking for a Marketing Coordinator with a strong focus on Google Ads and Facebook Ads to join our team and help scale our paid media efforts.\n\r\nIn this role, you'll take the lead on planning, launching, and optimizing paid advertising campaigns across both platforms. You'll work closely with the President to align campaigns with our business objectives and ensure our messaging remains consistent and compelling. If you're highly analytical, creative, and love diving into performance metrics to improve results, this role is for you.\n\r\nAt ProRise, we believe there’s a better way to deliver residential and commercial painting services—one built on integrity, trust, and exceptional quality. Our customer-first approach has made us the most reviewed painting company in Canada, and we’re looking for someone who shares our passion for excellence and growth.\n\r\nPosition Overview:\r\nThe Marketing Coordinator plays a key role in supporting the planning, execution, and tracking of marketing initiatives across various channels. This role offers a dynamic environment with opportunities to contribute ideas, take ownership of projects, and grow professionally within the marketing field.\n\r\nWhat You’ll Do:\r\nPlan, launch, and optimize Facebook Ads and Google Ads campaigns to generate leads and boost awareness\r\nMonitor campaign performance, analyze KPIs, and implement optimizations to drive results\r\nCreate content and visual assets for digital ads, landing pages, emails, and social media\r\nManage content calendars and maintain brand consistency across platforms\r\nCoordinate marketing initiatives and ensure timely execution of digital campaigns\r\nConduct audience research and keyword targeting to maximize ROI and lead quality\r\nStay up to date with platform updates and digital advertising best practices\r\nWork closely with leadership to align marketing strategy with business goals\r\nReport on campaign performance and provide actionable insights\n\r\nWhat You’ll Bring:\r\nProven success managing and optimizing Facebook Ads and Google Ads campaigns with measurable results\r\nStrong understanding of digital marketing KPIs and analytics tools\r\nStrong writing and storytelling skills, with the ability to adapt tone and voice for different platforms\r\nBasic to advanced design skills using tools like Canva, Adobe Creative Suite, or similar\r\nStrong understanding of other major social platforms including Instagram, TikTok, and YouTube\n\r\nNice to Have:\r\nExperience with email marketing platforms like Mailchimp or Sendlane\r\nSEO knowledge and content optimization experience\r\nExperience in landing page creation and sales funnel strategy\n\r\nWhat We’re Looking For:\r\n3+ years of experience managing Facebook and Google Ads campaigns\r\nStrong understanding of paid media strategy, ad platforms, and performance tracking\r\nBasic to advanced design skills using tools like Canva, Adobe Creative Suite, or similar\r\nAnalytical mindset with experience using tools like Google Analytics, Ads Manager, etc.\r\nExcellent attention to detail and ability to manage multiple campaigns simultaneously\r\nStrong English communication (C2 level), attention to detail, and ability to prioritize tasks\r\nProficiency in Microsoft Office Suite, Mailchimp, Google Analytics, or similar\r\nAbility to track, interpret, and report on key performance metrics\r\nDetail-oriented with strong organizational and time-management skills \r\nCollaborative team player with a proactive, self-motivated attitude\n\r\nNon-Negotiables:\r\nHours of Operations: 8AM to 5PM Pacific Standard Time, Monday to Friday\r\nA quiet environment to work in. Working from cafes is not allowed.\r\nA computer with two monitors or laptop with 2nd screen\r\nHeadset with microphone\r\nMouse and keyboard\r\nHigh speed internet connection (100Mbps+)\n\r\nOther Detail:\r\nPaid PH holidays and performance bonus\n\r\nHow to Apply:\r\nPlease apply via this link: Upgrade to see actual info\r\nKeyword: Seaborne",
  "skill_requirements": [
    "Google Ads",
    "Facebook Ads",
    "Digital Marketing"
  ]
}