{
  "job_id": "1401676",
  "url": "https://www.onlinejobs.ph/jobseekers/job/ExperiencedSenior-Graphic-Designer-1401676",
  "scraped_at": "2025-07-15T15:34:22.256951",
  "title": "Experienced/Senior Graphic Designer",
  "type_of_work": "Part Time",
  "salary": "TBN",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Position Overview:\r\nWe are seeking an Experienced Senior Graphic Designer to join our team on a partUpgrade to see actual info basis. As a Senior Graphic Designer, you will play a crucial role in creating visually appealing and impactful designs for various mediums, including digital and print. Your creativity and expertise will contribute to enhancing client brand identities, marketing materials, and overall visual communication.\n\r\nCompany:\r\nWe are a dynamic design agency serving primarily North American clients, specializing in innovative and customized graphic solutions. Committed to delivering exceptional results, we strive to exceed client expectations through strategic and effective design.\n\r\nResponsibilities:\r\n- Develop and design creative graphics aligned with client objectives and brand guidelines.\r\n- Create visual concepts, graphics, and layouts for digital and print media (Newsletters, UX Design)\r\n- Collaborate with clients and teaUpgrade to see actual infombers to understand design requirements and deliver compelling solutions.\r\n- Ensure all designs are visually appealing, on-brand, and effectively communicate the desired message.\r\n- Stay updated with design trends, tools, and best practices to ensure high-quality and innovative design output.\r\n- Provide revisions and adjustments based on client feedback to achieve desired results.\n\r\nRequirements:\r\n- Proven experience as a Senior Graphic Designer or similar role, with a strong portfolio of successful design projects.\r\n- Proficiency in design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign) and other relevant tools.\r\n- Experience in both graphic design and brand kit creation.\r\n- Strong understanding of typography, colour theory, and visual composition.\r\n- Excellent problem-solving skills and attention to detail.\r\n- Ability to work independently and remotely with minimal supervision.\n\r\nLocation:\r\n-Remote position - only candidates based in the Philippines.\n\r\nSchedule:\r\n- Part-time or gig-based. Flexible hours depending on project requirements and deadlines.\n\r\nBenefits:\r\n- Competitive compensation based on experience and project scope.\r\n- Opportunity to work with diverse clients and industries.\r\n- Professional growth and development in graphic design.\r\n- Flexible work schedule and remote working environment.\n\r\nHow to Apply:\r\n- Interested candidates are invited to send a message with their resume and portfolio a must showcasing successful design projects. Highlight your experience with design software and your approach to effective graphic design strategies.  No example or portfolio will be deleted.",
  "skill_requirements": [
    "Marketing",
    "Graphic Design",
    "Creative Advertising"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:29:00.298958",
      "reason": "Job first discovered"
    }
  ]
}