{
  "job_id": "1402692",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-E-commerce-Video-Editor-1402692",
  "scraped_at": "2025-07-15T11:21:41.855871",
  "title": "Experienced E-commerce Video Editor",
  "type_of_work": "Full Time",
  "salary": "1600",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you passionate about editing engaging and high performing UGC content? Do you thrive in fast-paced, dynamic environments where creativity is key? Join Nordic Sculpt as we build a worldwide beauty tech brand dedicated to bring integrity to the beauty industry. We’re two founders working alongside a third partner — one of the world’s top e-commerce experts and the founder of several well-known, successful brands like Hears and Dore & Rose. We are seeking a talented Video Editor Manager to enhance our paid advertising and engage our audience with top-tier.\n\r\nResponsibilities:\r\n• Edit, and deliver high-quality video content tailored for social media platforms.\r\n• Work collaboratively with our team to develop cohesive and innovative video ad content strategies.  \n\r\nRequirements:\r\n• Proven experience in e-commerce paid ads video editing, with a strong portfolio showcasing your understanding of the field.\r\n• Great understanding of paid ads, UGC content and etc.\r\n• Solid understanding of paid ads dynamics and content strategies.\r\n• Creative mindset brimming with ideas and a keen eye for detail.\r\n• Excellent command of English, with exceptional communication skills.\n\r\nWhat We Offer:\r\n• Competitive compensation starting at $1000-$1800 per month for 35-40 hours per week, with the potential for bonus salary based on performance.\r\n• The opportunity to grow within an inspiring brand and significantly impact our community.\r\n• A collaborative work environment where innovation and creativity are encouraged. \n\r\nNot the Right Fit:\r\nThis position is designed for individuals with advanced experience in video editing for e-commerce paid ads and a strong portfolio of relevant work. If you do not have medium to advanced experience or a specific portfolio, this role may not be suitable for your current career stage. \n\r\nHow to Apply:\r\nPlease send your CV and a brief introduction to Upgrade to see actual info - Include the word “Inspire” in the subject line to ensure your application stands out.\n\r\nWe are eager to welcome a new member to our team who is motivated, detail-oriented, and ready to contribute to our mission from day one. If you are looking to make a meaningful impact with a fast-growing brand, we look forward to hearing from you!",
  "skill_requirements": [
    "Video Editing"
  ],
  "is_active": true,
  "status_history": []
}