{
  "job_id": "1402157",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Content-Editor-1402157",
  "scraped_at": "2025-07-15T13:41:22.807386",
  "title": "Senior Content Editor",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "As a senior content editor, you will be responsible for maintaining the highest standards of quality for our content. The ideal candidate is a skilled writer with a keen eye for detail and a deep understanding of the unique requirements of web writing. Your expertise will be key to guiding our writers and ensuring our content meets the needs of our audience. \n\r\nKey Responsibilities\r\n-Edit a variety of digital content formats, including landing pages and blogs.\r\n-Meticulously identify and correct errors, fluff, and inconsistencies to maintain clarity and adherence to company standards.\r\n-Verify the accuracy of all information to maintain the company's credibility and integrity.\r\n-Ensure all content is optimized for search engines and adheres to SEO best practices.\r\n-Develop and enforce editorial standards and best practices for the content team.\r\n-Maintain consistency in tone, voice, and style across all content.\r\n-Supervise the quality of content produced by other writers.\n\r\nQualifications And Skills\r\n-A minimum of 2 years of legal content writing experience is required; personal injury experience is a plus. \r\n-Minimum of 3 to 5 years relevant experience as an editor\r\n-Strong portfolio of published work, demonstrating writing and editing skills\r\n-Exceptional attention to detail, ensuring all content is meticulously reviewed and free from errors\r\n-Excellent command of the English language for both written and oral communication\r\n-Good communication and interpersonal skills\r\n-Strong organizational skills and the ability to manage time effectively\r\n-Proficiency in Microsoft Office and Google Workspace\r\n-A good grasp of SEO and basic digital marketing principles\n\n\r\nBasic Requirements\r\n-Device Specifications: Intel i5 processor or higher with a minimum of 8GB RAM\r\n-Equipment: Webcam, speakers, and a microphone or headphones\r\n-Internet Speed: Minimum of 100Mbps with a backup connection in case of outages\n\r\nWork Details\r\n-Working Hours: Monday to Friday, 8 AM to 5 PM Pacific Standard Time | Tuesday to Saturday, 12 AM to 8:30 AM Manila Time\r\n-Location: Anywhere in the Philippines\n\r\nWhy Join Us?\r\n-Stable employment\r\n-Competitive salary\r\n-Bi-monthly salary\r\n-A-Z benefits, including bonuses and annual raises\r\n-Work-life balance \r\n-Work-from-home opportunity\n\r\n*** The company uses a time tracker and maintains a virtual office setup via Google Meet.\r\nFor interested applicants kindly send your CV to Upgrade to see actual info\n\r\n(Note: DO NOT SEND YOUR APPLICATION through our websites or social media platforms. FAILURE TO COMPLY WITH THIS INSTRUCTION may result in DISQUALIFICATION)",
  "skill_requirements": [
    "Copywriting",
    "Article Writing",
    "Proofreading"
  ],
  "is_active": true,
  "status_history": []
}