{
  "job_id": "1403617",
  "url": "https://www.onlinejobs.ph/jobseekers/job/VIVID-POS-VA-Technical-SupportAdmin-Support-1403617",
  "scraped_at": "2025-07-15T15:46:24.131280",
  "title": "VIVID POS VA/ Technical Support/Admin Support",
  "type_of_work": "Any",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Note: Please send your US format Resume and video resume\r\nKindly read first the below information before applying.\r\n POS ( Point of Sale) system experience is a plus!!\n\r\n!!!!This role is ideal for a tech-savvy virtual assistant who enjoys problem-solving and helping users navigate POS systems efficiently.!!!!!\n\r\n1. Technical Support & Troubleshooting\r\n? Provide first-level support for Vivid POS platform issues via email, Slack, and text.\r\n? Assist users with front-end POS functionality, including order processing, payment errors, and system navigation.\r\n? Troubleshoot basic hardware issues related to POS terminals, card readers, and peripherals.\r\n2. Onboarding & Setup Assistance\r\n? Guide clients through the initial boarding process, including hardware installation and configuration.\r\n? Assist with card reader setup (PAX and Dejavoo).\r\n3. Portal & Account Management\r\n? Help users navigate the Vivid POS portal for settings, reports, and account management.\r\n? Assist with password resets, user permissions, and basic administrative tasks.\r\n4. Documentation & Knowledge Sharing\r\n? Maintain a log of common issues and solutions for internal reference.\r\n? Escalate complex technical issues to senior IT support or development teams when necessary.\r\nRequired Skills & Qualifications:\r\n? Prior experience in IT support, helpdesk, or technical customer service (experience with POS systems is a plus).\r\n? Familiarity with Vivid POS (front-end and portal) or similar POS platforms.\r\n? Basic knowledge of hardware setup (terminals, card readers, printers).\r\n? Understanding of payment processing and basic networking concepts.\r\n? Strong written communication skills for email, Slack, and text-based support.\r\n? Ability to troubleshoot technical issues independently.\r\n? Customer-focused with patience and clarity in guiding non-technical users.\r\nPreferred Qualifications:\r\n? Experience with VAR deployment and merchant boarding processes.\r\n? Knowledge of common POS integrations (payment processors, inventory systems).\r\nWork Environment:\r\n? Fully remote (work from home).\r\n? Flexible hours, but must be available during key business hours (specify time zone if needed).\r\n? Primary communication via email, Slack, and text (no phone support required).\n\r\nThis role is ideal for a tech-savvy virtual assistant who enjoys problem-solving and helping users navigate POS systems efficiently.",
  "skill_requirements": [
    "Administrative Management",
    "Technical Support",
    "Tech-Savvy"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:46:24.133099",
      "reason": "Job first discovered"
    }
  ]
}