{
  "job_id": "1403982",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AI-First-WordPress-Developer-Team-Leader-Remote-1403982",
  "scraped_at": "2025-07-15T12:37:00.099769",
  "title": "AI-First WordPress Developer Team Leader (Remote)",
  "type_of_work": "Full Time",
  "salary": "PHP 60,000+ p/month neg",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Join an Innovative Team That’s Redefining Websites Through AI\n\r\nAre you an experienced WordPress developer with a deep passion for AI, automation, and building smarter workflows for converting custom designs into live websites?\n\r\nDo you want to work full-time from home for a high-performing, conversion-focused web design agency that embraces innovation, continuous improvement, and team collaboration?\n\r\nIf that sounds like your kind of challenge, we’d love to meet you. =)\n\r\nWhat We’re Looking For:\r\n-  You’re a strong developer with WordPress experience and an AI-first mindset.\r\n-  You thrive on research and testing, constantly exploring new tools, workflows, and ways to accelerate and optimize website development.\r\n-  You’ve successfully converted Figma designs into functional, responsive, fast-loading WordPress websites. \r\n-  You love staying at the forefront of what’s possible with tools like:\r\n      -  Figma\r\n      -  Cursor with Dev Mode MCP Server\r\n      -  Model Context Protocol (MCP)\r\n      -  GitHub & version control\r\n      -  AI Engine plugin for WordPress\r\n      -  Upgrade to see actual infov\r\n      -  Upgrade to see actual info\n\r\nYour Core Responsibilities Will Include:\r\n-  Leading our development team with an AI-first approach.\r\n-  Converting Figma design files into responsive, high-performing WordPress websites. (Webflow is a bonus!) \r\n-  Collaborating with our designers, project managers, and other developers to ensure high-quality execution.\r\n-  Researching and implementing cutting-edge tools and workflows to improve speed, efficiency, and scalability.\r\n-  Documenting best practices, building out internal development SOPs, and refining our AI-first build process.\r\n-  Reviewing code, improving performance, and ensuring clean, maintainable codebases.\r\n-  Troubleshooting technical issues, debugging, and suggesting better solutions.\r\n-  Mentoring teaUpgrade to see actual infombers and offering technical guidance where needed.\r\n-  Experimenting with AI tools to streamline development and identify game-changing improvements.\n\r\nYou’ve led a small team or mentored junior developers before, and you enjoy collaborating with designers and project coordinators to bring ideas to life, and...\r\n-  You’re self-motivated, disciplined, and great at working remotely.\r\n-  You have excellent English communication skills (written & spoken).\r\n-  You have a powerful, reliable computer with at least 16GB RAM and fast internet.\r\n-  You can work full-time, Monday to Friday, during Philippine business hours.\n\r\nWhat We Offer:\r\n-  Competitive salary (based on your experience)\r\n-  100% remote role (Philippines only)\r\n-  Monday to Friday only—no weekend work!\r\n-  Fully paid trial period to ensure a great fit\r\n-  Performance bonuses based on output and innovation\r\n-  A forward-thinking team that values experimentation and continuous learning\r\n-  Clear SOPs and documentation to support your growth\r\n-  The opportunity to help shape the future of AI-first websites at Studio1\n\r\nAbout Us:\r\n-  We’re Upgrade to see actual info, an Australian-based branding and website design agency that’s known for creating conversion-focused websites that actually drive results.\n\r\n-  We’ve designed over 2,000 websites, and now we’re going deeper into AI and smarter systems that help us build better, faster, and more creatively.\n\r\n-  We’re a team of friendly, forward-thinking creatives who genuinely love what we do—and we’re excited to welcome someone who shares our passion for pushing boundaries.\n\r\nHow to Apply:\n\r\nIf you’re an AI-driven developer excited to lead and build smarter, we’d love to hear from you.\n\r\n Submit your application with:\r\n-  A cover letter explaining why this role excites you\r\n-  A link to your CV\r\n-  A few examples of your best recent WordPress builds (bonus if they started as Figma files)\r\n-  Describe the AI tools, plugins, or workflows you've built or tested\n\r\nShortlisted applicants will be invited to a Zoom interview.\n\r\nAll successful hires begin with a fully paid 4-week trial (40 hours/week). If it’s a great fit, we’ll offer you a permanent role.\n\r\nApply now and help us lead the charge in AI-powered website development!\n\r\nGood luck =)",
  "skill_requirements": [
    "Wordpress",
    "Team Leadership"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:25:22.317713",
      "reason": "Job first discovered"
    }
  ]
}