{
  "job_id": "1404308",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-Graphic-Designer-1404308",
  "scraped_at": "2025-07-15T14:33:37.010285",
  "title": "Experienced Graphic Designer",
  "type_of_work": "Any",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "The Graphic Designer is responsible for creating visual content that communicates ideas, inspires, informs, and captivates audiences. This role requires a strong understanding of design principles, brand identity, and user experience to develop creative assets for both digital and print platforms. The ideal candidate is highly creative, detail-oriented, and capable of managing multiple projects in a fast-paced environment.\n\r\nKey Responsibilities:\n\r\n1. Creative Design & Development\r\nConceptualize and design graphics for various platforms including social media, websites, email campaigns, presentations, advertisements, and print materials.\r\nTranslate business and marketing objectives into compelling visual content.\r\nCreate consistent brand visuals and templates that align with brand guidelines and tone.\n\r\n2. Brand Identity Management\r\nMaintain and evolve the company’s visual identity across all media.\r\nEnsure brand consistency in all design outputs, from typography and colors to layout and imagery.\r\nCreate and update brand style guides when necessary.\n\r\n3. Marketing & Advertising Materials\r\nDesign marketing creatives and branded visuals such as newsletters, social media graphics, email campaign layouts, website headers, landing pages, internal posters, announcements, and more—ensuring alignment with the company’s brand identity.\r\nDevelop digital assets for paid ads (Facebook, Instagram, Google, etc.), landing pages, and newsletters.\r\nCreate high-converting product or service visuals across all our social media platforms\r\nCreate designs and visual assets for company events, including banners, flyers, digital invites, and presentation decks.\r\nDevelop branded materials for internal campaigns, such as newsletters, onboarding kits, and recognition programs in collaboration with the Marketing Manager.\r\nResponsible for delivering the design for the newsletter within a week once a month\r\nSupport in creating promotional materials for tradeshows, community outreach, and sponsorships.\r\nOther duties as assigned.\n\r\n4. Social Media & Web Design\r\nDesign engaging content tailored to each platform (Instagram posts/stories, Facebook covers, YouTube thumbnails, etc.).\r\nWork closely with the marketing team to develop content calendars and visual campaigns.\r\nCreate web graphics, hero images, icons, and other UI elements in collaboration with the marketing team.\n\r\n5. Video & Motion Graphics (optional)\r\nDevelop engaging video content and creative topic ideas for social media posts, ensuring relevance, brand consistency, and audience appeal across platforms.\r\nCollaborate with the marketing team to align messaging, trends, and campaign goals. Edit short-form videos, reels, or animations to boost online visibility and engagement.\r\nCreate (2) 2 to 3 minutes Youtube Videos and (60 seconds) Reels video per week\r\nAssist in editing company videos such us marketing videos and company event videos\n\r\n6. Collaboration & Communication\r\nWork closely with marketing, product, and content teams to understand project requirements and deliver timely outputs.\r\nCommunicate design concepts clearly and accept constructive feedback for revisions.\r\nParticipate in brainstorming sessions and contribute creative ideas.\r\nMaintain and update company templates (e.g., PowerPoint, Google Slides, letterheads) to ensure consistency.\n\r\n7. File Management & Asset Delivery\r\nPrepare final designs for production (web, print, or multimedia) ensuring proper formats, sizes, and resolutions.\r\nOrganize and manage files, keeping an efficient library of design resources and assets.\r\nCommunicate with Marketing Manager about updates and file management\n\r\nSkills and Qualifications:\n\r\nBachelor’s degree in Graphic Design, Visual Arts, Multimedia, or a related field.\r\n3+ years of proven graphic design experience (freelance or agency experience is a plus).\r\nProficient in Adobe Creative Suite (Photoshop, Illustrator, InDesign, After Effects), Canva, Figma, or similar tools.\r\nStrong portfolio showcasing a range of creative projects.\r\nExcellent visual, typographic, and color skills with attention to detail.\r\nUnderstanding of digital marketing concepts and social media trends.\r\nTime management skills and ability to handle multiple projects and deadlines.\n\r\nMUST HAVES - If you don’t match the following criteria, unfortunately, we are not a match\r\n- Strong Internet Connection\r\n- Back-up Power Source\r\n- Noise Canceling Headset\r\n- Private Office Space without distractions\n\r\n>>>>Employee Benefits\n\r\nOpportunities for career growth and advancement\r\nAccess to ongoing training, workshops, and professional development programs\r\nSupport for continued education and skill-building\r\nPaid time off (PTO) for rest, recovery, and personal time\r\nHoliday pay for recognized national and company holidays\r\nFixed weekday schedule with weekends off to support work-life balance\r\nEarly-out Fridays to kickstart the weekend\r\nPerformance-based incentives and bonuses\r\nTeam-building activities and virtual/in-person events\r\nEmployee recognition programs and yearly awards\r\nCelebrations for birthdays, anniversaries, and milestones\r\nA supportive and collaborative work culture\n\r\nWhy Join Klinger Insurance Group?\n\r\nAt Klinger Insurance Group, we’ve been proudly serving our clients since 1993. As a well-established and trusted company, we offer a competitive salary, comprehensive benefits, professional growth opportunities, and a supportive work environment.\n\r\nWe value our team and foster a culture of collaboration, respect, and recognition. At Klinger Insurance Group, you’re not just an employee—you’re part of a family that cares about your success.\n\r\nCome grow with us—we love our team, and we know you will too!                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:33:37.013375",
      "reason": "Job first discovered"
    }
  ]
}