{
  "job_id": "1404803",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-Sales-Agent-1404803",
  "scraped_at": "2025-07-14T23:09:34.101574",
  "title": "Experienced Sales Agent",
  "type_of_work": "Any",
  "salary": "3.50",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Experienced Sales Agent - Weight Loss Medications\r\nFull-Time Position Available\r\nAbout the Role\r\nWe are seeking a dynamic and experienced sales professional to join our team selling weight loss medications. This is a full-time position that requires dedication, excellent communication skills, and a proven track record in sales.\r\nKey Requirements\r\nProven Sales Experience: Must have demonstrated success in sales, preferably in healthcare, pharmaceuticals, or related industries\r\nExcellent Communication: Perfect English speaking ability with clear articulation and professional phone presence\r\nScript Adherence: Ability to follow provided scripts while maintaining a natural, personable conversation style\r\nMultitasking Skills: Ability to manage multiple client interactions while maintaining attention to detail\r\nPersuasive Abilities: Strong capability to build rapport and guide clients through the sales process\r\nConfidence: Self-assured professional demeanor with the ability to handle objections effectively\r\nPosition Details\r\nSchedule: 8-hour shifts, Monday through Sunday (weekends required)\r\nEmployment Type: Full-time position\r\nCompensation: Competitive hourly wage plus commission on each successful sale\r\nWhat We're Looking For\r\nThe ideal candidate will be a results-driven professional who thrives in a fast-paced environment. You should be comfortable discussing health and wellness products with potential clients and have the ability to close sales consistently.\r\nBenefits\r\nBase hourly pay\r\nPerformance-based commission structure\r\nFull-time employment stability\r\nOpportunity for career growth\r\nReady to take your sales career to the next level?\r\nHow to Apply\r\nIf you're interested in this position, please send an email that includes:\r\nYour resume highlighting sales experience and achievements\r\nA video introduction of yourself covering:\r\nPersonal introduction\r\nYour relevant sales experience\r\nTwo specific reasons why you would be a good fit for this position\r\nOne of our HR managers will review your application and reach out if we feel you're a good match for our team.\nUpgrade to see actual info",
  "skill_requirements": [
    "English Speaking",
    "Sales",
    "Customer Relationship Management"
  ]
}