{
  "job_id": "1404642",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Software-Developer-Time-Tracking-Software-1404642",
  "scraped_at": "2025-07-15T12:22:28.039256",
  "title": "Software Developer (Time-Tracking Software)",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Remote | Full-Time\n\r\nJob Overview:\r\nWe are looking for a talented and self-driven Software Developer with strong experience in Python and web-based application development to join our remote team. In this role, you’ll play a key part in building and maintaining a custom time-tracking software that supports productivity, transparency, and data reporting for remote teams. This is a unique opportunity to help develop a solution from the ground up that has a direct impact on how teams work remotely.\n\r\nKey Responsibilities:\r\n-System Design & Development\r\n-Design and develop a robust time-tracking platform from scratch, including features like activity monitoring, time logs, idle detection, reporting dashboards, and integrations with other tools.\r\n-Write scalable and maintainable code primarily using Python (e.g., Django or Flask), as well as relevant front-end technologies.\r\n-Build efficient back-end systems, RESTful APIs, and data processing pipelines.\n\r\nFront-End Development\r\n-Collaborate with designers or use libraries/frameworks (e.g., React.js or Vue.js) to build user-friendly, responsive dashboards and interfaces.\r\n-Ensure cross-browser compatibility and performance optimization across devices.\n\r\nBack-End Development\r\n-Develop secure and scalable APIs and data storage solutions.\r\n-Integrate with third-party services (e.g., Google Calendar, task managers, screen monitoring APIs if applicable).\r\n-Implement real-time components like idle time alerts, activity snapshots, or tracking summaries using WebSockets or polling systems.\n\r\nKnowledge of server implementation of the application.\r\n-Testing, Optimization & Maintenance\r\n-Conduct unit, integration, and performance tests to ensure software reliability.\r\n-Continuously monitor and optimize performance, resource usage, and application speed.\r\n-Fix bugs and update the application based on user feedback or internal QA.\n\r\nDocumentation & Collaboration\r\n-Document code, APIs, and technical designs for ease of maintenance and team collaboration.\r\n-Work closely with project managers, stakeholders, and QA to deliver milestones on time.\n\r\nRequired Skills & Qualifications:\n\r\n-Proven experience as a Software Developer with strong Python skills (preferably Django, Flask, or FastAPI).\r\n-Familiarity with front-end technologies like JavaScript, React.js, HTML5, and CSS3.\r\n-Experience with relational and NoSQL databases (e.g., PostgreSQL, MongoDB, MySQL).\r\n-Strong understanding of RESTful API design and implementation.\r\n-Experience in creating or contributing to SaaS tools, internal dashboards, or productivity software is a big plus.\r\n-Ability to write clean, well-documented, and maintainable code.\r\n-Familiarity with authentication/authorization systems (OAuth2, JWT).\r\n-Excellent problem-solving skills and attention to detail.\r\n-Comfortable working independently in a remote setup with minimal supervision.\n\r\nNice to Have:\r\n-Experience with time-tracking, productivity, or monitoring software.\r\n-Familiarity with DevOps tools (Docker, CI/CD pipelines).\r\n-Experience with integrating third-party APIs or browser extensions.\n\r\nBasic Requirements:\r\n-Device Specs: Intel i5 or higher, with at least 8GB RAM\r\n-Equipment: Functional webcam, microphone, and headphones\r\n-Internet: At least 100 Mbps primary connection, with a backup available\n\r\nWork Details\r\n-Working Hours: Tuesday to Saturday, 12 AM to 8:30 AM Manila Time\r\n-Location: Anywhere in the Philippines\n\r\nWhy Join Us?\r\n-100% work-from-home setup\r\n-Flexible working hours\r\n-Competitive compensation\r\n-Work on real-world projects with immediate impact\r\n-Opportunity to lead and innovate product development\r\n-Collaborative and supportive remote work culture\r\n-Continuous learning and growth opportunities\n\r\nFor interested applicants, kindly send your CV to Upgrade to see actual info\n\r\n (Note: DO NOT SEND YOUR APPLICATION through our websites or social media platforms. FAILURE TO COMPLY WITH THIS INSTRUCTION may result in DISQUALIFICATION.)",
  "skill_requirements": [
    "Python",
    "Software",
    "Software Development Project Manager"
  ],
  "is_active": true,
  "status_history": []
}