{
  "job_id": "1404627",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Support-Specialist-1404627",
  "scraped_at": "2025-07-15T12:03:30.002221",
  "title": "Marketing Support Specialist",
  "type_of_work": "Full Time",
  "salary": "$866 USD/month, 49,535 PHP/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you looking to make a career change? Are you passionate about working with nonprofits? Maybe you have taken some time off and now you want to pivot your skills into a more tech-savvy field but aren’t sure how. Nonprofit Megaphone is a remote, home-based company with a paid hands-on training program to amplify nonprofit voices! \n\r\nNonprofit Megaphone empowers organizations to expand their reach and impact by assisting them in obtaining and effectively managing the Google Ad Grant/Microsoft Ads for Social Impact Grant. Through this grant, nonprofits are able to share their stories with a wider global audience. Our team was recently recognized by Inc. Magazine on the Inc. 500 List as one of the fastest-growing companies in America. \n\r\nAt Nonprofit Megaphone, our team is 100% remote, so we are one of the few companies where working from home is the rule, not the exception. Because we are remote, we take team culture very seriously. We love chatting with each other over Slack, our internal instant messaging system, and we get together for an (optional) in-person retreat once a year. Nonprofit Megaphone also understands the need for portable and flexible careers and proudly supports military spouse employment through the Hiring Our Heroes #DiscoverTheTalent initiative.\n\r\nPosition Specifics: Contract position, full-time, hourly position, 9:00-5:00 M-F within EST, CST, MST, or PST time zones.\n\r\nPerks:\n\r\n- Robust On The Job Training: With Nonprofit Megaphone’s hands-on training you will learn new career skills, in-demand tech knowledge, and gain the confidence needed to transition and thrive in your new career. There is no need for direct experience!\r\nEarn While You Learn: During your first 90 days you’ll be paid while you learn each new skill and technology.\r\n- Remote First Culture: We thrive in our remote environment and want you to as well. We spend time getting to know one another and building relationships both virtually and in person.\r\n- Growth: Nonprofit Megaphone recognizes great assets when we see them. Our employees have the ability to continue their learning and growth through ongoing training and development.\r\n- Workplace Cohesion: We are a no drama llama environment and strive to build and support an atmosphere that is centered around inclusivity, honesty, drive, and transparency. As part of our commitment to fostering transparency and collaboration, we also offer open office hours once a week with our leadership team, which anyone is welcome to join. \n\r\nCompensation & Benefits:\n\r\n- $5 USD per hour.\r\n- Soft-close week between Christmas Eve and New Year’s Day, allowing you time to relax and recharge before the new year.\r\n- A $175 USD starting balance in your Tech & Wellness Stipend account upon successful completion of your 90-day review, followed by a recurring $7/month USD on your 1-year anniversary.\n\r\nJob Summary:\n\r\nAs a Marketing Support Specialist, you will play an essential role in helping the Sales & Marketing team achieve its goals—especially our booked call targets—by flexibly stepping in wherever you’re needed. While a large portion of your work will involve administrative tasks, such as research, data input, and campaign setup, this role goes beyond admin. You’ll be counted on to support other teaUpgrade to see actual infombers, cover for out-of-office teammates, assist with marketing emails and booking calls, and pitch in across various platforms and functions. Flexibility, a proactive mindset, and high attention to detail are essential to your success.\n\r\nKey Responsibilities & Duties:\r\n- Support the team in achieving its booked call goals by flexibly assisting with administrative tasks, managing marketing email campaigns, booking calls through various outreach methods, covering for teammates during absences, and providing general support to individual teaUpgrade to see actual infombers as needed.\r\n- Use tools such as LemList, HubSpot, and Google Sheets to execute tasks efficiently.\r\n- Participate in campaign setup, comparable client input, and other recurring processes.\r\n- Collaborate with Sales & Marketing leadership to identify and absorb additional tasks when lead or email campaign work is complete.\r\n- Maintain detailed records and meet deadlines while consistently producing quality work.\r\n- Take ownership of your assignments and problem-solve with minimal supervision.\r\n- Contribute to cross-functional projects that help drive company-wide objectives forward.\r\n- Proactively offer help to teammates and communicate regularly about your capacity and bandwidth.\n\r\nQualifications:\r\n- Full fluency in written and spoken English, including spelling, composition, and grammar.\r\n- Excellent communication skills with a collaborative and team-first mindset.\r\n- Comfortable with a wide range of digital tools (e.g., Google Docs, Google Sheets, Asana, HubSpot, LemList).\r\n- Fast learner who thrives in a remote environment and adapts quickly to change.\r\n- Ability to work independently with strong time management and organizational skills.\r\n- Receptive to constructive feedback and committed to continual improvement.\r\n- Strong attention to detail and ability to proofread your work.\r\n- Willingness to jump into new tasks or unfamiliar platforms and figure them out with minimal direction.\r\n- Available full-time during US business hours and able to support a remote, distributed team.\r\n- Embody NPM Core Values: Growth Champion, Results, Always Honorable, No Drama (Llama), and Team Player.\n\r\nTech Requirements:\r\n- Quiet, distraction-free environment for phone calls/meetings.\r\n- Typing speed of 60+ words per minute.\r\n- A computer with audio and visual capabilities for on-video ZooUpgrade to see actual infoetings with strong internet connectivity.\n\r\nNote to Applicants:\n\r\nThis job description is a general overview and will evolve as the company grows and adapts to new needs.\r\nAs part of our hiring process, all applicants must complete and pass our four assessments: Critical Thinking, Typing Test, Computer/Tech Skills, and Grammar. These assessments provide valuable insights and help us ensure a good match for both you and the role. We believe they make the process more objective, and if you don't perform well, the job might not be a great fit for you.\n\r\nTo apply for this role, please email Upgrade to see actual info with the following:\r\n- Subject Line: \"Application: [Your Full Name]\"\r\n- Resume: Attach your resume to the email.\r\n- Cover Letter or Loom Video (Bonus Points for Video): In your application, please either attach a brief cover letter or include a link to a Loom video (Upgrade to see actual info) — whichever you prefer. In either format, share what you believe our company does based on your exploration of our website (Upgrade to see actual info) and tell us a bit about yourself and your interest in the role. If you choose to submit a Loom video (no longer than 5 minutes), you’ll earn bonus points — we love getting a chance to see your personality and communication style!\n\r\nAnswer the following questions in the email body:\r\n- Are you willing to undergo a background check, in accordance with local law/regulations?\r\n- How did you hear about this job? (Indeed, VirtForce, OnlineJobs.Ph, other?)\r\n- What position are you officially applying for at Nonprofit Megaphone? (e.g., “Impact Advisor,” “Marketing Support Specialist,” etc.)\r\n- Do you consent to your interview being recorded for evaluation and training purposes?\n\r\nImportant: Applications that do not follow these steps will not be considered.",
  "skill_requirements": [
    "Marketing",
    "Office and Administration",
    "Administrative Support"
  ],
  "is_active": true,
  "status_history": []
}