{
  "job_id": "1404691",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Mortgage-Loan-Processor-Virtual-Assistant-1404691",
  "scraped_at": "2025-07-15T10:19:49.628343",
  "title": "Mortgage Loan Processor (Virtual Assistant)",
  "type_of_work": "Full Time",
  "salary": "$6-$8/hr depending on skills and experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you the kind of person who finds satisfaction in precision, structure, and seeing things done right the first time?\r\nIf you're nodding, we might have just the role for you.\n\r\nWe’re looking for a Mortgage Loan Processor who’s not just great with paperwork—but someone who genuinely cares about helping people move one step closer to their goals. This role goes beyond checking boxes. It’s about making sure everything behind the scenes runs smoothly, accurately, and on time—because real lives are on the other end of every file.\n\r\nWhat You’ll Be Doing:\r\nYou’ll be the backbone of our mortgage operations, helping ensure every loan moves forward with clarity, speed, and compliance.\n\r\nLoan Processing & Documentation:\r\nReview, verify, and manage loan applications with an eagle eye for detail.\r\nMake sure each file is complete, accurate, and in line with lending guidelines.\r\nPartner with internal teams and external contacts to keep deals moving and timelines on track.\n\r\nMortgage Servicing Support:\r\nKeep loan records clean and current in our servicing system.\r\nMonitor statuses, payments, and balances while proactively addressing any gaps.\r\nHelp generate and interpret performance reports related to loan portfolios.\n\r\nFinancial & Data Accuracy:\r\nEnsure all entries and reconciliations are timely and error-free.\r\nSupport financial tracking and assist with internal reporting tasks.\n\r\nCommunication & Collaboration:\r\nKeep everyone in the loop—clients, lenders, investors, and teaUpgrade to see actual infombers.\r\nSolve issues with professionalism and urgency.\r\nFoster a sense of ownership and reliability within the team.\n\r\nYou’ll Be a Great Fit If You:\r\nBring experience in mortgage loan processing, servicing, or a similar finance role.\r\nKnow your way around mortgage platforms—bonus if you’ve worked with The Mortgage Office.\r\nAre known for your attention to detail and pride yourself on doing things right the first time.\r\nHave strong organization and time management skills—you can juggle tasks without letting anything slip.\r\nCan work independently but still value collaboration and shared goals.\r\nCommunicate clearly and professionally, whether by phone, email, or in documentation.\r\nAdapt well to change—especially in a space that evolves with compliance and client needs.\n\r\nCompany Benefits:\r\n$500 USD Sign-In Bonus if you apply between July 10 to September 25, 2025\r\nCompetitive compensation package\r\nOpportunity to work closely with high-level executives from various industries.\r\nProfessional growth and development.\r\nChance to contribute to the success and growth of our clients.\r\nSupportive and collaborative team environment.\r\nPaid US Federal Holidays\r\nPaid Time Off\r\nHealthcare Package\r\n1 Year Travel Bonus\r\nYear-End Bonus\n\r\nHow to Apply:\r\n1. Complete the Form: Start by filling out the form at Upgrade to see actual info.\r\n2. Video Recording: Ensure you have a professional background when recording your video.\r\n3. Be Authentic: We strongly discourage reading from a script. Instead, be genuine and let your personality shine!\r\n4. Email Confirmation: Make sure to provide a valid email address to receive our application confirmation. If you don’t see the confirmation email, double-check for any spelling errors and resubmit the form with the correct email.\r\n5. Next Steps: If your qualifications meet our criteria, our Recruitment Specialist will reach out to you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}