{
  "job_id": "1404543",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Long-Term-Precision-Obsessed-System-Savvy-Executive-Assistant-1404543",
  "scraped_at": "2025-07-14T22:21:35.112104",
  "title": "Full-Time | Long-Term | Precision-Obsessed | System-Savvy Executive Assistant",
  "type_of_work": "Full Time",
  "salary": "$400/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hi! I’m Lisa — an Insurance Agent, emotional intelligence architect, and founder of multiple brands (with more on the way). I’m ready to bring on a rock-solid assistant who thrives on structure, accuracy, and high-touch communication. This is your shot if you’re a details-first kind of person with a backbone of discipline and a love for behind-the-scenes excellence.\n\r\nThis is NOT a gig. This is a right-hand role.\n\r\nWeekly Schedule — Graveyard Shift (PHT Time)\r\nYou’ll work full-time (40 hours/week) and overlap with Pacific Standard Time (PST). You must be available for prep time before Lisa’s day starts and wrap-up time after it ends. Here’s your breakdown:\n\r\n2:30 AM – 7:30 AM (Tuesday) 5 hrs\r\n1:00 AM – 11:30 AM (Wednesday) 10.5 hrs\r\n4:30 AM – 7:30 AM (Thursday) 3 hrs\r\n1:00 AM – 7:30 AM (Friday) 6.5 hrs\r\n1:00 AM – 11:30 AM (Saturday) 10.5 hrs\r\n3:00 AM – 7:30 AM (Sunday) 4.5 hrs\n\r\nSaturdays are always worked for consistency (even if I have no calls). Thursdays are light: policy review support only.\n\r\nWhat You’ll Own\r\nDaily CRM & Lead Hygiene\r\n • Receive lead data, input into CRM, and send emails and texts\r\n • Organize and clean CRM like a data ninja\r\n • Input lead notes, follow-up reminders, & enrollment prep\r\n • Nothing gets lost. Nothing is vague. No half-done tasks.\n\r\nInbox + Calendar Management\r\n • Sort & flag Lisa’s inbox daily\r\n • Draft templated replies via email/text/phone AI & organize by urgency\r\n • Prep tomorrow’s calendar with notes, links, & lead info\n\r\nSystems & SOPs\r\n • Start and end the day with a log\r\n • Document workflows as they evolve (you’ll help build systems too)\r\n • Track which leads came from which campaign\r\n • Assist in light project builds (I use Upgrade to see actual info)\r\n • Consistently update knowledge base for Client Portal + Sona\n\r\nClient Experience\r\n • Light client messages set up & engagement (e.g., check-ins, birthday messages)\r\n • Send follow-up reminders with care\r\n • Make every interaction feel white-glove, even via email\n\r\nRequirements\r\n • Fluent English (written and spoken)\r\n • Expert-level attention to detail — surgical precision, not vibes-based\r\n • Solid tech stack confidence: Upgrade to see actual info, OpenPhone\r\n • Strong internet + quiet environment\r\n • Can handle fast-moving days and calm ones with equal grace\r\n • Must be okay working graveyard shift (PH) long-term\n\r\nBonus Points If…\r\n • You’ve worked in insurance, legal, real estate, or healthcare\r\n • You’ve supported a founder or CEO before\r\n • Your DISC profile = High C or High S\r\n • You actually like organizing things and fixing broken processes\r\n • You read this entire ad and are ready to pass the test.\n\r\nWhat You Get\r\n • Pay via Wise (PH-friendly)\r\n • CEO mentorship + system-building experience\r\n • Bonuses for high performance or big lead weeks\r\n • Long-term growth potential\r\n • Respect, clarity, structure — always.\n\r\nTO APPLY\r\nYou must apply you must go to Upgrade to see actual info and take the test and send the screenshot of your test results to me with the word, Peach in your message. That way I know you read this far.\n\r\nUPDATE: I have extended the deadline for applications. Will continue to accept until I find the right fit!",
  "skill_requirements": [
    "Personal Assistant",
    "Executive Assistance",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": []
}