{
  "job_id": "1405669",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-1405669",
  "scraped_at": "2025-07-15T11:23:36.437293",
  "title": "Virtual Assistant",
  "type_of_work": "Any",
  "salary": "$800-1,400/mo",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "ROLE SUMMARY\r\nWe at Glyph Consulting are seeking remote Video & Photo Editors to support our clients with high-quality editing across real estate walkthrough videos, drone footage, short-form content, and professional photo sets. The ideal candidates will excel in their verbal & written communication and proactive task execution, with a keen eye for detail. This is a long-term opportunity for editors who can follow creative direction, manage their time well, and maintain a clean, consistent visual style.\n\r\nWHO ARE GLYPH CONSULTING?\r\nGlyph Consulting is a boutique talent consultancy that's become a trusted partner for growing media agencies looking to scale with the right people, helping creative entrepreneurs move out of the weeds and into true leadership. We specialize in providing real estate and lifestyle media brands with skilled editors, virtual assistants, and other creatives. Our clients value consistency, reliability, and great design—and we’re looking for editors who do, too.\n\r\nROLE & RESPONSIBILITIES\r\n- Download and organize raw footage, drone clips, and photo assets from cloud storage platforms (Google Drive, Dropbox, etc.)\r\n- Edit property walkthrough videos, aerial sequences, and short-form social content (Reels/TikToks)\r\n- Perform photo editing for real estate listings using bracketed exposures\r\n- HDR blending (manual or software-assisted)\r\n- Color correction, brightness and contrast adjustments\r\n- Sky replacements, object removal (as needed)\r\n- Consistent white balance and straightening\r\n- Add basic titles, overlays, and branding per client guidelines\r\n- Sync audio and music, adjust volume levels, and apply light transitions\r\n- Export files in requested formats (video and photo)\r\n- Complete quality control for your edits before uploading\r\n- Respond to and incorporate revision feedback (typically 1–2 rounds)\r\n- Complete edits within a 24-36 hour turnaround window, unless otherwise directed\r\n- Maintain consistent communication with other teaUpgrade to see actual infombers regarding project status\n\r\nSKILLS & QUALIFICATIONS\r\n- 2+ years of experience in both video and photo editing\r\n- Strong skills in Adobe Lightroom & Photoshop (photo)\r\n- Strong skills in Premiere Pro, Final Cut Pro, or DaVinci Resolve (video)\r\n- Familiarity with real estate content editing and bracketed image workflows\r\n- Strong organizational habits & version control, with the ability to take on several tasks at once\r\n- Reliable internet connection and consistent availability during required hours\r\n- Clear, professional communication and a solutions-oriented attitude\r\n- Ability to innovate new ideas and editing styles\r\n- Bonus: After Effects, Upgrade to see actual info, or other editing software experience\n\r\nCOMPENSATION & WORK HOURS\r\n- Pay will generally be $5.00-9.00 USD per hour (based on experience).\r\n- The amount of working hours vary per client and will be clarified at the time of engagement.\r\n- Operating hours will generally be from 1:00A-9:00A in the respective client’s timezone, but may vary based on client or project needs.\n\r\nGlyph HR & Talent Consulting provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
  "skill_requirements": [
    "Content Creation",
    "Photo Editing",
    "Video Editing"
  ],
  "is_active": true,
  "status_history": []
}