{
  "job_id": "1405185",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Catalog-VA-1405185",
  "scraped_at": "2025-07-15T14:25:53.766650",
  "title": "Amazon Catalog VA",
  "type_of_work": "Full Time",
  "salary": "$4-$5/hour depending on experience",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Join a fast-growing New York-based e-commerce company dedicated to delivering top-quality products and seamless customer experiences on Amazon. Our client is looking for a detail-oriented and proactive Amazon Catalog Manager to maintain, optimize, and expand our product listings to ensure maximum visibility, accuracy, and conversion.\n\r\nWhat You’ll Do:\r\n- Manage the creation, updating, and optimization of product listings on Amazon Seller Central\r\n- Ensure all listings follow Amazon's guidelines and are fully optimized with accurate titles, bullet points, descriptions, images, and keywords\r\n- Monitor and resolve listing issues, including suppressed listings, stranded ASINs, or variation errors\r\n- Execute keyword research and SEO strategies to improve organic search rankings and product visibility\r\n- Handle flat file uploads and bulk listing adjustments to streamline catalog management\r\n- Coordinate with internal teams on inventory, pricing, and product updates\r\n -Work with Amazon Seller Support to troubleshoot listing and catalog issues\r\n - Analyze listing performance and recommend improvements based on data and trends\n\r\nInterested applicants must be able to work from 9am-530pm US EST.  Email your resume, a brief cover letter detailing your experience with Amazon catalog management including the types of listings you’ve handled and the link to your work samples to Upgrade to see actual info",
  "skill_requirements": [
    "Amazon",
    "Ecommerce"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:24:47.637546",
      "reason": "Job first discovered"
    }
  ]
}