{
  "job_id": "1405816",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Manager-1405816",
  "scraped_at": "2025-07-15T12:32:59.169728",
  "title": "Social Media Manager",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "49",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Social Media Manager\r\nWorking Hours: 9:00 AM to 7:00 PM HKT (Monday to Friday) including 1-hour lunch break and 9:00 AM to 1:00 PM HKT (Saturday)\n\r\nJOB SUMMARY\n\r\nWe are looking for a resourceful and self-motivated Social Media Manager who thrives in a fast-paced, environment. This role goes beyond content scheduling — it demands someone who is deeply invested in the company’s mission, willing to take initiative, and ready to contribute wherever the business needs them most.\n\r\nYou will own and drive our social media strategy while also having the opportunity to contribute to high-impact projects across departments. We are seeking a team player who understands that in a startup, dedication often comes before reward — and who is prepared to grow with the business by taking risks, solving problems, and delivering results.\n\r\nRESPONSIBILITIES\n\r\n•Develop and implement a comprehensive social media strategy to increase brand awareness, engagement, and conversions.\r\n•Manage and oversee the company's social media accounts, including but not limited to Facebook, Twitter, Instagram, LinkedIn, Pinterest, and YouTube.\r\n•Create, publish, and optimize engaging and high-quality content in line with our brand identity and target audience.\r\n•Monitor and analyze social media performance using analytics tools, and provide regular reports on key performance indicators (KPIs).\r\n•Collaborate with internal teams, such as marketing, sales, and customer service, to align social media efforts with company goals.\r\n•Respond to comments, messages, and inquiries on social media platforms, fostering a strong community and positive brand reputation.\r\n•Stay up-to-date with the latest social media trends, tools, and best practices to ensure effective and innovative strategies.\r\n•Evaluate the company's social media and digital marketing plans, see areas for development, and provide strategic advice.\r\n•Analyzing the company’s digital marketing plan and social media strategy and identifying strategic weaknesses and making recommendations for improvements.\r\n•Research social media trends and update management on any changes that are relevant to the business's marketing initiatives.\r\n•Develop and manage social media advertising campaigns, including audience targeting, budget allocation, and performance tracking.\r\n•Perform data analysis to see whether social media marketing objectives have been attained.\r\n•Coordinate with influencers and industry professionals for partnerships, collaborations, and content creation.\r\n•Provide training and guidance to teaUpgrade to see actual infombers on social media best practices and content development.\n\r\nQUALIFICATIONS & SKILLS\n\r\n•Minimum of 2 years’ experience in a Social Media Manager or similar role\r\n•Prior experience in startups, high-growth environments, or dynamic creative teams is preferred.\r\n•Strong copywriting, storytelling, and content creation skills.\r\n•Proficiency in multimedia production and basic graphic design (e.g. Canva, Adobe Creative Suite, CapCut, etc.)\r\n•Solid understanding of analytics tools and data-driven decision making.\r\n•Highly adaptable, self-directed, and accountable in fast-moving environments.\r\n•Strong collaborative skills; able to work effectively across departments.\r\n•Proactive mindset with a focus on problem-solving and ownership.\r\n•Excellent verbal and written communication skills in English.\r\n•Familiarity with or enthusiasm for the motorcycle or electric vehicle industry is a plus.\r\n•Experience with influencer outreach, paid social campaigns, or community building is a bonus\n\r\nEssential Requirements for Remote Work:\r\n• Reliable Laptop or Desktop Computer.\r\n• Stable and high-speed internet connection.\r\n• Power source and backup internet connection in case of electricity interruptions.\n\r\n***How to Apply***\n\r\nTake the next step by completing our application form:\nUpgrade to see actual info/Upgrade to see actual info/f/3j1fc-35945/HQ578HNFWTW3B7LXDL\n\r\nNote: Only successful candidates will be contacted for the next phase of the selection process. We appreciate your time and interest in joining our team.",
  "skill_requirements": [
    "Content Creation",
    "Social Media Management",
    "Canva"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:48:50.288578",
      "reason": "Job first discovered"
    }
  ]
}