{
  "job_id": "1406294",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Development-Representative-w-B2B-Experience-in-Finance-Mortgage-or-Real-Estate-Industry-1406294",
  "scraped_at": "2025-07-15T12:24:23.964674",
  "title": "Sales Development Representative - w/ B2B Experience in Finance, Mortgage or Real Estate Industry",
  "type_of_work": "Full Time",
  "salary": "$800 - $1000 base + commission",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "APPLY ONLY IF YOU HAVE EXPERIENCE WITH THE FOLLOWING:\r\n1. B2B and B2B experience\r\n2. Experience with Finance, Mortgage, or Real Estate Industry\n\r\nReady to Spark Change in Mortgage Tech?\r\nAt Zeitro, we’re not just improving the mortgage industry—we’re transforming it. As a fast-growing startup at the intersection of fintech and real estate, we’re building innovative tools that simplify and streamline the mortgage journey. Now, we’re looking for a high-energy Growth Catalyst to help us bring these solutions to the professionals who need them most.\n\r\nWhat You’ll Own:\r\nThis isn’t a typical SDR role. As a key player on our go-to-market team, you’ll be responsible for identifying and connecting with mortgage and finance professionals who are the right fit for Zeitro’s platform. Your outreach will drive pipeline growth and directly shape how our technology is adopted across the mortgage industry.\n\r\nKey Responsibilities:\r\n-Target and engage B2B/B2C prospects across the mortgage, real estate, and financial services sectors—loan officers, brokers, lenders, and other decision-makers.\r\n-Build and execute strategic outbound campaigns using phone, email, LinkedIn, and other channels.\r\n-Understand the unique language and pain points of the mortgage industry and tailor messaging accordingly.\r\n-Qualify leads effectively and hand off sales-ready opportunities to Account Executives.\r\n-Maintain clean and accurate records in our CRM and contribute to a data-driven sales process.\r\n-Continuously analyze performance metrics, A/B test approaches, and optimize outreach for efficiency and impact.\r\n-Work closely with marketing and product teams to ensure messaging resonates with industry professionals and aligns with our GTM strategy.\n\r\nWhat You Bring:\r\n-2+ years of B2B/B2C sales or business development experience, ideally in a high-velocity outbound role.\r\n-Strong preference for candidates with experience in mortgage, finance, or real estate—you know the terminology, the players, and how to speak their language.\r\n-Proven ability to research, personalize outreach, and navigate complex conversations with senior professionals.\r\n-Self-starter mentality with a sense of ownership and urgency.\r\n-Familiarity with CRM systems and sales tools (HubSpot, Salesforce, SalesLoft, etc.).\r\n-Resilience, curiosity, and a growth mindset—we move fast, learn faster, and celebrate wins together.\n\r\nLet’s Build the Future of Mortgage Tech\r\nIf you’re ready to help modernize one of the most vital industries—and you thrive in fast-paced, mission-driven environments—we want to hear from you.\n\r\nTo be considered for this role, please respond to this job posting by copying and completing the template below:\n\r\n1. Do you have B2B experience? Yes or No\r\n2. Do you have B2C experience? Yes or No\r\n3. Do you have experience in the Finance, Mortgage, and Real Estate industries? Answer “Yes” only if you have experience in all three. If not, please specify the industries you do have experience in.\r\n4. Resume Link - Make sure that this is accessible\n\r\nApply now and become part of something transformative.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:21:30.803426",
      "reason": "Job first discovered"
    }
  ]
}