{
  "job_id": "1407921",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1407921",
  "scraped_at": "2025-07-14T23:07:17.912347",
  "title": "Inbound Sales Call Center Manager (Build & Scale from Scratch)",
  "type_of_work": "Full Time",
  "salary": "HIGH SALARY",
  "hours_per_week": "50",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Please watch this Loom video for a detailed explanation of the role:\nUpgrade to see actual info/share/77f1cca87a82477aa57da283fe6b5205?live_rewind=1\r\nDISCLAIMER: Who this is NOT for\n\r\nThis is not a support role. If your experience is mostly in customer service or tech support, this won’t be a fit.\r\nIt’s also not a role for someone who just wants to manage an existing team. We’re looking for a builder — someone who can sell on the phone themselves, and then build the systems, hire the full team, and build processes around them.\n\n\r\nRequirements:\n\r\n-Fluent in English\n\r\n-Available full-time (50+ hours/week minimum), with flexibility to take early/late shifts as needed during the initial phase\n\r\n-Proven experience building or managing a sales call center team (ideally inbound)\n\r\n-Strong track record in phone-based sales — especially handling high lead volumes or TV/radio/direct response campaigns\n\r\n-Experience closing sales personally — not just managing reps\n\r\n-Deep understanding of call center metrics, workflows, and performance management\n\r\n-Experience hiring, training, and coaching sales reps at scale\n\r\n-Familiarity with CRM systems, call tracking tools, and sales automation — and ability to recommend/implement the right setup\n\r\n-Highly organized and proactive — you take full ownership of building and leading your department\n\n\n\r\nThe Company:\r\nLOOM: Upgrade to see actual info/share/85c5d4c952d240878bed48d74859d61d\n\r\nAt Nebroo, we are revolutionizing the hearing aid industry by combining world class products with cutting edge direct response marketing. In just a few months, we’ve grown into a multi 8-figure business — and we’re only getting started.\n\r\nWhile we’re known for our expertise in direct response marketing, we go far beyond just performance. We obsess over product quality. Our mission is to create the highest quality over-the-counter hearing aids on the market — products that genuinely improve the lives of millions suffering from hearing loss.\n\r\nEverything we do is shaped by our values:\n\r\nTransparency\r\n- We believe trust is built through honesty. That’s why we share information openly, give direct feedback, and keep our promises — internally and externally. No politics, no games, just clarity.\n\r\nHard Work\r\n- At Nebroo, we work long hours, move fast, and expect a lot from ourselves and each other. Not because we have to, but because we love what we do. We’re obsessed with building, improving, and pushing things forward every single day. This isn’t the place for people chasing comfort. It’s for people who love the grind, take pride in outworking everyone else, and get energy from going all in.\n\r\nExcellence\r\n- We never settle for “good enough.” From our ad creatives to our customer experience to the engineering behind our products, we hold ourselves to the highest standards and aim to outperform the competition at every level.\n\n\r\nJob Description:\n\r\nWe’re launching nationwide TV ads and building a brand-new inbound call sales operation — and we’re looking for a Sales Call Center Manager who can own the entire thing from day one.\n\r\nAt first, you’ll be on the phone yourself, taking inbound sales calls directly from customers responding to our ads. But this role isn’t just about closing — it’s about building. Within weeks, you’ll start hiring and training your own team. You’ll choose the CRM, set the KPIs, build the scripts and processes, and run the entire sales floor. You’ll have full ownership — from calls to conversions.\n\r\nYou’ll report directly to the founder and work closely with marketing to align messaging, pacing, and performance.\n\r\nThis is a ground-floor leadership role for someone who has done it before — someone who’s built and scaled a call center or sales team, knows what high performance looks like, and is ready to do it again.\n\n\r\nWhat You’ll Be Doing\n\r\n- Taking inbound sales calls directly from our TV advertising campaigns (initial solo phase)\r\n- Closing sales over the phone using persuasive, compliant, and clear communication\r\n- Building and managing a high-performance inbound call sales team\r\n- Hiring, training, and coaching reps to hit clear, measurable targets\r\n- Setting up the CRM, call tracking systems, reporting dashboards, and SOPs\r\n- Developing scripts, rebuttals, and objection-handling flows for the team\r\n- Monitoring team performance, coaching in real time, and handling escalations\r\n- Working closely with marketing to give feedback on lead quality and ad performance\r\n- Taking full ownership of the sales department’s output and growth\r\n- Reporting directly to the founder with weekly numbers, insights, and actions\n\r\nAdditional note: The main intent for this sales team is to handle inbound TV ads sales calls. However with time we may also test outbound abandoned checkout calls, outbound upsell calls(post purchase), outbound upsell calls(after delivery) and few other initiatives.\n\n\r\nCompensation:\n\r\nCompensation is open and flexible, and will depend on your experience, skillset, and the level of ownership you bring to the role.\r\nWe’re not hiring someone to just manage — we’re looking for someone who can build, lead, and scale a high-performance sales operation from scratch. If you’ve done this before, and you’re ready to do it again at a high level, you’ll be compensated accordingly.\r\nThere’s no hard ceiling here. Show us you can drive real performance and results, and you’ll be rewarded for it.",
  "skill_requirements": [
    "Call Center Operations Management",
    "Workflow",
    "Phone Support"
  ]
}