{
  "job_id": "1407797",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Executive-Assistant-1407797",
  "scraped_at": "2025-07-14T23:07:46.499573",
  "title": "Virtual Executive Assistant",
  "type_of_work": "Part Time",
  "salary": "$350 - $400+ per month",
  "hours_per_week": "25",
  "date_updated": "Jul 14, 2025",
  "job_overview": "I'm the founder of a digital growth marketing company that helps mission-driven founders scale their businesses with more ease & less overwhelm - and I'm looking for a small team of highly-skilled Philopena assistants to help take over the marketing and management tasks that make a huge difference in the lives of the people that hire us.\n\r\nI'm looking for a max of 5 amazing executive assistants available for part-time (potential for full time) with a salary starting at $350 USD per month and with long term success and robust training, moving up to $500 USD per month as an emerging leader in the company. \n\r\nIf you have the following skill sets, I encourage you to apply:\n\r\nPREFERRED EXPERIENCE:\n\r\n- 1+ years of experience in Social Media Marketing, Sales Funnels, Shopify, or Digital Marketing\r\nYou're a professional woman who is passionate about helping changemakers simplify their lives by setting up systems that will allow them to operate their businesses with more ease and less overwhelm. You have experience with sales funnel and CRM software\r\n- 1+ years of experience advertising on platforms like Instagram, Facebook, Tik Tok, within a Marketing team consisting of Paid Acquisition, Organic Marketing, Customer Retention, & Product Marketing\r\nYou're an emerging leader who has the potential to head a team in the future that will report directly to you. Having leadership experience is a MAJOR plus\r\n- 1+ years of experience as a Virtual Assistant or Executive Assistant \r\nYou've done it all from managing schedules to email & calendar management. You have a meticulous eye for detail where Prioritization and Organization are your love language\r\n- Creating SOPs (Standard Operating Procedures)\r\nYou’ll ensure each business function has detailed documentation for repeatable and scalable growth if it isn't already place. If you see gaps, you take the initiative to fill them and produce results without anyone knowing there was an issue (yea, all that and a bag of chips :-)\r\n- Experience working at a digital/online product/platform: You’re familiar with online courses, digital products & platforms and popular tools in the business space ranging from landing page builders and email service providers to CRMs, and course hosting platforms aren’t foreign to you (We teach tools like Shopify, Convertkit, Kajabi, Teachable, Learnworlds, Calendly, etc)\n\r\nABOUT YOU:\n\r\n- “You down with SOP? Yeah you know me!”—You’re an advocate for SOPs (Standard Operating Procedures) to make our systems repeatable & scalable.\r\n- Your love language is processes & predictable, meteoric growth. We never question company progress towards the quarterly and yearly goals because you keep real-time metrics for all projects.\r\n- You’re aware of new software and can look at current systems and identify how to automate tasks a company has been doing manually for months. \r\n- You’re addicted to digital processes & automation in the world of social media because you love building connections in the digital space and you’ve seen how powerful it can be in business growth\r\n- You’re driven by metrics & tracking. You know that you can’t improve something unless you measure it, so you develop ways to measure performance so your company is always predictably improving.\r\n- Timeliness and deadlines are your jam. When we have a team call at 10:00am, you show up at 9:55am. When the deadline is Tuesday at 5:30pm, you have it done Monday.\r\n- You overcommunicate clearly and confidently. If you agree/disagree with something, you communicate that without hesitation or overthinking. You’re no stranger to asking why we do things a certain way to ensure we’re intentional with our resources.\r\n- You’re a leader and team player. Ego? What ego? If something needs to be done, you dive in to make sure all critical tasks are accounted and cared for.\n\r\nIf you’re nodding your head “Yes” to the above, proceed below to apply.\n\r\nPERKS:\n\r\nI'm committed to setting our staff up for success with access to trainings that will certify your skills in:\n\r\n- Task & Calendar Management\r\n- Launch/Sales Strategy Planning\r\n- Sales Funnel Tech Setup (For E-Commerce or Service Based Businesses)\r\n- Social Media Management\r\n- Digital Media Marketing (Including Email and SMS Marketing) \r\n- Lead Generation \n\r\nAfter one week of training and assessment, you're officially certified under our internal training program, which means hitting the ground running with your new skills. Perks include: \n\r\nPart time work hours\r\nWork from anywhere in the world (as long as your internet signal is strong and computer is fast)\r\nStarting Salary at $350 USD a month ($4200 USD annual)\r\nInternal certification program to enhance your professional skills in your career (I have helped clients amass at least $10M from the same digital growth marketing strategies I will require you to learn)\n\r\nInterested? Please reply to this post with the secret keyword \"APPLES\" so I know you can pay attention to detail - from there, I'll let you know next steps if you qualify.",
  "skill_requirements": [
    "Marketing Automation",
    "Digital Marketing",
    "Executive Assistance"
  ]
}