{
  "job_id": "1407462",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Full-Stack-Developer-Work-From-Home-1407462",
  "scraped_at": "2025-07-15T12:35:45.709266",
  "title": "Senior Full Stack Developer (Work From Home)",
  "type_of_work": "Full Time",
  "salary": "80,000 - 150,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are an e-commerce/manufacturing company that manufactures home decor products. Lumaprints specializes in manufacturing canvas, metal, and fine art paper prints from beautiful artworks and photography. We are an equal opportunity company that promotes workplace diversity. You can view more details about our company on our website Upgrade to see actual info.\n\r\nWe’re looking for a Senior Full Stack Developer to join our team in building a robust and scalable web platform. You will be responsible for transforming user stories into high-quality, production-ready features that meet acceptance criteria. You will collaborate closely with others to plan, build, and optimize the platform using modern full-stack technologies.\n\r\nEssential duties and responsibilities:\r\n· Develop and maintain high-quality applications using C# and PHP (Laravel).\r\n· Build responsive frontend interfaces using React and Next.js.\r\n· Write tests for new or updated features.\r\n· Ensure code quality, performance, maintainability, and security.\r\n· Contribute to architectural planning and long-term technical strategy.\n\r\nRequirements:\n\r\n· 4+ years of experience in full-stack development using:\r\n                                       o Backend: PHP (Laravel), knowledge in C# is a plus\r\n                                       o Frontend: React with Next.js\r\n                                       o Database: MySQL, PostgreSQL and MongoDB\n\r\n· Proven experience delivering production-ready software.\r\n· Strong communication and time management skills.\r\n· Ability to thrive in a fast-paced, evolving environment.\n\r\nThis is full-time, long-term positions, and we are looking for dedicated applicants looking to grow with the company.\n\r\nJob Type: Full-time\r\nSchedule: 8-hour shift, Monday to Friday.\r\n12 AM - 8:30 AM Philippine Standard Time / 9 AM - 5:30 PM Pacific Time\n\r\nCompensation: PHP 80,000 to PHP 150,000 depending on experience and qualification.\n\r\nNote: Please send a copy of your most recent CV.",
  "skill_requirements": [
    "PHP",
    "React JS",
    "MySQL"
  ],
  "is_active": true,
  "status_history": []
}