{
  "job_id": "1407317",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Friendly-High-Performing-Real-Estate-Cold-Caller-1407317",
  "scraped_at": "2025-07-14T23:09:17.460566",
  "title": "Friendly, High Performing Real Estate Cold Caller",
  "type_of_work": "Full Time",
  "salary": "$640/ Month Base + Weekly and Monthly Bonuses",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Virtual Assistant Cold Caller – Real Estate (Full-Time | Long-Term)\n\nAre you a confident English speaker with a friendly voice and excellent phone presence? Do you enjoy engaging with people and helping solve problems? If so, we’d love to have you on our team!\n\nWe are a fast-growing U.S.-based real estate investment company that specializes in buying residential properties. We’re looking for a professional, consistent, and driven Cold Caller VA who can help us connect with motivated homeowners. This is not for beginners or clock watchers. \nPosition Details\nRole: Virtual Assistant Cold Caller\nIndustry: Real Estate \nEmployment Type: Full-Time (40+ hours/week)\nLocation: Remote (Philippines-based candidates only)\nWorking Hours: U.S. Eastern Standard Time (EST) – typically 9 AM to 6 PM EST (Bonus if you can work Saturdays) \nSalary: Competitive pay (based on experience) + performance bonuses\n\nYour Responsibilities\nMake outbound calls to property owners using our dialer (Ready Mode)\nFollow scripts and qualify leads based on specific criteria\nInput lead details and notes accurately into Close.io CRM\nSchedule follow-up calls and set appointments for our acquisition team\nMaintain professional and empathetic communication at all times\nCollaborate with our team via Slack and manage daily tasks on Asana\n\nWhat We’re Looking For\nExcellent verbal and written English (neutral/clear accent preferred)\n12+ months of outbound calling or sales experience in Real Estate \nStrong communication and listening skills\nSelf-motivated, consistent, and organized\nComfortable working independently and hitting daily/weekly KPIs\nUnderstands how to build rapport and qualify using the 4 pillars: Motivation, Condition, Timeline, Price\nQuiet environment, reliable internet, USB headset\nFamiliarity with tools like:\nReady Mode \nClose.io CRM\nSlack, G-Suite, Batch Leads, Propstream, Asana\n\nHow to Apply\nWe want to hear how you sound on the phone! Please submit:\nYour updated resume. \nAn audio recording (MP3 or Vocaroo link) of you doing a 1-2 minute mock cold call as if you're speaking to a homeowner about selling their property. Be friendly, natural, and confident.\nA brief introduction message telling us why you’re a great fit for this role.\n\nWhy Work With Us\nLong-term opportunity with room to grow\nSupportive and professional U.S. team\nTraining and onboarding provided\nMonthly incentives and performance bonuses\nA company culture that values respect, ownership, and growth\n\nWe’re hiring immediately – apply today and become a vital part of our growing team!",
  "skill_requirements": [
    "Acquisition",
    "Appointment Setting",
    "Cold Calling"
  ]
}