{
  "job_id": "1407320",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1407320",
  "scraped_at": "2025-07-14T23:08:45.860556",
  "title": "Facebook Ads Specialist (Remote, Full-Time)",
  "type_of_work": "Full Time",
  "salary": "$5 - $7 (Depending on Experience)",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re Hiring: Facebook Ads Specialist (Remote, Full-Time)\n\r\nAre you passionate about running high-converting Facebook Ads? We’re looking for a Facebook Ads Specialist to join our growing team! This is a fully remote and full-time role perfect for someone who enjoys creating impactful campaigns and driving real results.\n\r\nWhat You'll Do:\r\nPlan, launch, and manage Facebook Ad campaigns that drive traffic, leads, and conversions\r\nConduct audience research and competitor analysis to optimize targeting\r\nCreate engaging ad copy and creatives tailored to campaign goals\r\nMonitor campaign performance and make data-driven improvements\r\nStay updated on Facebook Ads trends and algorithm updates\r\nWork closely with our marketing and design teams\r\nProvide clear reports and insights on campaign performance\n\r\nWhat We're Looking For:\r\nProven experience managing multiple Facebook Ad accounts\r\nStrong knowledge of Facebook Ads Manager and ad targeting strategies\r\nAnalytical mindset with attention to campaign data and metrics\r\nGreat communication and teamwork skills\r\nCreative eye for developing effective ads\n\r\nNice to Have (But Not Required):\r\nExperience with Google Ads or other paid media platforms \nFacebook Blueprint and/or Google Ads certifications\n\r\nPerks & Benefits:\r\nPaid Time Off\r\nOvertime and Holiday Pay\r\nFixed Weekends Off\r\nEmployee Loan Program\r\nCareer development opportunities\n\r\nHow to Apply:\r\n1. Complete the assessment: [Insert assessment link here]\r\n2. Send an email to Upgrade to see actual info with the subject line: Facebook Ads Specialist - [\"Your Full Name\"]\n\r\nA $3 token will be given to applicants who complete the test project and successfully pass all interview stages.",
  "skill_requirements": [
    "Marketing Analytics",
    "Advertising",
    "Facebook Ads"
  ]
}