{
  "job_id": "1407940",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-Representative-CSR-1407940",
  "scraped_at": "2025-07-15T15:29:12.522834",
  "title": "Customer Service Representative (CSR)",
  "type_of_work": "Full Time",
  "salary": "$6.27/hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Seeking a professional, Customer Service Representative (CSR) with excellent verbal and friendly customer service skills. This CSR position will interact with different customers to handle inbound inquiries and answer service calls.\n\r\n***PLEASE INCLUDE A VIDEO RECORDING INTRODUCING YOURSELF WITH THE INTRO SAYING \"HI CONTACT AUTOMATION, MY NAME IS.....\" AND THEN SHARING THREE INTERESTING FACTS ABOUT YOURSELF OUTSIDE OF WORK.***\n\r\n***FLUENT ENGLISH IS REQUIRED***\n\r\n***MUST HAVE A QUIET SPACE TO WORK AT HOME***\n\r\n***MUST HAVE RELIABLE INTERNET SERVICE & DIRECTLY PLUGGED INTO YOUR MODEM.***\n\r\n***DUAL MONITORS ARE REQUIRED***\n\r\n***PLEASE INCLUDE A VIDEO OR PHOTO OF YOUR HOME OFFICE SETUP DETAILS.***\n\r\nRequirements:\n\r\n- Working hours: Must have OPEN availability. Saturdays and Sundays open availability is a must!\r\n- At least 1 year previous phone customer support call center experience.\r\n- High attention to detail and strong organizational skills\r\n- Excellent verbal and written English communication skills\r\n- Ability to MULTI-TASK in FAST-PACED environment, including phone and email support\r\n- Great customer service personality and upbeat attitude\r\n- Ability to work independently while managing multiple projects and with minimal supervision\n\r\nAs a Customer Service Representative, you will serve as the first point of contact for a variety of different customers handling a wide array of requests. With incoming phone calls, you will handle different requests based on the specific client’s scripts and instructions. Whether you assist in scheduling a service, processing a payment, or taking a message, you will make each customer interaction a successful positive call.\n\r\nWe work in a team atmosphere that strives to meet the CA call center’s goals each month. Your computer skills, problem-solving, and commitment to creating an awesome interaction experience will ensure your success!",
  "skill_requirements": [
    "English Speaking",
    "Customer Service",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:40:25.936304",
      "reason": "Job first discovered"
    }
  ]
}