{
  "job_id": "1408188",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-Full-Time-Social-Media-Expert-EST-Time-Zone-1408188",
  "scraped_at": "2025-07-15T11:35:08.232466",
  "title": "Experienced Full Time Social Media Expert - EST Time Zone",
  "type_of_work": "Full Time",
  "salary": "1,000-1,600",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Important: Do not apply unless you have read this entire job posting and can meet all requirements. Before applying, review our website, Instagram, and Facebook pages thoroughly and please audit what can be improved. \n\r\nCandidate must be \r\n- 9/10 proficient in English \r\n- Advanced video editing (see our social media to note the quality we expect) \r\n- Must be experienced in social media content marketing strategies & analyzing data\r\n- Must be comfortable with AI\r\n- \n\r\n**Technical Requirements**: Candidates must have a reliable high-speed internet connection (minimum 10 Mbps) and a fast, modern computer capable of handling photo and video editing software (e.g., Adobe Suite, Canva). Please confirm these in your application. Additionally, you must have a backup power solution (e.g., UPS or generator or alternative location with access to alternative power sources) to ensure uninterrupted work during power outages.\n\r\nTasks not limited to but include \r\n- Daily posting on IG, FB, & TikTok\r\n- Adjusting posts to go onto Linked In, Google my business updates, Youtube, TikTok, Nextdoor\r\n- Follow unfollow \r\n- Replying to comments \r\n- 3-5 Stories a week on FB + IG\r\n- Lead Generation - scanning Facebook groups and other platforms for potential leads, engage with interested parties, and respond to comments/messages promptly to drive conversions\n\r\nTo apply: \r\n- Please write an detailed audit of our current social media you will find links on our website: Upgrade to see actual info addressing how you can improve our current social media presence based on your review.\r\nInclude specific suggestions for new platforms (e.g., Yelp, Twitter/X) and strategies to enhance our visibility.\r\n- Explain why you would be good for this role \r\n- Send previous content you have created and pages you have managed \r\n- Provide a Vocaroo voice note\n\r\nWe are looking for someone who understands that we musts deliver value not just sell our services. Someone who understands viewer retention, engagement, is self motivated, and hardworking. We want to have this person long term and provide the opportunity not just for our business to grow, but to support you in your growth as well.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Video Editing",
    "Social Media Marketing"
  ],
  "is_active": true,
  "status_history": []
}