{
  "job_id": "1408707",
  "url": "https://www.onlinejobs.ph/jobseekers/job/BIM-Interior-Designer-Revit-Expert-1408707",
  "scraped_at": "2025-07-15T14:39:42.203789",
  "title": "BIM Interior Designer (Revit Expert)",
  "type_of_work": "Full Time",
  "salary": "700 usd/m",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: BIM Interior Designer (Revit Expert Only)\r\nLocation: Remote – Full Time\n\r\nRD Studio is a digital company specializing in high-quality Revit families, CAD blocks, and architectural content. We are looking for a talented Interior Designer or Architect with expert-level Revit skills to join our team.\n\r\n******* Important:\r\nPlease visit our website www.rdstudio.co before applying. We only consider candidates who understand what we do and who are experienced in Revit.\n\r\n?\n\r\nJob Responsibilities:\r\n • Develop interior design concepts using our Revit families\r\n • Visualize and model interiors in Revit at LOD 300+\r\n • Design product graphics and presentation material using Adobe software\r\n • Manage and create content for our social media accounts\r\n • Help maintain and update our website content\n\r\n?\n\r\nQualifications:\r\n • Expert-level proficiency in Revit\r\n • Experience with AutoCAD, Illustrator, Photoshop, and InDesign\r\n • Strong interior design portfolio\r\n • Good understanding of visual storytelling and layout design\r\n • Familiarity with Instagram, Pinterest, or similar platforms\r\n • Excellent English communication skills\r\n • Organized, proactive, and able to work independently\r\n • Bonus: experience with Shopify or WordPress\n\r\n?\n\r\nTo Apply: \nEmail Upgrade to see actual info with the following:\r\n 1. Your resume\r\n 2. A portfolio of your interior design work (Revit-based)\r\n 3. A short cover letter explaining your Revit experience and why you want to work with us\n\r\nOnly complete applications will be reviewed. This position is for serious applicants who are confident in their Revit skills and interested in long-term work.",
  "skill_requirements": [
    "Architectural Services",
    "Parametric modeling",
    "Revit"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T11:22:29.849665",
      "reason": "Job first discovered"
    }
  ]
}