{
  "job_id": "1408360",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Operations-Assistant-1408360",
  "scraped_at": "2025-07-15T14:38:10.366992",
  "title": "Operations Assistant",
  "type_of_work": "Full Time",
  "salary": "$500",
  "hours_per_week": "32",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking a highly organized and proactive Operations Assistant to support the day-to-day functions of our Digital Marketing Agency. Working directly under the supervision of the Operations Manager, this role involves coordinating internal workflows, assisting in service execution, managing administrative tasks, and helping ensure client deliverables are completed efficiently and on time.\n\r\nKey Responsibilities:\r\n1. Project Coordination:\r\n-Assist in tracking and managing tasks related to Website Design, SEO, Google Ads, Facebook Ads, and Graphic Design.\r\n-Ensure deadlines and deliverables are met by coordinating with internal teams.\n\r\n2. Digital Asset Management:\r\n-Organize and manage assets used for video production and graphic design.\r\n-Assist our Facebook Marketplace Upgrade to see actual info \n\r\n3. CRM:\r\n- Maintain and tracking of client data, project status, and communication logs.\n\r\n4.Administrative Support:\r\n- Prepare reports, update trackers, and maintain project documentation.\r\n- Schedule internal meetings and follow up on action items.\r\nIndicate good on the email subject.\n\r\n5. SMS and Email Marketing\r\n- You will be a dedicated SMS & Email Campaign support. Tools and drafts will be provided\n\r\n6. Quality Control:\r\n- Conduct basic reviews to ensure ads, websites, and listings meet brand and quality standards before final submission.\n\r\n7. Communication:\r\n- Coordinate with teaUpgrade to see actual infombers across departments (design, content, ads) to support smooth workflow.\r\n- Provide updates to the Operations Manager on task progress, bottlenecks, and client-related concerns.\n\r\nQualifications:\r\n1. Prior experience in a digital marketing agency or operations-related role is a plus.\r\n2. Strong organizational and multitasking skills.\r\n3. Familiarity with Google Workspace (Docs, Sheets, Drive), project management tools (e.g., Notion, ClickUp)\r\n4. Basic understanding of digital marketing services (SEO, paid ads, design) is preferred.\r\n5. Excellent written and verbal communication skills.\r\n6. Fast learner with a proactive and team-oriented attitude.\r\n7. Able to work day shift Philippine time \n\r\nBenefits & Perks will be discussed during the interview.\n\r\nPlease apply only if you think you are the one I'm looking for. DMs will not be entertained, so send your CV and video selfie with a brief intro about you and what you do at Upgrade to see actual info",
  "skill_requirements": [
    "Office and Administration",
    "Operation Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:46:43.238825",
      "reason": "Job first discovered"
    }
  ]
}