{
  "job_id": "1408679",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Influencer-Relationship-Manager-1408679",
  "scraped_at": "2025-07-15T12:23:57.656107",
  "title": "Influencer Relationship Manager",
  "type_of_work": "Full Time",
  "salary": "480USD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re hiring a full-time Virtual Assistant to manage our influencer collaborations across HashGifted and similar creator platforms. This role blends relationship management with data entry and organization. You'll be responsible for messaging creators, coordinating PR packs, tracking deliverables, and keeping everything up to date in our internal systems. Training will be provided and custom GPTs will facilitate many of these processes.\n\r\nYou’ll need to be confident in outreach and follow-up, while also being highly organized and detail-oriented. Your job is to bring structure to the moving parts from initial contact to final content delivery.\n\r\nWhat You’ll Do:\r\n– Message creators and respond to incoming inquiries\r\n– Organize PR pack details with creators and confirm collaboration requirements\r\n– Add creators to our CRM and track each stage of their collaboration\r\n– Prepare CSV files for sample shipments via ShipBob or local Australian fulfillment\r\n– Follow up on deliverables and update status in our Notion CRM\r\n– Organize received content into the correct cloud folders\r\n– Send a short end-of-day update on the creator pipeline, content received, and queue progress\r\n– Use the CRM to manage communication, follow-ups, and content deadlines\r\n– Ensure proper attribution, storage, and categorization of all creator content\r\n– Maintain clean and accurate tracking across databases and folders\n\r\nYou won’t be responsible for creating, scripting, or delegating content. A separate teaUpgrade to see actual infomber will handle all creative direction and briefs. Your role is to make sure information flows smoothly between creators and our internal team acting as the point of contact to keep everything aligned and on track.\n\r\nYou’ll work with tools like HashGifted, Notion, Google Sheets, AirTable, Google Drive, and Slack. Ideally, you’ll be available during AEST hours for better communication with our team. Attention to detail, consistency, and clear communication are essential for success in this role.\n\r\nHow to apply\r\nRespond to this listing with: “I’m your Creator Collaboration VA”\r\nPlease include:\r\n– A cover letter on why you’re a great fit based on current skills or past experiences\r\n– A screenshot of your internet speed test\r\n– One paragraph explaining how you stay organized when managing multiple tasks\r\n- At your discretion, please share screenshots or resources demonstrating your abilities as a value add",
  "skill_requirements": [
    "Customer Support",
    "Database Management",
    "Customer Relationship Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:33:39.271325",
      "reason": "Job first discovered"
    }
  ]
}