{
  "job_id": "1408002",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Digital-Designer-with-Klaviyo-experience-1408002",
  "scraped_at": "2025-07-15T14:41:18.490963",
  "title": "Digital Designer with Klaviyo experience",
  "type_of_work": "Full Time",
  "salary": "Depend",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the role\r\nWe are seeking a highly creative Digital Designer with deep experience in email marketing, HTML email creation, and Klaviyo. In this role, you will also design compelling product images, marketing content, logos, illustrations, and layouts—ensuring consistency with our brand guidelines throughout.\n\r\n If you think you’re the right fit, a modern portfolio that demonstrates a strong sense of layout, typography, and color is essential—we’re looking for someone who knows how to make emails not only stand out and engage, but convert.\n\r\nWhat you'll do\r\nDesign visually compelling, HTML-friendly email assets (templates, banners, graphics) tailored for Klaviyo\r\nBuild and manage automated email flows and sequences, ensuring mobile responsiveness and dynamic personalization\r\nGenerate the HTML/CSS for the designs they create\r\nConduct A/B testing on visual and messaging elements (CTAs, subject lines, imagery) to optimize open rates, click-through rates, and conversions.\r\nAnalyze campaign performance (open, click, and conversion rates) and iterate on design based on insights\r\nMaintain and evolve a modern design system with a keen eye for clean layouts, strong color palettes, and brand consistency\r\nDesign landing pages, promotional graphics, and web banners aligned with marketing goals\r\nCollaborate closely with marketing and product teams to produce cohesive campaigns across channels\r\nMaintain and enforce brand guidelines across all digital and print design touchpoints\n\r\nQualifications\r\nProven experience with Klaviyo, including custom flows, segmentation, and campaign building\r\nSolid understanding of HTML/CSS for emails, with a focus on responsiveness and cross-platform compatibility\r\nAdvanced skills in Adobe Creative Suite (Photoshop, Illustrator, InDesign), Figma, and modern design tools\r\nPortfolio that showcases email designs, landing pages, and digital marketing collateral with a modern aesthetic and attention to color, typography, and layout\r\nUnderstanding of email marketing UX/UI, customer engagement strategies, and email compliance best practices\r\nAbility to analyze email performance data and apply findings to enhance visual content\r\nStrong communication skills and the ability to collaborate across teams\r\nBonus: Familiarity with Dreamweaver, Quark, or motion graphics tools\n\r\nAdditional Requirements\r\nAvailability to work 7 AM to 4 PM Pacific Time zone\r\nReliable internet access and a private remote workstation.\n\r\nHow to apply\r\nPlease send your application here:\nUpgrade to see actual info\n\r\nJob Type: Full-time, International Contractor, Remote\r\nCompensation: Up to $35 USD per hour, depending on experience",
  "skill_requirements": [
    "Design",
    "Klaviyo",
    "Digital Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:31:28.856145",
      "reason": "Job first discovered"
    }
  ]
}