{
  "job_id": "1408035",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Platform-Support-Assistant-1408035",
  "scraped_at": "2025-07-15T14:41:42.264286",
  "title": "Marketing & Platform Support Assistant",
  "type_of_work": "Part Time",
  "salary": "$400 - $600 USD/month",
  "hours_per_week": "30",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Title: Marketing & Platform Support Assistant\r\nLocation: Remote (Must be able to overlap at least 3-4 hours with Pacific Time (PST) business hours)\r\nWork Hours: 25-30 hours per week (With potential to grow into full-time, 40 hrs/week)\n\r\nCompany Overview:\r\nJoin Creator, the ultimate influencer marketing platform trusted by global brands like Nike, Oakley, Best Buy, and Amazon. We empower brands to reach millions and turn influence into measurable impact—tracking every step from social engagement to sales, all in one seamless platform. \r\nWe're looking for a detail-oriented, Marketing & Platform Support Assistant to help ensure the successful setup, execution, and troubleshooting of influencer marketing campaigns. This role plays a critical part in reviewing campaign briefs, managing updates, and supporting both brands and creators through technical and operational questions. \r\nStarting at 20 hours per week with the potential to grow into a full-time position.\n\r\nWhat You’ll Do:\r\nCampaign Strategy & Optimization\r\n- Review 1–5 influencer campaign briefs daily to ensure strategic alignment, clarity, and creator-friendliness flagging issues as needed and making timely updates to briefs, compensation, or deliverables while ensuring changes are communicated appropriately.\r\n- Add missing workflow steps on the Creator dashboard (e.g., shipping, content review) to improve campaign structure and execution\r\n- Join internal or brand-facing calls as needed, and contribute ideas to improve campaign performance and platform workflows\n\r\nBrand Support & Onboarding\r\n- Assist with onboarding new brands through live training calls, dashboard walkthroughs, and post-call recaps with strategy tips and templates\r\n- Conduct weekly audits of brand dashboards to monitor campaign status, flag at-risk accounts, and reach out to inactive brands to reengage them\r\n- Respond to platform and workflow questions from brands with clear guidance, linking to Help Center articles or offering a quick call when needed\n\r\nPlatform & Creator Support\r\n- Troubleshoot platform issues by reproducing errors, ruling out user mistakes, submitting detailed bug reports, and summarizing findings in weekly reports\r\n- Help manage creator-related issues by reviewing campaign activity, removing influencers when necessary, and escalating disputes to the Community team\n\r\nCustomer Support\r\n- Monitor and respond to daily support tickets, helping influencers with, tech or login issues, payment-related questions, and campaign and brand-specific inquiries\r\n- Ensure a friendly, prompt, and helpful support experience\n\r\nAmbassador Identification\r\n- Review creators, identify top performers to include in Creator Club and update list with niche, creator size (i.e. nano) and social link\r\n- Maintain records of current ambassadors by niche and size\n\n\r\nWhat We’re Looking For:\r\n- 1–3 years experience in marketing, operations, or campaign management\r\n- Strong problem-solving skills and the ability to work independently\r\n- Organized, detail-oriented, and quick to follow through on tasks\r\n- Comfortable working across tools like Slack, Asana, Google Workspace, and bug-tracking platforms (e.g., Jira)\r\n- Excellent written communication skills and strong communicator on camera\r\n- Familiarity with major social media platforms (Instagram, TikTok, YouTube, etc.)\r\n- Able to identify high-performing influencers\n\r\nAdditional Notes:\r\n- Candidates must be fluent in English (written and spoken)\r\n- Must have availability to work at least 3-4 hours overlapping with Pacific Time (PST)",
  "skill_requirements": [
    "SaaS",
    "Creative Problem Solving",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": []
}