{
  "job_id": "1408540",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Digital-Marketer-Social-media-SEO-Lead-Generation-Specialist-1408540",
  "scraped_at": "2025-07-15T00:21:16.089799",
  "title": "Digital Marketer - Social media, SEO & Lead Generation Specialist",
  "type_of_work": "Part Time",
  "salary": "$4 - $6 / hour",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Important: Kindly read through to the end for detailed application instructions.\n\r\nWho are we?\n\r\nSelfBuild3D is a leading Irish company revolutionizing the self-build and home improvement industry through innovative digital solutions. We empower individuals to design, plan, and visualize their dream homes using advanced 3D renderings, value engineering strategies, and smart building workflows.\n\r\nAt SelfBuild3D, we’ve built efficient systems to deliver high-quality, in-house construction design and planning services. Our mission is to simplify the building process while ensuring precision, efficiency, and outstanding results.\n\r\nWe are now looking for a creative and data-driven Digital Marketer to join our growing remote team. In this role, you'll be responsible for driving brand awareness, lead generation, and digital engagement across various channels. You'll work closely with our design, sales, and technical teams to craft compelling campaigns that connect with self-builders across Ireland and beyond.\n\r\nYour digital marketing expertise will play a key role in helping us reach more homeowners and grow our presence in the self-build community.\n\r\nResponsibilities:\n\r\nDevelop and execute digital marketing strategies, content creation, campaign management, and performance tracking.\r\nManage and optimize paid advertising campaigns across Facebook, Instagram, and Google.\r\nLead email marketing initiatives using best practices to nurture leads and drive engagement.\r\nManage social media accounts to build brand visibility and foster community engagement.\r\nCollaborate on or build conversion-focused landing pages for campaigns or service highlights.\r\nRegularly update and optimize the website for SEO, including keyword implementation, on-page optimization, blog content, and backlink building.\r\nBuild and maintain websites using CMS platforms like WordPress, Webflow, or similar.\r\nConduct cold outreach and follow-up with potential leads via phone calls and online directories.\r\nUse LinkedIn and other platforms for B2B lead generation.\r\nUtilize tools such as Google Analytics, Meta Ads Manager, CRM systems, and email platforms for data-driven marketing.\r\nPerform light bookkeeping tasks using Xero, including invoicing, expense tracking, and monthly reconciliation.\r\nWork independently and collaboratively in a remote, fast-paced environment.\n\r\nRequirements:\n\r\nProven experience in digital marketing strategy, content creation, and performance analysis.\r\nStrong hands-on skills in SEO, paid advertising (Facebook, Instagram, Google), email marketing, and social media management.\r\nExperience with website building and content management systems (WordPress, Webflow, etc.).\r\nAbility to create, update, and optimize landing pages for marketing campaigns.\r\nFamiliarity with SEO best practices, keyword research, blogging, and backlink strategies.\r\nProficiency with Xero or similar tools for basic bookkeeping and financial tasks.\r\nExperience with analytics and marketing platforms such as Google Analytics, Meta Ads Manager, and CRM systems.\r\nExcellent written and verbal communication skills, with attention to detail.\r\nHighly organized, self-motivated, and results-driven.\r\nPrior experience in B2B marketing and cold calling is a strong advantage.\n\r\nWhy Join SelfBuild3D?\n\r\nCompetitive Compensation – We value your expertise and pay fairly\r\nCareer Growth – As we expand, so do your opportunities\r\nRemote Work – Enjoy the flexibility of working from home\r\nOngoing Training – Weekly learning sessions to level up your skills\r\nPositive Team Culture – Collaborative, friendly, and professional environment\n\r\nJob Type: Full-time\r\nPay: $4 – $6 / hour\r\nSchedule: 8-hour shift\r\nBenefits: Work from home\n\r\nTO APPLY\r\nTo continue with your application, please complete this form: \nUpgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}