{
  "job_id": "1408318",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Technical-Support-Representative-for-Security-Camera-1408318",
  "scraped_at": "2025-07-14T23:09:17.628702",
  "title": "Technical Support Representative for Security Camera",
  "type_of_work": "Full Time",
  "salary": "$400/Mo",
  "hours_per_week": "48",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are growing!\r\nWe are expanding! Our client is a TOP Brand of security cameras and doorbells on Amazon. They design, build, and support the technology that powers these innovative products.\n\r\nYour typical day:\r\nAs a representative of the company, you will be expected to deliver high-quality customer service via phone, chat, and email. You will receive inbound calls or messages from current and prospective customers needing real-time assistance. You will provide problem resolution to customers by performing a diagnostic assessment while guiding users through step-by-step solutions. Solutions include resolving account problems, setting up cameras, and addressing motion detection and recording issues. You will offer support by clearly communicating solutions in a user-friendly and professional manner.\n\r\nWhat you need to have is:\r\n- Fluency in English, both written and verbal\r\n- Excellent communication and customer handling skills\r\n- Work experience in a customer service center is preferred\r\n- Solid computer skills (MS Office, internet usage, email, and web-based applications)\r\n- An interest in technology and a desire to learn new skills\r\n- Strong organizational, problem-solving, and analytical skills\r\n- A team player with a positive attitude\r\n- A university education\r\n- A stable internet connection, reliable power supply, and a quiet environment\n\r\nWhat do you get from us?\r\n- Competitive salary\r\n- Double pay on public holidays\r\n- 5 days of annual paid leave\r\n- Additional bonuses\r\n- Work-from-home options (available in any location in the Philippines)\r\n- Comprehensive initial training and onboarding (fully funded by us)\r\n- Professional development and career navigation programs to help you map out the steps toward your desired growth\n\n\r\nAre you looking for your next opportunity? We are a young BPO company with two years of experience, dedicated to supporting numerous e-commerce sellers. We assist growing brands in enhancing their businesses through technology and integrated solutions across over 70 countries. We take pride in being recognized with awards such as \"Employer Brand Leader of the Year\" and \"Best Employer - Outsourcing\" year after year.\n\r\n---\r\nLocation: Anywhere Work-at-Home\r\nLanguage Requirements: English\r\nTime Type: Full time",
  "skill_requirements": [
    "Technical Support",
    "Phone Support",
    "English Speaking"
  ]
}