{
  "job_id": "1408792",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Brand-Manager-Toys-and-Games-Brand-1408792",
  "scraped_at": "2025-07-15T07:44:41.601332",
  "title": "Amazon Brand Manager  (Toys and Games Brand)",
  "type_of_work": "Full Time",
  "salary": "$800 - $1200 (Contract to Hire)",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Seller Fuel dba Toy Launch is seeking a proactive and detail-oriented Brand Coordinator to join our growing team. This role is ideal for someone who thrives in a fast-paced eCommerce environment, enjoys client communication, and can coordinate across teams to keep projects running smoothly.\n\r\nIf you have experience managing Amazon brands, working with multiple clients, and are familiar with tools like ClickUp and Slack, we’d love to hear from you!\n\r\nKey Responsibilities:\r\n- Client Communication & Account Management\r\n- Serve as the primary point of contact for assigned Amazon clients.\r\n- Communicate updates, follow-ups, and recommendations to clients professionally and on time.\r\n- Join and coordinate client meetings, prepare agendas, and track action items.\n\r\nProject Coordination & Task Delegation\r\n- Oversee projects and ensure timelines, tasks, and deliverables are met across multiple client accounts.\r\n- Use ClickUp or similar tools to assign and track tasks, ensuring accountability across teaUpgrade to see actual infombers.\r\n- Coordinate with cross-functional teams (creative, copy, PPC, logistics) to complete deliverables.\n\r\neCommerce Operations Support\r\n- Understand the basics of Amazon Seller Central platform functions.\r\n- Support brand strategy implementation, listings optimization, advertising coordination, and performance tracking.\r\n- Identify potential operational or brand performance issues and help propose solutions.\n\r\nReporting & Optimization\r\n- Prepare regular brand performance updates and reports using tools like Google Sheets.\r\n- Monitor KPIs and flag concerns or opportunities for improvement.\r\n- Assist in the continuous improvement of internal processes for better client experience.\n\r\nPreferred Qualifications:\r\n- Experience working in or with a marketing/eCommerce agency.\r\n- Familiarity with Amazon Seller Central, ClickUp.\r\n- Ability to manage and coordinate 10 or more client accounts efficiently.\r\n- Strong written and verbal communication skills in English.\r\n- Proactive, organized, and detail-oriented with a solution-focused mindset.\r\n- Comfortable working in a fully remote environment and during US (PST) hours.\n\r\nTechnical Requirements:\r\n- Personal computer with at least 16GB RAM and Ryzen 5 / i5 12th Gen or above\r\n- Dual monitor setup\r\n- Stable internet connection (minimum 25 MBPS)\r\n- High-quality microphone and camera (must be on during meetings)\n\r\nWhy Join Us?\r\n- Work with a mission-driven company that supports children with learning needs through our brand LakiKid\r\n- Dynamic and supportive remote team culture\r\n- Exposure to various eCommerce brands and industries\r\n- Opportunities for career growth and leadership development\n\r\nAbout Seller Fuel:\n\r\nSeller Fuel LLC is a full-service eCommerce agency helping entrepreneurs launch and scale their brands on Amazon and Shopify. Our in-house brand, LakiKid, supports children with Autism, ADHD, and Sensory Processing Disorder and is featured in over 300 locations across the U.S.\n\r\nLearn more:\nUpgrade to see actual info\nUpgrade to see actual info\n\r\nHow to Apply:\r\nTo be considered, complete the application form linked below.\n\r\nAfter submission, you will receive an email with a link to an assessment form, which must be completed within 24 hours.\n\r\n - Application Form: Upgrade to see actual info\n\r\n(Only shortlisted candidates will be contacted for an interview.)",
  "skill_requirements": [
    "Brand Management",
    "Ecommerce",
    "Client Relationship Management"
  ],
  "is_active": true,
  "status_history": []
}