{
  "job_id": "1408713",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Join-Our-Team-as-a-Full-Time-Influencer-Relationship-Manager-1408713",
  "scraped_at": "2025-07-15T15:39:04.770921",
  "title": "Join Our Team as a Full-Time Influencer Relationship Manager",
  "type_of_work": "Full Time",
  "salary": "480USD Per Month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Description\r\nWe’re hiring a full-time Virtual Assistant to manage our influencer collaborations across HashGifted and similar creator platforms. This role blends relationship management with data entry and organization. You’ll be responsible for messaging creators, coordinating PR packs, tracking deliverables, and keeping everything up to date in our internal systems. Training will be provided and custom GPTs will support many of the processes.\n\r\nYou’ll need to be confident in outreach and follow-up while staying highly organized and detail-oriented. Your role is to bring structure to the moving parts from initial contact to final content delivery.\n\r\nWe are open to juniors with less experience assuming that you are a fast learning, proficient with english, and have a high attention to detail. \n\r\nDetailed responsibilities\n\r\nYour daily responsibilities would include:\r\n • Message creators and respond to incoming inquiries\r\n • Organize PR pack details with creators and confirm collaboration requirements\r\n • Add creators to our CRM and track each stage of their collaboration\r\n • Prepare CSV files for sample shipments via ShipBob or local Australian fulfillment\r\n • Follow up on deliverables and update status in our Notion CRM\r\n • Organize received content into the correct cloud folders\r\n • Use the CRM to manage communication, follow-ups, and content deadlines\r\n • Maintain clean and accurate tracking across Notion, AirTable, and cloud folders\r\n • Send a short end-of-day update on the creator pipeline, content received, and queue progress\n\r\nYou won’t be responsible for creating, scripting, or delegating content—our creative team handles all direction and briefing. Your role is to ensure clear communication and coordination between creators and our internal team, acting as the main point of contact to keep everything organized, aligned, and moving forward.\n\r\nSoft skills\r\n We’re looking for someone who is:\r\n • Proactive and dependable\r\n • A clear communicator\r\n • Confident with follow-up and creator interactions\r\n • Extremely organized and detail-focused\n\r\nBasic skills\r\n You should be comfortable working with:\r\n • HashGifted or similar platforms\r\n • Notion\r\n • Google Sheets, Google Drive, Gmail\r\n • Slack and other teaUpgrade to see actual infossaging apps\r\n • CSV creation and file management\r\n • Airtable etc\n\r\nWe are open to eager learners. Minimum standard is the ability to use CRM communication tools with proficient english and follow SOP workflow. \n\r\nDesired technical skills (optional but helpful)\r\n• Experience using influencer platforms like HashGifted, Collabstr, or TikTok Creator Marketplace\r\n• Familiarity with CRM tools for tracking outreach, follow-ups, and deliverables (e.g., Notion, AirTable, or similar)\r\n• Understanding of the influencer collaboration lifecycle — from gifting to content handoff\r\n• Experience with tagging, categorizing, and storing UGC in cloud-based systems\n\r\nWork schedule and holidays\r\n This is a full-time position — 40 hours per week\r\n Preferred hours are weekdays: 9 am to 5 pm AEST (7 am to 3 pm Manila time)\r\n We observe most major Filipino public holidays\r\n You’ll qualify for paid leaves after the 6-month probation period\n\r\nSalary\r\n $480 USD/month\r\nPerks and benefits\r\n • Long-term role with growth opportunities\r\n • Access to resources and training\r\n • Performance-based bonuses\r\n • Paid leave accrual after probation\n\r\nHow to apply\r\n Respond to this listing with:  “I’m your Creator Collaboration VA”\r\nPlease include:\r\n – A  cover letter on why you’re a great fit based on current skills or past experiences\r\n – A screenshot of your internet speed test\r\n – One paragraph explaining how you stay organized when managing multiple tasks\r\n - At your discretion, please share screenshots or resources demonstrating your abilities as a value add",
  "skill_requirements": [
    "Customer Support",
    "Database Management",
    "Customer Relationship Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:30:08.400928",
      "reason": "Job first discovered"
    }
  ]
}