{
  "job_id": "1408386",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Recruiting-Operations-CoordinatorSourcer-1408386",
  "scraped_at": "2025-07-15T15:29:42.032927",
  "title": "Recruiting Operations Coordinator/Sourcer",
  "type_of_work": "Full Time",
  "salary": "$1000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Join a women-founded, women-owned search firm redefining the talent experience!\n\r\nAbout Us\r\nAscension Search Partners is a women-founded and owned executive search firm with over 90 years of combined recruiting experience. We know what it takes to deliver the right talent—and we do it through true partnership. We believe successful talent acquisition goes far beyond resumes; it requires deep market insight, functional expertise, and a highly consultative approach.\n\r\nOur team brings global executive and professional search experience across industries—from startups to Fortune 10 companies. We specialize in placing mid-management to executive-level accounting and finance professionals across the Dallas/Fort Worth market, including CFOs, Controllers, VPs of Finance, and Tax Directors.\n\r\nThe Opportunity\r\nWe are looking for a detail-oriented and proactive Recruiting Operations Coordinator to collaborate with our existing Recruiting Operations Manager and support our award-winning Founding Partners and team of executive recruiters. This role is critical to keeping our operations running smoothly—freeing our recruiters to focus on candidates and clients while you ensure the behind-the-scenes excellence that powers our success. This is a newly created role due to company growth.\n\r\nKey Responsibilities\n\r\n* Source qualified candidates via LinkedIn and manage them through LI Projects\r\n* Format and edit resumes, job descriptions, and other materials in Word and PDF\r\n* Create and update branded client presentations (templates provided) in Canva and PowerPoint\r\n* Maintain our CRM: track activities, manage tasks, enter/update company and contact data, and oversee pipeline documentation\r\n* Conduct research using LinkedIn, ZoomInfo, Mergr, Swordfish, and other platforms\r\n* Create and send weekly activity reports\r\n* Draft and send candidate correspondence including interview confirmations and job descriptions (templated provided)\r\n* Manage calendar scheduling for calls, meetings, and interviews\r\n* Monitor and route inbound website leads appropriately\r\n* Modify and update client agreements, ensuring accuracy of terms\r\n* Schedule and book internal and client meetings\r\n* Document internal processes and SOPs\r\n* Support social media operations: schedule, and post content on LinkedIn, Twitter, Facebook, and Instagram\r\n* Create marketing collateral (e.g., placement announcements, anniversary posts, hot jobs) using Canva\r\n* Generate and send invoices to clients; track and follow up on outstanding payments\r\n* Monitor general inbox and assign leads to appropriate teaUpgrade to see actual infombers\r\n* Assist with ad hoc projects and reporting as needed\n\r\nQualifications\n\r\n* 3+ years of experience in a recruiting support, HR coordination, or administrative role\r\n* Sharp attention to detail and exceptional organizational skills\r\n* Ability to manage multiple tasks and priorities with follow-through\r\n* Strong written and verbal communication skills\r\n* Proactive problem-solving and a high degree of ownership\r\n* Availability during standard Central Time business hours (9am–6pm CT)",
  "skill_requirements": [
    "US recruiting",
    "Applicant Tracking Systems",
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:42:32.055084",
      "reason": "Job first discovered"
    }
  ]
}