{
  "job_id": "1409796",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1409796",
  "scraped_at": "2025-07-14T23:10:08.137276",
  "title": "Remote Sales Associate",
  "type_of_work": "Full Time",
  "salary": "$8/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "GROUND FLOOR OPPORTUNITY - WHY THIS ROLE IS AWESOME!\n\r\nWe onboarded our first remote TeaUpgrade to see actual infomber in September 2020. Since then, we’ve been continuously expanding our Remote Team, and this time by adding a fantastic Remote Sales Associate from the Philippines. This is a rare opportunity to join a dynamic, growth-oriented company where you'll be part of an amazing team, receive full training, and built a long-term career in appliance retail sales. You won’t just answer customer questions; you’ll learn our products, connect with our customers, and help guide them to make confident purchasing decisions, while also playing a support role for our In-Store Team, assisting with logistics coordination and customer service tasks as needed.\n\r\nIf you’re someone who loves interacting with customers, staying organized, and being part of a team that takes pride in accuracy and process, you’ll thrive in this role.\n\n\r\n-\n\n\r\nGENERAL JOB DESCRIPTION\n\r\nYou’ll be on the front lines of customer interaction via phone, live chat, and email, answering questions, sharing product recommendations, and following up with leads to close sales. You’ll also work closely with our Point-of-Sale (POS) system to create invoices, check stock, and ensure order accuracy. You’ll regularly communicate with the In-Store Sales Team and Delivery Team to support end-to-end sales fulfillment and internal coordination. This role requires a mix of excellent people skills, product curiosity, and technical attention to detail.\n\r\nTo thrive in this position, you need to be friendly and persuasive, detail-oriented, and eager to grow your sales skills in a supportive and tech-forward environment. Well teach you the appliance knowledge you need, then you bring the energy, commitment, and enthusiasm! We place a strong emphasis on quality, so if you're someone who takes pride in double-checking your work and following thoughtful processes, you’ll feel right at home.\n\n\r\n-\n\n\r\nKEY RESPONSIBILITIES\n\r\n* Learn our appliance products, services, and customers (training will be provided)\r\n* Handle incoming sales calls and chats via Zendesk and Package.AI\r\n* Actively listen too customer needs and make thoughtful product recommendations\r\n* Answer product questions, pricing inquiries, availability requests, schedule deliveries, and respond to customer quiries\r\n* Prepare sales quotes and enter data accurately into our POS system\r\n* Follow up with leads and support customers through their buying journey (like offering extended warranties and sending personalized emails and follow-ups after purchases)\r\n* Maintain strong attention to detail when working with customer orders and product data\r\n* Maintain organized records of follow-ups, appointments, and customer communications\r\n* Provide top-notch customer service and uphold our company’s values in every interaction\r\n* Communicate effectively with our In-Store and Remote Teams\r\n* Learn and use internal systems such as Zendesk, Slab, and Google Workspace\r\n* Actively take product trainings from manufacturers’ websites\r\n* Support internal procedures by consistently applying our documentation and workflow standards\r\n* Assist with administrative tasks during downtime\n\n\r\n-\n\n\r\nWHAT WE’RE LOOKING FOR\n\r\n* Excellent written and verbal English skills with a near-native American accent\r\n* Friendly, clear, and persuasive communication style\r\n* At least 2 years of Sales experience required (preferably in a retail or product-based business)\r\n* Customer-first mindset with a desire to build relationships\r\n* Trustworthy, empathetic, an enthusiastic about helping others\r\n* Strong attention to detail and commitment to double-checking your work (we call this “QC”)\r\n* Detail-oriented with a strong commitment to process accuracy, documentation, and follow-through\r\n* Highly organized\r\n* Strong time-management skills\r\n* Comfortable switching between high-touch customer interactions and tasks during slower hours\r\n* Tech-savvy and quick to learn new tools and software platforms\r\n* Interested in the appliance industry and excited to learn more\r\n* Self-motivated\r\n* Willing to commit to a long-term, full-time position\n\n\r\n-\n\n\r\nSYSTEM/INTERNET REQUIREMENTS & WORKSPACE\n\r\n* At least 8GB RAM\r\n* Minimum 25 Mbps download and 10 Mbps upload internet speed\r\n* Quiet, dedicated home office space, equipped for frequent phone and chat communications with customers throughout the workday\n\n\r\n-\n\n\r\nWORK HOURS & PAY\n\r\n* Full-time role: 40-45 hours/week\r\n* Schedule (Eastern Time) to be determined. Basically, shift will be 4 weekdays and a Saturday, Eastern Time hours. Schedule may include shifts between 8:30 AM to 8:00 PM Eastern Time.\r\n* Competitive rate. The starting rate is $8.00 USD per hour. Once fully trained and successfully onboarded, you'll be eligible to earn commissions for sales and bring your potential earnings up to $9.60 USD per hour.\r\n* Paid in Philippine pesos\r\n* Hired through our Employee-of-Record (EOR) partner, Multiplier Technologies, which enables full compliance with Philippine labor laws\r\n* Benefits include 13th month pay, holiday pay, paid leaves, government contributions, and 50% HMO subsidy if opted in\n\n\r\n-\n\n\r\nABOUT OUR COMPANY\n\r\nOur company (website: Upgrade to see actual info ) is a well-established, fast-growing appliance retailer based in the United States. We sell, service, and deliver major home appliances like washers, dryers, refrigerators, ovens, and more in Massachusetts and Rhode Island. While we have over 70 years of experience, we operate like a startup- innovative, people-centered, and always improving. Our team is filled with awesome people who care deeply about doing great work, serving our customers well, and supporting one another.\n\r\nOur company is built on a foundation of precision, process, and quality systems. Our Philippine Remote Team, which assists with Sales, Delivery, Accounting, Operations, and Project Management, follows robust systems designed to help you succeed. If you commit to our quality standards and consistently apply self-checking habits to your work, you’ll thrive here.\r\nGreat sales performance goes hand-in-hand with accurate follow-through and clear documentation. If you bring both persuasive energy and a love of detail-oriented work, you’ll be a strong fit for our Team.\n\n\r\n-\n\n\r\nHOW TO APPLY\n\r\nTo move forward with your application, please follow all steps below carefully. Only COMPLETE applications will be considered.\n\r\n1. Prepare an email to Upgrade to see actual info your email with this sentence: \"Hello! I'm interested in working with you. I see that your store is located at [Please research and insert the full street address of Bellingham Electric here].\"\r\n2. In the email, answer this question: What makes you interested in long-term remote work with us?\r\n3. In the email, also attach your resume, a screenshot of your internet speed, and a voice clip where you confidently recommend a product (any kind, not necessarily appliances).\r\n4. Point out exactly 3 grammatical or typographical errors in this job post and correct them. Send the email.\r\n5. Complete this test: Upgrade to see actual info. This is a detailed test, so we recommend setting aside enough time to complete it without rushing.\n\r\n-\n\r\nBest of luck, and we can't wait to meet the next amazing person to join our growing team!",
  "skill_requirements": [
    "Sales Support",
    "Attention to Detail",
    "Communication"
  ]
}