{
  "job_id": "1409717",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-PPC-Ads-Specialist-1409717",
  "scraped_at": "2025-07-15T12:28:42.892273",
  "title": "Senior PPC  Ads Specialist",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Click here to apply: Upgrade to see actual info/careers/#career-form-wrap\n\r\nAbout us: Upgrade to see actual info\r\nEMRG is an award-winning Digital Marketing Agency based in Los Angeles. With a team of experienced professionals for each service line, we offer a wide range of digital marketing solutions that are customized to meet the unique needs of each client. We are renowned for our outstanding customer service and ability to deliver exceptional results. As a leading agency in the industry, we have established ourselves as a reliable partner for businesses looking to grow and expand their online presence.\r\nAs our company continues to grow, we are also committed to expanding our philanthropic goals and supporting children in need worldwide.\n\r\nJob Description: Senior PPC Ads Specialist\n\r\nPosition Overview:\r\nAs a Senior PPC Ads Specialist, your primary responsibility will be to optimize and manage advertising campaigns on various social media platforms. Your expertise in digital advertising, campaign management, and data analysis will contribute to the success of our marketing initiatives. Working closely with cross-functional teams, you will drive performance and achieve business goals through effective campaign execution and optimization.\n\r\nKey Responsibilities:\r\nCampaign Management:\r\nPlan, execute, and monitor advertising campaigns on social media platforms, leveraging your expertise in campaign management.\r\nDevelop strategies to maximize campaign performance, including ad targeting, budget allocation, bidding, and creative optimization.\r\nContinuously monitor campaign metrics and key performance indicators (KPIs) to identify areas for improvement and implement optimization tactics.\r\nCollaborate with internal stakeholders, such as marketing and creative teams, to align advertising strategies with overall marketing objectives.\r\nCoordinate with external stakeholders, such as media agencies or vendors, to ensure seamless campaign execution.\r\nPerformance Analysis:\r\nUtilize platform-specific tools and reporting features to analyze campaign performance data on social media platforms.\r\nGenerate regular reports and dashboards to communicate campaign performance, trends, and recommendations to stakeholders.\r\nIdentify opportunities for growth and optimization based on data-driven insights.\r\nCollaborate with the analytics team to conduct deeper analyses and leverage insights for campaign enhancement.\r\nPlatform Expertise:\r\nStay up-to-date with the latest features, trends, and best practices related to advertising on various social media platforms.\r\nLeverage your expertise to maximize the capabilities of different social media platforms for campaign success.\r\nUnderstand and implement platform-specific ad formats, targeting options, and campaign optimization techniques.\r\nShare industry insights and recommendations with the team to drive continuous improvement in advertising strategies.\r\nCollaboration and Communication:\r\nWork closely with internal teams to ensure proper coordination of assets, messaging, and tracking requirements for campaigns.\r\nCommunicate campaign updates, performance, and recommendations to relevant stakeholders in a clear and concise manner.\r\nParticipate in meetings and brainstorming sessions to contribute innovative ideas and strategies for campaign optimization.\n\r\nQualifications:\r\nBachelor's degree in marketing, advertising, business, or a related field (or equivalent experience).\r\nProven experience in managing and optimizing advertising campaigns on social media platforms.\r\nStrong analytical skills with the ability to derive actionable insights from campaign performance data.\r\nFamiliarity with campaign management tools and platforms specific to social media advertising.\r\nExcellent communication and presentation skills, with the ability to convey complex data insights to non-technical stakeholders.\r\nStrong attention to detail and the ability to manage multiple projects simultaneously.\r\nUp-to-date knowledge of social media advertising trends, industry best practices, and platform updates.\r\nExperience with Google Ads or other digital advertising platforms is an advantage.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:30:15.957617",
      "reason": "Job first discovered"
    }
  ]
}