{
  "job_id": "1409174",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Listing-Optimization-Expert-SEO-Google-Ads-for-Etsy-Store-1409174",
  "scraped_at": "2025-07-15T12:23:59.666692",
  "title": "Listing Optimization Expert (SEO + Google Ads) for Etsy Store",
  "type_of_work": "Full Time",
  "salary": "300",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Schedule: Monday to Friday, 8 PM to 4 AM EST\r\n(This will be flexible after you pass our OA Training)\n\r\n**Please read the entire job post**\n\r\nThis role is focused on growing our Etsy embroidery shop through Google Ads, Pinterest Ads, and high-converting SEO listings — but during the early phase, you'll be trained in Amazon product research (Online Arbitrage) and spend most of your time there until Etsy operations scale.\n\r\nOnline Arbitrage (OA) is the process of finding profitable products on retail websites that can be resold on Amazon or Walmart. You’ll be trained to source and evaluate leads using tools like Keepa and SellerAmp, while gradually transitioning into your primary role managing Etsy growth and external ad campaigns. Type in the subject line \"Etsy.\" Failure to do so results in your application not being opened. \n\r\nYour future role will focus on:\n\r\n* Running Google Ads to drive external traffic to Etsy listings\r\n* Creating and managing Pinterest Ads for visual product promotion\r\n* Optimizing Etsy listings for internal search and Offsite Ad performance\r\n* Conducting keyword research using Everbee, Alura, and Google Keyword Planner\r\n* Writing SEO-optimized titles, tags, and descriptions\r\n* Analyzing ad performance and making data-driven adjustments\n\r\nRequirements:\n\r\n* Fluent in English (written and spoken)\r\n* Proven experience \r\n* Deep understanding of Etsy SEO and listing structure\r\n* Analytical and creative thinker with strong attention to detail\r\n* Time Doctor must be installed and active during your shift\r\n* You must not currently work for another Amazon, Walmart, or Etsy seller\n\r\nTo Apply, Send:\n\r\n* Resume in PDF format\r\n* Screenshot of your Cloudflare Speed Test\r\n* Share Google/Pinterest ad examples, Etsy or any other platform listings you’ve optimized, or SEO copy you’ve written\n\r\nYou’ll be contacted with an interview link if your application passes our initial screening.",
  "skill_requirements": [
    "Google Ads",
    "Keyword Research",
    "Etsy"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:30:48.744380",
      "reason": "Job first discovered"
    }
  ]
}