{
  "job_id": "1409870",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Accounting-Coordinator-1409870",
  "scraped_at": "2025-07-14T23:08:22.863474",
  "title": "Accounting Coordinator",
  "type_of_work": "Full Time",
  "salary": "USD 800 ($5/hour)",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Local Foreigner is a boutique consultancy offering expertly curated travel experiences, from the simplest getaways to the most extravagant adventures. Whether guiding clients on a weekend in Paris or an expedition to Patagonia, we are committed to providing the most personalized service through thoughtful attention and seamless planning. Our approach blends a sophisticated global perspective with warm, personalized service—qualities we value in every member of our team. \n\r\nWe are currently seeking a detail-oriented and resourceful Accounting Coordinator to join our team. This role is integral to ensuring the financial accuracy and smooth operation of our business. The ideal candidate will possess strong analytical skills, be proactive in solving problems, and excel in managing multiple tasks within deadlines. \n\r\nThis is a unique opportunity to join a small, tight-knit team in a supportive, but challenging work environment. \n\r\nCOMPENSATION: \n\r\nTraining period (4-6 months): $5/hour + a monthly internet allowance. \n\r\nPost-training: $6/hour + a monthly internet allowance. \n\r\nWORK SCHEDULE: \n\r\nThis is a full-time position (40 hours per week) with work hours overlapping European and U.S. business operations. A typical schedule is 7 PM to 3 AM Philippine local time. \n\r\nRESPONSIBILITIES: \n\r\nPost payments that are made by checks, ACH, and credit cards.  \n\r\nReconcile credit card transactions, bank statements, and merchant credit card settlements in QuickBooks. \n\r\nCollect outstanding commission payments by contacting hotels, tour operators, and concierge services through phone calls and emails. \n\r\nPrepare accurate reports on accounts receivable and collection activities. \n\r\nUpdate payment details, tax information and key finance contacts in the CRM. \n\r\nInvestigate and resolve accounting discrepancies promptly. \n\r\nDocument tasks and processes clearly to ensure transparency and consistency. \n\r\nREQUIREMENTS: \n\r\nHands-on accounting experience, including reconciling accounts, managing financial records, and processing transactions \n\r\nProficiency in QuickBooks Online and Microsoft Excel.\n\r\nExperience with Salesforce is a plus. \n\r\nKnowledge of exchange rates and foreign transactions is highly desirable. \n\r\nStrong organizational skills with keen attention to detail. \n\r\nAbility to manage multiple tasks and meet deadlines. \n\r\nExcellent written and verbal communication skills in English. \n\r\nAnalytical mindset with a problem-solving approach. \n\r\nTeam player who can also work independently.",
  "skill_requirements": [
    "Accounts Receivable",
    "Quickbooks",
    "Collection"
  ]
}