{
  "job_id": "1409958",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Operations-Coordinator-1409958",
  "scraped_at": "2025-07-15T14:31:17.925117",
  "title": "Operations Coordinator",
  "type_of_work": "Full Time",
  "salary": "$6/hr negotiable",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role\r\nWe are seeking a detail-oriented and proactive FULL TIME Operations Coordinator to support the day-to-day operations of our busy dental laboratory 7:30 am - 5 pm PST . This role is essential in ensuring smooth workflow across departments, accurate case tracking, timely communication with clients, and efficient management of inventory and logistics.\n\r\nKey Responsibilities\r\nCase Management & Tracking\r\nOversee the movement of cases across all lab departments (e.g., setup, QC, finishing).\r\nMaintain accurate records of case statuses in our case management systems (e.g., RXn3D, Notion).\r\nVerify scans, files, and approvals before production.\r\nCoordinate with drivers for pickups and deliveries, including confirming cut-off times.\n\r\nClient Communication\r\nServe as the point of contact for offices and doctors regarding case updates, billing questions, appointment making and confirmation, travel arrangement, and delivery schedule adjustments.\r\nCommunicate professionally by phone, email, and WhatsApp.\r\nProvide bilingual support with the help of AI (English and Spanish) when needed. Candidate does not have to speak Spanish.\n\r\nBilling & Payment Coordination\r\nFollow up on statements, past-due balances, and payment confirmations.\r\nDocument billing adjustments and maintain organized records.\n\r\nInventory Management\r\nTrack lab supplies, orders, and usage.\r\nCoordinate with suppliers for replenishment and resolve delivery issues.\r\nMaintain accurate records of incoming and outgoing inventory.\n\n\r\nAdministrative Support\r\nPrepare reports and summaries for management.\r\nAssist with onboarding new offices and technicians.\r\nDocument process changes and ensure compliance with lab procedures.\n\r\nSkills & Qualifications\r\nExperience in a dental lab, dental office, or similar operations/administrative role \r\nStrong organizational and multitasking skills\r\nExcellent communication skills, both written and verbal\r\nComfort with technology (case management systems, email, spreadsheets)\r\nFluent in English and Spanish (preferred but not required)\r\nProfessional, proactive, and solutions-oriented mindset\n\r\nHow to Apply\r\nIf you’re interested, please send:\r\nYour CV (resume)\r\nSend a link to loom video introducing yourself\r\nto this email\r\nh r . i n n Upgrade to see actual info ma i l. c om",
  "skill_requirements": [
    "Coordination",
    "Operation Management",
    "Multitasking"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:28:56.770749",
      "reason": "Job first discovered"
    }
  ]
}