{
  "job_id": "1409126",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Customer-Service-Rockstar-Needed-Not-Your-Average-VA-Job-1409126",
  "scraped_at": "2025-07-15T12:31:17.981157",
  "title": "Full-Time Customer Service Rockstar Needed (Not Your Average VA Job!)",
  "type_of_work": "Full Time",
  "salary": "$500-1000/mo",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're running multiple 7-figure e-commerce brands and need someone who actually wants to build something, not just answer emails for a paycheck.\n\r\nWhat you'll do:\r\n- Handle customer support that actually retains people (not copy-paste responses)\r\n- Keep our daily P&L tracking accurate (business decisions depend on this)\r\n- Deal with suppliers when they mess up orders\r\n- Handle Klarna/Stripe disputes (templates provided, but you need to think)\r\n- Spot problems before I have to\n\r\nYou're built for this if:\r\n- You've worked with real Shopify brands (not Amazon VA fluff)\r\n- You can write replies that don't sound like bots\r\n- You give a shit about results, not just checking boxes\r\n- You want to grow into Ops Lead, leading a team, not stay stuck doing the same tasks forever\n\r\nYou're not a fit if:\r\n- You need daily hand-holding\r\n- You've never touched Shopify operations\r\n- You want boring and predictable work\n\r\nThe deal:\r\n- Base pay weekly + performance bonuses based on keeping customers happy. \r\n- Work directly with me, real feedback, room to grow in the company as we scale.\n\r\nApply:\r\n1. Quick fresh Loom video (60 sec) about your e-com experience\r\n2. Answer: How would you handle \"My order is late and no one is answering me!! This is ridiculous!\"\r\n3. Pick a core value that hits different and explain why you chose it: RESULTS OBSESSED | ATTENTION TO DETAIL | RELENTLESS OWNERSHIP | PREPARED TO WIN\n\r\nYou can only get shortlisted if you answer everything above.\n\r\nLet's build something together.",
  "skill_requirements": [
    "Shopify",
    "Customer Support",
    "Order processing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:19:16.727424",
      "reason": "Job first discovered"
    }
  ]
}