{
  "job_id": "1410554",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Junior-Bookkeeper-Needed-FULLY-REMOTE-FULL-TIME-1410554",
  "scraped_at": "2025-07-15T15:40:18.743764",
  "title": "Junior Bookkeeper Needed FULLY REMOTE - FULL TIME",
  "type_of_work": "Full Time",
  "salary": "Php55,000/month",
  "hours_per_week": "39",
  "date_updated": "Jul 15, 2025",
  "job_overview": "**This is a full-time role. Candidates must be able to commit exclusively to this position once hired.**\n\r\nWe’re super excited to announce that LedgerWay, a licensed USA CPA firm, is growing again - and we’re on the lookout for our next amazing Junior Bookkeeper!\n\r\nWhat’s in it for you…\r\nYou’ll be joining a team of high-performing, kind, and driven professionals who genuinely love what they do. LedgerWay isn’t your typical accounting firm - we’re people-first, growth-focused, and all about helping our team thrive.\n\r\nHere’s what’s waiting for you:\r\n- A dynamic, friendly, and fun remote team\r\n- Supportive leadership who actually listens\r\n- The chance to do meaningful work with US-based clients\r\n- Long-term stability (our Accounting Manager has been with us since 2013!)\r\n- Empowerment to make decisions and take ownership\r\n- Mentorship and company-paid courses to level up your skills\r\n- Career path opportunities (Accounting Supervisor? FP&A? CFO? All possible!)\r\n- A workplace that respects your time, your energy, and your life\n\r\nIf you’ve been searching for more than just a job, this is your sign!\n\r\nWhat a career here looks like…\r\nAt LedgerWay, we toss out the usual corporate hierarchy mindset. You won’t be stuck in a sea of red tape or micromanagement. Instead, you’ll find a workplace that values open communication, professional maturity, and your unique contribution.\n\r\nThis isn’t just about numbers - it’s about making a difference in the lives of small, medium, and large business owners. Every transaction you reconcile and every invoice you manage adds real value. You’re not just balancing books; you’re helping real people succeed.\n\r\nWe’ve got your back. You’ll receive training, ongoing support, and opportunities to evolve. You’ll never feel like just another employee here - you’ll be seen, heard, and celebrated.\n\r\nWhat’s needed from you…\r\nTo help us continue delivering top-tier service to our US-based clients, we need your bookkeeping expertise and proactive energy. You’ll be part of a supportive team but also expected to own your role like the professional you are.\n\r\nOh, and one more thing:\r\nTo apply, please write “Sunshine fuels my focus” at the top of your cover letter.\n\r\nWhat you’ll be in charge of…\r\n- Daily bookkeeping for multiple U.S. clients\r\n- Data entry and transaction recording\r\n- Bank and credit card reconciliations\r\n- Accounts Payable and Receivable support\r\n- Month-end close processes\r\n- Loan tracking\r\n- Assisting with onboarding new clients\r\n- Advising on past-due invoice collections\r\n- Working exclusively with QuickBooks Online\r\n- Collaborating with other awesome teaUpgrade to see actual infombers\r\n- Helping us keep things organized, accurate, and calm under pressure\n\n\r\nIf you’re detail-oriented, reliable, and love the idea of handling multiple clients in different industries, this might be your dream job.\n\r\nHow will your life be different at LedgerWay…\r\nPicture this: a remote-first environment that respects your time, prioritizes your growth, and surrounds you with a genuinely kind team. You’ll work independently but never alone.\n\r\nWe don’t do micromanagement - we hire professionals and trust them to deliver. You’ll communicate like a pro, hit your deadlines, and manage your work with confidence. And yes, we only hire team players who bring positive energy to the group. (We strictly follow a “no jerks” policy.)\n\r\nThis is where smart, ethical, reliable people thrive.\n\r\nAbout you…\r\nIf you’re friendly, curious, detail-loving, and a bit of a tech nerd - we want to meet you.\r\n- You’ve got at least 2 years of experience at a US-based CPA firm\r\n- You’re fluent in English - written and spoken\r\n- You’re solid in QuickBooks Online (or ready to get certified fast)\r\n- You’re confident with tools like MS Outlook, Excel, Word\r\n- Bonus points if you’ve worked with Upgrade to see actual info, Gusto, Stripe, Shopify, Amazon FBA, or A2X\r\n- You’re naturally professional and dependable - you take ownership of your work\r\n- You’re comfortable working with confidential information in a private setup\r\n- You have a backup power solution and a stable 100/10 Mbps internet connection\r\n- You love learning and want to grow into more advanced roles down the line\n\r\nIf that’s you, we’d love to chat!\n\r\nPay and benefits…\r\nStarting at Php 55,000/month (Tell us if you bring more value!)\r\nAnnual reviews + performance-based raises\r\n15 days PTO accrued annually\r\n9 paid U.S. holidays\r\nCompany-provided laptop, headset, and HD camera\n\n\r\nWork hours…\r\nFull time (40 hours/week)\r\nInitial 6 months: 9AM–4PM CST to sync with the team\r\nAfter training: flexible schedule options with management approval\n\r\nHow to apply…\r\nSend a short and genuine cover letter to Upgrade to see actual info you're eager to make a meaningful impact and grow your career with a team that truly cares - LedgerWay is waiting.\n\r\nLet’s build something amazing together!\n\n\r\nLauren M.\r\nLedgerWay",
  "skill_requirements": [
    "Quickbooks",
    "Bookkeeping",
    "Organization"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:47:57.603831",
      "reason": "Job first discovered"
    }
  ]
}