{
  "job_id": "1410230",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Carrier-Sales-Specialist-Dry-Refrigerated-Freight-1410230",
  "scraped_at": "2025-07-15T07:38:14.244751",
  "title": "Carrier Sales Specialist – Dry & Refrigerated Freight",
  "type_of_work": "Any",
  "salary": "$8 - $10 per hour",
  "hours_per_week": "50",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About GH Logistics:\r\nGH Logistics is a high-performance freight brokerage and asset-based logistics firm focused on dry and refrigerated full-truckload freight. As our national freight network expands, we are seeking a results-driven FMT to specialize in carrier onboarding, relationship management, and future-lane development. This role is ideal for someone who thrives in brokerage execution, knows how to build carrier loyalty, and wants to scale repeatable freight with accountability and urgency.\n\r\nPosition Summary:\r\nYou will act as a tactical Freight Management Technician (FMT) embedded in our brokerage operations, focused on booking current loads while also onboarding and activating new carriers into our system. This role is fast-paced and performance-driven. You’ll be evaluated on your ability to secure capacity, communicate effectively with dispatchers/owner-operators, and expand GH’s contracted carrier base through consistent execution.\n\r\nCore Responsibilities:\r\n- Source and book dry van and reefer freight with high-compliance carriers across key U.S. lanes\r\n- Build new carrier relationships and guide them through onboarding protocols\r\n- Maintain daily touchpoints with carriers to ensure repeatability and coverage stability\r\n- Ensure all active and new carriers meet insurance, tracking, and communication compliance standards\r\n- Update carrier records and profiles in our internal systems (LoadStop, TMS, etc.)\r\n- Execute high-volume call/email/text outreach to align capacity with active and forecasted freight\r\n- Collaborate with brokerage QA and sales teams to flag underperforming carriers and identify scalable performers\r\n- Push forward recovery efforts, backup truck options, and same-day coverage solutions when needed\r\n- Track bonus eligibility based on successful onboarding and weekly load activity of newly added carriers\n\r\nIdeal Candidate:\r\n- 1–3 years experience in freight brokerage, dispatch, or carrier sales\r\n- Clear understanding of dry van and refrigerated truckload operations\r\n- Strong interpersonal communication and sales-style approach to carrier development\r\n- Ability to enforce compliance without losing relational tone\r\n- Highly organized, fast-moving, and tech-literate\r\n- Self-managed and eager to contribute to aggressive brokerage growth goals\r\n- Bilingual (Spanish/English) a plus, but not required\r\n- Minimum of 50 words per minute\n\r\nWe are looking for flexible full time candidates who can work on: Wednesday - Sunday 7 AM - 5 PM San Antonio Texas Time\n\r\nNOTE: Before applying, ensure you are comfortable with the following:\r\n- Can work on any US hours (CDT).\r\n- Comfortable being in a rotational shift depending on business needs\r\n- Using Hubstaff throughout shift\r\n- Being in the zoom throughout shift (start to end)\n\r\nApply here: Upgrade to see actual info\r\nPerformance Expectations:\n\r\nBy Week 2:\r\n • Fully onboarded in TMS tools, booking protocols, and load coverage procedures\r\n • Comfortable with daily outreach to both current and prospective carriers\n\r\nBy Week 4:\r\n • Actively adding 2–4 net new carriers/week\r\n • Booking 5–10 loads/week through your book of carriers\r\n • Able to identify and resolve gaps in tracking, communication, and compliance\n\r\nBy Week 8:\r\n • You are tracking bonuses based on newly onboarded carriers generating weekly freight\r\n • You’ve helped grow the active brokerage carrier base by 10+ qualified units\r\n • You’re taking initiative in market coverage and identifying key lanes we should dominate\n\r\nCompensation:\r\n- Starting salary of $8 - $10 (Base pay commensurate with experience)\r\n-  Aggressive performance bonus structure based on active carriers added and booked\r\n- Opportunity for vertical growth into carrier sales or account management\n\r\nIf you’re looking to build a true brokerage career, not just sling spot loads, and want to grow within a disciplined, scaling operation, apply now.\n\r\nGH Logistics is where carrier relationships become infrastructure. \n\r\nDue to the high volume of applications we receive, we are only able to contact candidates who meet the qualifications for the position.",
  "skill_requirements": [
    "Sales",
    "Client Relationship Management",
    "Freight Forwarding"
  ],
  "is_active": true,
  "status_history": []
}