{
  "job_id": "1410042",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Resident-Coordinator-FULLY-REMOTE-FULL-TIME-1410042",
  "scraped_at": "2025-07-15T14:28:40.778914",
  "title": "Remote Resident Coordinator  FULLY REMOTE – FULL TIME",
  "type_of_work": "Full Time",
  "salary": "$1200/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "This is a full-time independent contractor role. Applicants must be able to commit exclusively to this position and discontinue any part-time or freelance work upon hire.\n\r\nWe’re excited to share a fantastic opportunity to join Progressive Urban Property Management (PUPM) as our next Remote Resident Coordinator!\n\r\nWhat’s in it for you…\r\nYou’ll be part of a tight-knit, mission-driven team that’s helping manage residential rental properties across Cleveland, Ohio. \r\nWe’re a full-service property management company with a growing team of 24 awesome humans, and we’re looking for someone who’s ready to step up, solve problems, and help our tenants feel heard and supported.\n\r\nHere’s what you’ll love..\r\n- 100% remote work\r\n- Weekly pay via PayPal\r\n- Paid U.S. and Philippine holidays\r\n- Vacation time\r\n- Tons of growth potential in both responsibilities and pay\r\n- A calm, organized, people-focused workplace\r\n- Clear training and support from your manager\n\r\nWhat a career here looks like…\r\nWorking with PUPUpgrade to see actual infoans more than answering calls and sending emails. You’re a critical part of how we keep properties running smoothly and tenants feeling cared for. You’ll handle real situations with real people - and be the one who makes a difference.\n\r\nYou’ll work closely with our Resident Manager, and collaborate with other departments to handle both tenant and owner concerns. You’ll help ensure everyone has the information, support, and guidance they need - on time and with professionalism.\n\r\nHere at PUPM, we value people who take initiative, solve problems, and bring calm to the chaos. We don’t believe in hand-holding or micromanagement - we believe in hiring grown-ups and trusting them to shine.\n\r\nTo apply, please include the phrase “I bring solutions, not drama” at the top of your cover letter.\n\r\nWhat you’ll be in charge of…\r\n- Resolving tenant issues (non-maintenance) via phone, email, and messages\r\n- Tracking rent payments and flagging delinquencies\r\n- Reaching out to collect rent from late-paying tenants\r\n- Handling lease renewals\r\n- Onboarding new and inherited tenants\r\n- Setting up tenants and leases in Buildium\r\n- Educating tenants on how to use the portal and submit maintenance requests\r\n- Communicating with voucher programs\r\n- Updating property owners on key issues like rent collection and evictions\r\n- Resolving basic owner questions\r\n- Assisting with Rental Registration processes\r\n- Collaborating with other departments to solve concerns\r\n- Managing department inboxes and routing emails as needed\r\n- Supporting the manager with task organization and solution planning\r\n- Auditing reports and trackers\r\n- Assisting with internal reporting\r\n- Creating and updating communication templates\r\n- Handling file and document management\n\r\nAbout you…\r\nIf you’re someone who thrives in a busy, fast-paced environment and finds satisfaction in helping people solve real problems, we’d love to meet you.\n\r\nYou’re a natural communicator, calm under pressure, and able to work through tense situations with professionalism. You’re tech-savvy, detail-oriented, and deeply organized.\n\r\nHere’s what we’re looking for:\r\n- Fluent English speaker (you’ll be talking to tenants often!)\r\n- Strong people skills (you’ll be de-escalating tenant concerns)\r\n- Solid problem solver and clear communicator\r\n- Proficient in Microsoft Word and Excel\r\n- Able to stay focused and juggle multiple priorities\r\n- Experience in property management is a big plus\r\n- Bachelor’s degree required\r\n- Own laptop required\r\n- Must be available to work from 9AM - 4PM EST (New York time)\n\r\nPay and Benefits…\r\n- Starting pay: $6.5usd/hour, paid weekly via PayPal\r\n- Paid U.S. and Philippine holidays\r\n- Vacation time included\r\n- Performance-based growth opportunities\n\r\nHow will your life be different at PUPM…\r\nYou’ll never be just a cog in the wheel. Here, your voice matters. Your problem-solving skills matter. And your growth matters.\n\r\nYou’ll work directly with your manager, receive clear expectations, and be empowered to make decisions. If you’ve ever felt underappreciated or overlooked, you’ll find PUPM refreshingly different.\n\r\nWe don’t do drama. We don’t do chaos. We do solutions, teamwork, and progress. Every day.\n\r\nHow to apply…\r\nSend a short, friendly cover letter to Upgrade to see actual info",
  "skill_requirements": [
    "Customer Service",
    "Attention to Detail",
    "Conflict resolution"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:48:23.086900",
      "reason": "Job first discovered"
    }
  ]
}