{
  "job_id": "1410606",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Real-Estate-Acquisitions-VA-1410606",
  "scraped_at": "2025-07-15T15:28:19.412544",
  "title": "Real Estate Acquisitions VA",
  "type_of_work": "Full Time",
  "salary": "Up to $10.00/hr + Bonuses",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Real Estate Acquisitions VA – Up to $10/hr plus Bonuses – Experienced Real Estate Closers Only\n\r\nIf you’re a real estate closer with a proven track record, tired of dead-end VA jobs and looking for a true career role with high earning potential, this is for you.\n\r\nDescription:\r\nWe are a U.S. based real estate investment company hiring a Acquisitions Virtual Assistant with proven experience making offers to home owners, negotiating, closing real estate deals, and guiding them through the contract signing process.\n\r\nThis is a high-level remote role. You must understand real estate terminology, be confident on the phone, great work ethic, coachable, and know how to follow a sales script while sounding natural. Only apply if you’ve personally made offers to homeowners to buy their properties, negotiated, and closed real estate contracts over the phone.\n\r\nCompensation:\r\nBase Pay: $10/hour USD\n\r\nBonuse Structure:\r\n- Up to $2,000/month in tiered contract bonuses (3 signed = $750, 4 = $1,250, 5+ = $2,000)\r\n- Quarterly consistency bonuses up to $2,000 for top performers (hit your tier 3 months in a row)\r\n- High performers regularly earn $3,000+ per month with base and bonuses.\r\n- All contracts must be company owner-approved and realistic.\n\r\nSchedule: \r\nFull-time, Monday to Friday, 9 AM to 6 PM CST\r\nPay Dates: 1st and 15th of each month\n\r\nWhat You’ll Be Doing:\r\n- Call homeowners (seller leads)  and build authentic rapport\r\n- Follow a proven script while sounding natural and confident\r\n- Ask strong follow-up questions to uncover motivation and condition\r\n- Make verbal offers and negotiate price and terms\r\n- Walk sellers through the purchase agreement and get it signed over the phone via docusign\r\n- Handle objections and push deals forward\r\n- Keep all detailed notes, offers, and seller updates organized in our CRM\r\n- Collaborate closely with our team\n\r\nYou Must Have:\r\n- Minimum 2 years of experience in real estate acquisitions or seller negotiations\r\n- Experience closing real estate deals and getting contracts signed\r\n- Excellent English communication skills (spoken and written)\r\n- Proven ability to build trust and rapport over the phone\r\n- Good attitude, confident, friendly, and persuasive communication style, not robotic\r\n- Familiarity with terms like ARV, repairs, inspection, contingencies, etc.\r\n- Comfortable with CRM tools and outbound dialers\r\n- Fast internet, reliable computer, and quiet workspace\n\r\nYou Should NOT Apply If:\r\n- You’ve never closed a real estate deal directly with a seller\r\n- You only have admin, customer service, or lead generation VA experience\r\n- You’re not comfortable cold calling or negotiating pricing\r\n- You don’t understand real estate terms or investment basics\r\n- You can’t work full-time U.S. hours or have unreliable power or internet\r\n- You can not take coaching or accountability for performance\n\r\nHow to Apply: (Read Carefully – Incomplete Applications Will Be Ignored)\r\n- Email us at: Upgrade to see actual info\r\n- Subject line: Real Estate Acquisitions Application – [Your Name]\r\n - Attach your resume with relevant real estate or sales experience\r\n- Include a 1–2 minute audio or video introduction about yourself and experience. \n\r\nOnly applicants who follow all instructions will be considered.\n\r\nWhy Work With Us:\r\n- Industry-leading comp structure\r\n- Bonuses for both activity and consistency, no cap for top earners\r\n- Real deals, real support, real growth for career-minded closers\r\n- This is a career opportunity for serious professionals. If you’re a strong real estate closer who knows how to talk to homeowners (sellers) and get contracts signed, we want to hear from you.",
  "skill_requirements": [
    "Outbound Sales",
    "Acquisition",
    "ISA Real Estate"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:28:19.415589",
      "reason": "Job first discovered"
    }
  ]
}