{
  "job_id": "1410304",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-Customer-Service-Real-Estate-and-Surplus-Funds-Law-Firm-1410304",
  "scraped_at": "2025-07-15T09:22:09.691853",
  "title": "Virtual Assistant / Customer Service | Real Estate and Surplus Funds Law Firm",
  "type_of_work": "Full Time",
  "salary": "$5-$6/hr ($800-$960 USD mo.)",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking a highly skilled and motivated virtual assistant/paralegal to join our dynamic team and small law firm located in US Eastern Standard Time Zone. Ideal candidate is a detailed-oriented VA who understands real estate law and investigating, surplus funds recovery, and title search background with significant US work experience. This is a remote opportunity, and we are eager to connect with a qualified virtual assistant/customer service to explore how you can contribute to our team on a full-time basis. \n\r\nKey responsibilities:\r\n-Provide support to our attorney, including case preparation and client communication.\r\n-Maintain confidentiality and handle sensitive client information with discretion.\r\n-Ability to work effectively and efficiently in a fast-paced environment to meet deadlines with quick turnaround times.\r\n-Monitor case dockets and calendar deadlines.\r\n-Calendar and email management\r\n-Work with our surplus funds recovery clients and claimants\r\n-Client support with intake of “live” calls and response\r\n-Manage complex administrative processes, data entry and appointment setting\r\n-Web research, data gathering and skip tracing skills\r\n-Social media accounts and content creation to assist with marketing campaigns (optional)\n\r\nQualifications:\r\n-Minimum of 3 years of experience in the legal profession and surplus funds recovery\r\n-Knowledgeable in Clio (preferred), Zoho (preferred), RingCentral communication network, Microsoft Office Suite and Adobe DC software. \r\n-Strong knowledge of legal procedures and terminology.\r\n-Strong knowledge of surplus funds recovery and unclaimed property industry\r\n-Strong analytical and problem-solving skills.\r\n-Excellent written and verbal communication skills with positive personality.\r\n-High level of professionalism and ethical standards.\r\n-Strong organizational skills with the ability manage multiple tasks and deadlines effectively and prioritize tasks effectively.\r\n-Proactive, detail-oriented, and capable of working independently with minimal supervision.\r\n-Strong interpersonal skills and ability to work in a team environment, including with other remote teaUpgrade to see actual infombers.\r\n-Affluent in English language and speaking\r\n-Work Hours (without exception): 8:00 a.m.-5:00 p.m. Monday-Friday during US Eastern Standard Time Zone, with 1.0 hour lunch break. 40 hours per week to compliment business hours of operation of law firm.\n\r\nIdeal candidates are requested to reply with link to CV and with a short video explaining why you are qualified for this position. Projected start date week of July 7, 2025 or July 14, 2025, depending upon availability and schedule.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}