{
  "job_id": "1410377",
  "url": "https://www.onlinejobs.ph/jobseekers/job/YouTube-Specialist-1410377",
  "scraped_at": "2025-07-15T14:40:20.555222",
  "title": "YouTube Specialist",
  "type_of_work": "Part Time",
  "salary": "450",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "DESCRIPTION:\r\nWe’re a fast-growing sprinkler repair company based in North Texas, and we’re looking for a YouTube Growth Strategist from the Philippines to help us rank locally, grow our subscribers, and dominate search results using Shorts and smart content strategy.\n\r\nThis is a long-term position for someone who knows how YouTube really works—not just editing videos, but understanding titles, descriptions, thumbnails, tags, local keywords, viewer retention, and how to trigger Google’s video section with Shorts and service content.\n\r\nWHAT YOU’LL BE DOING:\r\nUploading and optimizing YouTube Shorts 3–5x per day\r\nWriting SEO-optimized titles and descriptions that target search terms like “sprinkler repair Plano” or “zone won’t shut off McKinney”\r\nAdding location tags, playlists, and related video links to boost visibility\r\nOrganizing video content by city, service type, and problem type\r\nMonitoring performance and reporting on CTR, retention, and visibility\r\nManaging scheduling links and earning bonuses based on booked appointments\r\nCollaborating with our in-house video team to improve hooks and thumbnails (no editing required, but understanding of click psychology is a plus)\n\r\nREQUIREMENTS:\r\nExperience managing YouTube channels, especially for businesses or service brands\r\nStrong understanding of YouTube SEO, video structure, and retention principles\r\nFluent English (writing & comprehension) — we’re talking to U.S. homeowners\r\nConfidence working with tools like YouTube Studio, TubeBuddy, vidIQ, Canva, or ChatGPT\r\nOrganized, consistent, and hungry to grow with a company\r\nFast and reliable internet connection\r\nHOURS + PAY:\r\n20 hours per week (flexible schedule, daily uploads required)\r\n$450 USD/month starting pay\r\nBonus potential for each booked job that comes from your videos (via our scheduling link tracking system)\n\r\nHOW TO APPLY:\r\nInclude the subject line: I’m Your YouTube Growth Strategist\n\r\nTell us about a YouTube channel you’ve helped grow and what you did\n\r\nShare a sample YouTube Short title + description for this topic:\n\r\n“Sprinkler system won’t shut off – Plano homeowner fix”\n\r\nBonus: Tell us one YouTube tip you think most businesses miss\n\r\nWe’re not looking for someone to just upload videos. We’re looking for someone who gets the game and wants to help us win locally—while building a long-term role with real potential.\n\r\nIf you’re sharp, strategic, and ready to own this channel, we want to meet you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:48:13.417050",
      "reason": "Job first discovered"
    }
  ]
}