{
  "job_id": "1411424",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Data-Analyst-1411424",
  "scraped_at": "2025-07-15T15:35:48.204710",
  "title": "Data Analyst",
  "type_of_work": "Part Time",
  "salary": "$433 - $500",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Everylite\n\r\nAt Everylite, we are passionate about creating innovative and efficient solutions for the signage industry. We believe in leveraging data to make smarter decisions and fuel our growth. As we continue to expand, we are seeking a highly analytical and detail-oriented Data Analyst to join our dynamic team.\n\r\nJob Overview\n\r\nWe are looking for a motivated Data Analyst who will be responsible for transforming raw data into actionable insights, helping to drive strategic decisions across all departments. This role is key to maintaining the accuracy and efficiency of our systems and providing ongoing analytical support to sales, production, operations, and leadership teams.\n\r\nKey Responsibilities:\n\r\nTransform raw data into clear, actionable reports to assist decision-making across departments.\r\nEnsure our database is consistently updated and maintained across all platforms.\r\nCollaborate with inventory and production teams to forecast inventory needs and monitor production orders.\r\nCreate and deliver ad hoc reports based on business needs and leadership requests.\r\nTrack sales quotas vs. actual results and highlight areas of improvement or concern.\r\nDevelop, maintain, and distribute monthly reports for department heads and executive teams.\r\nConduct trend analysis and deliver insights to support strategic planning.\r\nDevelop and automate data collection and reporting processes to improve efficiency.\r\nIdentify and troubleshoot data inconsistencies and work with relevant departments to resolve them.\r\nPartner with IT and Operations teams to ensure data security, accuracy, and integrity.\n\r\nRequirements:\n\r\nPart time, 4 hours per day, 2 hours from 9-11 am EST and 2 hours on your own time.\r\nBachelor’s degree in a related field such as Data Science, Statistics, Business Analytics, Computer Science, or Information Systems.\r\n2+ years of experience in a data analyst, business analyst, or similar role (preferred but not mandatory if skills are demonstrated).\r\nExpert-level proficiency in Microsoft Excel, including strong experience with Visual Basic for Applications (VBA) for automating tasks and building custom tools.\r\nExcellent analytical thinking and problem-solving skills.\r\nAbility to translate complex data into understandable insights and present them effectively to non-technical audiences.\r\nHighly organized with strong attention to detail.\r\nStrong communication skills, both written and verbal.\r\nAbility to work independently in a remote setting and manage multiple projects simultaneously.\n\n\r\nPreferred Qualifications:\r\nExperience with inventory management or production order tracking systems.\r\nFamiliarity with CRM and ERP systems.\r\nExperience in a manufacturing or signage industry environment is a plus.",
  "skill_requirements": [
    "Data Analytics",
    "Data Entry"
  ],
  "is_active": true,
  "status_history": []
}