{
  "job_id": "1411546",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-media-content-creator-1411546",
  "scraped_at": "2025-07-15T02:25:43.360569",
  "title": "Social media content creator",
  "type_of_work": "Part Time",
  "salary": "4-8",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Description \n\r\nPosition Summary:\r\nWe’re seeking a creative and self-driven Content Creator to help us build a strong presence on Instagram, TikTok, and YouTube through short-form videos (Reels, Shorts). This role includes video editing, voiceover scripting, and helping shape our social media brand. Bonus if you’re also familiar with social media growth strategies and can help plan content calendars.\n\n\n\r\n   Responsibilities:\r\n\t•\tCreate 3–7 engaging Reels/Shorts per week (voiceovers, captions, trending audio, transitions)\r\n\t•\tWrite or collaborate on short scripts and voiceovers\r\n\t•\tRepurpose raw footage, interviews, or clips into viral-style content\r\n\t•\tStay updated on trends, audio, hashtags, and hooks that work\r\n\t•\tCollaborate on content strategy and weekly planning\r\n\t•\t(Optional) Schedule and post across platforms\r\n\t•\t(Optional) Monitor performance and tweak content for better engagement\n\n\n\r\n  Requirements:\r\n\t•\tStrong experience editing short-form videos (Instagram Reels, TikTok, YouTube Shorts)\r\n\t•\tProficient in tools like CapCut, Adobe Premiere Rush, or similar\r\n\t•\tAbility to generate creative ideas from raw content or prompts\r\n\t•\tBonus: voiceover or voice editing skills\r\n\t•\tBonus: past work with personal brands or businesses in real estate, trucking. \r\n\t•\tStrong communication skills and reliability\n\n\n\r\n Bonus Points:\r\n\t•\tKnows how to hook attention in the first 3 seconds\r\n\t•\tUnderstands how to grow engagement and following organically\r\n\t•\tHas a portfolio or examples of Reels/Shorts they’ve made\n\n\r\n****attach 3-5 examples of your recent work!****",
  "skill_requirements": [
    "Content Creation",
    "Video Content Creation",
    "Communication"
  ],
  "is_active": true,
  "status_history": []
}