{
  "job_id": "1411855",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Operations-Manager-Short-Term-Rental-Property-Management-Remote-Full-Time-20hour-High-Responsibility-Role-1411855",
  "scraped_at": "2025-07-15T12:27:28.513791",
  "title": "Operations Manager – Short-Term Rental Property Management Remote | Full-Time | $20/hour | High-Responsibility Role",
  "type_of_work": "Full Time",
  "salary": "$20/hr",
  "hours_per_week": "50",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you highly intelligent, obsessively hardworking, and capable of running operations at an elite level? Do you thrive in fast-paced, high-accountability environments and want to grow into an executive role?\n\r\nLuxury Lodging is a fast-scaling short-term rental property management company with homes across the U.S. We are hiring a top 1% offshore Operations Manager to help us build systems, solve operational problems, manage vendors, and improve internal performance across the board.\n\r\nThis is a high-performance role—only apply if you're ready to bring extreme work ethic, speed, and problem-solving ability every day.\n\n\r\nWhat You’ll Be Responsible For:\n\r\nContractor & Vendor Oversight\r\n    •    Research and track the 20+ most common short-term rental issues (e.g., plumbing, WiFi, AC)\r\n    •    Gather contractor pricing across cities and monitor for overcharges or delays\r\n    •    Help build and maintain a nationwide contractor network\n\r\nListing Optimization\r\n    •    Optimize Airbnb/STR listings for higher revenue (title, description, photos, pricing)\r\n    •    Create internal checklists and track listing performance improvements\r\n    •    Research and test tools to improve revenue across platforms\n\r\nGuest Review Removal & Policy Enforcement\r\n    •    Research Airbnb review removal rules, guest violation policies, and enforcement tactics\r\n    •    Help develop a system to detect and dispute unfair or policy-violating reviews\r\n    •    Collect documentation from guests that supports violations\n\r\nGeneral Operations\r\n    •    Identify broken systems and build better ones\r\n    •    Help manage offshore team productivity and accountability\r\n    •    Track and report operational KPIs and guest experience metrics\n\n\r\nSchedule & Time Commitment:\r\n    •    Core Hours: 9:00 AM – 7:00 PM EST, Monday to Friday\r\n    •    Expected Hours: Minimum 50+ hours per week\r\n    •    Availability: Must be reachable via phone/text on weekends in case of urgent issues (minimal, but required)\n\n\r\nIdeal Candidate:\r\n    •    Extremely intelligent, fast learner, and deeply analytical\r\n    •    Works fast—slow workers or overthinkers will not thrive here\r\n    •    Strong communication, documentation, and research ability\r\n    •    Obsessed with improving systems and solving problems without being asked\r\n    •    Experience in operations, project management, STR, or vendor management is a big plus\n\n\r\nCompensation:\r\n    •    $20/hour USD (Full-Time, Tracked Hours via Software)\r\n    •    10% raise structure every 3 months for top performers\r\n    •    Long-term role with potential to grow into a high-level executive position",
  "skill_requirements": [
    "Property Management",
    "Airbnb",
    "Leadership"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T11:24:32.155332",
      "reason": "Job first discovered"
    }
  ]
}