{
  "job_id": "1411553",
  "url": "https://www.onlinejobs.ph/jobseekers/job/LightroomPhotoshop-Editor-1411553",
  "scraped_at": "2025-07-15T14:36:50.648813",
  "title": "Lightroom/Photoshop Editor",
  "type_of_work": "Part Time",
  "salary": "650",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Photo Editor (Lightroom & Photoshop) – Construction & Real Estate\n\r\nWe’re on the hunt for a confident photo editor who’s skilled in Lightroom and Photoshop to join Mizzi Media on a long-term basis. Our clients span across construction and real estate, and we’re looking for someone who can consistently match the tone and energy of our brand.\n\r\nKey Responsibilities:\n\r\nDaily editing of photo sets in Lightroom (main software used)\n\r\nColour grading that suits the tone of the project\n\r\nObject removal and clean-up in Photoshop\n\r\nHDR bracketing and image blending\n\r\nCarousel and banner creation for social media\n\r\nStyle Direction:\r\nCheck out our page for editing Upgrade to see actual info\n\r\nConstruction: Grittier, darker-toned edits with mood and contrast\n\r\nReal Estate: Clean, vibrant, and polished — always bright and inviting\n\r\nMust-Haves:\n\r\nStrong English communication (written + verbal)\n\r\nAvailable in or close to AEST timezone (Australia-based team)\n\r\nHigh attention to detail and consistency across galleries\n\r\nReliable turnaround and good file management\n\r\nTrial Edit Task:\r\nPlease complete the following using this pack:\nUpgrade to see actual info\n\r\nTasks to complete:\n\r\n1x HDR bracketed image\n\r\n3–4 edited stills (reference our Instagram look and feel)\n\r\n1x Instagram-style banner (refer to our IG layout for vibe)\n\r\nWe’re looking for someone we can work with regularly. If you’re confident you can match our style and edit efficiently, we want to hear from you.",
  "skill_requirements": [
    "Photoshop",
    "Lightroom"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:42:39.515263",
      "reason": "Job first discovered"
    }
  ]
}