{
  "job_id": "1411738",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Cold-Callerselect-Sales-Appointment-Setter-1411738",
  "scraped_at": "2025-07-15T12:33:01.258427",
  "title": "Cold Caller/select ‘Sales / Appointment Setter",
  "type_of_work": "Any",
  "salary": "30000",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re The Cultivator, an Australian-based agency scaling local and high-ticket service businesses across Australia, the US, and beyond. We’re currently looking for a sharp, confident Cold Caller who’s comfortable jumping on the phone, starting conversations, and turning cold leads into warm opportunities.\n\r\nIf you have a clear UK or neutral accent, and you’re not afraid to pick up the phone and get things moving, we want to hear from you.\n\r\nIn this role, you’ll be making outbound calls to cold leads provided by our team. Your job is to spark interest, build quick rapport, and either qualify or book them in for a deeper strategy call. You’ll be working with proven scripts and training materials, but we’re also looking for someone who can think on their feet and adapt to different conversations.\n\r\nYou don’t need to be an aggressive closer — but you do need to be confident, resilient, and know how to keep a conversation alive. If you’ve worked in outbound sales, lead generation, customer acquisition, or appointment setting, that’s a big plus.\n\r\nWe’re a remote-first team and already have strong support in the Philippines, so your onboarding will be smooth, and your interview can even be done in Tagalog if you’d prefer. What matters most to us is that you’re reliable, eager to learn, and bring energy to every call.\n\r\nTo apply, head over to thecultivator.co/applynow. Upload your CV and book an interview call with our team. Make sure to select ‘Sales / Appointment Setter’ as your preferred role.\n\r\nWe’re excited to meet you and get you on the phones. Let’s grow together.",
  "skill_requirements": [
    "Google Ads",
    "Shopify",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:46:39.277717",
      "reason": "Job first discovered"
    }
  ]
}