{
  "job_id": "1412831",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Property-Client-Concierge-VA-1412831",
  "scraped_at": "2025-07-15T15:46:02.557276",
  "title": "Property Client Concierge VA",
  "type_of_work": "Part Time",
  "salary": "Php 35,000",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "This is an exciting opportunity to join one of Queensland’s most trusted boutique real estate agencies, known for its excellence in marketing and selling high-end canal-front and lifestyle properties. Based in the scenic area of Bribie Island, our client offers a premium, client-focused real estate experience, and this role will be central to ensuring the smooth operation of its growing sales division.\r\nYou will play a pivotal role in supporting the principal agent by managing listings and sales administration, ensuring documentation compliance, and delivering seamless communication with clients and stakeholders throughout the sales process. This position is ideal for someone who thrives in an organized, process-driven environment and is passionate about upholding high standards of branding, professionalism, excellence, and customer service\n\r\nRequirements\r\n? Proven experience in real estate administration or property-related roles\r\n?  Proficient in CRM platforms (preferably Vault or MRI Eagle)\r\n? Skilled in Canva, Facebook, Instagram, Docusign, Realworks, RP Data, and Google Workspace, Xero (preferable not essential) \r\n? Excellent written and verbal English communication skills\r\n? Strong attention to detail and commitment to excellence and compliance\r\n? Highly organized and able to multitask effectively with minimal supervision\r\n? Professional and courteous demeanor with a strong team-oriented attitude\r\n? Familiarity with Queensland real estate contract and legal document procedures is an advantage\r\n? A bachelor’s degree is a plus\r\n? An understanding of property contract law is an advantage.\n\r\nResponsibilities\r\n? Client & Sales Support\r\n? Act as the first point of contact for clients and assist with listing and contract processing\r\n? Manage listing compliance (Form 6) and coordinate marketing launches\r\n? Process contracts, track key dates, and communicate with clients, solicitors, and agents\r\n? Ensure milestones such as finance and building & pest deadlines are monitored and met\r\n? Coordinate post-sale activities including document filing, CRM updates, and review requests\r\n? Communicate, post and update Facebook posts\n\r\nAdministrative Operations\r\n? Use MRI Eagle to manage client records and workflow automations\r\n? Maintain up-to-date digital files and ensure seamless data entry\r\n? Liaise with the accounts manager for trust deposits and invoicing\r\n? Ensure the client's brand is maintained across all external materials\r\n? Accountability, Development & Decision-Making\r\n? Proactively follow through on tasks to meet deadlines with excellence\r\n? Make informed decisions within company guidelines and escalate issues when needed\r\n? Support team culture by communicating effectively and upholding the client’s values and premium standards\n\r\nBenefits \r\n1. Monthly Salary: PHP35,000\r\n2. Salary will be paid on a bi-monthly basis on the 15th and 30th/31st of each month \r\n3. You will be paid extra for overtime and Philippines public holidays \r\n4. Probation: 6 months and after Probation \r\n? 10 days of annual leave credits \r\n? 5 days of sick leave \r\n5. Day 1 benefits include pro-rated 13th-month pay, HMO, SSS, PhilHealth, and HDMF (Pag-IBIG Fund).\r\n6. Permanent work-from-home role with company-provided equipment; a stable personal internet connection is required. \r\n7. Salary Review after 6 months and 12 months.\r\n8. Shift Times: 8:00AM-12:00PM PH Time, Monday-Friday\n\r\n???? Interested applicants may send their updated resume to Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:33:36.560169",
      "reason": "Job first discovered"
    }
  ]
}