{
  "job_id": "1412229",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Adalo-App-Developer-Debug-Optimize-UIUX-and-Prepare-for-App-Store-Approval-1412229",
  "scraped_at": "2025-07-15T09:27:19.765009",
  "title": "Adalo App Developer – Debug, Optimize UI/UX, and Prepare for App Store Approval",
  "type_of_work": "Part Time",
  "salary": "$6/hour",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Overview:\n\r\nWe are looking for an experienced Adalo developer to join our team on an ongoing basis. Your main responsibilities will include debugging our existing app, improving the UI/UX experience (with a strong emphasis on mobile usability), and preparing the app for successful submission to Google Play and the Apple App Store.\n\r\nThis role requires someone with a strong grasp of logic and conditional visibility, as well as familiarity with app store approval guidelines. Our app has several components of conditional logic already implemented, but we need it streamlined and polished for better performance and clarity.\n\r\nResponsibilities:\r\n- Debug current issues in an Adalo-built app (some bugs already identified)\r\n- Enhance UI/UX for optimal mobile experience using Adalo’s native tools\r\n- Review and optimize conditional visibility logic\r\n- Prepare app for successful submission to Google Play & Apple App Store\r\n- Stay up-to-date with app store design and content compliance guidelines\r\n- Collaborate with our team for ongoing updates and feature enhancements\n\r\nQualifications:\r\n- Proven experience with Adalo\r\n- Strong logical reasoning and ability to work with conditional visibility rules\r\n- Solid understanding of Google Play and Apple App Store approval requirements\r\n- UI/UX design experience (especially for mobile interfaces)\r\n- Detail-oriented with a proactive problem-solving approach\r\n- Good written and verbal English communication skills\n\r\nPreferred (but not required):\r\n- Experience with publishing apps via Adalo to both stores\r\n- Familiarity with Adalo plugins and third-party integrations\r\n- Background in quality assurance or UX testing\n\r\nWork Schedule & Terms:\r\n- Part-time to start, with potential for long-term engagement\r\n- Flexible working hours, but some overlap with US EST is preferred\r\n- Communication via Trello and WhatsApp\r\n- Pay via PayPal\n\r\nHow to Apply:\n\r\nPlease send:\r\n- Your resume or OnlineJobs.ph profile link\r\n- A portfolio of Adalo apps you’ve worked on (screenshots or links preferred)\r\n- A short explanation of a tricky conditional logic problem you’ve solved in Adalo\n\r\nWe’re excited to find someone who’s not just a technician, but a logical thinker who cares about user experience and app performance.\n\r\nApply now and let’s build something great together!",
  "skill_requirements": [
    "User Experience Design",
    "Mobile Development",
    "Web Development"
  ],
  "is_active": true,
  "status_history": []
}