{
  "job_id": "1412124",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Creative-Strategist-1412124",
  "scraped_at": "2025-07-15T12:25:27.517138",
  "title": "Creative Strategist",
  "type_of_work": "Part Time",
  "salary": "Negotiable",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking a Creative Strategist to join our growing online fashion brand team, starting on a part-time basis with the potential to transition into a full-time role. In this position, you will play a key role in developing and executing innovative strategies that align with our brand vision and drive results across campaigns, products, and content initiatives.\n\r\nResponsibilities:\n\r\nYou will primarily collaborate with AI prompt engineers, providing them with well-structured scripts, creative directions, and strategic ideas to guide content generation and campaign execution. In this role, you will translate high-level brand objectives into actionable prompts and briefs for AI-driven outputs, ensuring alignment with our overall marketing vision and brand voice. You will report directly to the Chief Marketing Officer (CMO), keeping them updated on progress, insights, and opportunities to enhance our creative strategies using AI technologies.\n\r\nRequirements:\n\r\nProven experience in creative strategy, brand strategy, or campaign planning.\n\r\nStrong ability to think both creatively and analytically.\n\r\nExcellent communication and presentation skills.\n\r\nAbility to manage multiple projects and deadlines efficiently.\n\r\nFamiliarity with social media, digital marketing, and consumer insights as well as trends.\n\r\nThis position will be fully remote and hours will increase as we move into Q4 possibly to full time if desired.\n\r\nIf you are interested in this position please fill out the official application form here: Upgrade to see actual info",
  "skill_requirements": [
    "Creative Writing",
    "Advertising",
    "Creative Advertising"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:26:39.694562",
      "reason": "Job first discovered"
    }
  ]
}