{
  "job_id": "1412305",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1412305",
  "scraped_at": "2025-07-14T23:09:07.017890",
  "title": "Transportation Tracker",
  "type_of_work": "Any",
  "salary": "$800 - $1100 / Month (Paid Every 15th / 1st)",
  "hours_per_week": "50",
  "date_updated": "Jul 14, 2025",
  "job_overview": "AJG Transport is expanding its Route Operations to help with the organization and running of the daily duties of the company. The ideal candidate will be a hard-working professional able to undertake a variety of office support tasks and work diligently under pressure. This person will be comfortable working with a high degree of attention to detail and discretion as well as incorporating new and effective ways to achieve better results.\n\r\nAJG Transport is an established transportation company in San Antonio Texas. Focusing on expedited freight with many other branches in the freight industry,\n\r\nInterested?\r\nWatch This Video: Upgrade to see actual info/share/fd6816fb8d664dcdbdUpgrade to see actual infob646edb?sid=6fbbf39d-c99f-4583-a6d1-6aa664bd22f7\n\r\nNOTE: Before applying, ensure you are comfortable with the following:\r\n- Can work on any US hours (CST).\r\n- Comfortable being in a rotational shift depending on business needs\r\n- Using Hubstaff throughout shift\r\n- Being in the zoom throughout shift (start to end)\n\r\nApply here - Upgrade to see actual info/team/Upgrade to see actual info/TransportationTracker\n\r\nTraining is paid upon completion!\n\r\nAJG Currently has 2 full time positions available for the following schedule:\r\nTuesday - Friday 7 AM - 5 PM / Saturday Half day 7 AM - 12 PM\r\nTuesday - Saturday 11:00 PM - 9:00 AM\n\r\nResponsibilities\r\n- Maintain an efficient remote working environment by organizing digital workspaces and assisting associates in optimizing procedures.\r\n- Develop and implement remote work policies and standard operating procedures to improve workflow.\r\n- Sort and distribute internal and external communications promptly using Telegram and other communication tools.\r\n- Maintain open lines of communication with drivers, customers, and teaUpgrade to see actual infombers via Zoom for updates and problem-solving.\r\n- Create, update, and maintain accurate digital records in Excel and Loadstop, ensuring data integrity and validity.\r\n- Track and trace shipments using Samsara and Loadstop, providing real-time updates on load statuses.\r\n- Plan and dispatch routes for drivers, ensuring efficient load delivery and pickup schedules.\r\n- Monitor driver progress and make real-time adjustments to routes as necessary to optimize efficiency and meet customer deadlines.\r\n- Utilize Samsara and Loadstop to track and trace loads, ensuring timely delivery and adherence to schedules.\r\n- Provide accurate and timely updates to customers regarding load statuses and potential delays.\r\n- Schedule and coordinate virtual meetings and appointments, ensuring all participants are informed and prepared.\r\n- Use Zoom to facilitate virtual meetings, maintaining a high level of communication and coordination.\r\n- Monitor digital tools and software levels, coordinating with IT to handle any shortages or technical issues.\r\n- Ensure all necessary digital tools and resources are available for efficient remote operations.\r\n- Generate and deliver detailed reports to customers regarding load statuses, delivery times, and any issues encountered.\r\n- Maintain regular communication with customers to provide updates and address any concerns promptly.\r\n- Proactively identify and resolve remote work-related malfunctions and respond to requests or issues from drivers, customers, and teaUpgrade to see actual infombers.\r\n- Coordinate with other departments to ensure compliance with company policies and to facilitate smooth remote operations.\r\nMaintain trusting relationships with suppliers, customers, and colleagues through consistent and transparent communication.\n\r\nSkills\r\n- Min 45 Words-Per-Minute Typing Speed\r\n- Proven experience as an office assistant, or in another relevant administrative role\r\n- Proficiency in MS Office, Knowledge of OneDrive & Google Applications\r\n- Working knowledge of office equipment\r\n- Willing to use Hubstaff throughout shift\r\n- Able to be on a consistent Zoom video Meeting with the Team to collaborate and learn\r\n- Thorough understanding of office management procedures\r\n- Excellent organizational and time management skills\r\n- Analytical abilities and aptitude in problem-solving\r\n- Excellent written and verbal communication skills\r\n- Logistics Experience Recommended. but not required.\r\n- Hustler Mentality REQUIRED\n\r\nThis position is a lifestyle that is unlike usual operations, the team is tight-knit and executes as such with the goal of decreasing operational driver error throughout their time online. AJG executes with this in mind when it comes to the growth and development of each operator, you will learn everything immediately before executing operations throughout the workweek. All of the tools you need to be successful will be provided, but this also requires chasing excellence fervently and we would require it consistently as it takes that type of charisma and drives to increase your own capacity for success and responsibility. But take this final thought in mind, you are paid according to your value, if you become someone the team can depend on you will be treated as such and paid according to that value which is the AJG Guarantee.\n\r\nFeel Free to Visit our Website at Upgrade to see actual info\n\r\nDue to the high volume of applications we receive, we are only able to contact candidates who meet the qualifications for the position.",
  "skill_requirements": [
    "Logistics Management",
    "English Speaking",
    "Dispatching"
  ]
}