{
  "job_id": "1413692",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Digital-Marketing-Specialist-1413692",
  "scraped_at": "2025-07-14T23:07:26.130201",
  "title": "Digital Marketing Specialist",
  "type_of_work": "Full Time",
  "salary": "25,000 - 40,000 (DOE)",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you passionate about all things design, branding, and digital magic?\r\nDo you thrive in a fast-paced virtual world where creativity meets strategy?\r\nWe’re on the hunt for a creative powerhouse who’s ready to bring bold ideas to life, elevate digital presence, and make brands pop!\n\r\nIf you’re detail-driven, digitally savvy, and bursting with fresh ideas — this is your Upgrade to see actual infont.\r\nReady to make your mark?\r\nJoin our team and let’s create something amazing together!\n\r\nAt The Guiding Star LLC, we’re all about helping businesses grow and we believe that starts\r\nwith a strong digital presence. As our Digital Marketing Specialist, you’ll be at the forefront of\r\nthat mission, creating stunning visuals, managing our website, and elevating our social media\r\npresence.\n\r\nKey Responsibilities:\r\nWebsite Management\r\nKeep our website fresh, functional, and on-brand\r\nUpdate content and ensure pages are responsive, attractive, and SEO-optimized\r\nCollaborate with internal teams to align web content with marketing goals\n\r\nGraphic Design\r\nDesign eye-catching visuals for web, social, and marketing campaigns\r\nUse tools like Canva, Adobe Photoshop, and Illustrator to deliver polished\r\nmaterials\r\nMaintain brand consistency across all platforms\n\r\nSocial Media Management\r\nPlan, create, and schedule content across platforms (Instagram, Facebook,\r\nLinkedIn, etc.)\r\nTrack engagement and analytics to optimize performance\r\nStay ahead of digital trends, reels, and viral content formats\r\nBuild and grow our social media presence with creativity and consistency\n\r\nMinimum technical requirements:\r\nProcessor (CPU): Intel Core i5 (10th gen or newer) or AMD Ryzen 5 (3000 series\r\nor newer)\r\nRAM: 8 GB minimum (16 GB recommended)\r\nStorage: 256 GB SSD (minimum)\r\nOperating System: Windows 10/11 (Pro or Home) or macOS\r\nWebcam & Microphone: 720p HD webcam and external microphone or headset\r\nwith noise cancellation for clear communication\n\r\nQualifications:\r\nBachelor’s degree in Marketing or a related field\r\n3–5 years of experience in marketing, design, or as a digital assistant\r\nStrong background in website content management\r\nProficiency with graphic design tools such as Canva and Adobe Creative Suite\r\nSolid experience in managing social media content and developing strategy\r\nExcellent English communication skills, both written and verbal\r\nHighly organized, self-motivated, and detail-oriented\n\r\nBenefits:\r\n100% Remote Work – Enjoy the freedom to create from anywhere\r\nFlexible Setup – Work on your terms, with the tools you love\r\nCreative Impact – Bring your ideas to life and shape our brand’s identity\r\nCareer Growth – Room to lead, innovate, and build a standout portfolio\r\nSupportive Team – Collaborate with people who care about your success\n\r\nHow to Apply\r\nApply here and help us build meaningful connections that fuel success!\r\nPro Tip: Be ready to showcase 3 sample works (e.g., social media designs, website layouts, or marketing materials) during your interview—we want to see your creativity in action!\n\r\nPlease note: We do not accept applications on this platform.\r\nTo be considered, kindly fill out the application form below:\nUpgrade to see actual info/forms/e886e26a3bca2a75bc4fac5c25663e97?r=apse2                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}