{
  "job_id": "1413275",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Outbound-Sales-VA-Cold-Calling-Appointment-Setting-Work-from-Home-US-EST-Hours-1413275",
  "scraped_at": "2025-07-14T23:12:14.717988",
  "title": "Outbound Sales VA – Cold Calling & Appointment Setting (Work from Home – U.S. EST Hours)",
  "type_of_work": "Full Time",
  "salary": "$500-$800 /mo",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a U.S.-based digital marketing agency looking to hire a fluent English-speaking Outbound Sales Virtual Assistant to call local business owners in the U.S., introduce our service, and book appointments for our sales team.\n\r\nYou will be trained and given scripts, leads, and tools. Your job is to follow the script, call warm and cold leads, and set qualified appointments on our calendar.\n\r\nThis is a full-time position, and we are looking for someone who is self-motivated, resourceful, and proactive — someone who doesn’t just wait for direction but can think critically, solve problems, and suggest improvements to make processes more efficient over time.\n\r\nResponsibilities:\r\n- Call small businesses in the U.S. (dentists, med spas, contractors, etc.)\r\n- Use scripts to pitch our reputation management service\r\n- Book appointments on Calendly or GoHighLevel calendar\r\n- Log call notes and follow-up tasks into CRM\r\n- Follow up with warm leads via SMS or email as needed\r\n- Report daily on calls made, appointments booked, and any issues encountered\n\r\nRequirements:\r\n- Excellent spoken English — you’ll be speaking directly with U.S. clients\r\n- Confident, friendly voice with a persuasive tone\r\n- Prior cold calling or appointment setting experience (required)\r\n- Fast, reliable internet and a quiet working environment for calls\r\n- Familiarity with tools like GoHighLevel, Google Sheets, CRMs (preferred)\r\n- Strong attention to detail and follow-through\r\n- Must be a problem solver and willing to take initiative\r\n- Committed, consistent, and interested in a long-term full-time opportunity\n\r\nWhat We Offer:\r\n- $500–$800/month base salary (depending on experience)\r\n- Performance-based bonuses for appointments booked and deals closed\r\n- Full training and proven scripts provided\r\n- Friendly, supportive team environment\r\n- Opportunities for growth into management or higher-level roles\r\n- U.S. EST working hours\n\r\nTo Apply:\r\nIf you think you're the right person for the job — we’d love to hear from you!\r\nPlease fill out our short application form to tell us more about your background, experience, and why you think you’d be a great fit for this role.\n\r\nApply here: Upgrade to see actual info\r\n(Do not send us an email — applications will only be reviewed through this form.)\n\r\nWe’re looking forward to meeting the next Rockstar on our team!",
  "skill_requirements": [
    "Cold Calling",
    "English Speaking",
    "English Proficiency"
  ]
}