{
  "job_id": "1413192",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-Representative-for-E-commerce-Shopify-Gorgias-Recharge-1413192",
  "scraped_at": "2025-07-15T12:34:35.832852",
  "title": "Customer Service Representative for E-commerce (Shopify, Gorgias, Recharge)",
  "type_of_work": "Full Time",
  "salary": "$700",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re looking for someone who doesn’t just do the work — but takes pride in doing it right. If you naturally pay attention to details, double-check your work, and genuinely care about every customer interaction, you’ll thrive here.\n\r\nAbout Dsrupt Media:\r\nDsrupt Media is a fast-growing, dynamic company focused on helping consumer brands scale through cutting-edge ad creative.\r\nWe’re committed to delivering excellent service, paying attention to even the smallest details, and building strong, trust-based relationships with our clients. By joining Dsrupt Media, you’ll be part of a team that values innovation, teamwork, customer satisfaction, and a culture of care and excellence.\n\r\nThe Opportunity:\r\nDsrupt Media is looking for a passionate, dedicated, and highly detail-oriented Customer Service Representative to join our team. This role is perfect for someone who loves delivering exceptional customer service, has a keen eye for accuracy, and takes pride in double-checking their work to ensure every interaction is polished and professional.\r\nExperience supporting e-commerce brands is a strong advantage.\r\nAs a Customer Service Representative at Dsrupt Media, you’ll play an important role in ensuring customer satisfaction and helping our clients experience a seamless and empathetic service journey.\n\r\nResponsibilities:\r\nAs a Customer Service Representative at Dsrupt Media, you will:\r\n-Respond promptly and accurately to customer inquiries via email, chat, and other communication channels, ensuring all information is double-checked before sending.\r\n-Address customer concerns with professionalism, patience, and empathy, providing thoughtful and tailored solutions.\r\n-Handle customer complaints with a calm demeanor, actively listening to understand the core issue and ensuring a timely and respectful resolution.\r\n-Collaborate with other departments when necessary to resolve complex issues effectively.\r\n-Ensure customers have a positive and memorable experience by maintaining a helpful, friendly, and detail-oriented approach.\r\n-Provide constructive feedback to help improve products, services, and overall customer experience.\r\n-Maintain a strong, updated knowledge of our e-commerce platforms and third-party apps to assist customers accurately.\r\n-Follow customer service procedures and guidelines meticulously to ensure consistency, accuracy, and a high standard of service delivery.\n\r\nAbout You:\r\n-Experience with CRM systems such as Zendesk, Salesforce, or Gorgias is a MUST.\r\n-Experience with e-commerce platforms like Shopify, Recharge, and Shiphero is a MUST.\r\n-2+ years of experience in customer service, preferably supporting e-commerce brands.\r\n-Excellent written and verbal English communication skills, with the ability to craft clear, thoughtful, and error-free responses.\r\n-Strong attention to detail — you naturally double-check your work and catch inconsistencies before they reach the customer.\r\n-Highly empathetic, with a genuine desire to help others and a calm presence under pressure.\r\n-Strong problem-solving abilities and a proactive, customer-first attitude.\r\n-Ability to handle multiple customer queries simultaneously while maintaining accuracy and care.\n\n\r\nWorking Hours:\r\n-Full-time position with flexibility required to provide some weekend coverage.\r\n-Working hours are primarily aligned with the EST timezone, with weekend availability to ensure customer service continuity.\n\r\nRequirements: \r\nNOTE: Applications that miss any of the listed requirements will not be considered.\n\r\n-To ensure your application is considered, please include the word \"jam\" in your subject line to show you’ve thoroughly reviewed the job description.\r\n-CV (Resume)\r\n-A brief video introducing yourself and explaining why you are an ideal fit for this role, highlighting your attention to detail and ability to double-check your work\r\n-3 professional references from previous employers\r\n-Completion of the personality test: Upgrade to see actual info/free-personality-test",
  "skill_requirements": [
    "Shopify",
    "Ecommerce",
    "Gorgias"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:34:35.835105",
      "reason": "Job first discovered"
    }
  ]
}