{
  "job_id": "1413604",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1413604",
  "scraped_at": "2025-07-14T23:06:37.658212",
  "title": "SEO Powerhouse Wanted: Build. Rank. Dominate.",
  "type_of_work": "Gig",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "SEO Powerhouse Wanted: Build. Rank. Dominate.\n\r\nJob Type: Contract\r\nSalary: TBD + Performance Bonuses\n\r\nWe don’t have SEO in place yet — and we’re not looking for someone to dabble or “test things out.” We’re looking for an expert who can come in, build from zero, and take us straight to the top of search results.\n\r\nIf you're the kind of pro who loves a blank slate and knows exactly what to do with it — from setup to domination — we want to see what you’ve got. Results matter. Speed matters. And if you can deliver both? You’ll be rewarded, BIG TIME.\n\r\nYour Mission:\r\n1. Set up our entire SEO framework (structure, tools, analytics — the works)\r\n2. Run full audits and deep-dive competitor analysis\r\n3. Build a rock-solid on-page and off-page SEO strategy\r\n4. Identify and rank high-converting, niche-specific keywords\r\n5. Create and manage backlink strategies that move the needle\r\n6. Ensure fast, mobile-optimized, technically sound pages\r\n7. Track rankings, report wins, and adjust for continuous growth\r\n8. Stay ahead of updates — and turn them into an advantage\n\n\r\nWhat We’re Looking For:\r\n1. Real experience ranking sites from scratch — not theory\r\n2. Strong portfolio and case studies that prove your SEO game\r\n3. Ability to work independently and make strategic calls fast\r\n4. Clear communicator who brings solutions, not problems\r\n5. Obsessed with performance, not vanity metrics\n\n\r\nWhat You’ll Get:\r\n1. A clean slate to own SEO end-to-end\r\n2. Performance-based bonuses — if you win, we win, and we pay\r\n3. Zero micromanagement — just high expectations and support\n\n\r\nThis isn’t a role for someone who “needs time to ramp.” We’re moving fast. You’ll need to prove yourself even faster.\n\r\n- Apply now. Show us you’re the one who takes blank pages and turns them into Page 1 rankings.\r\n- Use job code: SEO\r\n-Upgrade to see actual info",
  "skill_requirements": [
    "SEO",
    "SEO Analysis",
    "Keyword Research"
  ]
}