{
  "job_id": "1414057",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Product-Lister-for-Fashion-Dropshipping-Brand-1414057",
  "scraped_at": "2025-07-15T15:34:38.848948",
  "title": "Shopify Product Lister for Fashion Dropshipping Brand",
  "type_of_work": "Any",
  "salary": "120",
  "hours_per_week": "16",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Dear Applicant,\n\r\nWe are a fast-growing USA-based fashion dropshipping brand and we're looking for a reliable, detail-oriented Product Lister to join our team. This is a long-term opportunity for someone who wants to grow within a supportive and fast-moving company.\n\r\nPlease start your application with the word \"strawberry\" so we know you’ve read the full post.\n\r\nYour daily tasks will include:\n\r\n– Importing products into Shopify using Poky and AI tools  \r\n– Checking titles, descriptions, and variant options translations\r\n– Adding accurate size charts and checking product images  \r\n– Categorizing products into the correct collections  \r\n– Ensuring all listings meet our quality standards before publishing\n\r\nRequirements:\n\r\n– Shopify experience (must)  \r\n– Experience using Poky (must)  \r\n– Good written English communication skills (must)  \r\n– Strong attention to detail, include the word \"avocado\" in your application  \r\n– Experience with tools like Trello, Slack, or Google Sheets (preferred)  \r\n– Willingness to follow SOPs precisely and work independently\n\r\nAvailability:\n\r\n– You must ensure that 5 new product collections each containing 10-20 products go live every day ( Poky AI will do most of the heavy lifting)  \r\n– Workload is approximately 2 hours per day, 7 days a week  \r\n– If you wish to take a day off (e.g. Sunday), you are expected to work ahead of schedule (e.g. do 10 collections on Saturday)\n\r\nCompensation:\n\r\n– Starting rate: €1.50/hour  \r\n– Estimated monthly pay: $120  \r\n– Rate can increase based on performance and reliability\n\r\nOnly apply if you fully agree to the hourly rate and can meet the required output. Applications asking for higher rates will not be considered.\n\r\nIf you're organized, efficient, and excited to be part of a growing e-commerce brand, we’d love to hear from you.\n\r\nBest regards,  \r\nNass",
  "skill_requirements": [
    "Shopify",
    "Product Listing",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:23:06.968531",
      "reason": "Job first discovered"
    }
  ]
}