{
  "job_id": "1414461",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Lawyer-Personal-Injury-AI-Innovation-Specialist-1414461",
  "scraped_at": "2025-07-15T06:37:13.037789",
  "title": "Lawyer, Personal Injury & AI Innovation Specialist",
  "type_of_work": "Full Time",
  "salary": "120,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "The Opportunity\r\nMEDirect is a fast-growing Australian medico-legal technology company. Our AI-enabled Medicolegal Report Assistant is entering its next development phase, and we need an experienced personal injury lawyer to embed legal rigour, design guardrails and help train the system. You will translate complex legal nuances into usable AI workflows while ensuring that our human-in-the-loop model, where the medical expert’s opinion always prevails and remains intact. If you’re passionate about technology’s role in modern legal practice, this is your chance to shape the future of medicolegal reporting.\n\r\nThis is a full-time, work-from-home role, working Monday-Friday 9 am – 6 pm, Australian EST, and includes benefits such as leaves and a 13-month payment, plus HMO after successfully passing 6 months ' probation. You’ll become part of our team. In doing so, you must be able to demonstrate your capacity to have a secure working-from-home environment without distractions, including suitable childcare arrangements, backup power & internet connections, and a co-working space nearby if required. \n\r\nKey Responsibilities\r\n1. Elevate Report Quality with AI Integration\n\r\nReview completed medicolegal reports to confirm every template field is populated and each Letter of Instruction question is fully answered.\n\r\nUse AI-powered tools to proofread language, structure, grammar, formatting, and visual consistency, ensuring compliance with best practice guidelines.\n\r\nDraft concise clarification queries for medical experts, resolving any gaps or ambiguities.\n\r\nProvide detailed legal feedback to product and data science teams, directly influencing model accuracy, relevance and ethical compliance.\n\r\nCapture medical expert feedback and translate it into product improvements that enhance—never replace—clinical reasoning.\n\r\n2. Collaborate & Innovate\n\r\nAct as the subject matter expert for product, engineering and AI teams during design sprints, feature testing and release reviews.\n\r\nWork closely with medical specialists to clarify instructions, resolve issues and drive continuous quality improvements.\n\r\nEngage insurers, regulators, and other stakeholders to ensure that the AI assistant meets statutory and industry standards.\n\r\nExperience & Qualifications\r\n________________________________________\r\nExperience & Qualifications\r\n•\tLicensed lawyer in the Philippines.\r\n•\tMinimum of five (5) years' experience in personal injury law, with direct exposure to the Australian or US legal systems.\r\n•\tStrong familiarity with medicolegal reporting, insurance assessments, and litigation documentation.\r\n•\tCompetency in the AMA4 and AMA5 guides.\r\n•\tDemonstrated experience reviewing and editing expert reports, legal submissions, or court documents.\r\n•\tExceptional written and verbal English, with native-level grammar, legal reasoning, and editorial skills.\r\n•\tMeticulous attention to detail with the confidence to challenge omissions or inconsistencies.\r\n•\tAdvanced skills in Microsoft Word (including styles, templates, track changes, and document comparison).\r\n•\tStrong skills in the full Microsoft Office Suite, including Excel & Outlook, and other relevant corporate software such as Slack.\r\n•\tTechnologically confident, with proven experience using legal tech platforms, AI-enabled tools, or structured document review systems, and a keen interest in prompt training AI applications.\r\n•\tProven ability to work remotely, independently, and to tight deadlines.\n\r\nHow to Apply\r\nSubmit your resume, a cover letter detailing your relevant experience based on the criteria, and a redacted sample of a medicolegal (or similar) document you have created, reviewed or edited. Applications without a cover letter and a sample document will not be reviewed. Please include at least two references and their current contact information.\r\nApplications close on 18th July, or earlier, pending applicant volume.",
  "skill_requirements": [
    "Legal Services",
    "AI Tools",
    "Technology Proficiency"
  ],
  "is_active": true,
  "status_history": []
}