{
  "job_id": "1414450",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Executive-Amazon-Operations-PPC-Advertising-1414450",
  "scraped_at": "2025-07-14T23:09:50.964006",
  "title": "Senior Executive, Amazon Operations & PPC Advertising",
  "type_of_work": "Any",
  "salary": "PHP 40000 - 60000 per month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Mission of the role: \r\nThis role plays a key role in optimizing Amazon operations across all four brands while driving advertising performance for N-Labs & 7th Manna Ads. This role is responsible for end-to-end listing management, account health, compliance, pricing strategies, and customer engagement, ensuring smooth marketplace operations. Additionally, the specialist will develop and execute data-driven PPC strategies, leveraging tools like Scale Insights, Helium 10, and DataDive to optimize campaigns, refine keyword targeting, and maximize profitability. By combining operational excellence with advertising expertise, this role contributes to sustained marketplace growth and brand success.\n\r\nKey Responsibilities: \n\r\nAmazon Operations & Compliance\r\n- End-to-End Listing Management – Optimize titles, bullet points, descriptions, creatives and backend search terms to improve ranking and conversion.\r\n- Account Health & Compliance – Monitor account health metrics, manage case logs, and ensure compliance with Amazon policies.\r\n- Pricing & Buy Box Strategy – Implement pricing adjustments and strategies to maximize Buy Box retention while maintaining profitability.\r\n- Customer Service & Review Management – Handle customer inquiries, monitor feedback, and develop strategies to improve ratings and brand reputation.\r\n- Operational Reporting – Maintain Subscribe & Save (S&S) tracking, daily Wrike updates, and performance reports for data-driven decision-making.\n\r\nAmazon PPC & Advertising Strategy \r\n- Campaign Setup & Optimization – Manage Sponsored Products, Sponsored Brands, and Sponsored Display campaigns for N-Labs & 7th Manna Ads.\r\n- Keyword Research & Bid Strategy – Utilize Scale Insights, Helium 10, DataDive, and brand analytics to conduct keyword research, optimize bids and refine ad targeting strategies.\r\n- Performance Tracking & Scaling – Analyze key metrics (ACoS, ROAS, CTR, conversion rates) to improve campaign performance and maximize profitability.\r\n- Testing & Scaling – Implement A/B testing, long-tail keyword strategies, and retargeting campaigns to improve efficiency and market share.\r\n- Collaboration with Creative Teams – Work alongside design and content teams to ensure ads and listing creatives are fully optimized for engagement.\n\r\nKey Skills / Experience:\r\n- Diploma or Degree in Marketing, Advertising, Business, or a related field (preferred but not mandatory).\r\n- 2+ years of hands-on experience in Amazon PPC, managing Sponsored Products, Sponsored Brands, and Sponsored Display campaigns.\r\n- Strong expertise in keyword research, bid management, and audience targeting to optimize campaign performance and improve ROAS.\r\n- Proficiency in Amazon Seller Central and PPC tools like Helium 10, DataDive, Scale Insights, or similar.\r\n- Analytical mindset with problem-solving skills, able to track key metrics (ACoS, ROAS, CTR) and troubleshoot underperforming campaigns.\r\n- Experience in eCommerce or digital marketing, preferably with a deep understanding of Amazon’s ad ecosystem.\r\n- Ability to manage multiple campaigns and budgets independently while maintaining efficiency.\r\n- Excellent communication and reporting skills, with a detail-oriented and proactive approach to optimizing and scaling campaigns.\n\r\nThis is a 100% remote role where the potential hire must be equipped with the following to carry out this role effectively:\r\n- Laptop / CPU with acceptable speed\r\n- At least 2 monitor screen (inclusive of laptop screen)\r\n- Headset with Mic (Noise cancelling)\r\n- Webcam\r\n- Designated Workstation\r\n- Stable and strong power and internet connectivity\r\n- Noise-free and conducive environment",
  "skill_requirements": [
    "Amazon Ads",
    "Amazon"
  ]
}