{
  "job_id": "1414548",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Online-Arbitrage-Sourcing-Specialist-Amazon-US-1414548",
  "scraped_at": "2025-07-15T14:30:16.935611",
  "title": "Online Arbitrage Sourcing Specialist (Amazon US)",
  "type_of_work": "Full Time",
  "salary": "650",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Amazon US Marketplace Online Arbitrage Sourcing VA\n\r\nPosition Overview:\r\nWe are looking for an experienced Amazon US Marketplace Online Arbitrage Sourcing VA with at least 2 years of experience to join our team. \n\r\n- The ideal candidate will be able to adapt quickly, work efficiently, be open to criticism, communicate often and effectively, possess the ability to think critically, and consistently find high-quality leads. \r\n- The candidate must be open to source products in any category, as assigned by the manager. \r\n- The ideal candidate should have experience working with a lead list or managing a team of at least 2 VAs. \n\r\nThis role is performance-based, with the potential for pay increases contingent upon achieving results. \n\r\nA two-week trial period will be conducted to assess compatibility and performance. (No Access to Software Tools, paid-per-lead)\n\r\nKey Responsibilities:\r\nFind high-quality leads daily, with feedback provided on a daily basis. \r\nDaily Leads review and filter out quality leads for delivery. \r\nEager to learn.\r\nAdjust quickly to changing processes and business needs with minimal supervision.\r\nMaintain effective communication with the team and managers.\r\nLeads review and checking.\r\nUnderstanding ungating terminologies and incorporating them into your leads. \r\nProvide detailed analysis and purchasing notes. \n\r\nRequirements:\r\n1. Minimum of 2 years of experience in online arbitrage in the Amazon US marketplace\r\n2. Minimum 8 leads per day or 25 approved leads quota on a 40-hour full-time work week. You can source 40 leads, but not all of them will be approved—the more the merrier. \r\n3. Sourcing criteria will be provided if you apply with your resume. \r\n4. Ability to deliver daily leads that meet the business's quality expectations\r\n5. Strong internet connection for seamless online work\r\n6. Flexibility in schedule to accommodate business needs. Work weekends if needed.\r\n7. Good communication skills and the ability to take feedback constructively\r\n8. Leads checking and reviewing. \r\n9. Input data in Google Spreadsheets. \r\n10. Follow a work schedule and a deadline. \r\n11. Produce leads that meet criteria and adapt to new changes quickly.\r\n12. Detail-oriented and has their own sales and deals tracking systems.  \n\r\nReply to the below in your application (ALL AI responses will be disqualified):\r\n1. Is BSR important for sourcing products to sell on Amazon?\r\n2. List five websites or retailers that provide documents that enable brands to sell on Amazon.\r\n3. How do you tell if a listing has IP complaints apart from a brand regating issue?\r\nReply with the word \"hard\" along with your answers. \n\r\n- Bonus point if you know which website provides invoices that Amazon accepts. \r\n- Bonus point if you worked for a leads list before. \r\n- Bonus point if you know the sales cycle times for different websites. \n\r\nCompensation & Benefits:\r\nBi-weekly pay\r\nOpportunity for pay increases based on lead performance and average daily lead quality\r\nPerformance is based on daily lead quota and deadlines. Flexible schedule.\r\nReply to this job description with what you like to eat for breakfast \r\nWeekly meetings to ensure education and personal growth.\r\nBirthday Gift Cards\r\n5 days per year PTO\r\n25 hours of sick days per year. \r\nPerformance-based cash rewards\r\nReasonable boss. \r\nWe honor PH holidays, and you will have off. \n\r\nTrial Period:\r\nWe will pay you $100 for two weeks of trial run, with an 8-hour full-time work day and a 40-hour weekly schedule. \r\n Keepa/listing analysis skills will be tested during interviews. Expect to analyze a pre-picked listing on the fly. Fluency in English is a must.  Please send a video recording of you explaining and interpreting a listing. \r\nHaving a good internet connection is a must.\r\nSource products according to our criteria. If your past experiences used different criteria, you have 1-2 days to adapt to the new criteria. \r\nYou will pay for your own Keepa and Selleramp Subscriptions.\r\nReply \"Yes, I understand, I will not waste your time\" if you have read this far\r\nA 2-week trial period to assess performance and fit within the team.\r\nWe'd love to hear from you if you are a proactive and results-driven sourcing VA with a proven track record in online arbitrage!\n\r\nPlease apply with the following and include the word \"Done\" in your application.\r\n- A screenshot of your internet speed\r\n- Your computer setup\r\n- A 2-minute self-introduction and a 10-minute video for sourcing analysis (please explain from where you start to where you finish)\r\n-  An updated resume\r\n- 5 sample leads in 5 different categories (no shoes and apparel)",
  "skill_requirements": [
    "Amazon",
    "Product Sourcing",
    "Online Arbitrage"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:20:27.414551",
      "reason": "Job first discovered"
    }
  ]
}