{
  "job_id": "1414789",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Digital-Marketing-Assistant-Media-Buying-Copywriting-Meta-Google-Ads-1414789",
  "scraped_at": "2025-07-15T15:39:42.367484",
  "title": "Digital Marketing Assistant (Media Buying + Copywriting) – Meta & Google Ads",
  "type_of_work": "Part Time",
  "salary": "700 USD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re a performance-driven digital marketing agency with clients across events, e-commerce, clinics, personal brands, and more. We specialize in paid advertising that gets real results — and now we’re looking for a smart, fast, and reliable Digital Marketing Specialist to help us scale even further.\n\r\nThis role is media buyer-focused — execution, analysis, setup, and support. You’ll be helping our senior strategist set up and manage campaigns across Meta Ads (Facebook/Instagram) and Google Ads, with additional tasks like writing copy, checking tracking, and putting together reports or presentations.\n\r\nIf you’re well-rounded, eager to learn, and sharp with paid ads, this is for you.\n\r\nWhat You'll Do:\n\r\n- Launch, monitor, and optimize campaigns on Meta Ads and Google Ads\r\n- Follow clear instructions to implement setups in-platform (audiences, placements, budgets, objectives, etc.)\r\n- Double-check and help set up pixel tracking, events, UTM parameters\r\n- Write short, clear, compelling ad copy (headlines, descriptions, captions)\r\n- Assist with campaign performance reports and client-ready presentations\r\n- Execute tasks quickly and accurately using SOPs and tools\n\r\nWhat We're Looking For:\n\r\n- 2+ years experience in paid advertising (Meta and/or Google Ads specifically)\r\n- Strong understanding of ad account structure, targeting, and optimization\r\n- Comfortable with performance-focused marketing, not just brand awareness\r\n- Solid copywriting ability — headlines, body text, ad hooks\r\n- Familiar with pixels, custom events, Google Tag Manager, etc.\r\n- Fluent English (written and spoken)\r\n- Strong attention to detail, reliable, and takes initiative\n\r\nNice to Have (Not Required, But Helpful):\n\r\n- Experience with creative strategy (angles, hooks, value props)\r\n- Familiarity with Canva and/or PowerPoint\r\n- Minor video editing skills (for reels, ad creatives, UGC-style content)\r\n- Understanding of landing pages and CRO principles\n\r\nAbout Us:\n\r\nWe’re a lean but high-performance team working across multiple industries and countries. Our clients trust us to drive measurable growth, and we do it through clear strategy, excellent execution, and deep platform knowledge.\n\r\nYou’ll be working directly with experienced media buyers who have managed millions in ad spend, and you’ll be exposed to the full process of building, launching, and scaling winning campaigns.\n\r\nPlease apply here:\n\nUpgrade to see actual info/forms/d/e/1FAIpQLSeR8809VtYzhreixIr1fRlB2XJxJ4rNPCjGXO-10fxP_TwTIg/viewform?usp=dialog",
  "skill_requirements": [
    "Copywriting",
    "Google Ads",
    "Facebook Ads"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:29:59.635602",
      "reason": "Job first discovered"
    }
  ]
}