{
  "job_id": "1414889",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-VIdeo-Editor-full-time-1414889",
  "scraped_at": "2025-07-15T15:44:47.523457",
  "title": "Experienced VIdeo Editor (full time)",
  "type_of_work": "Full Time",
  "salary": "950-1050",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Here are more details about the position:\r\nFully remote, independent contractor, direct hire for a US company\r\nPermanent position, full time 40 hours per week\r\nThis is for an e-commerce company in the US\r\nWork schedule: Tuesday - Saturday, 5:00 AM – 2:00 PM Philippine Time (PHT) (this is non flexible, and non negotiable)\r\nOffer: 950 - 1,050 USD per month + see benefits below\n\r\nWe're seeking a dynamic Video Editor who understands the nuances of creating\r\ncompelling content for today's fast-paced social media landscape.\n\r\nWe are a direct-to-consumer brand incubator; focused on creating products\r\nthat people love. Today, we own and operate a portfolio of brands with products that put you\r\nfirst. We take a unique approach to each brand and every product, making sure that we are\r\nfulfilling a real need while helping to shift the status quo.\n\r\nThis is an excellent opportunity for a highly motivated individual, eager to excel in a fast-paced\r\nand growth-centric setting. We're looking for someone who understands Video Editing best\r\npractices, is deadline-oriented, and detail-focused, and has thrived in a remote role.\n\r\nResponsibilities\r\n? Utilize CapCut to create innovative and visually appealing videos.\r\n? Testing new AI video editing software tools and conducting training with respective video\r\neditors to improve their efficiency and quality when creating social media ads.\r\n? Platform-Specific Video Creation: Design and edit video ads tailored for Facebook,\r\nInstagram, YouTube, and TikTok, ensuring each video is optimized for its respective\r\nplatform.\r\n? Engaging Content Creation: Produce videos that not only look great but also captivate\r\nviewers within the first few seconds, effectively \"stopping the scroll.\"\r\n? Footage Integration: Seamlessly integrate internal video footage with stock footage,\r\nensuring a cohesive and engaging narrative.\r\n? Text & Animation: Implement compelling text overlays and animations to enhance the\r\nvideo's message. Proficiency in Adobe After Effects to create animations is a significant\r\nplus.\r\n? Sound Design: Select and integrate music tracks that resonate with the video's\r\nmessaging and amplify viewer engagement.\r\n? Target Audience Connection: Understand and implement video editing techniques that\r\nresonate with the target customer for the specific product or brand being advertised.\r\n? Collaboration: Work closely with the marketing and content teams to align on campaign\r\nobjectives and creative direction.\r\nRequirements\r\n? 2+ years of video editing experience\r\n? Experience in editing videos, making ones for social media or documentaries are a plus\r\n? Openness and current experience when experimenting with AI tools that can improve\r\ncurrent workflows in terms of efficiency and quality output.\r\n? Proficiency in Adobe Premiere Pro and Adobe After Effects; experience with CapCut or\r\nAI editing tools is a plus.\r\n? A strong portfolio showcasing your best video edits for social media and/or\r\ndocumentaries that show your ability to visually tell a story\r\n? Exceptional attention to detail and a keen eye for storytelling through visuals.\r\n? Ability to work in a fast-paced environment\r\n? Excellent communication skills, both written and verbal in English\r\n? A deep understanding of social media trends and the evolving nature of digital consumer\r\nbehavior\n\r\nBenefits\r\n? Fully Remote Position\r\n? Observed Local Philippine Holiday's\r\n? Bonus Program\r\n? Paid Vacation\r\n? HMO Plan after 6 month probationary period\n\r\nTo apply:\r\n1. PDF FILE - Send links to examples of your best video work\r\n2. Link to a 2 minute video introduction of you and your work as video editor\r\n3. Link to your complete online portfolio or a link to your Canva site (Canva site has to be downloadable), or a Google drive link to your portfolio (preferably a file, not folders)\r\n4. Asking salary in USD, monthly rate, 40 hours per week\n\r\nKindly email to Upgrade to see actual info with subject: Video Editor application for Ecom.",
  "skill_requirements": [
    "Video Content Creation",
    "Video Editing",
    "CapCut"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:33:11.152938",
      "reason": "Job first discovered"
    }
  ]
}