{
  "job_id": "1414281",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SEO-Content-Specialist-1414281",
  "scraped_at": "2025-07-15T15:44:52.391126",
  "title": "SEO Content Specialist",
  "type_of_work": "Full Time",
  "salary": "$6 to $9 USD per hour, depending on experience",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the role\n\r\nThe SEO & Product Content Coordinator is responsible for driving content accuracy, discoverability, and brand consistency across Sunco's digital platforms. This role focuses heavily on SEO best practices, crafting optimized product titles, metadata, and descriptions, while maintaining up-to-date and conversion-driven content across Shopify, Amazon, and other digital assets.\n\r\nThe ideal candidate has a sharp eye for detail, strong English writing skills, and an analytical mindset to support SEO initiatives, blog research, and ongoing content enhancements. This position works cross-functionally with Product, Marketing, Design, and Content teams to support new product launches, platform accuracy, and long-term search performance.\n\r\nWhat you'll do\r\nSEO-Focused Product Copywriting: Write keyword-optimized product titles, brief descriptions, and metadata for Shopify, Amazon, and product packaging. Includes SEO research, formatting adherence, and multilingual caution text (provided templates).  \r\nContent QA Across Platforms: Review content across Amazon, Shopify, Figma, and Upgrade to see actual info for consistency, brand tone, grammar, and product data accuracy.  \r\nShopify & Google Metadata: Write, optimize and maintain metadata for Shopify listings, including SEO descriptions for Google search previews. Update comparison charts with new SKU data.  \r\nAlt Text for Shopify Blocks: Create SEO-optimized, descriptive alt text for all images in Shopify Enhanced Brand Content (A+), improving accessibility and search performance.  \r\nAmazon & Shopify Listings Maintenance: Write product titles and bullet points using structured templates and keyword research. Review listings against product documentation to ensure accuracy and keyword integrity.  \nUpgrade to see actual info Copy Updates: Revise and optimize Upgrade to see actual info category and landing page copy to improve clarity, performance, and alignment with SEO goals.  \r\nVoiceover Copy for Product Videos: Draft engaging voiceover scripts for product videos using ElevenLabs, ensuring tone and clarity align with brand standards.  \r\nSEO Research for Blog Content: Conduct keyword and topic research for blog articles, providing foundational SEO insights and content outlines for Sunco’s editorial strategy.  \r\nAmazon Comparison Chart Accuracy: Audit and update Amazon comparison charts to ensure all SKUs are included, correctly formatted, and keyword-aligned.  \r\nYouTube Content Maintenance: Ensure YouTube descriptions, product links, and video titles remain accurate and optimized for discoverability.  \r\nNew Product Naming: Generate on-brand, SEO-friendly product name suggestions for new product launches.  \r\nNegative Customer Experience (NCX) Monitoring: Monitor Amazon listings for patterns of negative customer feedback (e.g., low ratings, recurring complaints), flag high-priority issues, and suggest copy or content updates to reduce friction and improve clarity.  \r\nProduct Manual, Listing Asset, and Spec Sheet Revisions: Review and revise product manuals, Spec Sheets, and LIsting Assets for grammar, clarity, accuracy, and alignment with updated product specs and branding guidelines.  \n\r\nQualifications\r\n3–5 years of relevant experience in SEO content writing or digital marketing.\r\nStrong SEO and content writing skills, with a focus on technical content such as case studies, white papers, product descriptions, blog posts, and landing pages.\r\nProven experience creating SEO-optimized content for e-commerce websites or digital platforms.\r\nNative-level English fluency with exceptional grammar, syntax, and clarity in written communication.\r\nDeep understanding of search engine algorithms and the ability to adapt to frequent changes in SEO trends.\r\nProficiency with SEO tools such as Ahrefs, SEMrush, Google Keyword Planner, or similar platforms for keyword research and performance tracking.\r\nFamiliarity with platforms including Shopify, Amazon Seller Central, Figma, and ElevenLabs is a plus.\r\nStrong knowledge of SEO best practices, including keyword research, metadata structuring, and on-page optimization.\r\nExperience with content QA processes, CMS platforms, and metadata management is highly preferred.\r\nHighly detail-oriented, with excellent organizational skills and the ability to manage content across multiple channels.\r\nCapable of juggling multiple projects and meeting deadlines in a fast-paced, collaborative environment.\r\nSelf-starter with a proactive mindset and strong communication skills to work effectively across cross-functional teams. \n\r\nAdditional Requirements  \r\nAvailability to work 8 AM to 5 PM Pacific Time zone \r\nReliable internet access and a private remote workstation. \n\r\nHow to apply \r\nPlease send your application here:\nUpgrade to see actual info\n\r\nJob Type: Remote (International Contractor)",
  "skill_requirements": [
    "SEO",
    "Ahrefs",
    "Semrush"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:33:35.177470",
      "reason": "Job first discovered"
    }
  ]
}