{
  "job_id": "1414395",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Performance-Obsessed-Video-Editor-for-UGC-Ads-MetaFacebookIG-1414395",
  "scraped_at": "2025-07-15T06:37:15.290068",
  "title": "Performance-Obsessed Video Editor for UGC Ads (Meta/Facebook/IG)",
  "type_of_work": "Full Time",
  "salary": "1600-2500",
  "hours_per_week": "35",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Performance-Obsessed Video Editor for UGC Ads (Meta/Facebook/IG)\n\r\nIf your idea of \"creative\" is just smooth transitions and trendy templates…\n\r\nIf you've never touched a UGC ad that scaled cold…\n\r\nThis isn’t for you.\n\r\nWe’re looking for a full-time, hungry partner that's excited to work hand in hand with our Creative Strategist to obsess over making ads that convert, not just over what makes them look good.\n\r\nWho We Are:\n\r\nWe’re two young, fast-moving ecom founders scaling a beauty brand that’s already done 7-figures. Our hero product — Batana Oil — is converting in 7+ countries, and we’re scaling FAST.\n\r\nThe product hits.\r\nThe offer works.\r\nNow we need YOU to help us explode our reach on Meta platforms.\n\r\nYour Mission if you choose to accept it:\n\r\nCreate high-converting UGC video ads (Meta/FB/IG) alongside our creative strategist and founders.\n\r\nYou'll:\n\r\nEdit fast, iterate fast — learn to understand what works and tie it into future ads\n\r\nYou will have the script, the guidance and storyboard to build ad creatives with punchy hooks and emotional storytelling\n\r\nUse AI tools (like ElevenLabs etc.) to really bring the story together \n\r\nHave discussions with the creative strategist to relate ad performance (CTR, hook rate, thumbstop rate) to the creative process and optimize based on data\n\r\nBring your own creative ideas to the table, everyone on the team really makes the role what they want it to be - want to learn creative strategy? Try your hand at graphic design? The floor is yours\n\r\nWork directly with founders — no, you wont' have anyone breathing down your neck, yes you might exchange some GIFs throughout the week\n\r\nYou’re a Fit If You:\n\r\n- Have edited UGC-style ads that scaled cold Meta campaigns\n\r\n- Understand performance metrics like hook rate, CTR, CVR, thumbstop rate\n\r\n- Can create killer hooks, envision exactly the BRoll that can bring an ad alive\n\r\n- Have used AI tools like ElevenLabs to create high-performing assets\n\r\n- Have created UGC mashups or compilations that tell a story\n\r\n- Worked on ads for beauty, skincare, or DTC brands\n\r\n- Are looking for long-term, full-time growth — not just project-based gigs\n\r\nDo NOT Apply If:\n\r\n- You think creative testing = changing fonts\n\r\n- You’ve never worked on data-driven ads\n\r\n- You need someone to tell you what to do every step of the way\n\r\n- You don't care how the content performs after it's posted\n\r\nWHY NOW?\n\r\nWe’re scaling aggressively — spending more, testing faster, and breaking into new markets.\n\r\nYou’ll be part of the core team during a pivotal growth phase. If you’ve ever wanted to get in before a brand pops off, this is your chance.\n\r\nHOW TO APPLY:\n\r\nSend us:\n\r\n-  A link to your portfolio, GDrive, or Dropbox with your best work (Bonus if you have performance stats)\n\r\n- A Loom video or written message on why you’re the creative weapon we’re missing\n\r\nWe’re building a category leader — an A level team that has fun in the trenches building something great and you’ll play a direct role in shaping that.\n\r\nReady to build winners?\n\r\nLet’s dominate this space together.",
  "skill_requirements": [
    "Facebook Ads",
    "Video Editing",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": []
}