{
  "job_id": "1414041",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Tech-Driven-VA-GHL-Kajabi-Specialist-for-Digital-Businesses-1414041",
  "scraped_at": "2025-07-15T12:29:41.072713",
  "title": "Tech-Driven VA | GHL & Kajabi Specialist for Digital Businesses",
  "type_of_work": "Part Time",
  "salary": "Negotiable",
  "hours_per_week": "35",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're Hiring: Tech VA & Funnel Strategist (Think: Second Me)\n\r\nWe’re looking for a high-performing tech VA who can think strategically and execute precisely , someone who can run funnels, manage integrations, troubleshoot issues, and streamline our backend operations just like I would.\n\r\nYou’ll work across Go High Level (GHL), Kajabi, Zapier, and WordPress to help manage everything from funnel builds to automation cleanups to website updates and more.\n\r\nBuild and manage funnels inside GHL (landing pages, automation, triggers, tagging, etc.)\n\r\n-Update and organize our Kajabi members library (products, offers, tags, expirations).\r\n-Set up and troubleshoot Zapier automations.\r\n-Build and update WordPress pages (Divi, Elementor, or basic builder).\r\n-Assist in funnel strategy — know when to use tripwires, upsells, follow-up flows.\r\n-Set up tracking (pixels, Deadline Funnel, UTM parameters, GHL analytics).\r\n-QA funnels and automations - making sure they actually work before launch.\r\n-Collaborate on launch planning and timelines (pre-launch, cart open/close, webinar flows).\n\r\nMust-Have Experience:\n\r\n-Proficiency in Go High Level (funnels, automations, calendars, SMS, Emails, What is your favorite meal of all time)\r\n-Deep familiarity with Kajabi (products, library, tagging logic)\r\n-Comfort with Zapier (multi-step zaps, conditional logic)\r\n-Website editing via WordPress (preferably Divi or Elementor)\r\n-Understanding of funnels (not just how to build, but when to use what and why)Comfortable with basic analytics & tracking (UTMs, link tracking, and stats dashboards).\n\r\nThis Is NOT for You If:\n\r\n-You freelance with 6 other clients and deliver late without updates.\r\n-You don’t communicate proactively or go MIA mid-project.\r\n-You get bored watching content or tuning systems that already work.\n\r\nThis IS for You If:\r\n-You thrive when things are organized, working, and optimized.\r\n-You enjoy learning from the content while working with it.\r\n-You take full ownership and don’t wait to be told what to do.\r\n-You love improving systems, solving tech puzzles, and optimizing funnels.\n\r\nTo apply, use your answer to my question as the subject line AND:\r\n1. Your CV or resume.\r\n2. 2–3 examples of funnels or automations you've built.\r\n3. Your hourly rate.\r\n4. Your availability (per week and time zone).",
  "skill_requirements": [
    "Clickfunnels",
    "Kajabi",
    "Zapier"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:31:37.468463",
      "reason": "Job first discovered"
    }
  ]
}