{
  "job_id": "1415838",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Accountant-1415838",
  "scraped_at": "2025-07-15T14:26:37.536047",
  "title": "Accountant",
  "type_of_work": "Full Time",
  "salary": "50,000-70,000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking highly organised and detail-oriented Accountants to join our company, one of the largest international manufacturers of Water Control Solutions. This role involves managing and overseeing day-to-day financial transactions, supporting month-end and year-end reporting, and ensuring compliance with Australian accounting standards.\n\r\nThe role collaborates with cross-functional teams to drive financial accuracy and deliver insights that inform strategic decisions.\n\r\nKey Responsibilities:\n\r\nPrepare and review general ledger entries, reconciliations, and journal adjustments\r\nManage accounts payable and receivable processes, ensuring timely invoicing and payments\r\nReview and assist with payroll systems and support the Senior Accountant with reconciliations or ad-hoc reporting\r\nCoordinate and execute month-end and year-end close activities, including financial statement preparation\r\nMonitor cash flow, budgeting, and forecasting activities; provide variance analyses\r\nEnsure compliance with AASB, Taxation Administration Act, GST, and other relevant legislation\r\nSupport audit processes by providing schedules, analyses, and documentation\r\nLiaise with external advisors, including auditors, tax agents, and financial institutions\r\nIdentify process improvement opportunities within the finance function\n\r\nQualifications and Certifications:\n\r\nBachelor’s degree in Accounting, Finance, or a related field\r\nQualified Certified Public Accountant\r\nWith Senior Accountant role experience \r\nDemonstrated continuing professional development in accounting standards and taxation \n\r\nSkills and Competencies:\n\r\nAdvanced proficiency in accounting software (e.g. Xero, MYOB, QuickBooks) and MS Excel\r\nKnowledge and experience in Australian payroll processes\r\nStrong analytical skills with an eye for accuracy and detail\r\nExcellent communication skills, both written and verbal\r\nAbility to manage multiple tasks, meet deadlines, and work independently\r\nSound understanding of Australian taxation laws, payroll, and superannuation requirements\r\nCollaborative mindset with stakeholder management capabilities\n\r\nExperience:\n\r\nMinimum of 5 years of experience in an industry accounting or finance role \r\nSolid experience working with Australian clients in a commercial accounting role, preferably in the manufacturing industry\r\nProven track record of managing full-cycle accounting processes\r\nExposure to audit engagements and financial reporting under the Australian Accounting Standards\n\r\nTools and Software Experience:\n\r\nMS Excel\r\nMicrosoft 365\r\nXero, MYOB, QuickBooks",
  "skill_requirements": [
    "Xero",
    "Payroll",
    "Financial Accounting"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:27:35.804737",
      "reason": "Job first discovered"
    }
  ]
}