{
  "job_id": "1415795",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Assistant-Sales-Support-Executive-1415795",
  "scraped_at": "2025-07-15T12:24:07.860345",
  "title": "Sales Assistant / Sales Support Executive",
  "type_of_work": "Any",
  "salary": "30000 Php/Month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us:\r\nBuck Sports is a Melbourne-based company specializing in custom apparel solutions. We are dedicated to delivering high-quality, personalized sportswear to our clients. As we expand our operations, we are seeking a proactive and experienced Sales Assistant to join our remote team in the Philippines.\n\r\nPosition Objective\n\r\nTo support the sales team in client follow-up, relationship management, and pre-sales coordination. The role ensures a smooth sales process, enhances client satisfaction, and helps secure long-term, mutually beneficial partnerships.\n\r\nKey Responsibilities\r\n1. Client Follow-Up & Reminder System\r\n(Client-Centric Growth, Real Human Partnerships)\n\r\nFollow up every 2 weeks with clients who place regular and stable orders to maintain continuity and service quality.\n\r\nReconnect with clients who previously placed orders but have not ordered in the past month, identifying changes and new needs.\n\r\nProactively reach out to high-potential clients to assist the sales team in scheduling meetings and building trust.\n\r\n2. Client Profile Collection & Management\r\n(People First, Simplicity in Customization)\n\r\nCollect and organize information such as: company founding year, size, team count, product focus, main clients, and business model.\r\nConduct monthly phone calls with clients to gather feedback on EDM (email marketing) campaigns.\r\nEnsure a continuous monthly update cycle of client data to keep records up to date and actionable.\n\r\n3. Sales Meeting Support & Client Needs Mapping\r\n(Client-Centric Growth, Simplicity in Customization)\n\r\nAssist in preparing for internal sales meetings to review client profiles and identify fit between client needs and Bucksports solutions.\r\nIdentify specific points of client interest and help align product offerings accordingly.\n\r\n4. Email Marketing (EDM) Support\r\n(One-Stop Product Solutions, Innovation in Communication)\n\r\nCreate and send one EDM per week to promote key products and services.\r\nDistribute weekly EDMs to prospective clients and track their engagement.\r\nAnalyze EDM feedback, organize responses, and coordinate with sales to improve targeting and content.\n\r\n5. Client Relationship Management & Scheduling\r\n(Real Human Partnerships, Proudly Australian)\n\r\nUpdate and review the list of priority clients with the sales team monthly (max. 15 clients per rep). Remove inactive ones and add new potential clients.\r\nAssist sales with weekly follow-ups on key accounts and ensure high service priority.\r\nSchedule monthly client meetings (for both active and inactive clients) to support relationship building and trust.\n\r\n6. Order Fulfillment & Supplier Coordination Support\r\n(One-Stop Product Solutions, Innovation in Cotton Sublimation)\n\r\nMonitor production quality, sampling timelines, and delivery deadlines; ensure feedback is communicated to relevant teams.\r\nHelp maintain a stable supply chain and pre-sales process, ensuring Bucksports consistently shows up for clients and secures new inquiries.\n\r\nRequirements\n\r\nEducation Diploma or above; majors in marketing, business, or sales preferred\r\nWork Experience Experience in sales support, customer service, or order coordination preferred\r\nCommunication Excellent verbal and written communication skills, especially via phone and email\r\nCoordination Able to manage multiple sales reps and prioritize tasks effectively\r\nLearning Ability Quick to understand new products and adapt to the custom apparel industry\r\nTools & Systems Familiar with Google Workspace, Excel, CRM platforms, and EDM tools\r\nWork Attitude Proactive, detail-oriented, responsible, and client-focused",
  "skill_requirements": [
    "Outbound Sales",
    "Trustee Sales Tracking",
    "Sales"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:23:31.252459",
      "reason": "Job first discovered"
    }
  ]
}