{
  "job_id": "1415793",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Quality-Assurance-Manager-1415793",
  "scraped_at": "2025-07-15T15:47:18.137654",
  "title": "Quality Assurance Manager",
  "type_of_work": "Full Time",
  "salary": "2000 - 4000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "QA Manager (Manual Testing)\r\nPhilippines-based | FinTech Industry | EST Work Hours Required\r\n**Experience in FinTech is required.**\r\n**This role requires full alignment with Eastern Time Zone working hours (including daily morning scrums).**\n\r\nAbout Us\r\nWe are a well-funded and highly experienced FinTech startup founded by veterans from Wall Street and Silicon Valley. Our mission is to democratize access to trading and investment platforms using decades of expertise in financial markets and cutting-edge AI.\r\nAbout the Role\r\nWe are seeking a QA Manager to lead our manual QA team in ensuring the reliability, stability, and high performance of our multi-platform financial software products. This is a leadership role for someone who thrives in fast-paced, startup environments and has a strategic mindset, strong quality advocacy, and people management skills.\n\r\nAs our QA Manager, You will manage a team of QA Specialists, define and maintain quality standards, oversee testing operations, and work closely with cross-functional teams to ensure that our releases are production-ready and customer-focused.\r\nKey Responsibilities\r\nLead and mentor a team of QA Specialists, driving a culture of quality, accountability, and continuous improvement.\r\nDevelop, own, and refine QA strategies, processes, and test plans for Web platform.\r\nCollaborate with Product, Engineering, and Design teams to understand product requirements and ensure complete test coverage.\r\nOversee and participate in test planning and execution (functional, regression, integration, exploratory, UAT).\r\nEnsure proper defect lifecycle management through tools such as Jira.\r\nEstablish and track QA KPIs and metrics for reporting and continuous feedback.\r\nReview and optimize existing QA workflows to reduce manual effort and improve release velocity.\r\nEnsure high standards of documentation for test cases, test results, and QA reports.\r\nParticipate in release planning and risk assessments to ensure product readiness.\n\r\nRequired Skills and Qualifications\r\nProven leadership experience in QA or Software Testing, with at least 2 years in a QA management or lead role and 7+ years overall in QA.\r\nStrong knowledge of QA methodologies, tools, and best practices.\r\nExperience working in FinTech or other highly regulated, complex software environments.\r\nProficient in test management tools (e.g., Jira, TestRail) and defect tracking systems.\r\nDeep experience testing across web applications both consumer apps as well as enterprise level applications.\r\nStrategic thinker with a hands-on approach and ability to operate independently.\r\nExcellent verbal and written communication skills; able to clearly articulate QA goals, risks, and status to stakeholders.\r\nExperience working in both startup and enterprise environments.\r\nHighly detail-oriented with excellent analytical and problem-solving abilities.\n\r\nBonus Points For\r\nExperience guiding manual testing teams through the transition toward automation (even if not hands-on with automation tools).\r\nPrior exposure to AI/ML-driven product environments or financial APIs.\n\r\nAdditional Info\r\n• This is a remote position but follows Eastern Time (EST) hours.\r\n• Occasional travel may be required for team alignment or strategic planning sessions.",
  "skill_requirements": [
    "Quality Assurance",
    "Team Leadership",
    "Manual Testing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:47:18.139661",
      "reason": "Job first discovered"
    }
  ]
}