{
  "job_id": "1416341",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Copywriter-1416341",
  "scraped_at": "2025-07-15T15:41:08.507914",
  "title": "Copywriter",
  "type_of_work": "Full Time",
  "salary": "$5/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us: GrumpyHare is a growing hosting company helping real estate investors succeed online with high performance websites. We recently launched our Done For You services, focused on simple, effective SEO strategies that attract motivated seller leads and drive organic growth. Our mission is to deliver clean, ethical SEO solutions that build long lasting results while protecting our clients' credibility and online reputation.\n\r\nRole Overview: We’re looking for an experienced copywriter who thrives in a fast-paced, detail-oriented environment. In this role, you'll write and edit SEO optimized content that reflects our clients’ brand voice and supports their business goals with the Real Estate Investing world. You must have a strong understanding of content strategy, on-page SEO, excellent writing and grammar skills, and a passion for delivering polished, client-ready work.\n\r\nKey Responsibilities:\r\n- Write engaging, high-quality content for websites and blogs that are SEO focused within the real estate investing space\r\n- Edit and proofread content for clarity, consistency, and alignment with brand guidelines\r\n- Collaborate with your manager, the SEO team, web build team and the DFY manager to ensure all content meets strategic goals and SEO best practices\r\n- Apply SEO principles, including keyword research, writing metadata, and internal linking\r\n- Review content for grammar, tone, structure, and keyword use before final delivery\r\n- Manage multiple client projects while staying on deadline\r\n- Stay up to date with SEO trends and Google algorithm updates\n\r\nQualifications\r\n- 5 or more years of professional copywriting experience, ideally in real estate, digital marketing, or SEO\r\n- Exceptional writing, editing, and proofreading skills\r\n- Strong understanding of SEO best practices and on-page optimization\r\n- Excellent communication skills with the ability to adapt tone and style\r\n- Comfortable using Google Docs, WordPress, and basic HTML\r\n- Experience with project management platforms like Upgrade to see actual info, Asana, or Trello\r\n- Self motivated, organized, and comfortable working remotely\n\r\nWhy Join Us?\r\n- Join a team passionate about ethical, simple SEO practices.\r\n- Use your skills to make a visible impact with minimal complexity.\r\n- Thrive in a supportive, collaborative environment.\n\r\nHow to Apply:\r\nSend the following to Ria at Upgrade to see actual info CC Upgrade to see actual info\r\n- Your updated resume\r\n- A portfolio showcasing your sample write-ups\r\nPlease include \"Copywriter” in the subject line.\n\r\nNOTE: Applications missing any of the above requirements will not be reviewed.\n\r\nThank you and we can’t wait to hear from you!",
  "skill_requirements": [
    "Copywriting",
    "Article Writing",
    "Content Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:28:46.370638",
      "reason": "Job first discovered"
    }
  ]
}