{
  "job_id": "1416274",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Accounting-Specialist-VA-1416274",
  "scraped_at": "2025-07-15T12:30:08.270412",
  "title": "Accounting Specialist VA",
  "type_of_work": "Full Time",
  "salary": "$5.50/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Accounting Specialist: Join a Team Built on Trust and Growth\n\r\nRequirement: Must be able to work during US time (Pacific)\n\r\nAre you a highly ethical and loyal accounting professional with a strong work ethic? Do you thrive in an environment where your hard work directly contributes to the success and stability of a company?\n\r\nWe're seeking a dedicated Accounting Specialist to join our team, offering not just a job, but a long-term commitment where your character and contributions are truly valued.\n\r\nIn this vital role, you'll work closely with our Accounting Manager, playing a key part in maintaining impeccable financial records and ensuring our continued compliance. We're looking for someone with unwavering integrity and a keen eye for detail to help us uphold our financial health and operational excellence.\n\r\nWhat You'll Do:\r\n- Manage daily accounting operations: Handle accounts payable, general ledger entries, and various financial reports, resolving vendor inquiries efficiently.\r\n- Reconcile accounts with precision: Conduct thorough monthly reconciliations for bank, credit card, and various balance sheet accounts.\r\n- Ensure financial accuracy: Perform accounting research, resolve discrepancies, and generate essential ad-hoc reports.\r\n- Collaborate and contribute: Partner with departments to ensure accurate financial reporting and support seamless month, quarter, and year-end close processes.\r\n- Process critical tax payments: Accurately handle federal, multi-state payroll, sales, and other tax payments.\r\n- Drive continuous improvement: Identify opportunities to streamline processes and propose effective solutions.\r\n- Provide administrative support: Offer general administrative assistance to all departments, showcasing your adaptability and helpfulness.\n\r\nWhat You'll Bring:\r\n- Experience: 2-4 years of accounting or bookkeeping experience, with a plus for restaurant or retail industry exposure.\r\n- Expertise: Solid grasp of accounting principles, GAAP, and accrual-based accounting.\r\n- Tech-Savvy: Proficiency in advanced Excel functions (pivot tables, VLOOKUP, SUMIF) and experience with Sage Intacct or similar accounting software.\r\n- Exceptional Qualities: Meticulous attention to detail, strong analytical and organizational skills, and a self-motivated, team-oriented approach.\r\n- Problem-Solver: Ability to prioritize, problem-solve, and multi-task effectively in a dynamic environment.\r\n- Trustworthy: Demonstrated ability to handle confidential information with the utmost integrity and discretion.\r\n- Adaptable: Capable of managing diverse workloads and evolving responsibilities as our business grows.\r\n- Positive Mindset: A proactive, positive attitude and a commitment to continuous improvement.\n\r\nEducation:\r\nA four-year accredited bachelor's degree in accounting is strongly preferred.\r\nCertified Public Accountant desired.\n\n\r\nHours & Pay:\r\n40 hours/week Mon–Fri 9a.m.–5:00p.m. Pacific....with the converted time this is actually 12am-8am Philippine time (technically Tuesday-Saturday)\n\r\n$5.50/hour\n\r\n1 year guaranteed raise\n\r\nPaid lunch included\n\n\n\r\nDon't apply if:\r\n-you are not comfortable with a time tracker (Time Doctor or similar) that takes screenshots of your work day\r\n-you have a job that conflicts with this schedule\n\n\r\nHOW TO APPLY: \nEmail us at Upgrade to see actual info with the subject line \"Accounting Specialist VA\" to apply for this role.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:36:16.868226",
      "reason": "Job first discovered"
    }
  ]
}