{
  "job_id": "1416306",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Tiktok-Ads-Specialist-1416306",
  "scraped_at": "2025-07-15T12:33:08.602823",
  "title": "Tiktok Ads Specialist",
  "type_of_work": "Part Time",
  "salary": "$10/hr",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Position Overview:\r\nWe’re hiring a Paid Media Specialist VA to manage advertising across TikTok (Ads and TikTok Shop) as well as Pinterest, Snapchat, and X/Twitter. This role is not about starting from scratch, it’s about bringing tight daily execution, quality control, and creative coordination to a set of platforms where the brand already has presence and performance data.\n\r\nYou’ll work closely with the internal creative team to deploy assets into campaigns, manage platform-level nuances, catch potential issues before they go live, and compile ongoing reports on performance across each channel.\n\r\nKey Responsibilities:\n\r\nTikTok Advertising and TikTok Shop Campaigns\r\nSet up, monitor, and optimize TikTok Ads for both traffic and conversion\r\nRun TikTok Shop Ads, ensuring accurate setup, catalog connections, and promo timing\r\nFlag and troubleshoot any platform issues or attribution inconsistencies between the two\n\r\nSecondary Channel Management (Pinterest, Snapchat, X/Twitter)\r\nLaunch and maintain retargeting and prospecting campaigns across each secondary platform\r\nEnsure campaign structures, creative placements, and targeting settings are configured correctly\r\nWatch for platform-specific glitches such as feed syncing, creative rendering, or policy flags\n\r\nCreative Coordination and QA\r\nWork closely with the internal content and design team to receive and implement ad assets\r\nDouble-check that creatives match placements, copy is accurate, and links are functioning\r\nMaintain a high bar for campaign hygiene including naming conventions, delivery previews, and scheduling\n\r\nPerformance Monitoring and Reporting\r\nPull and summarize platform-specific reports each week with key campaign metrics\r\nAlert internal stakeholders of any unusual performance swings or technical breakdowns\r\nAssist in light performance tracking of creative variations, spend efficiency, and ROI indicators\n\r\nQualifications (Must-Have):\r\nProven experience managing significant paid media budgets \r\nDirect experience working with ecommerce brands, preferably in clothing, lifestyle, or wellness\r\nStrong hands-on experience managing TikTok Ads and TikTok Shop Ads\r\nExperience with Pinterest Ads, Snapchat Ads, and X/Twitter campaigns\r\nFamiliarity with how each platform handles campaign delivery, attribution, and data\r\nHigh attention to detail, confident catching setup errors, rendering bugs, or audience mismatches\r\nExcellent English communication, able to coordinate clearly with creative and marketing teams\r\nReliable, self-managed, and comfortable working asynchronously in a fast-paced environment\n\r\nNice to Have:\r\nExperience compiling paid media dashboards or integrating platform reporting\r\nAwareness of creative best practices and performance drivers for each ad type\r\nExperience working within CPG, wellness, or lifestyle ecommerce brands                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:36:26.522594",
      "reason": "Job first discovered"
    }
  ]
}