{
  "job_id": "1416490",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Administrative-Assistant-1416490",
  "scraped_at": "2025-07-15T12:26:40.910985",
  "title": "Administrative Assistant",
  "type_of_work": "Full Time",
  "salary": "720",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us\r\nModern Edison Electric has been in business and solely operated by the owner since 2015. We specialize in residential panel upgrades, house rewires, and fire safety inspections in middle and upper-class homes.\r\nWe are a company that places great emphasis on systems, documentation, and automation. We believe that efficient and repeatable processes are essential to delivering excellent service at scale, and we are constantly refining and improving these through structured SOPs and process development.\n\r\nJob Summary\r\nWe are seeking a detail-oriented, proactive, and highly organized Administrative Assistant to support our growing business. This is a remote, full-time role with a three-month probationary period.\r\nYou will play a critical role in maintaining smooth project execution, managing communication channels, processing invoices, and supporting the operational backbone of the company. A strong ability to follow, improve, and create standard operating procedures (SOPs) is a must for this role.\n\r\nKey Responsibilities\r\nPermit and Documentation Management\r\n-Pull permits and prepare necessary documentation for residential electrical projects.\r\n-Ensure accuracy and timely submission of all paperwork to appropriate departments.\n\n\r\nSupplier Coordination\r\n-Communicate with suppliers to order, track, and confirm delivery of materials.\r\n-Resolve any issues related to supply chain delays or changes.\n\n\r\nBuilding Department and Inspector Liaison\r\n-Schedule inspections with local building departments and inspectors.\r\n-Maintain compliance with relevant building codes and regulations.\n\n\r\nClient Communication\r\n-Regularly update clients on project status.\r\n-Respond promptly to client inquiries and concerns in a professional tone.\r\n-Take and return calls from potential leads and coordinate follow-ups.\n\n\r\nQuickBooks Invoice Management & Job Costing\r\n-Create and send invoices using QuickBooks.\r\n-Follow up on unpaid invoices.\r\n-Conduct job costing to ensure accuracy in tracking financials.\n\n\r\nBusiness Research & Process Improvement\r\n-Conduct business research to identify efficiency improvements or cost-saving opportunities.\r\n-Make data-backed recommendations to enhance operational workflows.\n\n\r\nStandard Operating Procedure (SOP) Development\r\n-Follow existing SOPs meticulously to ensure consistency and quality.\r\n-Improve existing SOPs based on feedback and observed inefficiencies.\r\n-Create new SOPs to document recurring tasks or introduce new systems.\r\n-Collaborate with the owner to support a culture of process-driven work and automation.\n\n\r\nGeneral Administrative Support\r\n-Professionally handle calls and inquiries.\r\n-Coordinate schedules and appointments with adequate preparation.\r\n-Support ongoing project operations to meet deadlines.\n\n\n\r\nQualifications\r\n-Minimum 2 years of experience as an Executive Assistant – required\r\n-Minimum 1 year experience using QuickBooks – required\r\n-Experience in the construction or residential building industry – preferred\r\n-Proficiency in Google workspace (Docs, Google Sheets, Gmail)\r\n-Familiarity with project management tools – a plus\r\n-Strong organizational and time management skills\r\n-Excellent written and verbal communication\r\n-High attention to detail and proactive problem-solving\r\n-Ability to manage multiple tasks independently and within a team\n\n\n\r\nApplication Requirement\r\nPlease submit a video of yourself answering the following:\r\n1. Tell me about yourself.\r\n2. Describe the business and how we help our clients.\r\nAnd send the link of your video to sweet@modernedisonelectric.com\n\r\nNote that we will not cater applicants who will not submit a video. \n\r\nBenefits\r\n-No daily commute – fully remote\r\n-Independent work structure\r\n-Healthy work-life balance\r\n-Health plan allowance / HMO\r\n-7 Paid Time Off (PTO) days\r\n-5 Sick Leave days\r\n-10 Maternity Leave days\r\n-Christmas Bonus\n\n\n\r\nJoin us in delivering white-glove service to high-end homeowners and help streamline operations behind the scenes. If you thrive in an independent environment and take pride in smooth execution, we’d love to hear from you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:27:45.597233",
      "reason": "Job first discovered"
    }
  ]
}