{
  "job_id": "1416042",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Account-Manager-Full-Cycle-BDR-Remote-Full-Time-1416042",
  "scraped_at": "2025-07-15T15:40:55.060778",
  "title": "Sales & Account Manager (Full Cycle BDR) – Remote, Full-Time",
  "type_of_work": "Full Time",
  "salary": "100,000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "**PLEASE DO NOT APPLY THROUGH ONLINE JOBS. USE THE LINK AT THE BOTTOM OF THIS POST TO APPLY**\n\r\nSales & Account Manager (Full Cycle BDR) – Remote, Full-Time\r\nLocation: Remote (Must work U.S. time zone hours)\r\nPosition Type: Full-Time\r\nCompensation: Competitive base + commission per deal + ongoing percentage of managed accounts\n\r\nAbout the Role\r\nWe’re hiring a highly driven, client-focused Full-Cycle Sales & Account Manager to take ownership of the entire client lifecycle—from outreach to onboarding to long-term account management.\n\r\nIn this role, you’ll generate leads, conduct sales calls, present over Zoom, close deals, onboard clients, and oversee campaign execution. You’ll work closely with an appointment setter under your direction—and once the account enters fulfillment, you’ll step in as the Team Lead for that client.\n\r\nThis is a high-responsibility position with high reward: base pay, bonuses for each deal you close, and an ongoing percentage of every account you manage. If you’re organized, proactive, and love working with U.S. clients—this is an opportunity to own your book of business and get paid like a leader.\n\n\r\nWhat You'll Do\r\nLead Generation & Appointment Setting\n\r\nResearch and prospect cold leads (we also provide warm and cold leads from internal databases and ad campaigns)\r\nWrite and send outreach emails, follow up, and generate initial interest\r\nBook scheduled phone calls with qualified leads\r\nSales & Closing\n\r\nConduct short scheduled phone calls to share insight and qualify leads\r\nRun full Zoom presentations to explain our services, close the deal, follow up on negotiations, send contracts, and collect payment\r\nClient Onboarding\n\r\nGuide new clients through the onboarding process\r\nCollect brand assets, service territory details, and internal notes\r\nEnsure smooth transition into campaign execution\r\nCampaign Management\n\r\nDirect and collaborate with your assigned appointment setter\r\nOnce the account begins fulfillment, serve as the Team Lead for that client\r\nStrategize outreach approach and campaign execution\r\nMaintain strong communication with the client and oversee delivery\r\nLead client reporting touchpoints via monthly or quarterly Zoom check-ins\n\r\nYou’re a Great Fit If You:\r\nHave 3+ years of experience in sales, account management, or client success\r\nAre confident running sales calls and presentations from first contact to close\r\nLove working with clients—especially in the U.S. market\r\nHave excellent written and verbal English communication skills\r\nUnderstand how to de-escalate, build trust, and create long-term client satisfaction\r\nAre organized, self-directed, and performance-driven\r\nCan manage multiple accounts and guide others (appointment setters, internal staff)\r\nAre comfortable using Google Workspace, CRMs, and basic project management tools\r\nAre available full-time in U.S. time zone hours, Monday through Friday\n\r\nCompensation\r\nBase salary (monthly)\r\nCommission for each deal you close\r\nOngoing percentage of account revenue for every client you manage\r\nThis is a high-income opportunity for the right person—?100,000 to ?200,000+ PHP/month is achievable with strong performance\r\nThe compensation structure is second to none for professionals who want to own and grow a book of business\n\r\nAbout Us\r\nWe’re a U.S.-based company that helps home service businesses grow through consistent relationship-building campaigns. Our clients are typically roofers, HVAC companies, remediation companies, and other service contractors looking to expand their commercial work.\n\r\nWe run campaigns with structure, care, and client-first thinking—and we’re looking for professionals who do the same.\n\n\r\nReady to take ownership of your accounts and income?\r\nApply now with your résumé, a short message explaining why you’re a fit, and any links to past sales or client success results.\n\r\nApply here: Upgrade to see actual info/careers/46",
  "skill_requirements": [
    "Sales Management",
    "Business development",
    "Client Relationship Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:40:55.062996",
      "reason": "Job first discovered"
    }
  ]
}