{
  "job_id": "1416127",
  "url": "https://www.onlinejobs.ph/jobseekers/job/CAD-Drafter-Custom-Cabinet-1416127",
  "scraped_at": "2025-07-15T12:33:27.429880",
  "title": "CAD Drafter - Custom Cabinet",
  "type_of_work": "Full Time",
  "salary": "$5",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Remote CAD Drafter - Custom Cabinet Design & Installation\n\r\nIf you possess the qualifications, please apply using the form provided below.\n Upgrade to see actual info\n\r\nWe are a growing custom cabinet company specializing in high-quality kitchen and bathroom cabinetry with full installation services. Our team combines traditional craftsmanship with cutting-edge design technology to deliver exceptional results for residential and commercial clients.\n\r\nWe are seeking a skilled **Remote CAD Drafter** to join our design team. The ideal candidate will have extensive experience with **2020 Design software suite** and a strong background in custom cabinet design and space planning. This role involves creating detailed technical drawings, collaborating with our installation teams, and ensuring all designs meet both aesthetic and functional requirements.\n\r\n## Key Responsibilities\n\r\n- Create detailed CAD drawings and technical specifications for custom cabinet projects\r\n- Develop 3D renderings and visualizations using 2020 Design software suite\r\n- Collaborate with project managers and installation teams to ensure design feasibility\r\n- Modify existing designs based on client feedback and site requirements\r\n- Prepare cut lists, material specifications, and installation drawings\r\n- Maintain organized project files and documentation\r\n- Participate in client consultations via video conferencing when needed\r\n- Ensure all designs comply with industry standards and building codes\n\r\n## Required Qualifications\n\r\n### Technical Skills\r\n- **Proficiency in 2020 Design software suite is mandatory**\r\n- Experience with 2020 Design Flex, 2020 Fusion Live, or similar 2020 products\r\n- Strong understanding of cabinet construction methods and hardware\r\n- Knowledge of woodworking techniques and materials\r\n- Familiarity with kitchen and bathroom design principles\n\r\n### Experience & Education\r\n- 3+ years of experience in cabinet design or related field\r\n- Associate degree in Drafting, Interior Design, or equivalent experience\r\n- Portfolio demonstrating custom cabinet design work\r\n- Experience working with manufacturers' catalogs and specifications\n\r\n### Soft Skills\r\n- Excellent attention to detail and accuracy\r\n- Strong communication skills for remote collaboration\r\n- Ability to manage multiple projects simultaneously\r\n- Problem-solving mindset for design challenges\r\n- Self-motivated and able to work independently\n\r\n## Preferred Qualifications\n\r\n- Experience with cabinet installation processes\r\n- Knowledge of additional design software (AutoCAD, SketchUp, etc.)\r\n- Understanding of commercial kitchen design\r\n- Familiarity with accessibility requirements (ADA compliance)\r\n- Previous remote work experience\n\r\n## What We Offer\n\r\n- Flexible remote work environment\r\n- Opportunity to work on diverse custom projects\r\n- Professional development and software training\r\n- Collaborative team culture\r\n- Growth opportunities within expanding company\n\r\n## Application Requirements\n\r\nPlease submit:\r\n- Resume highlighting relevant experience\r\n- Portfolio showcasing cabinet design work (PDF format preferred)\r\n- Cover letter explaining your experience with 2020 Design software\r\n- References from previous employers or clients\n\r\n## How to Apply\n\r\nSend your application materials to [email address] with the subject line \"Remote CAD Drafter Application - [Your Name]\"\n\r\nWe are an equal opportunity employer committed to diversity and inclusion in our workplace.",
  "skill_requirements": [
    "Auto Cad",
    "Drafting",
    "3D autocad"
  ],
  "is_active": true,
  "status_history": []
}