{
  "job_id": "1416973",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-1416973",
  "scraped_at": "2025-07-15T12:22:58.930519",
  "title": "Video Editor",
  "type_of_work": "Part Time",
  "salary": "500",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re an e-commerce brand seeking a skilled and reliable video editor who specializes in direct response advertising. You will be working with raw user-generated content (UGC), testimonials, and product clips to create compelling, high-converting video ads for platforms like Pinterest, Google, and Meta.\n\r\nThis is a long-term collaboration for someone who values creative ownership, consistent work, and professional growth.\n\r\nKey Responsibilities\r\nEdit short-form direct response video ads (15–60 seconds)\n\r\nTransform raw content into polished, conversion-focused creatives\n\r\nApply engaging text overlays, captions, transitions, and music\n\r\nStructure videos for performance: strong opening, clear messaging, effective call to action\n\r\nDeliver multiple versions for A/B testing (e.g. different hooks or formats)\n\r\nFollow creative briefs precisely and meet deadlines consistently\n\r\nRequirements\r\nDemonstrable experience with UGC and direct response ad editing\n\r\nStrong portfolio showcasing paid social ads (send links)\n\r\nExcellent command of editing software (Premiere Pro, Final Cut, CapCut, etc.)\n\r\nStrong understanding of ad structure, buyer attention, and conversion psychology\n\r\nReliable and responsive communication\n\r\nExcellent written and spoken English\n\r\nNice-to-Have\r\nExperience editing for Pinterest, TikTok, or Meta platforms\n\r\nCopywriting or storytelling skills (writing hooks, CTA suggestions, etc.)\n\r\nAbility to work with performance data to refine creative\n\r\nHow to Apply (Read Carefully)\r\nTo confirm you’ve read this job post fully, please begin your application with FAST. Applications without this will be ignored.\n\r\nPlease include the following in your application:\n\r\nA short personal introduction\n\r\nPortfolio with relevant examples of UGC and direct response ads\n\r\nYour preferred editing software\n\r\nmonthly rate\n\r\nYour weekly availability and timezone\n\r\nQualified applicants will be shortlisted for a short video call to assess communication, followed by a paid test project.\n\r\nIf you’re someone who values structure, performance, and clear creative direction, we’d love to work with you.\n\r\nLooking forward to your application,\r\n— Hubert",
  "skill_requirements": [
    "Marketing",
    "Social Media Content Creation",
    "Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:22:58.932715",
      "reason": "Job first discovered"
    }
  ]
}