{
  "job_id": "1416320",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Listing-Customer-Support-Specialist-1416320",
  "scraped_at": "2025-07-15T14:24:39.834573",
  "title": "Amazon Listing & Customer Support Specialist",
  "type_of_work": "Full Time",
  "salary": "500 - 800 USD gross",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a remote e-commerce company on a heartfelt mission to spread Love, Positivity, and Health, one exceptional product at a time. Our unique niche is esoteric products that resonate in online markets around the world. With a crystal-clear vision for the future, our dedicated and diverse team is ever-growing, and we are eagerly seeking talented individuals to embark on this exciting journey with us.\n\r\nWatch an introductory video from our CEO: Upgrade to see actual info\n\r\nOur core values are:\r\n- Excellence in everything we do (“I go above and beyond”)\r\n- Ownership and responsibility (“I own it”)\r\n- Continuously push the limits (“I don’t accept no as an answer. No is just an option”)\r\n- Openness & cooperation (“Everyone matters”)\n\r\nAbout the Role:\r\nAs the company scales across Amazon and Shopify, there’s a need for a dedicated specialist to manage customer inquiries, resolve listing issues, maintain listing health, and handle cross-platform operational tasks. This ensures continued sales growth, minimized disruptions, and high customer satisfaction.\n\r\nWhat you’ll be responsible for:\n\r\nCustomer Support & Feedback Management (Approx. 50% of Time):\r\n- Maintain a 95%+ customer satisfaction rate on Amazon and Shopify.\r\n- Respond to customer queries daily within 24 hours.\r\n- Proactively remove negative feedback and reviews.\r\n- Handle disputes and customer escalations on Amazon, Stripe, and PayPal when they arise.\n\r\nListing Accuracy & Marketplace Issue Resolution (Approx. 30% of Time):\r\n- Maintain 100% listing accuracy across Amazon and Shopify.\r\n- Troubleshoot and resolve listing issues, including suspensions (Amazon Listing Suspensions).\r\n- Creating new ASINs, listing variations, child and parent ASINs.\r\n- Sync Amazon and Shopify listings monthly to ensure consistency.\r\n- Renew Amazon promotions and deals quarterly.\n\r\nCross-Platform Operations Support & Reporting (Approx. 20% of Time):\r\n- Monitor and process Shopify orders daily.\r\n- Prepare and deliver the Creator Connections report monthly.\r\n- Support monthly social media posting with AI-generated content.\n\r\nYou’ll be a great fit if you are:\r\n- 1–3 years of hands-on experience with Amazon Seller Central (customer support and listing troubleshooting)\r\n- Experience handling Amazon listing errors and suspensions\r\n- Experience creating and managing Amazon ASINs, listing variations, and parent/child ASIN structures\r\n- Knowledge of basic Amazon Reports (e.g., Feed Files report, Category Listing Reports, Promotion Reports.)\r\n- Strong written and verbal English communication skills (for customer support and internal updates)\r\n- Comfortable working remotely with minimal supervision\r\n- Solid organizational and time management skills\r\n- Comfortable using AI tools (like ChatGPT, Claude, etc.) regularly for increased productivity, research, analysis, and content creation (e.g., customer responses, listing content, or social media captions)\r\n- Experienced with Project Management Tools like Asana (Recommended), ClickUp, or Monday.\r\n- Proficient with Slack for internal communication and Email for external communication\r\n- Familiarity with promotion setups on Amazon (e.g., coupons, lightning deals, Tailored Brand Promotions, Creator Connections)\r\n- Experience syncing product data between Amazon and Shopify\n\r\nWhat’s in it for you:\r\n- Remote Work: Enjoy the flexibility of working 100% remotely from the comfort of your home or any location worldwide.\r\n- Unlimited Vacation: Take as many vacation days as you need to ensure you are well-rested and ready to tackle new challenges.\r\n- Professional Growth: As we are a small company, you'll have the chance to engage with various aspects of the business, fostering your professional development.\r\n- Personal Development Fund: We support your ongoing learning journey by providing a personal development fund each year.\r\n- Emergency Fund: We offer an interest-free emergency fund with comfortable payouts to help you in times of need.\n\r\nInterview flow:\r\n- Application: Everything starts with getting in touch. The best way to express your interest is by applying online.\r\n- HR Interview: If your profile aligns with our requirements, we'll invite you for an HR interview.\r\n- Technical Interview/Test: You may undergo a technical interview or complete a relevant test.\r\n- Online Interviews: You may have up to three online interviews with various teaUpgrade to see actual infombers.\r\n- Reference Check: We will kindly request you to arrange a reference check before we extend a job offer.\n\r\nIf this opportunity resonates with you, we are excited to meet you and welcome you to the HelloChakra team!",
  "skill_requirements": [
    "E-Commerce",
    "Amazon",
    "Customer Support"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:31:57.802670",
      "reason": "Job first discovered"
    }
  ]
}