{
  "job_id": "1416454",
  "url": "https://www.onlinejobs.ph/jobseekers/job/We-Need-a-VIDEO-MARKETING-DIGITAL-RENDERING-SPECIALIST-VA-1416454",
  "scraped_at": "2025-07-15T15:32:48.624363",
  "title": "We Need a VIDEO MARKETING / DIGITAL RENDERING SPECIALIST VA!",
  "type_of_work": "Any",
  "salary": "$10 - $11 per hour",
  "hours_per_week": "25",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us:\r\nWe are a wellness and lifestyle brand focused on premium CBD products that support stress relief, relaxation, and daily well-being. Our product line includes curated collections of edibles, topicals, and lifestyle essentials designed with modern, minimalist packaging that reflects our elevated brand values.\n\r\nWhat We're Looking For:\r\nWe are actively looking for a creative and experienced Video Marketing / Digital Rendering Virtual Assistant to help us bring our product packaging and visual assets to life across all major social media platforms. Your role will focus on transforming our packaging graphics and design files into scroll-stopping visual content and marketing videos for Instagram, TikTok, Facebook, YouTube, and more.\n\r\nPLEASE READ BEFORE APPLYING:\r\nFor the applicants we move forward with, there will be a paid test task to evaluate your visual style and brand alignment. If you do not wish to participate in a test task, please do not apply.\n\n\r\nTOP QUALIFICATIONS FOR THE ROLE:\n\r\n- Must be experienced in Video Marketing and Product Rendering\r\n- Must have portfolio or sample works demonstrating skill in turning still packaging into animated marketing content\r\n- Must be highly skilled in motion graphics, video editing, and brand-aligned content creation\r\n- Must be proficient in English (C2 or above) – excellent grammar and text overlay writing are a must\r\n- Must understand how to hook and retain viewers on platforms like TikTok, Instagram Reels, and YouTube Shorts\r\n- Must have an eye for luxury or minimalist branding aesthetics\r\n- Experience with CBD, skincare, or wellness product visuals is a HUGE BONUS\r\n- Able to collaborate, but also work independently and take initiative\r\n- Organized, detail-oriented, and capable of hitting deadlines consistently\n\r\nYOUR KEY RESPONSIBILITIES:\n\r\n- Create scroll-stopping product rendering videos using existing packaging design files\r\n- Edit and publish reels, shorts, and marketing videos across all relevant social media platforms\r\n- Repurpose product graphics into animated digital content for launches, campaigns, and promos\r\n- Develop and execute video marketing strategies to increase followers and conversions\r\n- Work with marketing and design teams to maintain consistent brand messaging\r\n- Monitor video analytics, suggest content optimizations, and stay on top of video trends\r\n- Organize files, maintain a content calendar, and prepare batches of visual content\n\r\nSOFTWARE & TOOLS:\n\r\n- After Effects / Premiere Pro (or equivalent editing tools)\r\n- Cinema 4D, Blender, or similar rendering software\r\n- Canva / Adobe Creative Suite (Photoshop, Illustrator, etc.)\r\n- Asana / Zoho Projects (Project Management)\r\n- Instagram, TikTok, YouTube, Pinterest, Facebook, LinkedIn (Content Publishing/Analytics)\n\r\nTECHNICAL REQUIREMENTS:\n\r\n- Internet speed of at least 50 Mbps (Backup Internet REQUIRED)\r\n- Computer/laptop with at least i7 processor (or equivalent) + 32GB RAM or higher\r\n- Work Set-up must be equipped with the latest GPUs for Video-editing and Rendering\r\n- Noise-cancellation headset and webcam for meetings/interviews\r\n- Backup power source (bonus)\n\r\nIf you’re ready to bring a premium wellness brand to life through powerful video content, we’d love to hear from you.\n\r\nTO APPLY:\r\n- Please complete this Google Form:Upgrade to see actual info\r\n- DO NOT message us on this platform – any messages will be ignored.\r\n- Failure to follow instructions will result in automatic rejection.",
  "skill_requirements": [
    "Video Content Creation",
    "3D animation",
    "Animation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:32:17.375294",
      "reason": "Job first discovered"
    }
  ]
}