{
  "job_id": "1416284",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Recruitment-Scheduling-Associate-1416284",
  "scraped_at": "2025-07-15T12:29:33.936626",
  "title": "Recruitment & Scheduling Associate",
  "type_of_work": "Full Time",
  "salary": "$800/month + uncapped bonus potentail",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Ready to Help Us Find Top Talent?\n\r\nIf you're a highly organized and engaging communicator ready to make a significant impact on our recruitment efforts, we encourage you to apply! Submit your resume and tell us why you're the ideal fit for this exciting remote opportunity.\n\r\nAre you a highly communicative and organized individual passionate about connecting talent with opportunity? Do you thrive in a dynamic, remote environment and excel at creating seamless experiences?\n\r\nJoin our team as a Recruitment & Scheduling Associate! In this pivotal role, you'll be at the heart of our candidate outreach, sparking interest in exciting career paths and expertly managing the interview process for our Hiring Managers. This is an excellent opportunity to utilize your communication and organizational skills to directly impact our team's growth.\n\r\nYour Impact & Responsibilities:\r\n- Engaging Candidate Outreach: Initiate compelling outbound calls to potential candidates, effectively showcasing exciting career opportunities within our organization.\r\n- Seamless Interview Coordination: Masterfully coordinate and schedule interviews for candidates and our recruitment team, ensuring a smooth, positive, and efficient experience for all parties.\r\n- Calendar Management: Maintain a highly organized and up-to-date recruitment calendar, meticulously managing interview slots and team availability.\r\n- Database Integrity: Contribute to the accuracy and integrity of our candidate database, ensuring all information is precise and readily accessible.\r\n- Talent Sourcing Support (As Needed): Provide support for our talent sourcing efforts by identifying promising candidates on various job platforms.\n\r\nWhat You'll Bring to the Team:\r\n- Outstanding Communication: Exceptional verbal and written English communication skills, capable of captivating and engaging diverse audiences.\r\n- Phone Presence: Proven experience in a role demanding significant phone interaction (e.g., sales, customer engagement, appointment setting).\r\n- Organizational & Time Management Prowess: Superior organizational and time management abilities, with a proven knack for efficiently juggling multiple tasks and deadlines.\r\n- Meticulous Attention to Detail: Strong administrative skills coupled with a meticulous eye for detail, ensuring accuracy in all tasks.\r\n- Proactive & Self-Motivated: A proactive, self-starter mentality with a strong drive to contribute and achieve results independently.\r\n- Persuasive Abilities: Demonstrates persuasive communication abilities and a goal-oriented approach in all interactions.\r\n- Recruitment Acumen (A Plus): Prior experience in talent acquisition, lead generation, or conducting initial candidate phone screenings is a significant advantage.\r\n- Platform Familiarity (Advantageous): Familiarity with popular job boards like ZipRecruiter and Indeed is a plus.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}