{
  "job_id": "1416363",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-Real-Estate-1416363",
  "scraped_at": "2025-07-14T23:09:44.046645",
  "title": "Video Editor - Real Estate",
  "type_of_work": "Part Time",
  "salary": "$7/hour (with growth opportunities based on performance)",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're seeking a talented and experienced Part-Time Video Editor (hourly rate: $7) to join our social media team. In this exciting role, you'll play a vital role in crafting visually stunning video content that elevates our VIPs brand presence and engagement across various social media platforms. You will be handling multiple VIPs within a team.\n\r\nOnly applicants who follow the instructions will be considered.\n\r\nFamiliarity with the luxury real estate industry is a plus! Having a background in this industry will allow you to create content that connects with those interested in luxury real estate.\n\r\nKey Skills & Qualities:\r\nProven Video Editing Expertise: Minimum 3 years of experience editing both short-form and long-form videos with exceptional efficiency.\r\nSoftware Proficiency: Mastery of Adobe Premiere Pro or a similar industry-standard video editing software is essential.\r\nEye-Catching Thumbnails: Design compelling thumbnails that grab viewers' attention and increase click-through rates on social media platforms.\r\nPlatform Optimization: Maintain a strong understanding of the latest algorithms for Facebook, Instagram, TikTok, YouTube, and email marketing platforms. Optimize videos for each platform to maximize reach and engagement.\r\nStaying Ahead of Trends: Stay current on the latest social media trends and seamlessly integrate them into your video editing to maintain fresh and relevant content.\r\nSEO & Video Ranking: Understand the importance of SEO optimization for video content to improve search ranking. Effectively utilize keywords, tags, and descriptions.\r\nData-Driven Approach: Analyze the performance of published videos and translate insights into actionable strategies to refine future content. Familiarity with analytics tools like YouTube Analytics, Google Analytics, and other social media platforms is a plus.\r\nBranding Champion: Grasp branding best practices and ensure consistent integration of branding elements into videos to strengthen brand identity. Create videos that exude luxury, sophistication, and a professional yet relatable tone.\r\nTeamwork Makes the Dream Work: Experience working within a remote team is essential, including clear communication and coordination with social media managers\n\r\nRequirements:\r\nMust have an Onlinejobs.ph account to track the hours and should have answered the English Grammar Test, DISC Personality Test, and the IQ Test\r\nAt least 2 years of experience working as a Video Editor, having experience with Real Estate is a plus\r\nExcellent English speaking and writing\r\nComputer or laptop, preferably with a backup\r\nInternet is a must with backup\r\nAmenable to do weekly meetings with the client\n\r\nApply here:\nUpgrade to see actual info",
  "skill_requirements": [
    "Social Media Content Creation",
    "Video Content Creation",
    "Video Editing"
  ]
}