{
  "job_id": "1416536",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Growth-Lead-1416536",
  "scraped_at": "2025-07-15T14:35:04.399202",
  "title": "Growth Lead",
  "type_of_work": "Full Time",
  "salary": "$1000-$1500",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Position: Growth Lead\r\nLocation: Remote (Philippines/Pakistan)\r\nJob Type: Full-time\r\nWork Schedule: 3pm- 11pm (Pacific Standard Time)\r\nBase Salary: $1000 per month?\n\r\nRole Overview:\n\r\nWe're looking for a start-up minded Growth Lead to join our team. In this role, you will help us uncover new traction channels, build fast experiments, and drive meaningful, ROI-focused results for our proxy product line. You'll create campaigns, run tests, and figure out how to get our products in front of the right people using whatever channels make sense.\n\r\nKey Responsibilities:\n\r\n- ?Identify and test unconventional acquisition channels like forums, development communities, cold email, affiliate placements, etc.\r\n- Build and run lightweight paid campaigns when appropriate (Google, Meta, Reddit, etc.)\r\n- Launch fast, iterative growth experiments from idea to copy to landing page to launch.\r\n- Work closely with the product team to align on messaging, offers, and positioning.\r\n- Track key metrics (clicks, signups, conversions) and optimize based on what actually works.\r\n- Own the full growth funnel from top-of-funnel awareness all the way to conversion and retention.\n\r\nRequirements:\n\r\n- Someone who sees challenges as opportunities and is passionate about sales and marketing.\r\n- Ability to showcase examples of growth based on practical experience.\r\n- A generalist with a bias for action: Someone who can do a little bit of everything and learn what they dont know.\r\n- Comfortable jumping into low-budget, hands-on execution without needing a large team.\r\n- Data-aware: able to measure results and iterate fast, even without perfect dashboards.\r\n- Strong analytical skills with the ability to interpret data and translate findings into actionable strategies.\r\n- Excellent organizational and project management skills to handle multiple initiatives simultaneously.\r\n- Strong communication skills, both written and verbal.\r\n- Creativity and a passion for staying ahead of marketing trends and innovations.\r\n- Experience working with tech or start-up companies is a plus.\n\r\nBenefits & Perks:\n\r\n- Fully Remote Work Work from anywhere with a reliable internet connection\r\n- Healthcare Coverage We provide health benefits for you and your familys well-being\r\n- Leave Days, Vacation Time, and Paid Holidays Recharge and take the time you need\r\n- Equipment Funds Get support to set up or upgrade your home office\r\n- Profit Sharing Monthly and annual bonuses tied to company performance\r\n- Long-Term Employment We value teaUpgrade to see actual infombers who grow with us\r\n- Collaborative Team Culture Work with a supportive and globally distributed team\n\r\nAbout Us:\n\r\nAutoScale Ventures is a technology-driven company with 50+ teaUpgrade to see actual infombers across the Philippines, Pakistan, India, the U.S., China, and Canada. We operate a group of businesses spanning tech, data services, recruiting, and real estate, including:\n\r\n- VinAudit Vehicle history and market data provider\r\n- Proxy Services High-speed private proxy solutions\r\n- EliteWork Remote workforce platform and SaaS productivity tool\r\n- Voliplex Long-term U.S. real estate investment firm\n\r\nWe're committed to building scalable, data-driven solutions and empowering a globally distributed team.\n\r\nImportant Note: Only those who are shortlisted will be contacted. We look forward to meeting the right person for this role!",
  "skill_requirements": [
    "Marketing",
    "Sales",
    "Funnel Design"
  ],
  "is_active": true,
  "status_history": []
}