{
  "job_id": "1418969",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Microsoft-Azure-DevOps-Engineer-1418969",
  "scraped_at": "2025-07-15T14:28:12.536039",
  "title": "Microsoft Azure DevOps Engineer",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Summary: \nAs an Application Developer, you will engage in the design, construction, and configuration of applications tailored to meet specific business processes and application requirements. Your typical day will involve collaborating with various teams, managing project timelines, and ensuring that the applications developed align with the strategic goals of the organization. You will also be responsible for troubleshooting issues and providing innovative solutions to enhance application performance and user experience.\n\nResponsibilities:\n- Expected to be an SME.\n- Collaborate and manage the team to perform.\n- Responsible for team decisions.\n- Engage with multiple teams and contribute on key decisions.\n- Provide solutions to problems for their immediate team and across multiple teams.\n- Facilitate knowledge sharing and best practices among team members.\n- Monitor project progress and ensure adherence to timelines and quality standards.\n- Assist in the development of training materials and documentation for end-users.\n\nQualifications:\n- Required Skill: Expert proficiency in Microsoft Azure DevOps.\n- Strong understanding of application development methodologies and best practices.\n- Experience with continuous integration and continuous deployment processes.\n- Familiarity with version control systems and collaborative development tools.\n- Solid grasp of cloud computing concepts and services.\n- Experience in troubleshooting and optimizing application performance.\n\nSetup: Hybrid\nLocation: Ortigas",
  "skill_requirements": [
    "Azure"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:29:59.328340",
      "reason": "Job first discovered"
    }
  ]
}