{
  "job_id": "1420409",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Inquiries-Removal-Expert-1420409",
  "scraped_at": "2025-07-15T12:24:28.636017",
  "title": "Inquiries Removal Expert",
  "type_of_work": "Any",
  "salary": "1500",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re a funding company and we provide with 0% interest business credit cards and business line of credit our clients and we have multiple request for hard inquiries removal across all 3 bureaus\n\r\nWe need SUPER QUICK, EFFICIENT and fluent English with NO language barrier person to add inside our team who must be collaborating on our weekly team calls, be part and integrate with the team.\n\r\nWe work on a performance basis meaning that we provide business funding to our customers but 90% of them have hard inquires to remove BEFORE applying for funding, so what we do is remove and clean up their profile so they’ll be ready for the first banks to approach.\n\r\nOnce the first banks get approached if we stack more then 3 hard inquiry x bureau we’ll then create another request to remove the new hard inquiries.\n\r\nSo with 35+ clients a month we end up disputing different requests as we approach at least 8-9 banks x client. Meaning that we need probably 3 request of hard inquires removal x bureau and x client throughout the collaboration.\n\r\nWe make money on a ?e of their funding, so we are suffering a lot now because we spend 20-30k a month in ads to acquire customers but they get ready for funding within 60-90 days due to our hard inquires team being so slow, and I let you image how painful could be for our cash flow.\n\r\nEssentially we never see profits.\n\r\nIf we fix the hard inquiry timing we can easily get these clients funding in 20-30 days.\n\r\nOur team is removing experian in 10 days, and this can be lowered to 24-72 hours, but EVERYONE claim to remove experian quick but they all take 10-20 days because they LIE. (even though is very easy to remove, they are just slow and lazy)\n\r\nAnd we need 15-20 days for TU and EQ as now they are taking 30-40 days.\n\r\nWe need to remove things super aggressive otherwise we don’t make money because we get money from funding commission of clients and 90% of them need hard inquiries removal before the funding applications\n\n\r\nwe pay for inquiries removed.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}