{
  "job_id": "1420878",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Media-Assistant-1420878",
  "scraped_at": "2025-07-15T04:26:11.171281",
  "title": "Remote Media Assistant",
  "type_of_work": "Part Time",
  "salary": "N/A",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a video editor with a passion for dance music? We’re looking for a Remote Media Assistant to help bring our content to life. This person is detail-oriented, creative, responsible, self-motivated, and will support content production, editing, and delivery.\n\nThis is a part-time, flexible role for someone who thrives in fast-moving environments, loves electronic and dance music, and knows how to manage both media and time effectively. If you’re confident in basic media editing and file organisation, we want to hear from you. There is potential for full time employment for the right candidate.\n\nWhat You’ll Be Doing\n• Basic editing using Adobe Premiere Pro (cuts, overlays, formatting for social media)\n• Naming and organising incoming media files (video and photo) on Dropbox\n• Basic photo editing in Lightroom or Canva\n• Working collaboratively across time zones with quick response times\n\nWhat You’ll Need\n• 1–2+ years experience in video editing, content management or digital media\n• Your own computer capable of running Adobe Premiere Pro and tools like Dropbox, Google Meet, Canva, etc.\n• A strong and reliable internet connection\n• A smartphone with WhatsApp for quick comms\n• Excellent written and spoken English\n• Familiarity with artists, tracks, or moments from the dance music world\n• Availability on a flexible schedule including weekends, which are a key part of the role\n\nThe Ideal Candidate\n• Has a passion for music, movies, entertainment, and creative media\n• Demonstrates strong attention to detail, time management, and a self-starting attitude\n• Thrives in a fast-paced, collaborative creative environment\n• Is open to feedback and able to apply it constructively\n• Manages time effectively to deliver high-quality work quickly\n\nA Few Important Notes\n• This is a remote, behind-the-scenes position. You’ll be handling sensitive and unreleased material, so attention to detail and discretion are critical.\n• We’ll provide access to all required software (Adobe CC, Canva, etc.)\n\nHow To Apply (submit the following):\n• Submit your resume along with a short bio about yourself and your experience. Please include:\n • Experience using Premiere Pro or similar video editing software\n • Experience using Canva, Dropbox, Lightroomor any other media based programs or platforms?\n • Are you available on weekends?\n • What most excites you about the role?\n• A portfolio or links to recent video projects you’ve worked on",
  "skill_requirements": [
    "Video Content Creation",
    "Video Editing",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": []
}