{
  "job_id": "1420920",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Hiring-Project-Management-Expert-w-Prev-Experience-FULL-TIME-1420920",
  "scraped_at": "2025-07-15T05:31:47.329500",
  "title": "Hiring Project Management Expert w/ Prev. Experience [FULL-TIME]",
  "type_of_work": "Full Time",
  "salary": "$500-700",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you interested in working from home in a positive environment with a scalable salary based on your performance? Then keep reading.\n\nWe are looking for an experienced project management specialist to join our team. You will be responsible for projects organization & listening all client calls to see if we have missed any tasks and organize them for the client delivery team. \n\nWhat we are looking for:\nSome great soft skills - fun, likable, and detail-oriented.\nYou have at least 2 years of actual marketing experience in digital companies.\nYou are deeply interested in marketing and you are looking for a long-term job & career.\nYou are curious and hungry to learn and improve yourself.\nBeing able to communicate with clients in English.\nYou're not afraid to criticize and receive criticism. We appreciate honesty from all sides.\nYou're comfortable working autonomously.\nCoachable, with an understanding that mentorship is an integral key to success.\nAbility to analyse large data sets, create dashboards, and generate actionable insights.\nGoogle Analytics - Ability to use most of the reports, analyse all key website data.\nShopify - Ability to use most of the reports, analyse all key store data.\nSkilled in Clickup.com or equivalent project management software.\nFamiliarity with analyzing financial statements, especially income statements / P&Ls.\nStrong analytical, quantitative, and problem-solving skills; ability to analyze raw data, draw conclusions, and develop actionable recommendations\nAbility to organize and work in a fast-paced environment in order to prioritize and manage multiple projects at once.\nPassion for learning about marketing, psychology, sales, and copywriting.\nUnderstanding and working knowledge of marketing funnels, remarketing strategies and customer journey\n\nWhat’s in it for you?\n20 days paid off time (not including holidays).\nRemote first business.\nScalable salary based on your performance.\n\nOlifant Digital is a performance marketing agency that works exclusively with e-commerce brands. Unlike other agencies, we guarantee results, have happy clients, and work in a positive environment.\n\nWe foster a playful and collaborative atmosphere where creativity thrives. Our processes are minimal, systems simple, and communication casual. As a remote company, we hire talented people and offer above-market salaries.\n\nCompany culture:\n\nCustomer Obsession — Always do what is best for the customer, even if it takes more time or it's not scalable. Always put yourself in the shoes of the customer and do the ABSOLUTE best to deliver EXCEPTIONAL results.\n\nOwnership — Think long term and don’t sacrifice long-term value for short-term results. Act on behalf of the entire company. Everyone in our team takes full responsibility of the outcomes, so we can take pride in the results.\n\nExceptional Communication — We are super proactive with fast and transparent communication. Speed is king.\n\nHire and Develop The Best Team — We always strive to find the best people for every position in our company. By working with exceptional talent, we are able to deliver outstanding results.\n\nIndependence — After speaking about shared values, here’s one that breaks away: Independence. We encourage independent thought and original thinking. Since day one, we’ve always done things our way. We don’t look to the industry or competitors for the way forward.\n\nUnmatched Excellence — Our team has relentlessly high standards. We continually raise the bar and drive our team to deliver the highest-quality services possible for our clients.\n\nWe're looking for an amazing positive person with experience to be a part of our growing team and work with us for years ahead.\n\nThe stars don’t align like this very often — Join us!",
  "skill_requirements": [
    "Project Management"
  ],
  "is_active": true,
  "status_history": []
}