{
  "job_id": "1420027",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-and-SEO-Marketing-Guru-1420027",
  "scraped_at": "2025-07-15T15:36:37.541057",
  "title": "Social Media and SEO Marketing Guru",
  "type_of_work": "Full Time",
  "salary": "$300+ (Based on Exp)",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking an experienced and passionate Social Media and SEO Marketing Guru to join our team! This full-time, work-from-home position is perfect for someone with over three years of experience in social media management and SEO. The ideal candidate is autonomous, results-driven, flexible, friendly, and dedicated to achieving outstanding results for our two new ventures: a Shopify dropshipping business and a web hosting company, both at their exciting launch stage.\n\r\nKey Responsibilities:\r\n• Develop and execute social media strategies to build brand awareness, engagement, and drive traffic for both the dropshipping business and the web hosting company.\r\n• Optimize website content and product listings for SEO to increase organic search visibility.\r\n• Monitor and analyze performance metrics, providing regular reports and insights to guide strategy adjustments.\r\n• Collaborate with the team to ensure that marketing efforts are aligned with overall business goals and launch plans.\n\r\nRequirements:\r\n• Proven experience in managing social media accounts and implementing SEO best practices.\r\n• Ability to work independently and efficiently in a remote setting.\r\n• Strong communication skills and a positive, proactive attitude.\n\r\nIf you’re excited about helping new businesses thrive and want to make a real impact, we’d love to hear from you!",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Management",
    "SEO"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:22:13.494820",
      "reason": "Job first discovered"
    }
  ]
}