{
  "job_id": "1420872",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AMAZING-VIDEO-EDITOR-WANTED-FOR-7-FIGURE-BUSINESS-1420872",
  "scraped_at": "2025-07-15T04:29:10.107433",
  "title": "AMAZING VIDEO EDITOR WANTED FOR 7-FIGURE BUSINESS",
  "type_of_work": "Part Time",
  "salary": "On avg: 11 dollar per hour, (3 dollar per minute edited).",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Amazing video editor wanted for 7 figure ecom brand\n\nHey there,\n\nMy team and I are looking for a new team member to join our amazing 7-figure eCommerce dropshipping business team.\n\nCurrently we are in need of someone that is responsible for the most important task of this business, video editing.\nIt's essential that you are experienced with eCommerce/dropshipping and video editing.\n\nYou will get the ads to edit from us every morning. Your job will be to translate and localize each ad into a danish version of that ad. First you will translate the ad script langugage to Danish and add new subtitles over the old ones. This will be translated using the Chatgpt prompts we provide you. You will use Elevenlabs to generate text to speech for the ad. After you have succesfully done this you will match the new generated audio to your danish subtitles in the timeline of the ad accurately. After this you will extract the music from the original sound of the ad using Upgrade to see actual info and then re-add that music to the new translated ad. The danish version of that ad is then finished. We like our workers to use capcut since it is easier to match the frames of subtitle change etc, but if you are very experienced with another editing software we are okay with you using it aslong as the results are fast and accurate.\nYou will find\n\nPlease read the model template below for all the information that we expect, such as Role, Responsibilities, Results and Requirements. Explanation vacancy text:\n\n\n\nPRODUCT DESCRIPTION WRITER\n\nDepartment: \nContent Creation Department\n\nReports To: \nProcess Manager\n\nROLE\nTranslating, localizing and editing our ads on a daily basis. You’re the person that is responsible for a very important part of the selling process.\nYou ensure that both the audible and visual localization/translation is accurate and well made.\nYou ensure the new subtitles match the old ones on the video timelime to preserve the formula of the original ad.\nYou make sure the new translated and localized ad to at least retain its quality and visual appeal.\n\nRESPONSIBILITIES\nEnsuring that the translated ad retains the same meaning and structure as the original ad.\nEnsuring that the generated text to speech match the new subtitles accurately and that the video retains its visual appeal. You make sure that there are no frames in the new and edited ad showing the old subtitles between your new translated subtitles, ensuring that its not noticable that the ad has been translated and localized.\nHaving a good grammar and spelling.\nMaintaining a certain benchmark that is created by the Process Manager.\nKnowing how to work with Capcut or different edit programs to provide high quality ad edits that are of high quality and accurately localized.\nKnowing where to find the Process Manager and have close contact with his/her requirements.\n\nRESULTS\nBeing able to edit 3-5 ad campaigns per day.\nMaking sure all the work is finished within a certain time frame\nFollowing the guidelines and instructions!\nLearning the guidelines fully!\nThinking along with the CEO and Process Manager to create a perfect product description concept. \nImproving yourself and the results everyday.\n\nRemember and use the codeword \"apple\" when introducing yourself to us for the first time. This way we know that you read this post and is motivated to work with us specifically.\n\nPlease be kind and contact me by email: Upgrade to see actual info",
  "skill_requirements": [
    "Video Content Creation",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": []
}