{
  "job_id": "1420880",
  "url": "https://www.onlinejobs.ph/jobseekers/job/ServiceNow-Developer-ServiceNow-Architects-SMEs-1420880",
  "scraped_at": "2025-07-15T04:27:58.037745",
  "title": "ServiceNow Developer (ServiceNow Architects, SMEs)",
  "type_of_work": "Full Time",
  "salary": "(Salary is confidential and the final salary offer will depend on the client and project they will be assigned)",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "JOB TITLE: ServiceNow Developer (ServiceNow Architects, SMEs)\nWORK SET UP: Hybrid in Taguig\nWORK SHIFT: Shifting\n\nThe work:?\n\n• Provide functional and technical expertise to plan, analyze, define and support the implementation of ServiceNow products or group of applications.\n• Facilitate impact assessment efforts in producing and reviewing estimates and solutions for client work requests.\n• Design, build and configure ServiceNow applications.\n• Work with an agile mindset to create value across ServiceNow projects of multiple scopes and scale.\n• Apply innovative ideas to drive automation.\n• Drive the delivery of outputs according to agreed schedules and specifications.\n• Combine business acumen and analytic insight with programming skills to design, develop, configure, build and support ServiceNow applications to meet specific requirements.\n• Develop ServiceNow application code, working through each sprint based on agreed stories – turning user requirements into testable product.\n• Implement, test, and deploy ServiceNow solutions using best practice software engineering and ITIL methodology.\n• Identify and solve issues and incidents within multiple components of the ServiceNow platform.\n• Perform thorough impact analysis and testing for ServiceNow patching and platform upgrades.\n• Raise issues and risks proactively, providing recommended solutions and mitigations.\n• Produce required deliverables and documentations according to defined standards.\n\nWhat’s in it for you?\n\n• You will be part of a diverse, vibrant,  ServiceNow Business Group, continually pushing the boundaries of business capabilities.\n• You will work on meaningful and innovative projects, powered by the ServiceNow platform. You’ll be immersed in industry best practices and platform features such as IT Service Management, IT Operations Management, HR Service Delivery, and many more.\n• The Organization will continually invest in your learning and growth. You’ll work with the Organization's certified System Administrations, Implementation Specialists, Application Developers, and will support you in growing your own tech stack and certifications.\n\nHere’s what you’ll need: ?\n\n• Required skill/s or must have skill/s: ServiceNow development or architecture skills on the ServiceNow platform and its product lines including but not limited to any of the following: ITSM, ITOM, SecOps, IRM, ITAM, HRSD, CSM, SPM\n• Years of experience:  At least 4 years of experience on ServiceNow development/architecture\n• Additional skill/s: (nice to have) Agile or Scrum methodology; GenAI\n• Open for those applicants who are currently in Philippines and already have the right to live and work in this country are eligible for this role\n\nNice to have:?\n• Any ServiceNow certification\n• ITIL knowledge and/or certification\n• A systems engineering or developer background with the ability to learn quickly and share your knowledge with the broader team?.\n• A mindset to automate everything?.\n\nFor Upskilling:\n• For those willing to be upskilled on the ServiceNow platform, experience in any of the following would be good foundational skills:\n• JavaScript or similar scripting languages, and the web as a development platform\n• Modern UI frameworks like Angular or React\n• Full stack development or developing automated solutions\n• DevOps implementations\n• Integrations and REST API automation\n• Agile development practices (e.g. SAFE, Scrum)\n• Automated testing using tools such as ServiceNow ATF, Selenium, etc.\n• Business analysis and design\n• Server/infrastructure administration\n• Security, Governance, Risk & Compliance – with good aptitude on development and configuration skills                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}