{
  "job_id": "1420840",
  "url": "https://www.onlinejobs.ph/jobseekers/job/FB-ADS-and-Social-Media-Management-1420840",
  "scraped_at": "2025-07-14T23:09:14.726657",
  "title": "FB ADS and Social Media Management",
  "type_of_work": "Part Time",
  "salary": "P 15, 000",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for a Social Media & Marketing Manager who doesn’t just post pretty content—but knows how to connect, build, and convert.\r\nSomeone who can confidently run and optimize Facebook & Instagram ads, and who’s ready to take full ownership of our digital presence.\n\r\nYou'll manage the online voice of two businesses and two personal brands. You’ll be the one turning our stories, services, and vision into measurable results.\n\r\nWhat You’ll Own:\r\n1. Manage and grow our accounts: Facebook, Instagram, LinkedIn, TikTok\r\n2. Run Meta Ads (FB & IG): from setup to scaling\r\n3. Create scroll-stopping visuals, reels, and campaigns using Canva or CapCut\r\n4. Write copy that speaks to real people—and makes them click, sign up, or buy\r\n5. Build a content calendar and drive consistent engagement\r\n6. Track metrics, test, learn, and improve\r\n7. Work directly with the founders and shape marketing strategies that matter\n\r\nYou Might Be Who We're Looking For If:\r\n1. You’ve successfully run ads and know what metrics to chase\r\n2. You enjoy writing, designing, creating. not just scheduling\r\n3. You’re proactive, reliable, and genuinely care about doing great work\r\n4. You keep an eye on trends, but stay rooted in strategy\r\n5. You want to grow—and you want the freedom to lead, create, and be trusted\n\r\nSchedule & Rate:\r\n100% Remote\r\nFlexible time | Available daily (7 days/week)\r\n?15,000/month (with the opportunity to go full-time based on performance)\n\r\nWhy You’ll Love Being Here:\r\nYou’ll work directly with passionate, supportive founders\r\nYour ideas will be heard—and implemented\r\nYou’ll grow with purpose, not pressure\r\nYou’ll have creative freedom\r\nYou’ll make a real difference in small businesses with a big heart\n\r\nTo Apply:\r\nUpload your resume and a short intro video here: Upgrade to see actual info\r\nIf you cannot see the link, please send us a message on our FB page: Go Virtual Philippines/ Elearning Academy by Go Virtual Philippines. \n\r\nWe’re not just hiring a task-doer.\r\nWe’re looking for a collaborator, a thinker, a creative partner who’s excited to build something meaningful—together.\n\r\nThis could be more than a job.\r\nThis could be your next big step.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Management",
    "Facebook Ads"
  ]
}