{
  "job_id": "1420911",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Online-ESL-tutor-1420911",
  "scraped_at": "2025-07-15T04:30:06.235793",
  "title": "Online ESL tutor",
  "type_of_work": "Full Time",
  "salary": "$350",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking an experienced and passionate online ESL tutor to work with teenage students at a beginner English level. The primary goal is to help them build confidence and fluency in conversational English for everyday situations.\n\r\nResponsibilities:\n\r\nConduct engaging, interactive online lessons focused on real-life communication\n\r\nCreate beginner-friendly lesson plans tailored for teenagers\n\r\nUse diverse teaching methods to encourage active student participation\n\r\nProvide clear, constructive feedback to help students improve gradually\n\r\nQualifications:\n\r\nProven experience teaching English as a Second Language (ESL)\n\r\nStrong understanding of language development for beginner learners\n\r\nAbility to build rapport with teenagers and create a fun learning environment\n\r\nExcellent communication skills and patience\n\r\nWorking Hours:\n\r\nKorea Standard Time (KST): 2:00 PM – 9:00 PM, Monday to Friday\n\r\nCompensation:\n\r\nFirst 3 months (probationary period): $175 USD/month\n\r\nAfter 3 months: $350 USD/month\n\r\nAdditional Requirements (Apostille Documents Required):\r\nTo be considered for this role, candidates must be able to provide apostilled copies of the following documents:\n\r\nA 2-year or 4-year college/university diploma\n\r\nA valid passport\n\r\nA criminal background check issued within the last 6 months\n\r\nA medical certificate (issued within the last month) confirming no drug use\n\r\nNote:\r\nFurther details regarding compensation or support for apostille-related documents will be discussed individually.\n\r\nIf you're passionate about helping students gain confidence in English and meet the above criteria, we’d love to hear from you!",
  "skill_requirements": [
    "English Speaking",
    "Tutorial Teaching",
    "English"
  ],
  "is_active": true,
  "status_history": []
}