{
  "job_id": "1420984",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Product-Listing-VA-Multiple-Other-Tasks-1420984",
  "scraped_at": "2025-07-15T02:28:17.878075",
  "title": "Product Listing VA + Multiple Other Tasks",
  "type_of_work": "Part Time",
  "salary": "$300",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Dear,\n\nFor our UK dropshipping brand we are looking forward to hit 7 figures this year. Therefore we are looking for a highly developed Shopify Lister and multiple other tasks like checking invoices (basic accounting) and store management with experience in Dropshipping in Shopify to be part of a new team in our organization, this is for a long term application. \n\nYou must understand the whole process and must be highly developed in communication. Therefore, please apply with the word \"orange\" before you introduce yourself. Read on to find out what tasks we expect you to perform, as well as the experience we feel is necessary for this job.\n\nPlease answer the following questions, if you are interested.\n\n- Do you have experience working with Shopify?\n- Do you have experience with preparing products so that they are ready to be advertised with?\n- Do you have experience in Trello?\n- Have you ever used slack for communication?\n- Are you available for 6-8 hours a day, 5-6 days a week?\n\n\nAs a Shopify Lister you have:\n\n- Experience in Shopify (Must!)\n- Good communication skills (Must!)\n- Experience with product research before (pre)\n- Experience with workflows like trello, monday.com etc. (must)\n- Experience with different communication platforms (slack)\n\nIf you do not meet the requirements, please do not submit an application for this role.\n\nYour duties will be:\n\n- Preparing products in the process to launch on our social media platforms. (5 per day)\n- Communicating with team members who participate in the same process\n- Being aware of the process and making sure there are no delays.\n- Updating the Google sheet with all products and following the instructions given.\n- Checking invoices match with quotations\n- Making sure product imagery is congruent\n\nIt is preferred if you have long term company goals in mind, eventually wanting to manage teams. \n\n\n* WORKFLOW IS PROVIDED THROUGH EVERY STEP OF THE PROCESS\n* CAREER OPPORTUNITIES IN THE TEAM\n* VIDEO TRAINING IS PROVIDED AS WELL\n\nIf you think you are the right person for this job and you are able to contribute to our company, please respond to this post.\n\nBest regards,\n\nLiam",
  "skill_requirements": [
    "Shopify",
    "Communication",
    "Cost Accounting"
  ],
  "is_active": true,
  "status_history": []
}