{
  "job_id": "1420955",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Data-Automation-Wizard-aka-Ops-Tech-Specialist-1420955",
  "scraped_at": "2025-07-15T05:26:01.024947",
  "title": "Data & Automation Wizard (a.k.a. Ops Tech Specialist)",
  "type_of_work": "Part Time",
  "salary": "450/month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "WHO WE ARE:\nAt Urban Landscaping & Irrigation, we’re not your average landscaping company. We’re building a smarter, smoother, and more human-centered business—one project, client, and team member at a time. We’re a small but scrappy crew in DFW with big dreams and even bigger spreadsheets. Now we’re looking for someone who can turn organized chaos into automated excellence.\nThe twist? You don’t need to live here. Work from wherever you feel most productive—home, coffee shop, beach, spaceship. We care about results, not your zip code.\n________________________________________\nWHAT YOU’LL DO (aka your power moves):\nWe need a tech-savvy problem solver who can build tools and systems that help real people get stuff done. You'll be our go-to person for anything involving data, dashboards, time tracking, automations—and now, AI integration. Yep, we want someone who’s not afraid to tell ChatGPT, “hold my beer” and let the bots work for you.\nYour Mission, Should You Choose to Accept It:\n• Build an accurate, easy-to-use Estimating System for landscaping services (Excel/Sheets/Python—whatever gets it done).\n• Create a slick Client Dashboard so customers can check their service status without needing to call.\n• Automate payroll previews for hourly employees (they’ll love you for it).\n• Help us track time without annoying logins or clunky apps—think small team, big need.\n• Use tools like Zapier, ChatGPT, or other AI buddies to automate boring stuff and free up human brainpower.\n• Help connect systems like Service Autopilot, Sheets, or other tools to talk to each other and run on autopilot.\n• Translate business needs into clean systems anyone on our team can use—no tech gatekeeping.\n________________________________________\nWHO YOU ARE (aka what you’re bringing to the squad):\n• You speak Excel, Google Sheets, and Python fluently (bonus: you can explain VLOOKUP to your grandma).\n• Comfortable with AI tools like ChatGPT, Claude, Notion AI, or Zapier—and you know how to use them as your digital sidekick.\n• You’ve built tools, automations, or dashboards that made someone say, “wait, you made that?”\n• Low-key obsessed with fixing broken systems, cleaning up messy data, and helping people work smarter.\n• You vibe with small businesses and like to see your work have a real, daily impact.\n________________________________________\nVIBES WE’RE LOOKING FOR:\n• Curious mind with DIY energy.\n• Not afraid to test, tweak, and break things to build better ones.\n• Good communicator—can break down the tech stuff for the non-tech folks.\n• Team player who wants to grow with us and leave their digital fingerprints all over our success.\n________________________________________\nPERKS:\n• Get in early at a growing company—we’re building this with you.\n• Flexibility in your schedule and workspace.\n• Direct impact—your tools and systems will be used every single day.\n• Creative freedom + room to experiment.\n• Access to tools, training, and tech you actually want to use (hello, AI lab time).\n________________________________________\nHOW TO APPLY:\nSlide into our inbox with a short intro, video, or portfolio link showing off your favorite dashboard, automation, or AI tool you’ve wrangled. Bonus points if you show us a before-and-after that slaps. \n________________________________________\nThis is for the builder, the hacker, the AI whisperer who wants to make a real difference in a business that values heart and horsepower. If you're ready to bring the tech magic to the landscaping world, we’re ready for you.",
  "skill_requirements": [
    "Python",
    "Data Engineering",
    "AI Tools"
  ],
  "is_active": true,
  "status_history": []
}