{
  "job_id": "1420898",
  "url": "https://www.onlinejobs.ph/jobseekers/job/VA-With-Medspa-Management-experience-1420898",
  "scraped_at": "2025-07-15T05:27:52.451734",
  "title": "VA With Medspa Management experience",
  "type_of_work": "Part Time",
  "salary": "$300 USD",
  "hours_per_week": "12",
  "date_updated": "Jul 14, 2025",
  "job_overview": "???? Job Opening: Virtual Assistant with Med Spa Experience (Google & Meta Ads + Client Support)\n\nAre you an experienced Virtual Assistant who understands the fast-paced world of Med Spas? We’re looking for a tech-savvy, organized, and highly responsive Virtual Assistant to help manage client communications and digital advertising campaigns for our upscale Med Spa.\n\n???? Position: Virtual Assistant (Part-Time/Full-Time, Remote)\n???? Industry: Aesthetic / Med Spa\n???? Location: Remote (Must be U.S.-based or fluent in English with excellent grammar and communication skills)\n???? Start Date: ASAP\n\n?\n\nKey Responsibilities:\n\n? Ads Management\n • Strategically create, monitor, and optimize Meta (Facebook/Instagram) and Google Ads campaigns\n • Report on performance, lead conversions, and budget spend\n • Adjust targeting and creative as needed to increase ROI\n\n? Client Communication & Booking (via OpenPhone)\n • Answer client questions professionally and promptly via text and call\n • Schedule and confirm client appointments using booking software\n • Handle rescheduling and cancellations efficiently\n • Provide basic information about services and pricing\n\n? Administrative Support\n • Update client records and maintain CRM\n • Send follow-ups and reminders\n • Assist with light social media engagement when needed\n\n?\n\nRequirements:\n • 1+ years experience in a Med Spa or beauty industry setting (virtual or in-office)\n • Proven experience with Google Ads and Meta Ads Manager\n • Proficiency using OpenPhone or similar platforms for business communication\n • Strong written and verbal communication skills\n • Comfortable with scheduling software (e.g., Square, Vagaro, or Aesthetic Record)\n • Detail-oriented and able to work independently\n • Professional and friendly attitude\n\n?\n\nPreferred But Not Required:\n • Familiarity with HIPAA compliance\n • Experience with Canva or basic content creation\n • Knowledge of common Med Spa services (Botox, fillers, microneedling, etc.)\n\n?\n\nTo Apply:\n\nPlease send your resume, a brief intro about your experience in the med spa or beauty industry, and at least one example of an ad campaign you’ve run (Google or Meta) to [your email here] with subject line: Virtual Assistant – Med Spa Application.\n\n?\n\nWe’re excited to find someone who is just as passionate about aesthetics and customer service as we are. If you love staying organized, helping clients feel their best, and diving into ad strategy—this role is for you.",
  "skill_requirements": [
    "Performance Marketing",
    "Google Analytics",
    "Meta Business Suite"
  ],
  "is_active": true,
  "status_history": []
}