{
  "job_id": "1420875",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AMAZING-N8N-WORKFLOW-BUILDER-NEEDED-FOR-7-FIG-ECOMMERCE-BRAND-1420875",
  "scraped_at": "2025-07-15T04:26:00.240103",
  "title": "AMAZING N8N WORKFLOW BUILDER NEEDED FOR 7 FIG ECOMMERCE BRAND",
  "type_of_work": "Any",
  "salary": "Everywhere from 7-15$ per hour depending on task",
  "hours_per_week": "30",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Amazing n8n workflow builder (experienced with both n8n and coding) wanted for 7 figure ecom brand\n\nHey there,\n\nMy team and I are looking for a new team member to join our amazing 7-figure eCommerce dropshipping business team.\n\nCurrently we are in need of someone that is responsible for the most important task of this business, Ai systems.\nIt's essential that you are experienced with n8n, coding and ai.\n\nIts imperative that you have exensive knowledge in both n8n and coding as the workflows needs to fullfil our needs fully, this is the type of tasks you would get:\nWebsite product automation. We have a template, we need to automate the replacing of text, colors and images in this template to create a product testing machine.\nAutomation of sending information between google drive folders and sheets.\nAutomation of notifications in master excel sheet.\nAnd much much more. \n\nPlease read the model template below for all the information that we expect, such as Role, Responsibilities, Results and Requirements. Explanation vacancy text:\n\n\n\nPRODUCT DESCRIPTION WRITER\n\nDepartment: \nAi Systyem Specialists\n\nReports To: \nCEO\n\nROLE\nBuilding automated systems that successfully automates our system more and more on a daily basis. You’re the person that is responsible for a very important part of the \nYou ensure that both the code and overall workflow is accurate and well made.\nYou ensure the task is instructions is followed to preserve the intended purpose of the workflow.\nYou make sure the new workflows hold up quality and function.\n\nRESPONSIBILITIES\nEnsuring that the finished workflow is fully operational and does exactly what we asked for.\nHaving a good grammar and spelling.\nMaintaining a certain benchmark that is created by the Process Manager.\nKnowing how to work with n8n, code, google sheets, and html.\nKnowing where to find the CEO and have close contact with his requirements, discussing and working together to successfully create the workflows he is looking for. \nUnderstands that the CEO often knows many of the programs needed to use and what they can do but doesnt have alot of knowledge in coding, this is where you need to successfully fill the gap fully!\n\nRESULTS\nBeing able to build smaller workflows in less than one day.\nBeing able to build medium workflows in less than 3 days.\nBeing able to build larger workflows in less than 5 days.\nMaking sure all the work is finished within a certain time frame\nFollowing the guidelines and instructions!\nLearning the guidelines fully!\nThinking along with the CEO and Process Manager to fully understand what you are building.\nImproving yourself and the results everyday.\n\nRemember and use the codeword \"apple\" when introducing yourself to us for the first time. This way we know that you read this post and is motivated to work with us specifically.\n\nPlease be kind and contact me by email: Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}