{
  "job_id": "1420886",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Store-Cloner-Shrine-Theme-or-Gempage-1420886",
  "scraped_at": "2025-07-15T04:22:15.186996",
  "title": "Shopify Store Cloner (Shrine Theme or Gempage) –",
  "type_of_work": "Gig",
  "salary": "300",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for a Shopify VA or developer who can rebuild Shopify stores using the Shrine or GemPages theme, replicating the homepage, product page, and overall layout exactly as the reference site.\n\r\nYou’ll be responsible for recreating 1 store per day, maintaining visual accuracy and mobile responsiveness.\n\r\nWe value precision, speed, and reliability — and we want to build a long-term partnership with someone who is consistent and takes ownership of their work.\n\r\n?\n\r\n???? Key Responsibilities:\r\n\t•\tClone existing Shopify stores using Shrine or GemPages (1 per day)\r\n\t•\tRecreate homepage, product pages, layout, fonts, spacing – pixel perfect\r\n\t•\tUpload content and images from the reference store\r\n\t•\tEnsure full mobile optimization and fast performance\r\n\t•\tCommunicate clearly and ask for clarification when needed\n\r\n?\n\r\n? Requirements:\r\n\t•\tExperience with Shrine or GemPages on Shopify (mandatory)\r\n\t•\tHigh attention to detail and ability to follow design exactly\r\n\t•\tAble to deliver 1 store per day\r\n\t•\tFamiliarity with Shopify admin, themes, and basic Liquid/CSS (preferred)\r\n\t•\tStable internet and availability to work daily\n\r\n?\n\r\n? Nice to Have:\r\n\t•\tExperience with other Page Builders like PageFly\r\n\t•\tBackground in dropshipping or e-commerce\n\r\n?\n\r\n???? Work Structure & Growth Opportunity:\n\r\nWe will start on a per-store (project-based) model. If you are consistent and deliver high-quality work, we will transition you to a full-time, long-term position.\n\r\nYour income will grow based on your reliability and consistency. The more stable and precise your work is, the more we will rely on you — and reward you accordingly.\n\r\n?\n\r\n???? To Apply:\n\r\nPlease send:\r\n• Examples of Shopify stores you have built using Shrine or GemPages\r\n• Your expected rate per store (fixed price, not hourly or monthly)\r\n• A short message confirming that you can deliver 1 store per day",
  "skill_requirements": [
    "Shopify"
  ],
  "is_active": true,
  "status_history": []
}