{
  "job_id": "1420864",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-IT-Representative-Web-Software-Specialist-1420864",
  "scraped_at": "2025-07-15T04:21:20.294977",
  "title": "Full-Time IT Representative & Web Software Specialist",
  "type_of_work": "Full Time",
  "salary": "$3000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Location: Remote\r\nCompensation: $3,000/month (Full-Time)\r\nEmployment Type: Contract\n\r\nAbout the Role:\r\nI am seeking a talented and experienced developer to represent me, Robert Eatherly from Oklahoma, in the pursuit and operation of a full-time IT role. This position involves not only applying for suitable IT roles on my behalf but also performing the actual job duties once secured.\n\r\nThe ideal candidate will serve as my representative in professional communications, interviews, and ultimately, in the execution of the job itself.\n\r\nResponsibilities:\n\r\nApply for IT/web development roles on behalf of Robert Eatherly\n\r\nAttend virtual interviews, representing Robert in a professional and fluent manner\r\nFulfill daily responsibilities of any IT/web development position secured under Robert's name\r\nEnsure confidentiality and maintain a high standard of work throughout the contract\n\r\nQualifications:\r\nC1 level English proficiency (spoken and written)\r\nStrong interview and communication skills\r\nAt least 3 years of experience in web software development (frontend, backend, or full stack)\r\nHigh level of professionalism, integrity, and reliability\r\nAbility to work full-time and meet all job obligations\n\r\nWhat You’ll Receive:\r\nMonthly compensation of $3,000 USD\r\nLong-term contract potential\r\nFlexible, remote working environment\r\nDirect support and communication with Robert Eatherly\n\r\nNote: This is a highly unique arrangement that requires trust, discretion, and professional excellence. All work performed will be under my name, and you must be comfortable with this condition.\n\r\nPlease add me on d.i.s.c.o.r.d ONLY! superbluestar_1019_cool and comment \"Onlinejob Applicant\"\r\nI will not entertain message here .",
  "skill_requirements": [
    "IT",
    "Fullstack"
  ],
  "is_active": true,
  "status_history": []
}