{
  "job_id": "1421930",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Commercial-Assistant-1421930",
  "scraped_at": "2025-07-14T23:09:57.961512",
  "title": "Amazon Commercial Assistant",
  "type_of_work": "Part Time",
  "salary": "$4-$6 USD per hour",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking a skilled and proactive individual to help us manage, optimize, and grow our Amazon business. The ideal candidate will have hands-on experience with Amazon Seller Central, a deep understanding of SEO best practices tailored for Amazon, and excellent copywriting skills to craft high-converting, keyword-optimized listings.\n\r\nThis role requires strong attention to detail, excellent communication skills, and the ability to maintain a high-performing, fully compliant Amazon storefront while driving continuous improvement in visibility, rankings, and sales.\n\r\nRequired Expertise:\n\r\nAmazon Marketplace Management: Proven ability to navigate and manage all aspects of Amazon Seller Central effectively.\r\nListing Creation & Optimization: Skilled in creating and optimizing new product listings, setting up new ASINs, and completing backend attributes accurately.\r\nVariation Setup: Experience creating and modifying product variations (e.g., size, colour) to maximize customer experience and search relevance.\r\nHazmat Compliance: Knowledge of Amazon’s hazmat policies and the ability to prepare and submit hazmat documentation properly.\r\nSupport Case Management: Professional and persistent in opening and managing support cases to resolve listing or account issues efficiently and politely.\r\nKeyword Research: Advanced ability to perform in-depth keyword research, identify high-impact search terms, and integrate them strategically into listings using tools like Helium10, Data Dive, or similar.\r\nOn-Page SEO Expertise: Strong understanding of how to structure titles, bullet points, product descriptions, and backend search terms for maximum discoverability and ranking within Amazon’s A10 algorithm, Rufus and COSMO.\r\nCompetitor & Category Analysis: Ability to analyse competitor listings and categories to identify gaps and opportunities for optimization.\r\nCopywriting: Excellent copywriting skills with a proven ability to write clear, persuasive, and product-specific copy based on product features and customer needs.\r\nBasic Excel Skills: Comfortable downloading, editing, and managing Amazon flat files and spreadsheets (no advanced Excel functions required).\n\r\nPreferred Skills (a plus, but not required):\r\nFamiliarity with Data Dive: ability to perform comprehensive category research and use listing builder tools effectively.\r\nFamiliarity with Helium10: experience using tools such as Magnet, Cerebro, Scribbles, X-Ray, and Keyword Tracker.\r\nExperience with AI Tools: ability to leverage AI-based solutions for content generation, data analysis, and workflow efficiency.\r\nUnderstanding of conversion optimization principles (e.g., improving CTR and CVR through listing enhancements, imagery suggestions, etc.).\n\r\nIf you’re passionate about e-commerce, Amazon SEO, and creating impactful listings, we’d love to hear from you!",
  "skill_requirements": [
    "Creative Writing",
    "Amazon",
    "Keyword Management"
  ]
}