{
  "job_id": "1421957",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Paid-Ads-Specialist-1421957",
  "scraped_at": "2025-07-15T06:40:12.395934",
  "title": "Paid Ads Specialist",
  "type_of_work": "Full Time",
  "salary": "$4-$7 (or more based on skill level)",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "lease read this carefully to the end. If you do not, I will not respond to your application. Attention to detail is key.\n\r\nWe are hiring a Full-Time Paid Ads Specialist with experience running Facebook, Instagram, Google, and Amazon Ads. This is a long-term opportunity with room to grow into a leadership role. You’ll be a key player in helping us scale ad campaigns for multiple brands across the martial arts and eCommerce industries.\n\r\nIn addition to ads management, we’re looking for someone with graphic design skills to help create ad creatives, landing page assets, and branded visuals.\n\r\nKey Responsibilities:\n\r\n1. Paid Ads Management\n\r\n• Plan, launch, and optimize paid ad campaigns across:\n\r\n• Meta (Facebook & Instagram)\n\r\n• Google Ads (Search, Display, YouTube)\n\r\n• Amazon Ads (PPC, Sponsored Brands, Product Listings)\n\r\n• Monitor KPIs daily and adjust targeting, budget, and creatives based on performance\n\r\n• A/B test headlines, thumbnails, creative formats, landing pages, and offers\n\r\n• Create custom audiences, retargeting flows, and conversion-focused funnels\n\r\n• Provide weekly ad reports and campaign insights\n\r\n2. Graphic Design & Creative Development\n\r\n• Design static ads, social graphics, and promotional assets using Canva or Adobe Creative Suite\n\r\n• Collaborate with our copywriters or marketing team to turn scripts or ideas into visuals\n\r\n• Ensure all assets match brand guidelines and platform specifications\n\r\n• Occasionally assist with mockups for new product launches or landing pages\n\r\n3. Bonus Responsibilities (Optional but Valuable)\n\r\n• Build landing pages (in GHL, Duda, or similar tools)\n\r\n• Write ad copy for different platforms\n\r\n• Help research competitors and gather swipe files for inspiration\n\r\nMust-Have Experience With:\n\r\n• Ads Platforms: Meta Ads Manager, Google Ads, Amazon Seller Central\n\r\n• Design Tools: Canva, Adobe Photoshop or Illustrator\n\r\n• Project Tools: ClickUp, Slack, Gmail\n\r\n• Reporting: Google Sheets or Excel\n\r\n• Understanding of Sales Funnels, Retargeting, and Audience Segmentation\n\r\nWhat We’re Looking For\n\r\n• Experience running paid ad campaigns for brands or agencies\n\r\n• Strong graphic design eye — you don’t just place images; you think about performance\n\r\n• Fluent in KPIs: CTR, ROAS, CPA, AOV, LTV\n\r\n• Responsive communicator who meets deadlines\n\r\n• Comfortable taking initiative, proposing new strategies, and evolving with platform changes\n\r\nThis is a full-time role with growth potential. As we scale, you could move into a more senior position — leading the creative strategy or managing a team. If you’re a results-driven thinker who enjoys both the creative and analytical side of ads, this is your chance to grow with a company that moves fast.\n\r\nTo ensure you’ve read this entire listing, please respond with the word “triangle” and include:\n\r\nYour portfolio or examples of past ad campaigns and creatives\n\r\nA list of platforms and tools you’ve used\n\r\nAny certifications (Meta, Google, etc. are a plus)",
  "skill_requirements": [
    "Advertising",
    "Google Ads",
    "Facebook Ads"
  ],
  "is_active": true,
  "status_history": []
}