{
  "job_id": "1421908",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421908",
  "scraped_at": "2025-07-14T23:10:04.716998",
  "title": "Audio Editor",
  "type_of_work": "Any",
  "salary": "TBD depending on experience",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Date with the Muse is looking for a talented audio editor who can make use of raw, unedited media and turn them into consumable audio for advertising and social media.\n\r\nWork hours are flexible so long as deadlines are met every week. But there will be a time where you have to meet with the CEO and communicate with other teaUpgrade to see actual infombers to discuss projects.\n\r\nDate With the Muse\nUpgrade to see actual info\n\r\nIf you can commit to and live with the following principles, then you are the type of person who will be successful and help our company thrive. If you feel this level of engagement is not right for you or that you’re not willing or able to participate with us at this level, we are not a good fit for you.\n\r\nOur expectation is that you will take the steps necessary to do what you say you are going to do and be accountable for your actions. You are committed to excellence and take pride in a job well done.\n\r\nWe understand that not every person is ready for this level of performance, and we appreciate the honesty of those who dUpgrade to see actual info this is not the right place for them. On the other hand, you would make an ideal candidate to join our company if you are willing to commit to the following principles:\n\r\n- Accountability: see it, own it, solve it, do it\r\n- Become part of the solution\r\n- Respect for others and their feelings\r\n- Act now.\r\n- Ask the question: “What else can I do?”\r\n- Ask the questions: “What coaching do you have for me?” and “What can I do better?”\r\n- Personal ownership and pride\r\n- Reject average\r\n- Show others that you care\n\r\nTasks include:\n\r\n• Adding Music and Sound Effects\r\n• Enhance Podcast Tone Through Equalization\r\n• Ensure Quality of Audio\r\n• Audio Editing and Post-production\r\n• Developing And Maintaining the Podcast Schedule\r\n• Managing Sound Quality and Editing Episodes\r\n• Organize Tracks and Audio Clips\r\n• Transcribe Podcasts and Audio Files\r\n• Be Able to Diagnose Technical Issues\n\n\r\nQualifications:\n\r\n• Proficiency with audio editing software\r\n• Preferably experienced with Trello, Vimeo and Gmail\r\n• Fast internet speed for upload and download\r\n• Pays close attention to details\r\n• Ability to take feedback on audios\r\n• Experience in WordPress is a plus\n\r\nQualified applicants are to be given a trial audio editing task.\n\r\nSchedule: Part-time flexible shift\r\nMonday to Friday, with occasional weekend work\n\r\nWork Location: Virtual\n\r\n**Qualified applicants are encouraged to apply as soon as possible.\r\nTo express interest please submit\r\nALL OF THESE MATERIALS AND NOTHING BUT THESE MATERIALS\r\n--a cover letter detailing why you are uniquely qualified for this role,\r\n--a resume,\r\n--and THIS DISC profile (not some other one) Upgrade to see actual info/VO/095915a3/en\n\r\n**We do not need to see links to your portfolio or any additional materials at this time. Please provide only the items requested**\n \nEmail all materials as PDF attachments to Upgrade to see actual info with the subject line AUDIO EDITOR\n\r\nInterviews will be conducted on a rolling basis.",
  "skill_requirements": [
    "Podcast Content Creation",
    "Audio Editing",
    "Wordpress"
  ]
}