{
  "job_id": "1421877",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Administrative-AsisstantMarketing-Manager-1421877",
  "scraped_at": "2025-07-15T14:35:42.988909",
  "title": "Administrative Asisstant/Marketing Manager",
  "type_of_work": "Full Time",
  "salary": "$800-1280/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Administrative Assistant\n\r\nRemote (Greenville, SC, USA)\r\nAre you a detail-oriented individual with a passion for organization and growth? J Pratt Construction is seeking a dedicated Administrative Support Specialist to join our team. This part-time position, initially remote, has the potential to evolve into a full-time role for the right candidate.\n\r\nAbout Us: At J Pratt Construction, we pride ourselves on delivering exceptional service and high-quality results. As we continue to expand, we are looking for someone who shares our commitment to excellence and is ready to contribute to our success.\n\r\nKey Responsibilities:\r\nMust have working knowledge of JobTread and ability to update catalog, pricing, and CRM\r\nBlogging & Content Creation: Develop engaging blog content that highlights our projects and expertise. Must be able to do some video editing and upload to our social media platforms. Have some creative document design experience to assist with marketing materials. Platforms include Instagram, Facebook, and YouTube\r\nAutomation Creation: Develop and implement automations to improve efficiency.\r\nWillingness to assist in the creation and documentation of processes and procedures via walk-through videos and written step-by-step processes.\r\nStrong organizational skills and ability to electronically file business documents in a logical manner\r\nShould be familiar with how to use collaborative tools such as Trello, Google Docs, Slack, and JobTread\r\nAbility to produce basic construction drawings\r\nCalendar Management: Must be able to manage multiple calendars to avoid conflicts\r\nInbox Management: Effectively and efficiently organize CEO emails and handle basic responses when appropriate.\r\nResearch & Strategy: Ability to generate detailed reports with action items on how to improve or create better processes and client experience along with marketing strategies.\r\n- Prospecting: Conduct outreach via email and social media to generate new leads and expand our client base as well as make contact with new vendors. Monitor social Facebook groups throughout the day and respond to requests for service.\r\n- Social Media Management: Create consistent posting and engagement schedule on our social media platforms to build our online presence.\r\n- Maintain current vendor Certificates of Insurance and request new certificates as necessary  \r\n- Apply for building permits\r\n- Document project selection sheets & maintain CRM entries and tracking\r\nAbility to have daily meeting with CEO to review tasks, statuses, and answer any questions.\n\r\nQualifications:\r\nExperience in administrative roles, preferably within the construction industry.\r\nMust be proactive, organized, and a problem-solver.\r\n- Proficiency in JobTread and other CRM tools.\r\n- Proficiency with Google Workspace\r\n- Strong organizational skills and attention to detail.\r\n- Excellent written communication skills for blogging and client interactions.\r\nAbility to work independently and manage multiple tasks effectively.\r\nHave power and internet backups in place to not have disruption\r\nPreferred Apple-based software and products\n\n\nUpgrade to see actual info",
  "skill_requirements": [
    "Marketing",
    "Auto Cad",
    "Organization"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:26:19.610534",
      "reason": "Job first discovered"
    }
  ]
}