{
  "job_id": "1421839",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421839",
  "scraped_at": "2025-07-14T23:09:13.497044",
  "title": "Amazon Team Lead",
  "type_of_work": "Any",
  "salary": "1500",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "# ???? Amazon Team Lead\n\r\n## ???? About Us\n\r\nWe’re a fast-scaling eCommerce brand (or agency) managing multiple high-growth ASINs across the Amazon marketplace. We’re looking for a **strategic and hands-on Amazon Team Lead** to manage day-to-day operations, guide performance, and coordinate across teams including ads, listings, supply chain, and creatives.\n\r\n## ???? What You’ll Own\n\r\n* Lead and manage Amazon strategy for our brand(s) or clients\r\n* Oversee execution across key areas: PPC, SEO, listings, storefront, promotions\r\n* Act as primary POC for teaUpgrade to see actual infombers (ads, listing, creatives, supply chain)\r\n* Monitor account health, BSR, TACoS, inventory levels, and customer experience\r\n* Create and maintain SOPs for listing optimization, launches, and A+ content\r\n* Manage launches, pricing strategy, and content updates\r\n* Lead weekly performance reviews and reporting across SKUs\n\r\n## ? What We’re Looking For\n\r\n* 2–3+ years managing Amazon Seller Central accounts (PPC + operations)\r\n* Strong understanding of Amazon ecosystem: A9, FBA, ads, SEO, promotions\r\n* Proven track record of scaling brands or managing multi-6/7-figure accounts\r\n* Confident with tools like Helium 10, DataDive, Sellerboard, or Pacvue\r\n* Comfortable leading a small team or cross-functional freelancers\r\n* Strong communication, problem-solving, and organizational skills\r\n* Bonus: experience with brand registry, DSP, or international marketplaces\n\r\n---\n\r\n## ???? What You’ll Get\n\r\n* Ownership of key Amazon growth levers\r\n* Opportunity to scale multiple brands from 6 to 7+ figures\r\n* Fully remote flexibility\r\n* Transparent bonus incentives for hitting key KPIs\r\n* Fast-moving team with growth potential and autonomy\n\r\n## ???? To Apply\n\r\nPlease send:\n\r\n* A short intro or Loom video explaining your Amazon experience\r\n* Examples of brands/accounts you’ve worked on\r\n* Results you’ve helped achieve (TACoS, ROAS, revenue growth, etc.)\r\n* Resume or LinkedIn profile\r\n* Availability and preferred time zone\n\r\n**Serious operators only.**\r\nIf you’ve built or scaled successful Amazon brands, we want to hear from you.",
  "skill_requirements": [
    "Amazon",
    "English Proficiency",
    "Team Leadership"
  ]
}