{
  "job_id": "1421929",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-High-Level-Online-Operations-1421929",
  "scraped_at": "2025-07-15T06:30:08.620247",
  "title": "Virtual Assistant (High-Level Online Operations)",
  "type_of_work": "Full Time",
  "salary": "1200",
  "hours_per_week": "50",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re hiring a high-level, resourceful Virtual Assistant to help manage and grow key parts of an online social media business.\n\r\nThis isn’t a role for someone who just completes checklists. We’re looking for someone who:\r\n • Can take ownership of projects and make decisions.\r\n • Stays on top of digital social trends and tools.\r\n • Excels at organizing, researching, and executing high-level online tasks.\n\r\nIf you’re proactive, ambitious, and thrive in a fast-moving environment, keep reading.\n\r\nWhat You’ll Do\r\n • Manage communications: emails, DMs, and outreach to partners/clients.\r\n • Research and organize information for digital projects and content.\r\n • Assist with social media (content ideas, scheduling, engagement).\r\n • Complete any virtual tasks asked upon completed at the highest level\n\r\nWhat We’re Looking For\r\n • Excellent written and spoken English.\r\n • Proven experience handling online tasks for entrepreneurs or businesses.\r\n • Proactive problem-solver who doesn’t wait to be told what to do.\r\n • 2+ years of experience in digital marketing / social media growth\r\n • Reliable internet and ability to work US hours (or partial overlap).\n\r\nHow to Apply - Response to these questions:\r\n1. Share links to your resume / social media accounts / digital work experience\r\n2. What’s the hardest you’ve ever worked on something in your life, and why did you do it?\r\n3. Why should we hire you out of the 1,000+ applicants we receive?",
  "skill_requirements": [
    "Social Media Management",
    "Executive Assistance",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": []
}