{
  "job_id": "1421057",
  "url": "https://www.onlinejobs.ph/jobseekers/job/E-commerce-Web-Developer-BigCommerce-Specialist-Contract-1421057",
  "scraped_at": "2025-07-14T23:08:51.654680",
  "title": "E-commerce Web Developer (BigCommerce Specialist) - Contract",
  "type_of_work": "Gig",
  "salary": "500",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Company: Green Kulture MSP\r\nLocation: Lauderhill, FL (Remote a possibility for the right candidate)\r\nJob Type: Short-Term Contract (with high potential for part-time or full-time engagement)\n\r\nAbout Us\n\r\nGreen Kulture MSP is a dynamic and growing digital solutions provider dedicated to helping our clients build robust and effective online presences. We partner with exciting businesses to provide foundational IT, web development, and digital marketing strategies. We are a collaborative team of experts focused on delivering excellence and tangible results.\n\r\nThe Opportunity\n\r\nWe are seeking a highly skilled E-commerce Web Developer with specific expertise in the BigCommerce platform for an immediate, short-term project. You will be responsible for building a new, fully functional e-commerce website for a premier client in the health and wellness space. This is a critical project with a tight timeline and requires a developer who can hit the ground running.\n\r\nWhile this role is initially for a single project, our company is growing rapidly. For the right candidate, this has the strong potential to evolve into a recurring part-time or full-time position as we take on new client projects.\n\r\nProject Overview\n\r\nYou will be the lead developer for a foundational digital setup for a premier client in the health and wellness sector. They are an innovative company specializing in nature-based therapeutic solutions, including compliant, hemp-derived products. This project involves building their primary direct-to-consumer (DTC) e-commerce website from the ground up on the BigCommerce platform.\n\r\nKey Responsibilities\n\r\nTake ownership of the end-to-end development of a new BigCommerce website.\n\r\nImplement and customize a premium BigCommerce theme to match the client's new brand guidelines (logo, color palette, typography).\n\r\nBuild out all essential e-commerce pages, including the Homepage, Product Listing Pages, Product Detail Pages, Cart, and Checkout.\n\r\nPopulate the website with up to 20 initial products and all core page content provided by the client.\n\r\nIntegrate and configure third-party applications, specifically a high-risk payment gateway and an age verification tool.\n\r\nSet up and configure basic shipping zones and rules within BigCommerce.\n\r\nEnsure the final website is fully responsive, mobile-first, and optimized for performance across all major browsers.\n\r\nCollaborate closely with our project manager, CTO, and marketing team via Microsoft Teams and Planner to ensure the project stays on schedule.\n\r\nRequired Skills & Experience (Must-Haves)\n\r\nProven experience as a Web Developer with a strong portfolio of BigCommerce websites you have built or significantly customized.\n\r\nExpert proficiency in HTML5, CSS3, and JavaScript.\n\r\nDeep understanding of the BigCommerce platform, including its theme architecture, objects, and APIs.\n\r\nDemonstrable experience integrating third-party apps and payment gateways into an e-commerce platform.\n\r\nStrong understanding of mobile-first design principles and responsive development techniques.\n\r\nExcellent communication skills and the ability to work effectively in a collaborative remote team environment.\n\r\nSelf-motivated with a strong attention to detail and problem-solving skills.\n\r\nBonus Points (Nice-to-Haves)\n\r\nExperience working with clients in high-risk or regulated industries (e.g., CBD, hemp, wellness supplements).\n\r\nPrior experience with specific age verification and high-risk payment gateway integrations.\n\r\nA good eye for UI/UX design and the ability to provide constructive feedback on design mockups.\n\r\nWhat We Offer\n\r\nThe opportunity to be a key player in an exciting and high-priority project.\n\r\nA collaborative environment with a team of dedicated professionals.\n\r\nHigh potential for future projects and a long-term working relationship.\n\r\nA competitive contract rate, commensurate with experience.\n\r\nHow to Apply\n\r\nIf you are a talented BigCommerce developer looking for your next challenge, we encourage you to apply. Please submit your resume, a link to your portfolio (must include examples of BigCommerce sites), and a brief cover letter outlining your relevant experience to Upgrade to see actual info",
  "skill_requirements": [
    "Web Design & Page Layout",
    "Javascript",
    "Bigcommerce"
  ]
}