{
  "job_id": "1421755",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Project-Manager-Creative-Production-1421755",
  "scraped_at": "2025-07-14T23:23:13.236446",
  "title": "Project Manager – Creative Production",
  "type_of_work": "Part Time",
  "salary": "$10p/h - $15p/h",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Part-Time (with full time possibility)| Remote (UK time preferred)\n\r\nWe’re Yogrt Media, and we make ads that don’t look like ads. We’re a fast-growing creative agency crafting scroll-stopping content for ambitious brands — and we need someone to keep the engine running smoothly.\n\r\nWe’re looking for an organized, proactive Project Manager to own timelines, keep everyone aligned, and make sure nothing falls through the cracks. You’ll work closely with our creatives, strategists, editors, and clients to deliver great work, on time and on point.\n\r\nWhat you’ll do\r\nRun the show: keep projects moving from onboarding ? strategy ? production ? post-production ? delivery.\r\nOwn the schedule: manage deadlines, track progress, and unblock the team.\r\nBe the bridge: coordinate between clients and the team on deliverables & approvals.\r\nKeep us sharp: make sure SOPs are followed and help improve them as we grow.\r\nSupport: help onboard and coordinate freelancers, interns, and contractors.\r\nSpot issues early and keep everything (and everyone) aligned.\n\r\nWhat you bring\r\n- Experience managing creative, production, or marketing projects (agency or studio experience is a must).\r\n- Excellent communication, organizational, and problem-solving skills.\r\n- Confident using tools like Notion, Slack, Upgrade to see actual info, etc. : Especially with Notion.\r\n- Calm under pressure and able to juggle multiple projects.\r\n- A collaborative, no-drama attitude.\n\r\nWhy Yogrt?\r\nWe’re not a boring agency. We make cool, creative work that actually performs, and have fun doing it. You’ll join a tight-knit, talented team where you can take real ownership and grow with us.",
  "skill_requirements": [
    "Project Management"
  ],
  "is_active": true,
  "status_history": []
}