{
  "job_id": "1421757",
  "url": "https://www.onlinejobs.ph/jobseekers/job/HighLevel-Admin-Automation-CRM-Migration-Specialist-1421757",
  "scraped_at": "2025-07-14T23:18:27.237941",
  "title": "HighLevel Admin (Automation & CRM Migration Specialist)",
  "type_of_work": "Full Time",
  "salary": "PHP 30000",
  "hours_per_week": "8",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Total Agent(s) Needed: 2\r\nType of Account/Industry: Other\r\nTarget Start Date: ASAP\r\nWorkplace: Remote (Permanent Work from home set-up)\r\nSchedule: AU Timezone \r\nType of Employment: Full time (40 hours per week)\n\r\nPerks of working at Telework PH:\r\n- Basic salary of 28K-30K (depending on experience) + 2K allowance (non-negotiable)\r\n- Bonus and Incentives depending on Performance*\r\n- Government mandated benefits\r\n- OT Pay, Holiday Pay, 13th Month Pay, Night Differential Pay\r\n- Paid Leaves (VL and SL) every month which are convertible to cash, after 1 year of service if unused*\r\n- Life AUpgrade to see actual info Protection Plan under Sunlife with Tendopay, after 3 months of tenure*\r\n- HMO upon regularization*\r\n- Annual Salary Increase*\n\r\nAbout the Client\r\nThe Client is an Australia-based marketing agency helping portrait photography studios grow\r\nthrough performance marketing and automation. We’re a remote team working across Australia\r\nand the Philippines, known for our supportive culture, high standards, and client-first mindset.\n\r\nThe Role\r\nWe’re hiring a HighLevel Admin to lead CRM migrations and optimize automation workflows\r\nacross our growing client base. This is not a white-label or SaaS reseller support role—this is a\r\nhands-on, internal position working across multiple client setups to make HighLevel work\r\nbetter for real businesses.\r\nYou’ll be responsible for calendar systems, pipeline automation, AI Agent setup, CRM\r\nmigrations, and continuous process improvement.\n\r\nResponsibilities:\r\n? Migrate clients from CRMs like Keap, ActiveCampaign, and Pipedrive into HighLevel\r\n? Set up and optimize calendars, pipelines, SMS/email automations, forms, and\r\nsurveys\r\n? Configure and maintain phone systems (e.g. JustCall integrations)\r\n? Set up and train AI Agents (voice and chat) for real-world usage\r\n? Work directly with the team to improve workflows across accounts\r\n? Proactively suggest better ways to use HighLevel to get real results\n\r\nRequirements:\r\n? HighLevel Certification with hands-on client experience (not just theory)\r\n? Strong working knowledge of HighLevel’s calendar, automation, and AI tools\r\n? Demonstrated experience with CRM migrations and solving real-world edge cases\r\n? Strong problem-solving skills and attention to detail\r\n? Clear communicator, able to document and explain solutions\r\n? Available to work AU timezone hours (GMT+8)\n\r\nBonus If You Have\r\n? Experience training others on HighLevel\r\n? Familiarity with outbound sales workflows\r\n? Knowledge of website migration (Wix/Squarespace to HL)\n\r\nThis is a full-time, business-critical role. You’ll be a key part of helping our clients run better,\r\nsmarter, and faster.",
  "skill_requirements": [
    "CRM",
    "GoHighLevel",
    "Active Campaign"
  ],
  "is_active": true,
  "status_history": []
}