{
  "job_id": "1421955",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421955",
  "scraped_at": "2025-07-14T23:09:04.088124",
  "title": "Full-Time Executive Assistant – Multivista - Tech Services Business",
  "type_of_work": "Full Time",
  "salary": "Php 50,000 - 70,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "What We Need:\n\r\nWe’re seeking an experienced, organised and self-motivated Executive Assistant to support the 2 directors in our busy London office.\n\r\nWe are looking for a self-starter with good all-round skills who is likely to have some experience in a rapidly growing business.\n\r\nThis is a very dynamic role in a fast-growing business with a variety of exciting and prestigious projects across London. The business is a leader in construction digital documentation, so we expect you have a great understanding of digital systems.\n\r\nYou will be expected to multitask and work under pressure to meet the demands of fast moving regularly changing requirements.\r\nYou will need to be able to quickly move from task-to-task, as in any one day you might be:- Managing emails and diaries, setting up meetings, arranging travel, providing research information, setting up project schedules, collating and reporting on project information, liaising with clients, the team or suppliers.\n\r\nWe expect you to be knowledgeable about a wide range of systems used for productivity in a business, and to quickly adapt to use them.\n\r\nAs a growing company, we want you to identify areas for improving efficiencies by suggesting change and revising internal processes.\n\r\nYou’re Great At:\n\r\n• Managing your time and tasks: you’re an organised multi-tasker, you plan & schedule activities, and ensure that tasks are finished by scheduled dates\r\n• Handling pressure: you respond quickly and diligently, you react to ever-changing projects, and you keep your cool when the curve-balls fly in.\r\n• Motivating & driving yourself: you are prompt & dependable, you take ownership of your time and workload, you are hungry to succeed and progress.\r\n• Connecting with people: you’re respected by your colleagues and clients, you proactively communicate with key people, and you inspire others around you\r\n• Attention to detail: you’re good at checking that everything is correct\r\n• Thinking on your feet: you like learning new things, and you can learn quickly. You’re open to new technology and when things change, you use your initiative to adapt.\n\r\nIdeally you:\n\r\n• Have 3+ years’ experience in an Executive Assistant role\r\n• Good written and spoken English\r\n• Have a bachelors degree level education\r\n• Have an excellent knowledge of MS Office products and be especially good with Excel and Word\r\n• Have experience using a wide range of remote working systems such as Dropbox, Zoom, Salesforce etc\r\n• Are an excellent time manager and multi-tasker\r\n• Will have some experience of the UK construction/property market (Real Estate)\r\n• Have experience managing and communicating within a multi-disciplinary team\r\n• Some experience managing HR and recruitment\r\n• Some experience with project management in an operational environment\n\r\nDuties and Tasks will include:\n\r\n• Understand directors' goals and priorities and provide full administrative support\r\n• Manage executive diaries: schedule meetings, manage conflicts, prioritise effectively\r\n• Oversee executive inbox: respond, file, follow-up, and escalate as needed\r\n• Organise meetings (clients, stakeholders, internal teams) across time zones, including in-person, video, and conference calls\r\n• Handle complex travel arrangements, including detailed itineraries, visa prep, bookings, and follow-ups\r\n• Governance support: manage approvals, expenses, red line submissions\r\n• Prepare and handle documentation: leadership papers, presentations, contracts, reports, letters, and confidential material\r\n• Manage sensitive or confidential tasks for directors, including team restructures and crisis support\r\n• Prioritise and report on key tasks for directors\r\n• Conduct research and summarise findings for projects and business development\r\n• Set up and manage project schedules; collate and report on key information\r\n• Liaise with clients, suppliers, and internal teams to ensure smooth communication\r\n• Maintain and organise digital documents and records\r\n• Review and check accuracy of reports, contracts, and data\r\n• Maintain project databases and ensure up-to-date records\r\n• Keep client insurance records updated annually to ensure uninterrupted payments\r\n• Manage and track staff training materials to confirm compliance and currency\r\n• Monitor stock levels for office refreshments and coordinate replenishment\r\n• Manage software licenses, access rights, and billing across key platforms\r\n• Support HR tasks including recruitment, contracts, documentation checks, onboarding/offboarding\r\n• Plan and coordinate business and staff events, such as the annual Christmas Party or team socials\r\n• Oversee marketing-related event logistics where the business attends as an exhibitor\r\n• Provide ad hoc support to directors and team as required\n\r\nLocation:\n\r\nThe office is based in London. We expect you to work remotely but we need you to be available in typical UK working hours 8.30 – 5.30 (GMT)\n\r\nHours:\n\r\nWe are looking for a full-time role on a freelance basis. You must be fully available during standard UK working hours (8.30 AM – 5.30 PM GMT) and responsive throughout the day — including being able to answer calls and messages from the directors as needed. (Part-time applicants will not be considered.)\n\r\nThe Company\n\r\nMultivista is the leading global provider of visual documentation to the Construction and Facilities Management Industries. Multivista combines photography, video, webcam, drone (UAV) and 3D reality capture services with a robust software delivery platform to create interactive records of actual construction conditions and events.\r\nFounded in 2003, Multivista now operates in almost every major metropolitan area across the United States, Canada and the United Kingdom (and growing in Europe and the Middle East). Multivista has been awarded contracts to document more than 2.5 billion square feet of construction projects. That's 50,000+ projects for 20,000+ Clients across every type of construction.\n\r\nVisit Upgrade to see actual info to learn more about Multivista.\n\r\nMultivista London is a group company, growing in its own right.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}