{
  "job_id": "1421656",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SEO-COACH-EXPERT-1421656",
  "scraped_at": "2025-07-14T23:09:51.639549",
  "title": "SEO COACH / EXPERT",
  "type_of_work": "Gig",
  "salary": "TBD",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "LAST CHANCE! Submit your application now. The deadline is Thursday, July 17, 2025, at noon PHT. NO EXTENSIONS!\n\r\nAre you an experienced SEO expert who doesn’t just do the work but knows how to teach it well?\n\r\nWe’re a California-based digital marketing team with over eight years of experience helping small and local businesses grow their online presence. We’re looking for a skilled SEO Coach or Expert to guide us through practical SEO processes, teach us best practices, and help us build internal confidence in applying SEO effectively.\n\r\nThis is a project-based role, but we’re open to long-term collaboration as new needs arise.\n\r\nWhat You’ll Do:\r\nOur focus is on helping local businesses rank and grow, but we know we need guidance from someone with proven expertise. We’ll need help in many areas, but to start, we’d love your support on:\r\n* Guide us in creating SEO-optimized blog content using ChatGPT\r\n* Help brainstorm blog topics based on the keyword and business relevance\r\n* Teach us how to apply schema markup for better visibility\r\n* Create an internal linking strategy that supports site structure\r\n* Support us with keyword research, keyword density, and placement\r\n* Instruct on writing optimized image Alt Text (description and title)\r\n* Help interpret Google Analytics and Search Console data\r\n* Share link-building techniques and how to gain inbound links\n\r\nWe’re Looking for Someone Who:\r\n* Has solid experience with on-page, off-page, technical, and local SEO\r\n* Is comfortable teaching, mentoring, and explaining SEO to beginners\r\n* Is familiar with different SEO tools\r\n* Can explain SEO strategies in a clear and simple way\r\n* Is reliable, responsive, and respectful of time\r\n* Bonus if you’ve worked with small teams or agencies\n\r\nPosition Details:\r\nType: Project-Based (with long-term potential)\r\nSchedule: Flexible (depending on your availability and our session needs)\r\nLocation: Fully remote (work from anywhere)\r\nRate: Based on experience and skills (negotiable)\r\nStart Date: As soon as possible\n\r\nHow to Apply?\r\nClick the link here:Upgrade to see actual info",
  "skill_requirements": [
    "SEO",
    "Local SEO",
    "SEO Analysis"
  ]
}