{
  "job_id": "1421900",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Expert-Accountant-1421900",
  "scraped_at": "2025-07-15T14:38:13.102456",
  "title": "Expert Accountant",
  "type_of_work": "Part Time",
  "salary": "$15/hour",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "EXPERT ACCOUNTANT WANTED – Long-Term Role (with Paid Trial Challenge)\n\r\nMUST have: PRC license\r\nNice to have: PICPA membership\n\r\nWe are a growing international company seeking a top-tier, detail-obsessed accountant to join us remotely and long-term.\n\r\nThis is not a junior position. We are looking for someone with serious accounting experience, ideally a CPA or similar background, who can take ownership of our financial reporting and maintain flawless books.\n\n\n\r\nYour Role Will Include:\n\r\n• Full-cycle bookkeeping and monthly reconciliation\r\n• Analyzing financial data across multiple periods\r\n• Preparing accurate P&L, balance sheet, and cash flow reports\r\n• Identifying discrepancies, missed transactions, or patterns\r\n• Suggesting improvements in process and reporting accuracy\r\n• Working with our team to clean up and standardize records\n\n\n\r\nHiring Process Includes a Paid Challenge\n\r\nIf selected for the next stage, you’ll receive a paid test project:\r\n• We will provide real financial data for one month (in Excel or CSV)\r\n• Your task is to do full bookkeeping for that month, and compare it to a current month\r\n• Highlight key differences, surface any red flags, and summarize your findings\r\n• This challenge will test your attention to detail, accounting rigor, and communication\n\r\nThis is a paid trial, and a great opportunity to show your skill.\n\n\n\r\nRequirements:\n\r\n• Minimum 3–5 years accounting experience (corporate or freelance)\r\n• Strong skills in QuickBooks Online, Excel, and Google Sheets\r\n• Experience with financial statements, reconciliation, and monthly closes\r\n• CPA is a strong plus\r\n• Must be proactive, organized, and meticulous\r\n• Excellent written English\r\n• Can work during PH daytime hours, some overlap with US time preferred\r\n• Stable internet and a quiet working environment\n\n\n\r\nCompensation & Benefits:\n\r\n• Monthly salary: $250 USD, based on skill and experience\r\n• Paid 13th month\r\n• Paid trial challenge\r\n• Bonuses for long-term retention, and lots of room for growth\r\n• Fully remote, long-term role\n\n\n\r\nTo Apply:\n\r\nPlease send the following:\r\n\t1.\tA short introduction about yourself and your accounting experience (1 minute video on a youtube link). Tell me about a. The biggest financial mess you've cleaned up, b. What makes you a great accountant and c. Why I can trust you.\r\n\t2.\tYour updated resume\r\n\t3.\tYour expected monthly salary\r\n        4.     Your license, passport, PRC license & PICPA membership\n\n\r\nWe’re only looking for serious professionals — if you’re detail-oriented, reliable, and take pride in clean, accurate books, we’d love to work with you.\n\n\n\r\nLet me know if you’d like this adapted for another platform or role.",
  "skill_requirements": [
    "Quickbooks",
    "Financial Accounting",
    "Bookkeeping"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:23:47.181686",
      "reason": "Job first discovered"
    }
  ]
}