{
  "job_id": "1421912",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Manager-1421912",
  "scraped_at": "2025-07-15T06:31:34.979463",
  "title": "Social Media Manager",
  "type_of_work": "Full Time",
  "salary": "$5 to 6/hour",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Please, share your resume in: Upgrade to see actual info\n\r\nDB Cleaning Services is seeking a dynamic and creative Social Media Manager to develop and execute our social media strategy, enhance our online presence, and drive brand awareness. The ideal candidate will be fluent in English, possess a strong understanding of social media platforms and trends, and have proven experience in managing editorial calendars and producing engaging written content. This role requires a strategic thinker with excellent communication skills, a passion for social media, and the ability to work independently.\n\r\nResponsibilities:\n\r\n1. Social Media Strategy:\r\n    a) Develop and implement a comprehensive social media strategy aligned with DB Cleaning Services' business goals and target audience.\r\n    b) Conduct market research and competitive analysis to identify trends and opportunities for growth.\r\n   c) Establish key performance indicators (KPIs) and track social media performance, providing regular reports and insights.\n\r\n2. Editorial Calendar Management:\r\n    a) Create and manage a detailed social media editorial calendar to ensure consistent and engaging content across all platforms.\r\n    b) Plan and schedule content in advance, considering seasonal themes, promotions, and relevant industry events.\r\n    c) Coordinate with internal teams to gather information and resources for content creation.\n\r\n3. Content Creation (English):\r\n    a) Produce high-quality, original written content in English for various social media platforms (Facebook, Instagram, LinkedIn, etc.), including captions, posts, articles, and ad copy.\r\n   b) Develop visually appealing content, working with graphic designers or creating simple graphics as needed.\r\n   c) Ensure all content is on-brand, grammatically correct, and optimized for search engines (SEO).\n\r\n4. Community Management:\r\n   a) Actively engage with followers, respond to comments and messages, and foster a positive online community.\r\n   b) Monitor social media channels for brand mentions, customer feedback, and potential issues, escalating them as needed.\n\r\n 5. Social Media Advertising:\r\n   a) Plan and execute social media advertising campaigns to reach target audiences and drive leads.\r\n   b) Monitor campaign performance, optimize ad spend, and provide reports on ROI.\n\r\n6. Analytics and Reporting:\r\n   a) Track and analyze key social media metrics, such as engagement, reach, and website traffic.\r\n   b) Prepare regular reports on social media performance and make recommendations for improvement.\r\n   c) Stay up-to-date on the latest social media trends and best practices.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}