{
  "job_id": "1421756",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Content-Creative-Director-1421756",
  "scraped_at": "2025-07-14T23:22:21.755991",
  "title": "Content Creative Director",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Creative Director (Full-Time, Remote - PH Based)\r\nCompany: BNB Know How (Instagram Personal Brand: Tabare_Sotomayor (INFO PRODUCTS)\r\nLocation: Remote (Philippines-based)\r\nCompensation: Competitive salary + bonuses (based on performance)\r\nWorking Hours: 9 AM – 6 PM EST preferred (flexible for the right talent)\n\r\nAbout Us\r\nWe’re a fast-growing, high-performance education and software company in the Airbnb/real estate and sales coaching space. Think: Iman Gadzhi meets Grant Cardone—but with better rental income and cooler branding.\n\r\nOur brand is bold, clean, elevated, and built for virality. We make info products, high-ticket offers, and automation tools for people who want to escape the rat race through short-term rentals.\n\r\nThe Mission\r\nYour job: make us look like a million-dollar brand. Consistently.\r\nWe want someone who can lead the creative direction of all visual and brand assets—including social media, landing pages, content templates, ads, presentations, and sales funnels.\n\r\nYou’ll be the person our content team, editors, and designers look to for vision and direction.\n\r\nYour Responsibilities\r\nDevelop and maintain brand guidelines for visual identity\r\nOversee graphic/video assets for social (Instagram, TikTok, YouTube thumbnails, reels, carousels, etc.)\r\nDirect creative across multiple products: BNB Know How and IG: Tabare_Sotomayor\r\nCollaborate with the CEO, video editors, and content creators to maintain aesthetic consistency\r\nApprove (or destroy) any design work that doesn’t align with the vision\r\nHelp build out ad creatives, landing pages, slides, funnels, and more\r\nSuggest fresh creative angles weekly that we can test for virality\n\r\nRequirements\r\nMinimum 2+ years in a Creative Director or Senior Graphic/Branding role\r\nProficient in Canva, Figma, Adobe Creative Suite\r\nStrong eye for luxury / modern / minimal / high-converting aesthetics\r\nFamiliar with high-ticket digital marketing & personal brands (bonus if you follow Iman Gadzhi, Alex Hormozi, or Grant Cardone)\r\nAbility to manage multiple projects and teaUpgrade to see actual infombers\r\nMust be organized, proactive, and able to take ownership\r\nSolid English communication skills\n\r\nWhat’s In It For You\r\nStable, full-time remote work\r\nLong-term opportunity with growth potential\r\nDirect access to 7-figure CEO + chance to lead creative on viral brands\r\nBonuses for viral wins or high-performing campaigns\r\nJoin a culture of speed, ambition, and creativity\n\r\nTo Apply:\r\nSend us:\r\na LOOM video of your past work and what you would do to improve our content (Social Media Handles are Tabare_Sotomayor) \r\nAlso tell me your favorite brand on social media right now (and why)",
  "skill_requirements": [
    "Content Creation",
    "Social Media Content Creation"
  ],
  "is_active": true,
  "status_history": []
}