{
  "job_id": "1421791",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Creative-Campaign-Manager-1421791",
  "scraped_at": "2025-07-15T03:44:54.224350",
  "title": "Creative Campaign Manager",
  "type_of_work": "Full Time",
  "salary": "$6-$12 per hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About the Role:\r\n We are seeking a highly organized and creative Creative Project Coordinator to join our team. In this role, you will act as the key link between the media and design teams, transforming creative briefs into structured, actionable projects. Working closely with the Head of Creative, you will manage internal assets and ensure projects are executed seamlessly from start to finish.\n\r\nKey Responsibilities:\r\n* Receive and manage creative briefs from the media team, ensuring clear instructions and deadlines for the design team.\r\n* Conduct market research to guide creative direction and ensure campaigns align with company goals.\r\n* Organize and streamline creative briefs for designers, ensuring timely delivery of campaign assets.\r\n* Assist the Head of Creative in managing internal creative assets and coordinating project workflows.\r\n* Collaborate with the media team to ensure the successful execution of creative projects from concept to completion.\n\n\r\nMandatory Requirements:\r\n* 2–3 years of experience in project coordination, creative roles, or marketing.\r\n* Exceptional organizational skills with strong attention to detail.\r\n* Excellent written and verbal communication skills in English.\r\n* Ability to work independently while maintaining effective communication with the team.\n\n\r\nPreferred Skills:\r\n* Experience with video or user-generated content (UGC) creation.\r\n* Proficiency in tools such as Adobe Photoshop, Canva, or video editing software.\r\n* Familiarity with AI-powered creative tools.\r\n* Experience in the gaming industry.\r\n* Strong understanding of project management and the creative process.\n\r\nWhy Join Us:\r\n Become part of an innovative and collaborative team where you'll work on exciting projects within a performance-driven marketing company. As a Creative Project Coordinator, you’ll have ample opportunities for career growth and personal development, all while contributing to a team that values creativity, drives results, and fosters individual growth.",
  "skill_requirements": [
    "Project Management",
    "Creative Advertising",
    "AI Tools"
  ],
  "is_active": true,
  "status_history": []
}