{
  "job_id": "1421969",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Landing-Page-Builder-1421969",
  "scraped_at": "2025-07-14T23:07:42.305368",
  "title": "Landing Page Builder",
  "type_of_work": "Full Time",
  "salary": "500",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "???? Landing Page & Funnel Builder for Fast-Growing E-Commerce Brand (PageDeck, Upsells, CRO Focused)\n\r\nWe're looking for an experienced, detail-driven landing page builder who understands the balance between performance-first design and clean, intentional layout. This isn’t about creating a pixel-perfect Dribbble showpiece — it’s about building fast, congruent, conversion-focused funnels that guide the customer from click to checkout.\n\r\nIf you’re obsessed with high-converting landing pages, love geeking out on funnels, and want to help a fast-growing brand scale with dozens of angles and offers, you’ll thrive in this role.\n\r\n? What You'll Be Doing:\r\n???? Landing Page & Funnel Creation\r\nBuild angle-specific product pages, advertorials, and listicles using PageDeck.\n\r\nEnsure pages are visually cohesive, even if intentionally minimal or “ugly” — but never sloppy.\n\r\nSource and place appropriate imagery — either from our content library or by coordinating with our graphic designer or content manager.\n\r\nOccasionally assist with minor website updates, but 95% of your time will focus on funnels and landing pages.\n\r\n???? Funnel Strategy & Congruency\r\nEnsure each funnel is fully congruent with the ad that precedes it — e.g., a gut health ad links to a gut health listicle ? gut health product page ? checkout.\n\r\nBuild tailored product pages and content flows for each ad angle.\n\r\n???? Landing Page & Competitor Research\r\nConduct daily or weekly research using:\n\r\nAmazon product pages\n\r\nMeta Ads Library\n\nUpgrade to see actual info\n\r\nCreate mood boards in Foreplay, Miro, or Figma with links and screenshots of compelling pages we can draw inspiration from.\n\r\n???? Upsell/Downsell Funnel Builds\r\nHelp implement post-purchase upsell/downsell flows using tools like AfterSell, Funnelish, or Checkout Champs.\n\r\nStrategize with the team to improve average order value (AOV) through thoughtful offer sequencing.\n\r\n? Work Schedule:\r\nThis will begin as a part-time role, with flexible options:\n\r\nEither 2 hours per day, Monday through Friday\r\nOR\n\r\n2–3 days per week with longer working hours on those days\r\nYou can pick the option that best suits your availability, as long as work is consistent and deadlines are met.\n\r\n???? This Role Is Perfect For Someone Who:\r\nHas strong experience building high-converting landing pages and funnels — preferably in e-commerce or DTC.\n\r\nCan move quickly and execute with precision using proven templates.\n\r\nUnderstands conversion-driven design — what makes people scroll, click, and buy.\n\r\nLoves researching funnels, competitor pages, and thinking strategically about layout and messaging.\n\r\nIs curious, organized, and eager to bring new ideas to the table.\n\r\n???? Summary:\r\nJob Type: Part-Time (2 hrs/day or 2–3 days/week)\n\r\nRole: Landing Page & Funnel Builder\n\r\nStart Date: ASAP\n\r\nExperience Required: Yes — e-commerce and funnel experience highly preferred\n\r\nTools: PageDeck, AfterSell, Funnelish, Checkout Champs, Miro, Upgrade to see actual info, Shopify, Slack\n\r\n???? To Apply:\r\nPlease include:\n\r\nYour best landing pages, listicles, product pages, or advertorials (required)\n\r\nAny funnel builds you've worked on (especially upsell/downsell flows)\n\r\nA short note on why you love landing pages, and how you stay up to date with trends\n\r\nIf you're a funnel nerd with sharp design instincts and a hunger to build pages that convert — we’d love to work with you.",
  "skill_requirements": [
    "Clickfunnels",
    "Landing Page Design",
    "Funnelish"
  ]
}