{
  "job_id": "1421672",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421672",
  "scraped_at": "2025-07-14T23:07:56.528771",
  "title": "Student Support Officer",
  "type_of_work": "Any",
  "salary": "Php 20,000-28,000",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Location: Remote – Philippines\r\nEmployment Type: Part-Time or Full-Time\r\nCompany: Alpha Technical Training (ATT)\r\nIndustry: Vocational Education / Online Learning\n\r\nAbout Alpha Technical Training\r\nAlpha Technical Training (ATT) is a leading Australian Registered Training Organisation (RTO) helping tradespeople become licensed and upskilled through flexible online learning and practical workshops.\n\r\nWe’re growing rapidly, and we’re looking for Student Support Officers to join our support team and help guide students through their learning journey. You’ll work directly under the Student Support Team Lead to ensure every student receives the guidance, clarity, and care they need to succeed.\n\r\nWhat You'll Be Doing\r\n• Respond to student queries via email, phone, and live chat in a timely and professional manner.\r\n• Follow SOPs and escalation processes to ensure smooth communication.\r\n• Track student progress and send reminders or motivational nudges to keep them on pace.\r\n• Help students navigate their online platform and access their course materials.\r\n• Coordinate with the training team to help resolve academic or assessment concerns.\r\n• Maintain accurate records of student interactions and update CRM or support logs.\r\n• Assist with onboarding and orientation of new students.\r\n• Report any concerns about disengaged students to the Team Lead for follow-up.\n\r\nWho You Are\r\n• Minimum 2 years experience in a student support / customer service role (preferably in education or ed-tech).\r\n• Excellent written and spoken English communication skills.\r\n• Tech-savvy – confident in using support tools, CRMs, and Microsoft Office / Google Workspace.\r\n• Warm, empathetic, and calm – students feel heard and supported when speaking with you.\r\n• Detail-oriented and organized – you track every task, follow up diligently, and document thoroughly.\r\n• Able to work independently and follow established processes.\r\n• Bonus: Familiarity with the Australian education system or RTO environment.\n\r\nWhat We Offer\r\n• Remote-first role with flexible hours.\r\n• Supportive team and ongoing training.\r\n• Opportunity to grow into senior support or training admin roles.\r\n• Be part of a mission-driven company transforming vocational education across Australia.\n\r\nHow to Apply\r\nSend us your CV and a short cover letter explaining your experience in student support, and why you'd be a great fit for ATT. Highlight any past success in helping students stay engaged or resolving student issues effectively.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}