{
  "job_id": "1421984",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421984",
  "scraped_at": "2025-07-14T23:09:06.334175",
  "title": "Executive Coordinator (Operations + Marketing Support)",
  "type_of_work": "Part Time",
  "salary": "$6 USD/hour",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are hiring on behalf of a US-based founder looking for a sharp, reliable, and systems-savvy Executive Coordinator. This is a part-time, long-term role for someone experienced in both operations and marketing support. It is not an entry-level VA position — we’re looking for someone who can think strategically, work independently, and execute across multiple functions.\n\r\nRole Overview\n\r\nThis role supports the executive across key areas including operations, reporting, client success, and marketing. You’ll be responsible for turning video walkthroughs into SOPs, managing meeting logistics, preparing reports and dashboards, uploading data into HubSpot, and tracking sales commissions and referral fees. You’ll also handle ad hoc cleanup tasks involving files and contracts, monitor HubSpot tickets, and coordinate thoughtful client touches like gifts or flowers.\n\r\nOn the marketing side, you’ll assist with repetitive tasks such as updating webinar pages and websites, posting videos to YouTube, pulling analytics, and helping with newsletters, social posts, and scheduled email reminders.\n\r\nFor client and team support, you’ll schedule weekly internal check-ins, support personal development tracking, and prepare one client meeting per week with light research and follow-through.\n\r\nQualifications\n\r\nProven experience in admin, operations, or executive assistant roles\n\r\nFamiliarity with tools such as HubSpot, QuickBooks, Google Workspace, Zoom, ClickUp\n\r\nExcellent written and spoken English\n\r\nAbility to work independently in a remote setting\n\r\nStrong attention to detail, time management, and problem-solving skills\n\r\nProfessionalism, initiative, and a positive attitude\n\r\nQuiet, dedicated WFH setup with reliable internet and backup power\n\r\nAvailable to work part-time during US hours (Monday to Friday, 4 hours/day)\n\r\nWilling to use Hubstaff for time tracking\n\r\nIf you’re organized, dependable, and confident working behind the scenes to help a business run smoothly, we’d love to hear from you. Only detail-oriented applicants will be considered.",
  "skill_requirements": [
    "Quickbooks",
    "Marketing",
    "HubSpot CRM"
  ]
}