{
  "job_id": "1421804",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-General-Virtual-Assistant-1421804",
  "scraped_at": "2025-07-15T03:41:54.112671",
  "title": "Executive Assistant / General Virtual Assistant",
  "type_of_work": "Any",
  "salary": "$5-$7 / hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking a proactive and detail-oriented Executive Assistants / General Virtual Assistants to provide comprehensive support to clients and help streamline day-to-day operations. This role offers the opportunity to work remotely and assist in various administrative tasks, ensuring smooth communication and efficient workflow.\n\r\nQualifications:\n\r\n- Must have 2+ years of experience as an Executive Assistant or General Virtual Assistant\r\n- Must be residing from Cebu, Davao or Manila, and its neighboring cities\r\n- Proven experience as an executive assistant, administrative assistant, or virtual assistant.\r\n- Excellent organizational and time management skills.\r\n- Strong communication skills, both written and verbal.\r\n- Proficiency in MS Office and Google Workspace applications.\r\n- Ability to work independently and handle multiple tasks simultaneously.\r\n- Attention to detail and a high level of accuracy.\r\n- Discretion and confidentiality in handling sensitive information.\r\n- Learn systems and CRMs easily.\n\r\nKey Responsibilities:\n\r\n1. Administrative Support:\r\n- Manage calendars, schedule appointments, and coordinate meetings and events.\r\n- Handle travel arrangements, including booking flights, accommodations, and transportation.\r\n- Prepare and organize documents, presentations, and reports as needed.\r\n- Take over day-to-day administrative tasks\n\r\n2. Communication Management:\r\n- Serve as the primary point of contact for internal and external communications.\r\n- Screen and prioritize emails, phone calls, and other correspondence.\r\n- Draft and proofread emails, letters, and other written communications.\n\r\n3. Task Coordination:\r\n- Assist with project management tasks, including tracking deadlines and milestones.\r\n- Coordinate tasks and assignments across teaUpgrade to see actual infombers to ensure timely completion.\r\n- Follow up on action items and ensure accountability within the team.\n\r\n4. Data Management:\r\n- Maintain organized digital and physical filing systems.\r\n- Update and manage databases, contact lists, and other information repositories.\r\n- Perform data entry and basic analysis as needed.\n\r\n5. Research:\r\n- Conduct research on various topics and compile information for reports or presentations.\n\r\n6. General Assistance:\r\n- Provide general administrative support as needed, including vendor coordination.\r\n- Assist with personal tasks and errands for teaUpgrade to see actual infombers, as appropriate.\n\r\n7. Client Onboarding:\r\n- Coordinate the onboarding process for new clients, including gathering necessary documentation and information.\r\n- Communicate with clients to facilitate the setup of accounts, access to platforms, and any other requirements.\r\n- Ensure a smooth transition for new clients by providing support and guidance throughout the onboarding process.\n\n\r\nFor interested applicants, please fill out this form:\nUpgrade to see actual info/forms/d/e/1FAIpQLScyaPlqa1sXF2u2Jfj9doWsQEpNzri71iRWPM8u0T-6kFlLSQ/viewform                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}