{
  "job_id": "1421898",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-Social-Media-Back-End-Support-1421898",
  "scraped_at": "2025-07-15T02:33:13.785201",
  "title": "Virtual Assistant - Social Media & Back-End Support",
  "type_of_work": "Full Time",
  "salary": "$200 USD/wk",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're looking for a talented Virtual Assistant to join our growing team! This is a dynamic role where you'll handle social media management, website support, and back-end operations across multiple businesses in our portfolio. It's a great opportunity to wear many hats and grow your skills in different areas.\n\r\nKey Responsibilities\n\r\n-Social Media Management\r\n-Create, schedule, and manage content across multiple platforms\r\n-Monitor engagement and respond to comments and messages\r\n-Develop strategies to increase brand awareness and track performance metrics\r\n-Customer Service & Administrative Support\r\n-Handle payment inquiries and billing questions\r\n-Provide timely and professional customer support\r\n-Create graphics and visual content using Canva for social media and marketing materials\r\n-Using Excel for reporting and tracking\n\r\nRequired Qualifications\r\n-Proficiency in Canva for creating graphics, social media content, and marketing materials\r\n-Excel skills including formulas, data analysis, and reporting\r\n-Social media experience across major platforms (Instagram, Facebook, Twitter, LinkedIn, TikTok)\r\n-Proven experience in social media management and digital marketing\r\n-Customer service experience with payment/billing systems\r\n-Ability to work independently and manage multiple tasks\n\r\nPreferred Qualifications\r\n-Previous VA or remote work experience\r\n-Familiarity with project management tools and social media scheduling tools\r\n-Basic understanding of digital marketing analytics",
  "skill_requirements": [
    "Social Media Management",
    "Microsoft Excel",
    "Canva"
  ],
  "is_active": true,
  "status_history": []
}