{
  "job_id": "1421993",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Finance-Manager-1421993",
  "scraped_at": "2025-07-15T08:34:49.021333",
  "title": "Finance Manager",
  "type_of_work": "Full Time",
  "salary": "£1000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for a meticulous and proactive Finance Manager to join our growing team! This is a fully remote role, but you’ll be working closely with UK-based clients and internal stakeholders. The ideal candidate has strong experience in UK accounting practices and is confident in managing both finance and HR operations.\n\r\nThis role involves a hybrid of responsibilities, from preparing full accounts and tax filings to administering payroll, recruiting talent, and supporting compliance matters. If you're detail-oriented, highly organized, and experienced in UK finance and HR procedures, we’d love to hear from you!\n\r\nKey Responsibilities\r\n— Prepare and issue invoices for the company and its clients (via Xero and manual methods)\r\n— Handle quarterly VAT returns and year-end CT600 Corporation Tax filings using TaxCalc\r\n— Prepare full statutory accounts and ensure compliance with Companies House and HMRC deadlines\r\n— Perform regular bank reconciliations and maintain accurate transaction records\r\n— Administer monthly payroll (including PAYE for Directors) for internal staff and client teams\r\n— Monitor year-to-date salary and material purchase records using Excel\r\n— Source and manage supplier records; handle payment processing using company credit card\r\n— Generate and analyze financial reports via Xero\r\n— Maintain timely and professional communication with clients regarding financial inquiries\n\r\nQualifications\r\n— Bachelor’s degree in Accounting, Finance, or any related field\r\n— Chartered Accountant certification (ICAEW, ACCA, or equivalent) is a strong advantage\r\n— Minimum of 5 years of UK-based accounting experience\r\n— Demonstrated experience handling full statutory accounts and corporation tax (CT600)\r\n— Proficient with Xero and TaxCalc accounting software\r\n— Strong working knowledge of UK tax regulations and financial compliance\r\n— Skilled in Google Sheets, Upgrade to see actual info, and RingCentral\r\n— Excellent communication skills (written and verbal)\r\n— Highly organized, dependable, and detail-oriented\r\n— Able to manage multiple streams of work independently\n\r\nHow to Apply\r\nIf you're passionate about financial accuracy, people operations, and cross-functional support, send your updated CV and a short cover letter highlighting your relevant experience to Upgrade to see actual info with the subject:\r\n“Application for Finance Manager – [Your Name]”\n\r\nThis is a long-term opportunity to play a vital role in a dynamic and growing team. Join us and contribute to both our operational excellence and people-first culture!",
  "skill_requirements": [
    "Xero",
    "Tax Preparation",
    "Bank Reconciliation"
  ],
  "is_active": true,
  "status_history": []
}