{
  "job_id": "1421822",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421822",
  "scraped_at": "2025-07-14T23:07:05.852955",
  "title": "Executive Virtual Assistant - Night Shift - $7-$9 per hr",
  "type_of_work": "Full Time",
  "salary": "$1120",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Company: Confidential until hire\n\r\nAbout Us: ROOTS Alignment (Core Values)\r\n• Results: WE do the work.\r\n• Ownership: WE are committed to excellence.\r\n• Open-Mindedness: WE create solutions.\r\n• Trust: WE do what we say we are going to do.\r\n• Service: WE go above and beyond.\n\r\nThe Role\r\nThis is a high-trust, high-impact virtual position supporting the founder and CEO of a multi-million-dollar, family-owned wood product distribution company based in Baltimore, MD. The Executive Assistant will act as an extension of the CEO, managing communication, task delegation, scheduling, and project execution with a strong emphasis on confidentiality, clarity, follow-through, and a high attention to detail. This role requires someone who is sharp, self-managing, highly detail-oriented, and extremely proactive. You will not just “do tasks”—you will think ahead, bring order to chaos, and protect the CEO’s time and focus. You are expected to anticipate needs, organize priorities, and follow through with excellence. This is a 1099 independent contractor role with potential for long-term growth.\n\r\nTasks and Responsibilities\r\n• Manages and organizes the CEO’s email and calendar, including scheduling and confirming meetings.\r\n• Prepares meeting materials such as briefs, agendas, and talking points.\r\n• Coordinates communication and logistics with internal teams, vendors, and partners.\r\n• Handles task management via ClickUp and keeps company OneNote updated.\r\n• Sends template-based responses and follows up on behalf of the CEO.\r\n• Assists with internal documentation, office supply orders, and travel/event logistics.\r\n• Oversees social media scheduling and engagement.\r\n• Tracks outstanding items and flags key issues for the CEO.\n\r\nRight Attitude and Behavior to Succeed in the Role\r\n• Someone who can think like a CEO and speak in the CEO’s voice when needed\r\n• Proactive self-starter who takes initiative and figures things out independently\r\n• Highly organized and owns outcomes - not just tasks\r\n• Follows through on assignments without needing reminders\r\n• Manages projects, track deadlines, and holds others accountable without micromanagement\r\n• Communicates clearly and professionally, representing the CEO’s voice and priorities\r\n• Resourceful—researches solutions and exercises sound judgment before escalating to CEO\r\n• Filters and responds to emails independently using templates and past examples\r\n• Turns rough ideas into structured tasks and knows when to escalate\r\n• Understands that if they can’t act independently, it often becomes easier for the CEO to do the task himself\n\r\nWhat Won’t Work in This Role\r\n• Lack of initiative, independence, or proactive problem-solving\r\n• Requiring frequent clarification instead of researching or using available resources\r\n• Missing details or failing to double-check work, causing rework or delays\r\n• Not following through on tasks or needing constant reminders\r\n• Misunderstanding the CEO’s tone, priorities, or adding to their workload instead of reducing it\n\r\nRequirements & Experience\r\nMinimum Requirements\r\n• Your own computer/home office set up\r\n• Reliable high-speed internet and backup connection\r\n• Distraction-free remote work environment\n\r\nPreferred Experience\r\n• 3–5+ years as a high-level Executive or Virtual Assistant, ideally supporting CEOs or fast-paced entrepreneurs\r\n• Strong ability to independently manage complex schedules, communications, and projects\r\n• Proficiency with tools like ClickUp, Microsoft Teams, Google Docs, Microsoft Office, Zoom, Canva, and Outlook\r\n• Experience managing SOPs, project briefs, and team task boards\r\n• Skilled at building and improving systems and processes proactively, without needing detailed direction\n\r\nPay: $7–$9 USD per hour depending on experience and performance - Paid weekly via Wise or similar international payment platform (May have some delay in crediting depending on the processing time of the payment platform). \n\r\nDeliverable Hours: Monday to Friday from 7:30 AM to 4:30 PM EST (7:30PM – 4:30AM PH Time) with 1-hour unpaid lunch break. \n\r\nConfidentiality: As this is a high-trust position, you will have access to confidential company and leadership info. NDA and contract are required before starting. One breach of contract is equivalent to immediate termination.\r\nStart Date: This is an urgent position. We need someone who can start ASAP.\n\r\nApplication Requirements\r\n1. Submit an up-to-date CV \r\n2. Take the 16 personalities - Upgrade to see actual info\r\n3. Take the English Assessment Test - Upgrade to see actual info\r\n4. Fill out the Candidate Form (Upgrade to see actual info). It is important to complete the 16 personalities and English Assessment Test before filling out the form because you will need to input your results into the form. \r\n5. If your application is successful, you’ll proceed to a video prescreening. If qualified, you’ll be invited to a final interview with the CEO.",
  "skill_requirements": [
    "Clickup",
    "Virtual Assistant"
  ]
}