{
  "job_id": "1421824",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Visual-Creative-Content-Producer-E-commerce-fashion-1421824",
  "scraped_at": "2025-07-15T03:34:48.644123",
  "title": "Visual Creative Content Producer - E-commerce fashion",
  "type_of_work": "Part Time",
  "salary": "2-4 USD p hour",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're a premiuUpgrade to see actual infonswear brand focused on timeless design and perfect fit. We’re currently looking for a part-time Visual Creative Content Producer (Photo & Video) to lead all our visual content creation. If you live and breathe fashion visuals and have expert-level Photoshop skills, this is your opportunity to help shape the look and feel of a fast-growing brand.\n\r\nAbout the role:\r\nYou will be responsible for creating all visual content used on our website, social media channels, and marketing campaigns. From product flat lays and lifestyle photo shoots to video content for reels and ads. You’ll be the creative force behind how our brand shows up visually. This is a hands-on role focused on execution, not strategy.\n\r\nResponsibilities:\r\n- Plan & edit high-quality photo and video content for use on our website, Instagram, TikTok, and ad platforms.\r\n- Design flat lays and e-commerce product imagery in line with brand aesthetics.\r\n- Edit and retouch images using Photoshop with professional-level precision.\r\n- Produce short-form video content for paid and organic social (IG reels, TikTok, ads).\r\n- Maintain a consistent visual tone across all creative assets.\r\n- Ensure fast turnaround times and high production quality.\n\r\nRequirements:\r\n- Expert in Photoshop (retouching, manipulation, color correction, layering).\r\n- Strong photography and video skills, both planning and editing.\r\n- A sharp eye for lighting, framing, and fashion-focused aesthetics.\r\n- Experience creating content for a fashion or lifestyle brand is a must.\r\n- Skilled in editing tools like Premiere Pro, Final Cut, or CapCut.\r\n- Comfortable working independently and managing your own schedules.\n\r\nNice to Have:\r\n- Experience with AI-generated visuals or creative tools.\r\n- Familiarity with ad creatives for Meta/TikTok platforms.\n\r\nWhat We Offer:\r\n- A flexible part-time role (~20–25 hrs/week) with room to grow into full-time.\r\n- Direct creative ownership of a premium fashion brand’s visual output.\r\n- Room to experiment with creative formats and visual storytelling.\r\n- A fast-paced but collaborative environment with passionate founders.\n\r\nTo apply, please include:\n\r\nA short intro about yourself and why you’re the right fit.\r\nUse the word \"shoes\" in your subject line so we know you read this.\r\nA portfolio or examples of photo and video content you’ve created.\n\r\nWe look forward to seeing your work!",
  "skill_requirements": [
    "Photoshop",
    "Video Editing",
    "Photo Editing"
  ],
  "is_active": true,
  "status_history": []
}