{
  "job_id": "1421185",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SEO-Content-Specialist-1421185",
  "scraped_at": "2025-07-15T02:24:38.031378",
  "title": "SEO & Content Specialist",
  "type_of_work": "Any",
  "salary": "$8 - $10 AUD per hour",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're a small but growing digital agency based in Australia, currently looking for a freelance SEO Specialist to support day-to-day SEO tasks across a range of client accounts.\n\r\nThis role is ideal for a contractor who can work independently, deliver consistently high-quality work, and grow with us as we scale. The current workload will vary depending on client projects, but this is a long-term opportunity for someone who shows initiative and maintains a high standard of delivery.\n\r\nThis is a part-time, flexible role, and the hours may shift depending on demand. The aim is to have someone I can rely on to take on core SEO activity, which will free me up to focus on growing the agency. The more support you can confidently take on, the more opportunities there will be. If you're dependable, detail-focused and solid at what you do, this role has room to grow.\n\r\nWe specialise in SEO, Content planning, Google Ads, content strategy, analytics/tracking and performance marketing, with SEO being a core focus of the agency. We're looking for someone confident in both the technical and content sides of SEO, with strong attention to detail and the ability to manage multiple accounts effectively.\n\r\nSome of the Key Responsibilities\r\n- Keyword research and on-page optimisation\r\n- Writing and refining meta titles and descriptions\r\n- Optimising on-site copy for SEO performance\r\n- Conducting technical audits and applying fixes\r\n- Monitoring performance using GA4 and Google Search Console\r\n- Interpreting SEO data and producing report commentary\r\n- Suggesting ways to improve organic visibility and content quality\n\r\nRequirements\r\n- Excellent written and spoken English is essential. You must be confident writing clean, professional content and communicating clearly in a remote working environment\r\n- Proven SEO experience, ideally with agency or multi-client work\r\n- Able to work independently and manage your own output\r\n- Comfortable interpreting data and explaining results in a clear and useful way\r\n- Google Ads experience is a bonus but not required\r\n- Flexible and adaptable as the agency grows\n\r\nAll work is for the Australian market, so knowledge of local spelling, tone and audience is important.",
  "skill_requirements": [
    "Content Creation",
    "SEO",
    "Digital Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:34:13.523430",
      "reason": "Job first discovered"
    }
  ]
}