{
  "job_id": "1421968",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Course-Office-Administrator-1421968",
  "scraped_at": "2025-07-15T07:49:05.627694",
  "title": "Course Office Administrator",
  "type_of_work": "Full Time",
  "salary": "USD 4.00 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Title: Office Support Administrator (Full-Time, Remote – Flexible Hours)\r\nCompany: CLIP – Chancery Lane Institute for Professionals\r\nLocation: Remote\r\nWork Schedule: Full-time (40 hours/week) with flexible hours\r\nSalary: $4 USD/hour (Paid monthly via [your payment method])\n\n\r\nAbout CLIP\r\nCLIP – Chancery Lane Institute for Professionals is a UAE-based legal education and training platform dedicated to preparing lawyers in the region to qualify as solicitors in England and Wales through the Solicitors Qualifying Examination (SQE).\n\r\nWe provide intensive, practical training to bridge the gap between regional practice and international standards. CLIP works with aspiring and current legal professionals to deliver a rigorous legal training experience focused on global legal careers.\n\r\nJob Summary\r\nWe are looking for a full-time Office Support Administrator to manage and streamline our training operations and academic logistics. You’ll be working closely with our lecturers, students, and operations team to coordinate classes, share materials, manage calendars, and support the delivery of SQE-aligned legal training.\n\r\nThis is a remote, full-time role with flexible hours, but you must be available and responsive during core UAE business hours when needed.\n\r\nKey Responsibilities\r\n-Scheduling & Calendar Management\n\r\n-Book and manage training and lecture sessions (virtual and physical)\n\r\n-Coordinate across lecturers and students to finalize schedules\n\r\n-Maintain and update shared calendars (Google Calendar)\n\r\n-Lecture & Curriculum Support\n\r\n-Send out class invites and reminders to all parties\n\r\n-Organize and share lecture slides and materials with instructors\n\r\n-Track the SQE curriculum and ensure correct content is prepared for each session\n\r\n-Assist in assigning lecturers to subjects based on their legal expertise\n\r\n-Maintain detailed student records, class logs, and attendance sheets\n\r\n-Support lecturers and students with general admin inquiries\n\r\n-Help refine and improve operational workflows over time\n\r\nQualifications\r\nStrong administrative and coordination experience (1–2 years preferred)\n\r\nExcellent written English and communication skills\n\r\nHighly organized, detail-oriented, and proactive\n\r\nProficient in Google Workspace (Docs, Sheets, Calendar, Gmail)\n\r\nFast learner, especially in understanding curriculum structures and processes\n\r\nAble to manage time independently and work across different priorities\n\r\nNice to Have (But Not Required)\r\nInterest in legal education or academic program management\n\r\nFamiliarity with the SQE (Solicitors Qualifying Examination) or UK legal system\n\r\nExperience using project tools like Notion, Trello, or Asana\n\r\nExperience working with international or academic teams\n\r\nWhat We Offer\r\nFull-time, long-term remote position with flexible working hours\n\r\nExposure to a professional, international legal training environment\n\r\nOpportunity to grow and expand responsibilities over time\n\r\nSupportive and collaborative team culture\n\r\nPaid monthly ($4 USD/hour)\n\r\nTo Apply: \nEmail your CV and a short cover letter (2–3 paragraphs) explaining your relevant experience and why you’re a good fit to:",
  "skill_requirements": [
    "Administrative Management",
    "Office and Administration",
    "Calendar Management"
  ],
  "is_active": true,
  "status_history": []
}