{
  "job_id": "1421972",
  "url": "https://www.onlinejobs.ph/jobseekers/job/VTuber-ClipperEditor-on-YouTube-Full-Time-Remote-1421972",
  "scraped_at": "2025-07-15T07:34:44.247876",
  "title": "VTuber Clipper/Editor on YouTube (Full-Time, Remote)",
  "type_of_work": "Full Time",
  "salary": "$440-$770",
  "hours_per_week": "45",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hey! I run several YouTube channels across different niches, and a lot of them are focused on VTubers.\n\r\nThese channels post viral videos based on VTuber stream highlights, funny Upgrade to see actual infonts, drama, emotional stories, dating talk, hot takes, and more.\n\r\nNow I’m looking for one skilled and reliable clipper/editor to join the team full-time and grow together.\n\r\nWho This Job Is Perfect For:\r\n-> You already watch VTubers (Hololive, VShojo, indies, etc.)\r\n-> You understand the community, Upgrade to see actual infos, slang, and culture\r\n-> You have editing experience (CapCut, Premiere Pro, etc.)\r\n-> You can also create thumbnails & write basic video titles\r\n-> You’re fast, self-managed, and want stable long-term work\n\r\nWhat You’ll Do:\r\n-> Watch VTuber VODs on Twitch or YouTube\r\n-> Find and clip the best stream Upgrade to see actual infonts (funny, awkward, spicy, wholesome, emotional, etc.)\r\n-> Edit these clips with basic simple editing (zooms, subtitles).\r\n-> Create clickable thumbnails\r\n-> Come up with catchy video titles\r\n-> Submit daily videos & improve over time with feedback\n\r\nExample VTuber Clip Channels:\nUpgrade to see actual info\nUpgrade to see actual info\nUpgrade to see actual info\n\r\n(These are NOT our channels, just examples of the style & energy we’re aiming for.)\n\r\nPay & Perks:\r\n-> $420–$750/month base salary: depending on skill + output\r\n-> Bonuses based on performance and channel growth\r\n-> Fully remote: work from anywhere\r\n-> Flexible hours option: we care about results, not clocking in\r\n-> Long-term stability & career growth (can grow to a channel manager position, and later a senior manager running multiple channels and managing multiple people under you)\n\r\nTop performers can eventually:\r\n-> Specialize in one role (editor, thumbnail artist, manager)\r\n-> Grow to a higher paying positions overtime\r\n-> Earn more $$$ as the channel grows\n\r\nHow to Apply:\r\nFill out this quick Google Form (2–3 mins):\r\n>Upgrade to see actual info\n\r\nThis is not a freelance gig or short project, it’s a long-term role with room to grow.\n\r\nIf you love VTubers, understand content, and want to be part of something exciting, this might be the best job you’ve ever had.\n\r\nLet’s build something viral together!",
  "skill_requirements": [
    "Thumbnail & Social Media Design",
    "Video Editing",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": []
}