{
  "job_id": "1421739",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Support-Ecommerce-1421739",
  "scraped_at": "2025-07-14T23:21:36.631519",
  "title": "Customer Support Ecommerce",
  "type_of_work": "Any",
  "salary": "15000",
  "hours_per_week": "7",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About the Role\r\nWe’re a fast-growing e-commerce brand in the wellness niche, selling supplements focused on lymphatic support, detox, and general well-being. Our business is built on direct-to-consumer sales and powered by paid ads (Meta/Facebook).\n\r\nWe’re looking for a Customer Support Manager who can handle day-to-day support tasks, manage subscription-related inquiries, and use tools like Shopify and ChatGPT to improve efficiency and customer experience.\n\r\n? Your Responsibilities\r\nRespond to customer messages via email (and possibly chat)\n\r\nHandle subscription management (cancellations, misunderstandings, billing questions)\n\r\nUse ChatGPT to improve response quality and speed\n\r\nTrack support KPIs and customer feedback\n\r\nBuild and maintain SOPs, templates, and macros\n\r\nCommunicate with fulfillment partners regarding order/shipping issues\n\r\nHelp build out the support team over time\n\r\n???? What You’ll Need\r\n1+ year experience in e-commerce customer support\n\r\nExperience with Shopify is required\n\r\nStrong written English and a helpful, friendly tone\n\r\nCalm and clear communication when handling frustrated customers\n\r\nComfortable using ChatGPT as a support tool\n\r\nBonus: Familiarity with subscription apps like Appstle or Recharge\n\r\n???? Tools We Use\r\nShopify\n\r\nAppstle Subscriptions\n\r\nChatGPT\n\r\nGorgias or similar\n\r\nGoogle Workspace\n\r\n???? Important Application Note:\r\nYou must include the word “Lymphatic” in your application headline to be considered.\n\r\n???? How to Apply\r\nPlease apply directly through the portal. We look forward to hearing from you!",
  "skill_requirements": [
    "Shopify",
    "Customer Service",
    "Customer Relationship Management"
  ],
  "is_active": true,
  "status_history": []
}