{
  "job_id": "1421777",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-AssistantOperations-Manager-1421777",
  "scraped_at": "2025-07-14T23:09:06.260179",
  "title": "Virtual Assistant/Operations Manager",
  "type_of_work": "Full Time",
  "salary": "55,000 php",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us\r\nThe Independent Living Company is a small, Queensland-based property management firm in Australia. We specialise in Specialist Disability Accommodation (SDA) — homes built for Australians living with disability. We’re passionate about creating better living experiences for people who need high-quality, accessible housing.\n\r\nWe’re currently looking for a reliable and detail-oriented Virtual Assistant from the Philippines to support our day-to-day admin and marketing tasks.\n\r\nJob Description\r\nYou will work directly with our Australian-based team and help keep our business organised and running smoothly. Your work will include administrative support, marketing coordination, and general task management.\n\r\nDuties and Responsibilities:\r\nProvide general admin support (data entry, document formatting, file organisation)\n\r\nManage our task boards and schedules using Upgrade to see actual info\n\r\nAssist with property listing updates and basic website content\n\r\nUse Canva to update templates and design simple marketing materials\n\r\nAssist with email marketing in HubSpot (we’ll provide training if needed)\n\r\nPost property updates and content on Facebook and Upgrade to see actual info\n\r\nOrganise files and folders in Google Drive\n\r\nPerform other administrative tasks as needed\n\r\nTools You’ll Be Using:\r\n Canva\r\n HubSpot\nUpgrade to see actual info\r\n Google Workspace (Docs, Sheets, Gmail, Drive)\n Facebook and Upgrade to see actual info (basic posting)\n\r\nQualifications:\r\nExcellent written and spoken English is essential\r\nPrevious experience as a virtual assistant, admin, or marketing support role\r\nStrong attention to detail and ability to follow instructions\r\nReliable internet connection and a quiet home working environment\r\nComfortable using cloud-based platforms and online tools\r\nBonus: Experience with property, real estate.",
  "skill_requirements": [
    "Marketing",
    "Property Management",
    "Canva"
  ]
}