{
  "job_id": "1421889",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Treatment-Document-Co-ordinator-Remote-Philippines-1421889",
  "scraped_at": "2025-07-15T06:42:14.311435",
  "title": "Treatment Document Co-ordinator - Remote (Philippines)",
  "type_of_work": "Full Time",
  "salary": "USD1,200 per month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a specialist orthodontic clinic based in Western Australia seeking a Treatment Document Co-ordinator to join our administrative team. This is a full-time, long-term position, working Monday to Friday, 8:00am to 5:00pm (PH time). We are looking for a dedicated professional who can commit to working exclusively for our company.\n\r\nABOUT THE ROLE:\r\nAs our Treatment Document Co-ordinator, you will play a key role in preparing and managing patient documentation for those ready to begin orthodontic treatment. You will be part of a collaborative team and work closely with our clinical staff in Perth, Western Australia. This role is administrative in nature and suited for someone who is highly organised, detail-oriented, and tech-savvy.\n\r\nKEY RESPONSIBILITIES:\r\n* Prepare and manage treatment documentation for patients commencing orthodontic care\r\n* Dispatch treatment documents to patients electronically with tailored communication\r\n* Prepare and manage outgoing correspondence to dental and medical practitioners\r\n* Manage incoming correspondence from dental and medical professionals\r\n* Coordinate execution and management of agreements\r\n* Keep patient files updated with progress notes, next steps, and relevant communications\r\n* Collaborate with teaUpgrade to see actual infombers to help achieve company goals\n\r\nREQUIRED SKILLS & EXPERIENCE:\r\n* Advanced proficiency in Microsoft Word (keyboard shortcuts, templates, and formatting)\r\n* Competence in Microsoft Excel and DocuSign\r\n* Comfortable learning new software quickly (experience with dental/medical software is a plus, but not required)\r\n* At least 5 years of experience in a professional administrative role\r\n* Minimum 2 years as a virtual assistant or in an online administrative capacity\n\r\nPREFERRED BACKGROUND:\r\n* Legal, document management, or proofreading experience\r\n* Healthcare or dental industry experience (non-clinical)\n\r\nThis is not a clinical or creative role — it requires precision in formatting, editing, and proofreading documents based on orthodontist-defined content.\n\r\nPERSONAL ATTRIBUTES:\r\n* Exceptional attention to detail\r\n* Excellent written English communication\r\n* Professional and reliable\r\n* Able to work independently with minimal supervision\r\n* Efficient and accurate task completion\r\n* Lateral thinker who anticipates next steps\n\r\nSALARY & BENEFITS:\r\n* USD $1,200/month (full-time, 40 hours/week)\r\n* Observance of Philippine regular and special non-working holidays\r\n* 13th month pay\r\n* Leave entitlements after 6 months of employment\n\r\nHOW TO APPLY:\r\nTo apply, please submit your Cover Letter and Resume.\n\r\nIn your Cover Letter, tell us your most recent holiday destination and your favorite activity during that trip\r\nPlease use at least 10 points when applying via onlinejobs.ph\n\r\nWe look forward to hearing from you!",
  "skill_requirements": [
    "Healthcare",
    "Administrative Support",
    "Documentation"
  ],
  "is_active": true,
  "status_history": []
}