{
  "job_id": "1421668",
  "url": "https://www.onlinejobs.ph/jobseekers/job/TikTok-Poster-Content-Operations-Assistant-Growth-Role-into-Project-Manager-1421668",
  "scraped_at": "2025-07-14T23:08:40.067783",
  "title": "TikTok Poster + Content Operations Assistant (Growth Role into Project Manager)",
  "type_of_work": "Part Time",
  "salary": "10,580 PHP/month to 17000-26000 PHP/month after 30 days along with up to an extra 5,000 PHP is bonuses",
  "hours_per_week": "12",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're looking for a dependable, detail-oriented content assistant to manage daily posting across multiple TikTok accounts. You’ll begin with writing captions and uploading short-form videos, but if you prove yourself reliable, you’ll quickly move into a leadership role where you’ll oversee the full content pipeline. This is a long-term role with growth potential and clear performance-based pay increases.\n\n\r\nYour responsibilities to start:\r\n- Post TikTok videos per day across multiple accounts, starting at 30 and scaling up to 60+\r\n- Write short, engaging captions (using simple templates)\r\n- Upload videos from a shared Google Drive folder\r\n- Keep folder structure and file naming organized\r\n- Be available 7 days/week to keep the system moving\n\r\nAs trust is built and consistency is proven, your role will expand to:\r\n- Oversee the editor’s daily video delivery\r\n- Ensure quality and accuracy of backend/frontend clip pairings\r\n- Maintain folder hygiene and daily upload flow\r\n- Report any issues or trends weekly\n\r\nWhat You MUST Be Great At:\r\n- Posting content on TikTok across multiple accounts\r\n- Writing clean, on-brand, English captions\r\n- Staying organized with file names and folders\r\n- Working independently without needing daily check-ins\r\n- Being responsive, consistent, and online 7 days/week\r\n- Taking initiative and improving how things run\r\n- Spacing out content strategically and following a consistent posting schedule\n\r\nYour first 7 days will serve as a paid trial period to evaluate your consistency, communication, and attention to detail. You’ll be expected to:\r\n- Work ~45 minutes/day, 7 days/week\r\n- Post  ~30 videos daily across two or more TikTok accounts\r\n- Follow a spaced-out posting schedule and maintain accurate logs\r\n- Communicate clearly and deliver work on time without reminders\r\n- You will be paid weekly  for 460PHP/hour during the trial period.\n\r\nIf you pass the 7-day trial successfully, you’ll continue under a 30-day probation period where we’ll monitor your ability to work independently and maintain consistency at scale.\n\r\nPromotion Opportunity After 30 Days\r\nIf you:\r\n- Post accurately and on time\r\n- Maintain clean file/folder structure\r\n- Communicate proactively\r\n- Help keep the system running smoothly...\n\r\nYou’ll be promoted to Content Operations Lead with a raise to 575PHP/hour (17,250 PHP/month) and take full ownership of the content posting workflow. You will be paid monthly after the promotion.\n\r\nCompensation\r\nStarting Pay: 460PHP/hour (10,580 PHP/month for ~23 hours/month to start)\n\r\nPromotion Pay (after 30 days): 575PHP/hour (Upgrade to see actual infoPHP/month for 30-45 hours/month)\n\r\nIn addition to your base pay, you’ll be eligible for monthly performance bonuses based on the quality and reliability of your work. Estimated range: 2,000-5,000 PHP/month\n\r\nAccount Access & Trust Policy (Strictly Enforced)\r\nThis role involves access to TikTok accounts and sensitive business systems. While you will have permission to post content, schedule videos, and manage drafts, you will never be authorized to:\n\r\n- Access TikTok Shop earnings or account balance\r\n- View payment settings or linked bank information\r\n- Attempt withdrawals, transfers, or edits to financial data\n\r\nAny attempt to access, manipulate, or interfere with financial settings will result in immediate termination, full blacklisting from future work, and reporting to relevant platforms and communities.\n\r\nWe take security, trust, and integrity extremely seriously. If you’re the kind of person who values long-term work, responsibility, and being part of a growing operation, you’ll be treated with that same level of respect.\n\r\nIf you’re looking to exploit account access or test boundaries—this is not the job for you.",
  "skill_requirements": [
    "Social Media Management",
    "Social Media Video Editing",
    "Social Media Engagement"
  ]
}