{
  "job_id": "1421066",
  "url": "https://www.onlinejobs.ph/jobseekers/job/COURSE-SETUP-MARKETING-LAUNCH-1421066",
  "scraped_at": "2025-07-15T05:33:17.209084",
  "title": "COURSE SETUP MARKETING & LAUNCH",
  "type_of_work": "Gig",
  "salary": "$4 per hour",
  "hours_per_week": "4",
  "date_updated": "Jul 14, 2025",
  "job_overview": "?\n\n???? Virtual Assistant – Beauty Course Marketing & Webpage Build\n\nRead through the entire description to be considered for the job.\n\nWe are a fast-growing Hair Extension beauty brand offering luxury online and in-person courses for aspiring hair professionals. Our mission is to empower women to launch their own profitable beauty businesses through high-quality education, coaching, and branding.\n\nWe are seeking a creative, detail-oriented, and tech-savvy Virtual Assistant who can help bring our online course platform to life, and market it effectively through email and social media.\n\n?\n\n???? Key Responsibilities\n • Course Webpage Creation: Build an aesthetic, on-brand course sales page on our website (basic web design or platform builder experience required).\n • Sales Funnel Setup: Create an evergreen course funnel, including payment links and automation.\n • Instagram Integration: Add direct links from Instagram to course page and booking/payment.\n • Email Marketing: Write and schedule engaging, high-converting Flodesk emails to promote our courses and mentorship programs.\n • Blog Writing: Create well-researched, SEO-friendly blog content about beauty, hair extensions, and business tips.\n • Slide Design: Design clean, professional PowerPoint slides for webinars that reflect our brand.\n • Content Planning: Assist with basic content calendars, captions, and light editing for Instagram posts and stories.\n\n?\n\n???? Tech Access Required\n • Laptop or computer\n • Canva\n • Flodesk\n • CapCut (for light video editing)\n • WhatsApp (for daily communication)\n • Website builder experience (Shopify, Squarespace, or similar)\n • Strong internet connection\n\n?\n\n? Must-Haves\n • Excellent written English and grammar\n • Strong attention to detail and ability to follow creative direction\n • Great communication and responsiveness\n • Interest in beauty, wellness, or women-led businesses\n • Ability to convey emotion and brand tone through writing\n • Experience with basic sales funnels and email sequences is highly preferred\n\n?\n\n???? Bonus (not required but a plus)\n • Experience with Kajabi, Thinkific, or other course platforms\n • Instagram/Meta ad experience\n • Understanding of the beauty industry\n\n\nWe’re excited to welcome a VA who’s passionate about growing alongside our business and who takes pride in creative, high-quality work.",
  "skill_requirements": [
    "Email Marketing",
    "Instagram marketing",
    "Flodesk"
  ],
  "is_active": true,
  "status_history": []
}