{
  "job_id": "1421761",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Product-Researcher-Hot-Selling-Product-Discovery-1421761",
  "scraped_at": "2025-07-14T23:09:53.254081",
  "title": "Amazon Product Researcher (Hot-Selling Product Discovery)",
  "type_of_work": "Full Time",
  "salary": "Negotiable",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re hiring a sharp and resourceful Amazon Product Researcher to work remotely and help identify trending, high-demand products with strong profit potential. You will play a critical role in sourcing winning products that align with market demand, low competition, and high ROI—fueling the growth of our Amazon store.\n\r\nIf you know your way around Amazon, understand customer behavior, and love uncovering the next big thing, we’d love to have you on board.\n\r\nKey Responsibilities:\r\nConduct daily product research to discover trending and profitable items for Amazon FBA/private label/resale.\n\r\nAnalyze sales data, competition, customer reviews, and demand trends using tools like Helium 10, Jungle Scout, Keepa, etc.\n\r\nIdentify low-competition niches with high potential and suggest products that meet specific criteria (e.g. size, margin, seasonality).\n\r\nTrack Amazon bestsellers, new releases, and rising trends across multiple categories.\n\r\nProvide detailed reports including potential selling price, estimated cost, profit margin, and sourcing suggestions.\n\r\nWork closely with the sourcing team (or suppliers on platforms like Alibaba/1688) to assess product feasibility.\n\r\nStay current on Amazon policies, marketplace trends, and consumer demands.\n\r\nRequirements:\r\nAt least 1–2 years of proven experience in Amazon product research.\n\r\nStrong understanding of FBA/private label business models and Amazon marketplace dynamics.\n\r\nSkilled in using research tools like Helium 10, Jungle Scout, Keepa, or similar.\n\r\nAbility to analyze data and make recommendations based on numbers, not guesswork.\n\r\nSelf-motivated, detail-oriented, and comfortable working independently in a remote setup.\n\r\nBonus: Knowledge of supplier vetting on Alibaba/1688 or experience in product validation.\n\r\nTo Apply, simply drop us a message with the subject title ' Product Researcher - I Love Shopping! ', together with a short introduction and we will get back to you.",
  "skill_requirements": [
    "Product Analysis",
    "Product Research",
    "Product Sourcing"
  ]
}