{
  "job_id": "1421922",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421922",
  "scraped_at": "2025-07-14T23:07:42.403649",
  "title": "Digital Marketer – E-commerce | SMM | Lead Generation",
  "type_of_work": "Full Time",
  "salary": "$4 - $6 / hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Important: Kindly read through to the end for detailed application instructions.\n\r\nWho are we?\n\r\nSelfBuild3D is a leading Irish company revolutionizing the self-build and home improvement industry through innovative digital solutions. We empower individuals to design, plan, and visualize their dream homes using advanced 3D renderings, value engineering strategies, and smart building workflows.\n\r\nAt SelfBuild3D, we’ve built efficient systems to deliver high-quality, in-house construction design and planning services. Our mission is to simplify the building process while ensuring precision, efficiency, and outstanding results.\n\r\nWe are now looking for a creative and data-driven Digital Marketer to join our growing remote team. In this role, you'll be responsible for driving brand awareness, lead generation, and digital engagement across various channels. You'll work closely with our design, sales, and technical teams to craft compelling campaigns that connect with self-builders across Ireland and beyond.\n\r\nYour digital marketing expertise will play a key role in helping us reach more homeowners and grow our presence in the self-build community.\n\r\nResponsibilities:\n\r\nDevelop and execute digital marketing strategies, including content creation, campaign management, and performance tracking.\r\nManage and optimize paid advertising campaigns across Facebook, Instagram, and Google.\r\nLead email marketing initiatives using best practices to nurture leads and drive conversions.\r\nManage social media accounts to build brand visibility and foster community engagement.\r\nCreate and optimize conversion-focused landing pages for campaigns and product highlights.\r\nRegularly update and enhance website SEO, including keyword implementation, blog content, and backlink strategies.\r\nBuild, manage, and update websites using CMS platforms like WordPress, Webflow, or Shopify.\r\nSupport e-commerce operations by managing product listings, content updates, and promotional campaigns on Shopify or similar platforms.\r\nConduct cold outreach and appointment setting via phone, email, and online directories.\r\nUse LinkedIn and other platforms for B2B lead generation and prospecting.\r\nLeverage tools such as Google Analytics, Meta Ads Manager, CRM systems, and email marketing platforms for data-driven decisions.\r\nWork independently and collaboratively in a remote, fast-paced environment.\n\r\nRequirements:\n\r\nProven experience in digital marketing strategy, content creation, and performance analysis.\r\nStrong hands-on skills in SEO, paid advertising (Facebook, Instagram, Google), email marketing, and social media management.\r\nExperience with e-commerce platforms and online product marketing.\r\nSkilled in website building and content management systems (WordPress, Webflow, etc.).\r\nAbility to create, update, and optimize landing pages for marketing campaigns.\r\nFamiliarity with SEO best practices, keyword research, blogging, and backlink strategies.\r\nExperience with analytics and marketing platforms such as Google Analytics, Meta Ads Manager, and CRM systems.\r\nPrior experience in appointment setting and lead outreach through digital channels.\r\nExcellent written and verbal communication skills, with attention to detail.\r\nHighly organized, self-motivated, and results-driven.\r\nPrior experience in B2B marketing and cold calling is a strong advantage.\n\r\nWhy Join SelfBuild3D?\n\r\n???? Competitive Compensation – We value your expertise and pay fairly\r\n???? Career Growth – As we expand, so do your opportunities\r\n???? Remote Work – Enjoy the flexibility of working from home\r\n???? Ongoing Training – Weekly learning sessions to level up your skills\r\n???? Positive Team Culture – Collaborative, friendly, and professional environment\n\r\nJob Type: Full-time\r\nPay: $4 – $6 / hour\r\nSchedule: 8-hour shift\r\nBenefits: Work from home\n\r\nTO APPLY\r\nTo continue with your application, please complete this form:\nUpgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}