{
  "job_id": "1421754",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Interior-Designer-Interior-Design-Lover-for-YouTube-channel-1421754",
  "scraped_at": "2025-07-14T23:23:19.416839",
  "title": "Interior Designer / Interior Design Lover (for YouTube channel)",
  "type_of_work": "Part Time",
  "salary": "350 USD/month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Role: Part-Time Visual Curator for Interior Design YouTube Channel\r\nHours: 20 hrs/week (option to move up to 40 hrs)\n\r\nWe’re seeking an interior design, architect or someone with a STRONG passion for interior design who can find high-quality interior design photos to fit each of our video’s talking points. To succeed in this role, you must LOVE interior design and be plugged into design trends so the visuals always feel fresh. \n\r\nYou'll start at 20 hours a week, fully remote, with the option to scale up to 40 if you consistently deliver.\n\r\nNOTE: If your Instagram/Pinterest feed isn’t filled with interior design images, this is not the role for you.\n\n\r\nWHAT YOU'LL DO\r\n- Hunt down striking, on-trend interior photos, mood shots, and design details that elevate each video’s storytelling.\r\n- Organize your finds in themed folders (e.g., Japandi kitchens, brutalist living rooms, budget studio hacks)\r\n- Collaborate with our scriptwriter and video editor to match images to talking points.\r\n- Stay tuned to design blogs, Instagram, and emerging designers so the channel always feels fresh and ahead of the curve.\n\n\r\nWHAT YOU NEED\r\n- A background in interior design or architecture OR a serious passion for the field.\r\n- An eye for composition and color.\r\n- Highly organized.\r\n- Some PhotoShop experience is a bonus but not required.\n\n\r\nWHY YOU'LL LOVE IT\r\n- Flexible hours\r\n- Growth: if you crush it at 20 hours, you can scale up to full-time and take on bigger creative responsibilities\r\n- Influence: your visuals set the tone for a fast-growing design channel\r\n- Creative playground: you’ll get paid to scroll design feeds, discover new talent, and curate the best of the internet\n\n\r\nTO APPLY\r\nComplete this Google Form: Upgrade to see actual info\r\nApplications made directly through OnlineJobs’ messaging system will be ignored.",
  "skill_requirements": [
    "Architectural Services",
    "Photoshop",
    "Graphic Design"
  ],
  "is_active": true,
  "status_history": []
}