{
  "job_id": "1421865",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Accountant-1421865",
  "scraped_at": "2025-07-15T05:25:04.402013",
  "title": "Accountant",
  "type_of_work": "Part Time",
  "salary": "Up to $8 per hour",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "The Accountant plays a vital role in maintaining accurate financial records, supporting account reconciliations, and collaborating with the AP/AR team to ensure smooth day-to-day financial operations. This role requires strong attention to detail, excellent analytical skills, and the ability to work both independently and cross-functionally. Ideal candidates will have experience in eCommerce accounting environments, strong familiarity with US GAAP, and a proven ability to manage financial statements, balance sheets, journal entries, audits, and tax compliance.\n\r\nNote: This is a passive sourcing opportunity, and while we are always looking to connect with exceptional talent, it may take some time to find the right match for this role.\n\r\nResponsibilities:\n\r\nPrepare accurate balance sheets, income statements, and other financial statements in accordance with US GAAP.\r\nPerform account reconciliations, maintain journal entries, and support month-end and year-end close processes.\r\nCollaborate with AP/AR teams to ensure accurate and timely transaction processing.\r\nAssist in preparing schedules and supporting documentation for audits and tax filings.\r\nPartner cross-functionally to identify and implement process improvements across accounting workflows.\r\nEnsure compliance with accounting standards, internal policies, and applicable tax regulations.\r\nProvide financial analysis and assist in budgeting, forecasting, and variance reporting.\r\nSupport audit readiness and liaise with external auditors or tax advisors as needed.\n\r\nRequirements:\n\r\nBachelor’s degree in Accounting, Finance, or related field.\r\nCPA designation is a plus.\r\n5+ years of experience in accounting roles, preferably within an eCommerce or consumer-facing environment.\r\nProficiency in accounting platforms such as Upgrade to see actual info, NetSuite, QuickBooks Online, or Sage Intacct.\r\nStrong working knowledge of US GAAP, financial reporting, and general ledger best practices.\r\nHands-on experience preparing and reviewing journal entries, balance sheets, and financial statements.\r\nFamiliarity with audit processes and tax compliance is required.\r\nExcellent analytical, organizational, and problem-solving skills.\r\nAbility to work independently while collaborating effectively with a team.\r\nPrior experience supervising AP/AR or junior accounting staff is a plus.\n\r\nThis role is part of our passive recruitment efforts, and while an immediate opening may not be available, we welcome experienced and motivated candidates to express their interest. We look forward to connecting with you should a suitable opportunity arise.",
  "skill_requirements": [
    "Accounting",
    "Quickbooks",
    "Microsoft Excel"
  ],
  "is_active": true,
  "status_history": []
}