{
  "job_id": "1421659",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Account-Manager-Full-Time-1421659",
  "scraped_at": "2025-07-14T23:09:48.633180",
  "title": "Account Manager - Full Time",
  "type_of_work": "Full Time",
  "salary": "50000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for a dedicated and professional Account Manager to support our team by managing existing client relationships and onboarding new clients. The ideal candidate will have excellent communication skills, strong organizational abilities, and a passion for delivering exceptional customer service.\n\r\nResponsibilities:\n\r\n* Serve as the primary point of contact for both existing and new clients\r\n* Maintain and strengthen client relationships through regular communication\r\n* Handle onboarding for new clients, guiding them through our services and processes\r\n* Address client inquiries, concerns, and requests promptly and professionally\r\n* Collaborate with internal teams to ensure client needs are met effectively\r\n* Monitor account activity and provide proactive recommendations to clients\r\n* Facilitate contract renewals and identify opportunities for upselling\r\n* Keep accurate records of client interactions and account status  \n\r\nRequirements:\n\r\n* Proven experience in account management, customer service, or client relations\r\n* Excellent communication and interpersonal skills in English\r\n* Strong organizational and problem-solving skills\r\n* Ability to manage multiple accounts simultaneously\r\n* Reliable internet connection and a suitable remote workspace  \n\r\nWhat You’ll Get:\n\r\n* Competitive monthly salary (discussed during interview)\r\n* Paid Australian public holidays\r\n* Bi-weekly pay schedule\r\n* Remote work with a flexible schedule  \n\r\nHow to Apply:\n\r\nDo not reply to this post.\r\nJob Code: ACCMVWM\r\nApply directly through this link:Upgrade to see actual info\n\r\nIncomplete applications or those not following instructions will not be reviewed.",
  "skill_requirements": [
    "Account Management",
    "Client Relationship Management",
    "Customer Relationship Management"
  ]
}