{
  "job_id": "1421715",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Kumusta-Are-you-an-Image-Ad-Designer-or-Video-Editor-1421715",
  "scraped_at": "2025-07-14T22:21:55.732693",
  "title": "Kumusta! Are you an Image Ad Designer or Video Editor?",
  "type_of_work": "Full Time",
  "salary": "$800 - $1200 (+ BONUSES)",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Kumusta!\n\r\nAre you a Video Editor or Image Ad Designer in the PH with 2+ years of experience making ads that sell?\n\r\nWe’re hiring top creatives to help us produce high-converting ads for a fast-growing software company used by 1,000+ businesses.\n\r\nThis isn’t about just pretty designs.\n\r\nIt’s about creating scroll-stopping ads that get clicks, conversions, and real results.\n\r\nYou’d be a great fit if:\n\r\n- You’ve created image or video ads specifically for Facebook, IG, or TikTok\r\n- You understand direct response marketing (persuasion, strong hooks, CTAs)\r\n- You’re fast, detail-oriented, and care about performance\r\n- You take feedback well and love testing what works\n\r\nYour role:\n\r\n- If you’re a Video Editor – you’ll cut short-form videos, for example, UGC-style that feel native to the platform\r\n- If you’re a Designer – you’ll create image ads that pop, grab attention, and sell (even if some are deliberately made “ugly”)\n\n\r\nWhat’s in it for you:\n\r\n- Stable, long-term work (no ghosting, ever)\r\n- Competitive pay + bonuses for top-performing ads\r\n- Flexible PH hours (no graveyard)\r\n- A role where your work directly impacts growth  with a great vibe\n\r\nTo apply:\n\r\nSend us:\r\n1. A quick intro (are you applying for video, image, or both?)\r\n2. Your best work (image or video ads you’ve made)\n\r\nUse the word “PERFORMANCE” in your message to show you read the full post.\n\r\nWe can’t wait to meet you!",
  "skill_requirements": [
    "Performance Marketing",
    "Graphic Design",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": []
}