{
  "job_id": "1421750",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421750",
  "scraped_at": "2025-07-14T23:08:53.044778",
  "title": "Shopify Store Manager",
  "type_of_work": "Any",
  "salary": "1000 USD",
  "hours_per_week": "38",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for someone who treats our Shopify store like their own.\n\r\nHi! We’re GMD Studio — a creative studio working with DTC lifestyle brands on everything from branding and email to websites and product launches. We’re on the hunt for someone to help maintain and optimise a few of our Shopify stores.\n\r\nThis role is ideal for someone who’s organised, reliable, and deeply familiar with the backend of Shopify — but also thinks like a customer. We’re not just looking for someone to tick off tasks. We want someone who’s constantly auditing the site through a conversion lens — noticing where things feel unclear, clunky, or off-brand — and suggesting (or making) smart improvements.\n\r\nKey Responsibilities:\r\n– Uploading and formatting new products (images, copy, tags, SEO, collections)\r\n– Building and updating landing pages (from a template)\r\n– Spotting issues like broken links, outdated banners, missing size charts or inconsistent messaging\r\n– Suggesting opportunities to improve copy, flow, or imagery to drive conversion\r\n– Assisting with updates during sales, product launches, and seasonal changes\n\r\nWe’d love to work with someone who:\r\n– Has strong Shopify experience across different themes\r\n– Is proactive and self-directed — you don’t wait to be told what’s broken\r\n– Thinks like a customer and sweats the small stuff - has a great eye for detail and aesthetics (bonus if you’ve worked with lifestyle/fashion brands)\r\n– Communicates clearly and reliably (we work async across time zones)\n\r\nNice-to-haves:\r\n– Experience using Canva or Figma\r\n– Comfort writing or editing product descriptions",
  "skill_requirements": [
    "Shopify",
    "E-Commerce Management"
  ]
}