{
  "job_id": "1421658",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421658",
  "scraped_at": "2025-07-14T23:07:53.552911",
  "title": "PPC Specialist - Google Ads Expert",
  "type_of_work": "Part Time",
  "salary": "$7 per hour (negotiable)",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Drug Testing Associates is a trusted provider of drug and alcohol testing services, along with clinical lab services, for businesses and individuals across the USA. With over 4,000 collection sites nationwide, we are focused on expanding our reach in every state. We are looking for a results-driven PPC Specialist to manage and optimize our paid search campaigns. If you’re passionate about digital marketing and have a strong command of Google Ads and other PPC platforms, we’d love to work with you!\n\r\nAs a PPC Specialist, you will be responsible for managing and optimizing our paid advertising campaigns to increase visibility, drive traffic, and improve conversion rates across various platforms. You will work with our Marketing person to ensure that PPC efforts align with broader marketing strategies.\n\r\nResponsibilities:\r\n1. Campaign Management: Set up, monitor, and optimize PPC campaigns on Google Ads, Bing Ads, and social platforms.\r\n2. Keyword Research: Perform keyword research to find new opportunities for campaign growth and refine targeting strategies.\r\n3. Ad Copy Creation: Develop engaging ad copy and landing page copy to improve CTR and conversion rates.\r\n4. Analytics & Reporting: Use analytics tools to track performance, analyze results, and provide regular reports on KPIs.\r\n5. Competitor Research: Monitor and analyze competitors’ PPC activities to identify opportunities and improve strategy.\n\r\nRequired Skills & Qualifications:\r\n• 2+ years of experience managing PPC campaigns, particularly on Google Ads.\r\n• Strong understanding of PPC platforms, keyword research tools, and analytics tools.\r\n• Proven track record of driving ROI and achieving performance goals through PPC ads.\r\n• Excellent communication and analytical skills.\r\n• Ability to work independently, dedicating 10-15 hours per week.\n\r\nPlease send us your resume and a cover letter briefly outlining your experience in this role. We would also love to see a portfolio showcasing past projects you've worked on.\n\r\nCheers,\r\nJoe",
  "skill_requirements": [
    "Google Ads",
    "PPC",
    "Ads Management"
  ]
}