{
  "job_id": "1421805",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Hiring-Advanced-CRM-Go-High-Level-Automations-Specialist-Instagram-DM-Funnel-Workflow-Pro-1421805",
  "scraped_at": "2025-07-15T03:36:53.885901",
  "title": "???? Hiring: Advanced CRM & Go High Level Automations Specialist (Instagram DM + Funnel + Workflow Pro)",
  "type_of_work": "Any",
  "salary": "500",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "FULL TIME WORK IF YOU DO EXTREMELY WELL PART TIME FIRST\r\nWe are The Breath Coach School — a fast-growing international coaching brand focused on helping conscious entrepreneurs build powerful, purpose-driven businesses online. We blend spirituality with systems, emotional transformation with marketing mastery, and we’re scaling rapidly.\n\r\nNow we’re looking for a highly skilled, detail-obsessed Go High Level + CRM Workflow Expert who can OWN and optimize our backend systems.\n\r\n?\n\r\n? YOUR PRIMARY RESPONSIBILITIES\n\r\nYou’ll work directly with the founder to bring our tech systems into full alignment with our vision. You must be proactive, organized, and a tech wizard when it comes to:\n\r\n???? Go High Level + CRM Systems\r\n • Building and duplicating entire funnels with optimized layouts and responsive formatting\r\n • Creating smart automation workflows using advanced conditions, delays, tags, and goal-based logic\r\n • Managing full customer journeys from opt-in to nurture to purchase\r\n • Building and managing sales pipelines, opportunity stages, and task reminders\r\n • Setting up and fixing email & SMS workflows, appointment setting flows, and automations\n\r\n???? Instagram DM Automation & Trigger Systems\r\n • Creating keyword triggers for DM replies (e.g. someone types “Vaisya” ? auto response + workflow triggers)\r\n • Tagging and segmenting contacts based on interactions\r\n • Integrating new DM automations without breaking current systems\r\n • Troubleshooting bot logic and ensuring smooth journeys from DM to funnel\n\r\n???? Tag Management & Segmentation\r\n • Creating clean, organized tag architecture across multiple brands and offers\r\n • Assigning and removing tags based on customer actions and statuses\r\n • Keeping our CRM\n\r\nHere’s a professional, compelling, and detailed part-time job post for OnlineJobs.ph to help you attract only the most skilled Go High Level (GHL) CRM automation & funnel assistant — someone who’s not just a funnel builder, but also deeply capable of organizing pipelines, tagging systems, automation logic, DM workflows, and advanced conditions inside GHL:\n\r\n?\n\r\n???? Part-Time CRM Automation & Funnel Wizard (Go High Level Expert) – 20 Hours/Week – Spiritual Coaching Brand\n\r\nLooking for someone who’s not just a funnel builder… but a systems artist.\n\r\nWe’re a fast-growing personal development + spiritual coaching company with a powerful global mission:\r\nTo help purpose-driven humans build liberated, profitable, soul-aligned businesses that change lives.\n\r\nWe’re seeking a part-time Go High Level (GHL) expert (20 hours/week) who can take full ownership over the backend CRM structure, DM automation, tagging, advanced workflow logic, and pipeline organization so that everything runs like a well-oiled machine.\n\r\n?\n\r\n???? YOUR PRIMARY RESPONSIBILITIES\n\r\nYou won’t just be building funnels. You’ll be managing and optimizing all the systems that drive revenue, client care, and lead flow. This includes:\r\n • ? Setting up & optimizing workflows (with advanced IF/THEN conditions)\r\n • ? Creating clean, well-organized pipelines and deal stages\r\n • ? Implementing Instagram DM automation triggers + comment keyword automations (via GHL social planner)\r\n • ? Masterfully managing tagging, custom fields, and segmentation\r\n • ? Setting up email & SMS automations with correct timing across time zones (CST, EST, PST, and Thailand time)\r\n • ? Maintaining course access automations and follow-up sequences (especially for payments with custom amounts)\r\n • ? Ensuring clean data hygiene — no duplicate contacts, wrong automations, or missed leads\r\n • ? Creating streamlined checklists & SOPs to track down payments, follow-ups, and event invites\n\r\n?\n\r\n???? REQUIREMENTS\n\r\nThis is not for beginners. You must already be a Go High Level expert with:\r\n • ???? Deep knowledge of CRM strategy, not just basic automations\r\n • ?? Fluent in advanced workflow logic (multiple conditions, triggers, delays, etc.)\r\n • ???? Confident in Instagram DM automation setup and comment triggers\r\n • ????? Highly organized — able to build pipeline systems that scale\r\n • ????? Strong tag segmentation skills — nothing sloppy\r\n • ???? Comfortable with managing complex event-based flows and follow-up\r\n • ????? Experience troubleshooting live campaign issues (missed links, timing bugs, etc.)\r\n • ???? Communicative, coachable, and committed to excellence\n\r\n?\n\r\n???? ABOUT US\n\r\nWe’re a spiritually-rooted coaching brand that blends breathwork, neuroscience, entrepreneurship, and holistic healing. Our team is global, our mission is deep, and our operations demand precision.\n\r\nYou’ll be working directly with the founder’s team to support systems across multiple brands and collaborations with influencers — so attention to detail is key.\n\r\n?\n\r\n? WORK HOURS & PAY\r\n • ???? Part-time – 20 hours/week\r\n • ? Flexible working hours (as long as you meet deadlines)\r\n • ???? Competitive pay based on skill and experience\r\n • ???? Long-term opportunity for growth, bonuses, and full-time transition\n\r\n?\n\r\n???? TO APPLY, PLEASE SUBMIT:\r\n 1. A brief intro message with:\r\n • Your CRM + automation experience\r\n • Any Go High Level workflows or projects you’re proud of\r\n • What excites you about working with a spiritual coaching brand\r\n 2. A Loom video (2–5 min) walking us through:\r\n • A CRM system or automation you’ve built in Go High Level\r\n • How you manage tags and pipelines\r\n • One thing most people get wrong in GHL (and how you do it better)\n\r\n?\n\r\nWe’re not just looking for a worker.\r\nWe’re looking for a wizard.\r\nIf you’re meticulous, strategic, and passionate about helping systems work beautifully behind powerful missions — apply now.",
  "skill_requirements": [
    "CRM",
    "Marketing Automation",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": []
}