{
  "job_id": "1421921",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Blog-Content-Writer-1421921",
  "scraped_at": "2025-07-15T06:26:49.995720",
  "title": "Blog Content Writer",
  "type_of_work": "Full Time",
  "salary": "$1000 USD/ a month 57k PHP/ a month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Full-Time SEO Blog Writer (Remote)\r\nInjectCo – Premier Medspa | Remote | Full-Time\n\r\nInjectCo is a fast-growing, modern medspa focused on aesthetics, skin health, and confidence. We are seeking a skilled and creative SEO Blog Writer to produce engaging, research-driven, and optimized content that drives traffic, boost user engagement, and supports our overall SEO strategy. \r\nIn this role, you will write high-quality blog posts tailored to specific target audiences while incorporating SEO best practices to improve content discoverability. You will collaborate with our SEO specialists and subject matter experts to ensure that the content aligns with business objectives and resonates with readers.\r\nKey Responsibilities:\r\nWrite well-researched, original, and compelling blog posts that reflect the brand's tone and voice.\r\nImplement SEO best practices, including keyword integration, metadata optimization, internal linking, and formatting for readability.\r\nConduct thorough research to ensure the accuracy, depth, and credibility of content.\r\nWork closely with our SEO specialists to align blog content with broader content marketing and SEO goals.\r\nEdit and proofread content to ensure clarity, grammatical accuracy, and adherence to brand guidelines.\r\nRequirements:\r\n2+ years of agency experience writing SEO-optimized content\r\nExperience with B2B, B2C or niche industries (e.g., beauty, healthcare, travel)\r\nStrong understanding of SEO principles, including keyword research, on-page optimization, and content structuring for search engines.\r\nAbility to simplify complex topics and present information in a clear, engaging manner.\r\nExcellent command of grammar, spelling, and punctuation, with strong attention to detail.\r\nExperience working with content management systems (CMS), such as WordPress, to format and publish blog posts.\r\nStrong organizational and time-management skills to handle multiple projects and meet deadlines.\r\nWhat We Offer: \r\nFull-time remote position (40 hours/week)\r\nFlexible work hours\r\nCompetitive pay (based on experience)\r\nOpportunity to grow in a fast-moving work environment\r\nCreative freedom and ownership of your role\r\nSupportive, fun, and collaborative team culture\r\n$1000 / month salary \r\nHow to Apply:\r\nSend your resume to Upgrade to see actual info with a cover letter, including:\n\r\nA writing portfolio showcasing your best work\r\nAdd the key phrase \"I can write SEO content\" in your email subject line\r\nInformation about any relevant experience in the medspa, beauty, or health niche\n\r\n**Must be willing to a writing test as part of the application process\r\n**Hiring 1 candidate for this role.",
  "skill_requirements": [
    "Copywriting",
    "Article Writing",
    "Blogging"
  ],
  "is_active": true,
  "status_history": []
}