{
  "job_id": "1421762",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Pet-Care-Co-ordinator-1421762",
  "scraped_at": "2025-07-14T23:08:24.217540",
  "title": "Pet Care Co-ordinator",
  "type_of_work": "Any",
  "salary": "52,000 PHP",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "As a Pet Care Coordinator at Upgrade to see actual info, you are the operational heartbeat of our service team. Your role is to ensure smooth, efficient, and high-quality service delivery by coordinating between pet sitters, dog walkers, and our valued clients. This is a fast-paced, dynamic role that requires exceptional multitasking, time management, and communication skills.\n\r\nYou’ll be managing day-to-day logistics, responding quickly to changing schedules, and ensuring every service is delivered with care and professionalism. From matching pets with the right carers to solving last-minute issues, you’ll be juggling tasks in real time and making decisions that impact customer satisfaction and staff performance.\n\r\nKey Responsibilities\r\n• Coordinate daily operations to ensure on-time service delivery across multiple service areas\r\n• Manage scheduling of dog walks, pet sits, and meet-and-greets with strict adherence to time windows\r\n• Assign and communicate with pet carers quickly and clearly, ensuring all job details are understood and confirmed\r\n• Act as the first point of contact for client enquiries, service updates, or issues — always aiming to respond quickly and professionally\r\n• Monitor and fill gaps in staffing due to cancellations, emergencies, or holidays\r\n• Balance competing priorities, often juggling multiple tasks and solving problems on the fly\r\n• Support recruitment efforts by identifying staffing gaps and assisting in onboarding new carers\r\n• Coach and support teaUpgrade to see actual infombers to maintain service excellence and uphold brand values\r\n• Maintain accurate records, client profiles, and key service notes using internal systems\r\n• Report performance issues or escalations to management as required\n\r\nYou’ll thrive in this role if you:\n\r\n• Work well under pressure and can adapt quickly to change\r\n• Are a confident english communicator across phone, text, and email\r\n• Can switch between tasks and make smart decisions in the Upgrade to see actual infont\r\n• Have a strong understanding of logistics, scheduling, or dispatch-style roles\r\n• Are passionate about animals and committed to high service standards",
  "skill_requirements": [
    "Multitasking"
  ]
}