{
  "job_id": "1421714",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Video-Editor-Graphic-Designer-1421714",
  "scraped_at": "2025-07-15T15:29:18.872746",
  "title": "Full-Time Video Editor / Graphic Designer",
  "type_of_work": "Full Time",
  "salary": "35,000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role:\n\r\nWe’re looking for a talented and highly committed Video Editor who can also assist with graphic design tasks when needed. While your main focus will be on video content, you’ll also support the creative team by working on static graphics and occasional website content updates when things are lighter on the video side.\n\r\nYou’ll also help manage and update product videos and images on our website. Experience with WordPress and Elementor is a big plus (but not a hard requirement). If you're interested in using AI tools to streamline creative workflows, even better — we’re always keen on improving efficiency and quality.\n\r\nWhat You'll Be Doing:\n\r\nEditing & Producing:\r\n- Product Installation Videos\r\n- Product Overviews & Feature Guides\r\n- Ads and Social Media Content\n\r\n Creating or Assisting With:\r\n- Social Media Graphics, Thumbnails, Banners\r\n- Marketing Visuals & Product Images\n\r\nOccasionally:\r\n- Updating media on our WordPress site (Elementor)\r\n- Using AI tools for editing, automation, or visual generation\n\r\nYou’ll work closely with our Marketing and Product teams to ensure all outputs are polished, on-brand, and effective.\n\r\nAbout Us:\r\nWe’re an Australian-based eCommerce brand selling high-quality Android head units and smart automotive tech. Our goal is to modernise the in-car experience, and your work will be central in demonstrating the value of our products to customers whether it's their first look through an ad or an in-depth install guide they rely on.\n\r\nWhat We’re Looking For:\r\n- Proficiency in video editing software (e.g., Adobe Premiere Pro, Final Cut, DaVinci Resolve)\r\n- Strong skills in Photoshop & other Adobe Creative Suite tools\r\n- Bonus: Experience with WordPress / Elementor\r\n- Bonus: Familiarity with AI tools (image generators, smart editors, auto-subtitlers, etc.)\r\n- Great visual storytelling instincts and sense of branding\r\n- Experience editing for platforms like YouTube, TikTok, Reels, or paid ads\r\n- Clear communicator with strong attention to detail\r\n- Must be available full-time and fully focused — no client juggling\n\r\nImportant Note\r\nThis is not a freelance gig for those juggling multiple clients. We’re offering a full-time, work-from-home position with consistent hours and long-term growth. We’re looking for someone who wants to be a part of our team — not just another project in their queue.\n\r\nPerks & Benefits\r\n- Morning Shift (Western Australia Time)\r\n- Saturday & Sunday Off\r\n- 13th Month Pay\r\n- HMO + 1 Dependent (after 6 months)\r\n- 2–3 Weeks Paid Christmas/New Year Break\r\n- Annual Catch-Up\n\r\nNew Graduates Welcome\r\nIf you’ve got the skill and the passion, we’re open to hiring fresh grads who are ready to commit and grow.\n\r\nHow to Apply\n\r\n- Send me a link of your CV and Portfolio (include both video and design samples)\r\n- Any install or product-related work you've done\n\r\nUse the subject line:\r\n\"AIGHT – Video Editor Application\"\r\n(to confirm you’ve read the full post)",
  "skill_requirements": [
    "Graphic Design",
    "Video Editing",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:27:03.077331",
      "reason": "Job first discovered"
    }
  ]
}