{
  "job_id": "1421963",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421963",
  "scraped_at": "2025-07-14T23:09:40.229121",
  "title": "Patent Legal Assistant",
  "type_of_work": "Any",
  "salary": "20,000 - 40,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "A Legal Assistant (Patent) plays a crucial role in supporting the legal team, particularly in intellectual property (IP) matters, with a focus on patents and occasional involvement in trademark cases. This role involves assisting attorneys and patent agents in various aspects of patent and IP law, including research, documentation, and administrative tasks. The primary responsibilities of a Patent Paralegal include:\n\r\nKey Responsibilities:\r\n1. Patent Filings: Provide support to external legal counsel in the submission of patent applications in jurisdictions that mandate filings exclusively by attorneys. Prepare, review, and file patent applications with the appropriate patent or intellectual property offices whenever possible. Ensure compliance with filing requirements and deadlines.\n\r\n2. Patent Prosecution Support: Assist in managing patent prosecution activities, such as tracking deadlines, preparing responses to office actions, and communicating with patent examiners and/or external counsel.\n\r\n3. Patent Search and Analysis: Conduct patent searches to assist in the evaluation of patentability and patent infringement issues. Summarize and present findings to legal professionals and/or external counsel.\n\r\n4. Document Management: Organize and maintain intellectual property related documents, including but not related to patent portfolios, external counsel correspondence, and related paperwork. Manage electronic and physical files efficiently.\n\r\n5. Deadline Compliance: Maintain and update patent docketing systems to ensure accurate tracking of patent deadlines, including maintenance fees and annuities.\r\n6. Communication: Prepare correspondence for external counsel and internal teaUpgrade to see actual infombers to provide updates, gather information, communicate instructions, and facilitate collaboration on patent and IP matters.\n\r\n7. Trademark and Copyright Assistance: Provide support in various trademark-related tasks, including conducting trademark searches, preparing trademark applications, and managing trademark maintenance. Additionally, assist with copyright tasks, such as advising on copyright registration, submission of documents and requirements under copyright laws, and aiding in the enforcement of copyright protections.\n\r\n8. Legal Research: Conduct legal research into matters pertaining to patent and intellectual property law, ensuring continual awareness and understanding of evolving regulatory frameworks, case law, and best practices.\n\r\n9. Administrative Support: Handle administrative tasks, such as billing, scheduling, and preparing reports and other duties as required by the legal team.\n\r\nQualifications:\r\n* A bachelor's degree in a related field is often preferred.\r\n* Paralegal certification that allows them to prepare and/or prosecute patent applications.\r\n* Experience in Patent and IP law.\r\n* Proficiency in legal research, patent databases, and document management software.\r\n* Strong attention to detail and organizational skills.\r\n* Excellent communication skills and the ability to collaborate with legal professionals and clients.\r\n* Knowledge of patent prosecution procedures and USPTO rules and regulations.\r\n* Familiarity with intellectual property law in multiple jurisdictions (a plus, but not always required).",
  "skill_requirements": [
    "Paralegal",
    "Intellectual Property Rights",
    "Patent Drafting"
  ]
}