{
  "job_id": "1421736",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Bookkeeper-Grant-Writer-Finance-Operations-Suppor-1421736",
  "scraped_at": "2025-07-14T23:25:04.960434",
  "title": "Bookkeeper / Grant Writer + Finance & Operations Suppor",
  "type_of_work": "Full Time",
  "salary": "750",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Location: Remote\r\nType: Full-Time\r\nReports To: Founder\n\r\nRole Overview\r\nWe’re looking for a highly organized and proactive Bookkeeper who can also take on broader Finance & Operations responsibilities. You’ll manage our day-to-day financial records in QuickBooks Online, help automate audit-ready books, and support forecasting and cost controls. Beyond core bookkeeping, you’ll also contribute to grant writing, investor due diligence, internal reporting (Power BI), and light HR tasks like onboarding and payroll support.\n\r\nThis is an ideal role for someone who’s detail-oriented and systems-minded, but also eager to wear multiple hats and help a growing business stay financially lean, organized, and strategic.\n\r\nKey Responsibilities\n\r\n1. Bookkeeping & Financial Management\r\nMaintain accurate and timely books using QuickBooks Online.\n\r\nReconcile bank accounts, credit cards, and payment processors monthly.\n\r\nManage accounts payable/receivable, expense tracking, and monthly closings.\n\r\nEnsure all books are audit-proof with proper documentation and automation for receipts and categorization.\n\r\n2. Financial Modeling & Cash Flow Forecasting\r\nAssist in developing cash flow models, operating budgets, and financial projections.\n\r\nSupport leadership in scenario modeling and funding strategy.\n\r\n3. Cost Control & Expense Optimization\r\nHelp track, categorize, and analyze spend across departments and projects.\n\r\nIdentify opportunities to cut costs, consolidate tools, or renegotiate vendor contracts.\n\r\n4. Automation & Systems Building\r\nAutomate routine financial processes and reporting using QuickBooks integrations or tools like Zapier and Quickbooks.\n\r\nSystematize receipt capture, transaction labeling, and recurring journal entries.\n\r\n5. SR&ED & Tax Credit Readiness\r\nEnsure proper tagging and documentation of R&D-related expenses within Quickbooks\n\r\nWork with internal and external stakeholders to maintain eligibility for SR&ED and other innovation programs.\n\r\nExpanded Responsibilities\n\r\n6. Grant Writing & Funding Applications\r\nResearch, draft, and submit grants for R&D, export, hiring, or innovation (e.g., IRAP, CanExport, FedDev).\n\r\nTrack grant deadlines, reporting requirements, and follow-up submissions.\n\r\nCoordinate with engineering and leadership teams for technical input on grant applications.\n\r\n7. Internal Reporting & Business Intelligence\r\nBuild and maintain dashboards and visual reports using Power BI or Excel/Sheets.\n\r\nDevelop recurring reports for leadership (e.g., runway, burn rate, departmental spend).\n\r\nCreate visibility into company KPIs and unit economics.\n\r\n8. Investor Due Diligence & Support\r\nMaintain an up-to-date investor data room with financials, cap table summaries, and key documents.\n\r\nPrepare financial summaries or backup materials for investor pitches and board updates.\n\r\nAssist with document collection during due diligence.\n\r\n9. Light HR & Onboarding Support\r\nAssist with contractor and employee onboarding, including payroll setup and compliance forms.\n\r\nCoordinate with payroll providers (e.g., Quickbooks) to ensure timely and accurate payments.\n\r\nMaintain HR documentation and track benefits/payroll records.\n\r\nQualifications\r\n3+ years of experience in bookkeeping, finance operations, or FP&A.\n\r\nExpert in QuickBooks Online, with strong financial reporting skills.\n\r\nProficient in Excel/Google Sheets; working knowledge of Power BI is a plus.\n\r\nExperience with grant writing, SR&ED, or government funding is a strong asset.\n\r\nBonus: Experience supporting investor relations or due diligence processes.\n\r\nExcellent organization, communication, and self-management skills.\n\r\nAbility to work independently and thrive in a fast-paced startup environment.",
  "skill_requirements": [
    "Quickbooks",
    "Microsoft Excel",
    "Power BI"
  ],
  "is_active": true,
  "status_history": []
}