{
  "job_id": "1421988",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Legal-Assistant-Floater-Position-1421988",
  "scraped_at": "2025-07-15T07:46:10.087657",
  "title": "Legal Assistant Floater Position",
  "type_of_work": "Full Time",
  "salary": "$1,000/mo.",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "US Company\n\r\nAre you a compassionate and detail-oriented professional who excels in providing exceptional service to clients? Are you fluent in English, with excellent communication skills? If so, we have an exciting opportunity for you to join our team as a FULL-TIME LONG-TERM Legal Assistant floater. We pay the 13th month and offer vacation after one year. Hours are Monday - Friday 8 am to 5 pm EST. Must have stable high-speed internet with backup internet and up-to-date computer.\n\r\nPosition Overview:\r\nAs a Legal Assistant, you will be the main point of contact for clients. Your role will be pivotal in creating a positive experience for our clients while gathering important information to help us serve their needs effectively.\n\r\nResponsibilities:\r\n* Client Intake: Conduct initial client interviews to gather essential information, including personal and contact details, medical history, and work history. The ability to redirect the conversation to get the information needed to assess their case.\r\n* Communication: Effectively communicate with clients, families, and teaUpgrade to see actual infombers, ensuring clear understanding and empathy.\r\n* Support: Offer emotional support to clients and their families by demonstrating kindness, compassion, and a nurturing demeanor.\r\n* Team Collaboration: Collaborate with other departments to ensure a seamless transition for clients into our programs.\n\r\nQualifications:\r\n* Fluent in English, both written and spoken.\r\n* Previous experience in client intake, customer service, or a related field is preferred.\r\n* Exceptional communication and interpersonal skills, with a kind and nurturing disposition.\r\n* Detail-oriented and highly organized, with the ability to set appointments and follow checklist items to send email sequences.\r\n* Empathetic and capable of providing emotional support to clients in distress.\r\n* Ability to handle sensitive information with discretion and maintain confidentiality.\r\n* Strong investigative skills and attention to detail.\r\n* Proficiency with computer software and data entry.\n\r\nWe are dedicated to making a positive impact on the lives of our clients and their families. As a Legal Assistant, you will play a crucial role in this mission. We offer competitive compensation, opportunities for professional growth, and a supportive work environment where your skills and talents will be valued and appreciated.\r\nIf you are a compassionate, detail-oriented individual who is passionate about helping others, we encourage you to apply and join our team.",
  "skill_requirements": [
    "Customer Service",
    "English Proficiency",
    "Case Management"
  ],
  "is_active": true,
  "status_history": []
}