{
  "job_id": "1421694",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421694",
  "scraped_at": "2025-07-14T23:09:31.504966",
  "title": "Virtual Assistant — Research & Outreach Support for Contracting Company",
  "type_of_work": "Full Time",
  "salary": "To Be Discussed",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a growing government contracting company that partners with subcontractors across the United States. We’re looking for a reliable, detail-oriented virtual assistant to join our team full-time.\n\r\nMain tasks will include:\r\nResearching new contract opportunities using provided websites and tools\r\nContacting our list of subcontractors to confirm interest in bidding on projects\r\nProviding clear, complete information to subcontractors so they can give us accurate quotes\r\nFollowing clear, step-by-step instructions for each task\n\r\nImportant:\r\nYour main priority will be following our process exactly as trained. We are NOT looking for someone to redesign or change our workflow at this time — just someone who can listen, learn, and execute with attention to detail. Improvements can come later, once you master the basics.\n\r\nAnswer each question in full sentences. Number your answers clearly. Do not skip any questions.\r\nWhat is your understanding of what a virtual assistant does?\r\nDescribe a time when you had to follow very specific instructions. What did you do to make sure you didn’t make mistakes?\r\nHow do you keep track of tasks to make sure you don’t miss any steps?\r\nWhy do you think attention to detail is important in research or outreach work? Are you a cat or a dog person?\r\nHow comfortable are you communicating professionally with different people by email or message?\r\nWhat would you do if you didn’t understand part of an instruction you were given?\r\nWhy do you want to work in a role where the main focus is following exact directions?\n\r\nWork hours mostly flexible, but you must be able to respond to messages during US business hours when needed\r\nPaid training provided\r\nLong-term opportunity — we want someone who will grow with us\n\r\nTo apply:\n\r\nAnswer all questions above in full sentences.\r\nInclude a short introduction about yourself.\r\nUse the subject line: “KB Standard VA Applicant – [Your Name] [Your least favorite color]”\r\nApplications without the answers or with missing information will not be considered.",
  "skill_requirements": [
    "Attention to Detail",
    "English Proficiency",
    "Research"
  ]
}