{
  "job_id": "1421914",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Website-Designer-Developers-1421914",
  "scraped_at": "2025-07-15T06:28:38.245544",
  "title": "Website Designer/ Developers",
  "type_of_work": "Full Time",
  "salary": "$650/mo",
  "hours_per_week": "35",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Serour Designs is a growing Australian startup agency specialising in website design, web development, and online business solutions. With a consistent stream of leads, we’re looking to expand our team with a reliable and skilled Web Designer/Developer.\n\r\nThis role is ideal for someone who is proactive, collaborative, and confident working across various website platforms and tools.\n\r\nAbout the Role:\r\nYou’ll work alongside me on client projects for Australian businesses in industries like construction, mortgage broking, cleaning, retail, and more.\n\r\nI handle the lead generation and discovery calls, we’ll jump on a Zoom call together to discuss the solution, where you’ll be introduced to the client and provide input on the design and technical strategy.\n\r\nYour job will be to design, build, and deliver the website, plus support with setting up Google Business Profiles and related digital tools as needed.\n\r\nRequired Skills & Tools in one of the following:\r\nWordPress (Elementor, Divi, etc.)\r\nWix\r\nSquarespace\r\nFigma (basic wireframing and prototyping)\n\r\nNice to Have (Not Essential):\r\nSEO best practices\r\nGoogle Ads or Google Business setup\r\nContent writing (for web copy or blogs)\n\r\nWhat You’ll Get:\r\nA steady flow of work – I’ll handle the sales so you can focus on the craft.\r\nFulltime work – Monday to friday 8hr days.\r\nLong-term growth potential – as the agency scales, so can your role.\n\r\nIf you’re a detail-oriented individual with solid web design skills and a collaborative mindset, I’d love to hear from you.",
  "skill_requirements": [
    "Web Design & Page Layout",
    "Wix",
    "Wordpress"
  ],
  "is_active": true,
  "status_history": []
}