{
  "job_id": "1421951",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-DM-Sales-Representative-only-DMs-NO-CALLS-required-1421951",
  "scraped_at": "2025-07-14T23:08:44.453163",
  "title": "Full Time DM Sales Representative - only DMs, NO CALLS required",
  "type_of_work": "Full Time",
  "salary": "600 -1000 USD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hey there!\n\r\nWe have opened another position.\n\r\nI'm looking for a full-time virtual assistant to join my team and help with some exciting work. My company helps businesses with large Instagram audiences sell their products/services directly to their followers through text messages, and I need someone reliable who can be part of this journey long-term.\n\r\nWhat's the job?\n\r\nYou’ll be starting and coordinating sales conversations with our clients' Instagram followers. Don’t worry - you won’t have to come up with what to say. We’ll provide you with the exact messages and the order in which to send them. You need to copy-paste the messages and send them as instructed and coordinate the conversation.\n\r\nWhat we’re looking for:\n\r\nSomeone dependable and willing to work full-time. Excellent English skills, understands US lingo, and the ability to communicate clearly through text.\n\r\nA friendly and professional approach when chatting with followers. Open to ongoing training and support, as we're always here to help you do your best.\n\r\n- MALES ONLY\n\r\n- You must have at least 2 years of sales experience.\n\r\n- You must know how to use social media, specifically instagram\n\r\n- You must be very communicative\n\r\n- You must be reliable, this is not a 1 month project, this is long-term employment\n\r\n- PLEASE DO NOT APPLY IF YOU DO NOT MEET THE CRITERIA ABOVE\n\r\nWhy join us?\n\r\nSimple tasks with clear instructions provided. Consistent training and support, so you'll always feel prepared. A long-term position where we can grow together. We have multiple PH employees who are working full time with us and they're amazing.\n\r\nIf you're interested and think this could be a good fit for you, I’d love to hear from you!\n\r\nLet me know, and we can discuss more details.\n\r\nThank you.",
  "skill_requirements": [
    "Instagram marketing",
    "Sales Support",
    "Communication"
  ]
}