{
  "job_id": "1421950",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Premiere-Pro-Video-Editor-Unleash-Your-Creative-Eye-1421950",
  "scraped_at": "2025-07-15T06:27:00.271613",
  "title": "Premiere Pro Video Editor: Unleash Your Creative Eye!",
  "type_of_work": "Full Time",
  "salary": "Php15,000-Php18,000 depending on skills and experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking to hire ASAP! If you’re a creative, reliable, talented, enthusiastic, and initiative-driven video editor with strong English comprehension and social media awareness, this role is for you! You'll be crafting eye-catching thumbnails that make people want to click and editing our video footage into engaging content. Here is a sample:\nUpgrade to see actual info\n\r\nWhat You'll Be Doing:\r\nDesigning awesome thumbnails that grab attention.\r\nEditing video footage to create polished and engaging content.\r\nKeeping things visually consistent with our brand.\r\nWorking closely with the team to bring ideas to life.\n\r\nWork Schedule:\r\nGraveyard shift: 8 PM - 4 AM (PH Time)\n\r\nSalary:\r\nCompetitive – based on skills & experience\n\r\nWhat You Bring to the Table:\r\nSolid experience with video editing in Adobe Premiere Pro\r\nCreative and flashy thumbnail creations using Adobe Photoshop\r\nStrong English reading comprehension & communication skills\r\nCreative thinker who takes initiative & can work independently\r\nSocial media-savvy – understands trends, perfect timing of cuts, and English slang\r\nMust be reliable and consistent in delivering high-quality edits\n\r\n**If you do not use Adobe Premiere Pro and Adobe Photoshop, DO NOT APPLY!!!\n\n\n\r\nHow to Apply:\r\nStep 1:\r\nApply here at OnlineJobs with the subject line:\r\n\"Video Editor Application – [Owner of Tesla]\".\n\r\nStep 2:\r\nReach out to the MS Teams of Oliber WB with your portfolio or some examples of your work, along with your resume. \n\nUpgrade to see actual info\n\r\nIf you're ready to bring your creativity to the team, apply now!",
  "skill_requirements": [
    "Photoshop",
    "Video Editing",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": []
}