{
  "job_id": "1421890",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421890",
  "scraped_at": "2025-07-14T23:07:07.399462",
  "title": "Shopify Product Lister (Competitor-Based Product Uploads)",
  "type_of_work": "Part Time",
  "salary": "200",
  "hours_per_week": "10",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're looking for a Shopify Product Lister who can help us add winning products to our dropshipping store by researching competitors and replicating listings with care and precision.\n\r\nYou will receive product links from us (from competitor stores and your job is to turn these into high-quality product listings on our Shopify store—optimized for both visuals and conversion.\n\r\nWhat You’ll Do:\n\r\n- Upload products to Shopify based on competitor product pages\r\n- Save and organize product images\r\n- Write short, clean titles and descriptions (based on existing ones or adjusted per guidelines)\r\n- Add variants, pricing, and metafields correctly\r\n- Follow our naming, tag, and collection structure\r\n- Optional: minor copy tweaks to improve clarity or avoid duplicate content issues\n\r\nRequirements:\r\n- Experience with Shopify product uploads\r\n- Fluent in **English** (written)\r\n- Strong attention to detail\r\n- Able to follow structure and meet deadlines\r\n- Able to use ChatGPT for listing optimisation\r\n- Comfortable working with Slack\r\n- Experience working with dropshipping stores and product listing\n\r\nA plus if you are:\r\n- Are familiar with Shopify apps like CJDropshipping\r\n- Can identify trendy or high-potential products on TikTok or competitor stores\n\r\nTo Apply:\n\r\nPlease send us:\n\r\n1. A short message on why you’re a good fit\r\n2. Your relevant Shopify or product listing experience\r\n3. Examples or links to stores you’ve worked on\n\r\nWe're looking for someone reliable, fast, and quality-focused — who knows how to make a copied product listing look polished and ready to sell.\n\r\nLet’s build something profitable together. ????",
  "skill_requirements": [
    "Product Optimization",
    "Product Research",
    "Product Listing"
  ]
}