{
  "job_id": "1421776",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Development-Representative-1421776",
  "scraped_at": "2025-07-15T03:47:57.976170",
  "title": "Sales Development Representative",
  "type_of_work": "Full Time",
  "salary": "40,000 - 80,000 PHP",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Role Overview\r\nWe’re hiring a driven and energetic Outbound Sales Development Representative (SDR) to generate qualified opportunities for our Account Executives. This is a 100% outbound role, focused heavily on cold calling and proactive outreach. You’ll play a key role in growing our top-of-funnel pipeline and driving go-to-market success.\n\r\nKey Responsibilities\r\n- Prospect new leads through research and targeting ideal customer profiles across industries.\r\n- Conduct high-volume cold outreach via calls, emails, and social platforms (e.g., LinkedIn) to generate interest and book qualified meetings.\r\n- Nurture prospects through multiple touch points to guide them toward becoming Sales Accepted Leads (SAL).\r\n- Work PST business hours to align with US-based prospects.\r\n- Collaborate with Account Executives to hand off qualified leads and provide context for successful follow-up.\r\n- Log and track all activities, outcomes, and contact data in CRM accurately and consistently.\r\n- Test and optimize messaging, call scripts, and email sequences to improve conversion rates.\r\n- Stay current on product, industry trends and competitive positioning to speak confidently with prospects.\n\r\nRequirements\r\n- 1–2 years+ of SDR or outbound sales experience in a B2B SaaS or tech environment.\r\n- Proven ability to conduct high-volume cold calls and generate pipeline through outbound efforts.\r\n- Excellent communication skills—confident on the phone and clear in writing.\r\n- Comfortable working US Pacific Time (PST) business hours.\r\n- Experience using CRM systems (HubSpot), sequencing tools, and prospecting platforms like LinkedIn Sales Navigator and Apollo.\r\n- Highly organized, self-motivated, and goal-driven.\r\n- Ability to work independently while thriving in a collaborative team environment.",
  "skill_requirements": [
    "HubSpot CRM",
    "Lead Generation",
    "Outbound Calls"
  ],
  "is_active": true,
  "status_history": []
}