{
  "job_id": "1421753",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-for-Viral-Youtube-channel-1421753",
  "scraped_at": "2025-07-14T23:08:45.112807",
  "title": "Video Editor for Viral Youtube channel",
  "type_of_work": "Full Time",
  "salary": "300",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for a talented YouTube video editor who can help bring gripping, suspenseful stories to life — just like the content on our channel: Shock Files.\n\r\nAbout the Channel:\r\nShock Files focuses on short, fast-paced, highly engaging videos centered around shocking real-life stories, mysteries, true crime, and dark internet lore. Our style is punchy, dramatic, and visually immersive. Think: high retention, YouTube-optimized editing with gripping pacing.\n\r\nWhat We’re Looking For:\r\n???? Someone who can edit videos in a style similar to Shock Files (check our latest uploads for reference).\r\n???? Strong storytelling instincts — knowing how to build suspense and keep viewers engaged.\r\n???? Comfortable working with voiceovers, stock footage, sound design, and text-based elements.\r\n? Fast turnaround time (3–5 days per video).\r\n????? You use Adobe Premiere, Final Cut, DaVinci Resolve — or any software that gets the job done at a high level.\n\r\nIdeal Candidate:\n\r\nProven experience editing content for YouTube (preferably in the mystery, horror, or true crime space).\n\r\nKnows how to work with pacing, audio, and visuals to maximize retention.\n\r\nCan source and integrate relevant b-roll and dramatic effects.\n\r\nDetail-oriented and reliable — meets deadlines and follows creative direction.\n\r\nWhat You’ll Get:\r\n? Consistent work (2–4 videos per month to start, with potential for more)\r\n? Competitive pay per video (negotiable based on experience)\r\n? Creative freedom within a proven format\r\n? Long-term collaboration potential\n\r\nTo Apply:\r\nPlease send:\n\r\nA short message about your experience\n\r\nLinks to your best relevant work (true crime / storytelling videos are a big plus)\n\r\nYour typical rate per video (5–10 minutes in length)\n\r\nLet’s create something captivating together.\r\nLooking forward to hearing from you!",
  "skill_requirements": [
    "Video Content Creation",
    "Thumbnail & Social Media Design",
    "Movie Editing"
  ]
}