{
  "job_id": "1421953",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Sales-Specialist-B2B-Corporate-Training-Google-Ads-CRM-1421953",
  "scraped_at": "2025-07-15T12:34:19.573686",
  "title": "Marketing & Sales Specialist – B2B Corporate Training (Google Ads & CRM)",
  "type_of_work": "Any",
  "salary": "AUD1,500",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us\r\nWe are Emergent Learning – a boutique, high-impact learning and development consultancy based in Australia. We deliver cutting-edge, face-to-face and live virtual professional development programs to corporate clients across a wide range of sectors, including finance, government, healthcare, and infrastructure. Our focus is on transforming workplace learning through practice-based, human-centred design.\n\r\nRole Overview\r\nWe’re looking for a proactive, tech-savvy Marketing & Sales Specialist to help drive the success of our public training programs. You’ll generate leads, manage ads, optimise conversions, and close B2B sales directly into our scheduled courses. This is a rare opportunity to take ownership of a portfolio and grow it from the ground up — not just supporting marketing, but actually driving enrolments and filling programs.\n\r\nKey Responsibilities\r\nPlan, create, and optimise Google Ads campaigns to generate course enrolments\r\nManage CRM (Dynamics 365 Sales Professional) and follow up leads and waitlists\r\nWrite and schedule compelling social media posts to promote upcoming programs\r\nMonitor course viability and report regularly on enrolment performance\r\nLiaise with internal team to update website and student management systems\r\nBook client appointments when needed for the Director to close high-value leads \nEmail and coordinate with prospective participants as required\r\nContinuously analyse what’s working, and suggest smart improvements\n\r\nMust-Have Qualifications\r\nMinimum 2 years’ experience in B2B marketing, sales, or lead generation\r\nDemonstrated success running and managing Google Ads campaigns\r\nHigh-level English communication (written and spoken)\r\nExperience working with CRM systems (Dynamics 365 a plus)\r\nTech-savvy and comfortable learning new platforms (e.g., LMS, analytics tools)\r\nSelf-motivated, organised, and able to work independently with integrity\r\nExperience in marketing or selling training/education services highly favoured\n\r\nNice-to-Have Qualifications\r\nPrior experience in the learning & development, education, or consulting sectors\r\nFamiliarity with Miro, MS Teams, or web content platforms\r\nCopywriting or SEO knowledge\r\nExposure to Australian or other English-speaking B2B markets\n\r\nWork Hours & Time Zone\r\nMust have daily overlap with Australian Eastern Standard Time (AEST)\r\nIdeally between 7am–3pm PH time, or a close equivalent\n\r\nWork Setup & Tools\r\nFully remote, work-from-home\r\nMust have own laptop/PC, reliable internet, and a quiet environment\r\nTools used: Microsoft Office 365, Dynamics 365, Google Ads, Google Analytics, CRM, LMS, Miro\n\r\nCompensation & Benefits\r\nUp to USD $15/hour depending on skills and experience\r\nPaid on-time via your preferred method\r\nLong-term, stable work with high ownership and growth opportunity\n\r\nHow to Apply\r\nSubmit your OnlineJobs.ph application with your resume/CV\r\nInclude a brief cover letter explaining why you're a great fit\r\nAnswer these short questions in your message:\r\nWhat’s the most effective Google Ads campaign you’ve run and why?\r\nDescribe how you would fill a B2B public course with minimal brand awareness.\r\nShortlisted applicants will be invited for a video interview and task simulation",
  "skill_requirements": [
    "Google Ads",
    "Sales",
    "Digital Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:36:09.190948",
      "reason": "Job first discovered"
    }
  ]
}