{
  "job_id": "1421858",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-1421858",
  "scraped_at": "2025-07-15T05:36:58.716313",
  "title": "Executive Assistant",
  "type_of_work": "Full Time",
  "salary": "Up to $2000 SGD / Month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "READ THIS FIRST\n\n\r\n[SHORT INTRO OF OUR COMPANY]\n\r\nWe are a Singapore based company.\n\r\nOur main core business involves coaching and training a new generation of financial advisors to reach out to more people, transform more lives and build the business of their dreams.\n\r\nWe have coached more than 3000 Financial Advisors and have more than 8 years under our belt in doing so.\n\r\nOur clients are mainly in Singapore, Malaysia and Hong Kong and we are on track to reaching out to more of them as we speak.\n\r\nRight now, We are looking for an Executive Assistant to be part of our company, and to be working directly with the Chief Executive Officer (CEO).\n\r\nAs the Executive Assistant of our company, you will be responsible for coordinating, planning events, communicating to the team and clients, and organising all the backend logistics and operations of the company.\n\r\nMore importantly, your main objective is to buy back time for the CEO.\n\r\nYour position will play an important and crucial role in the team’s success.\n\n\r\n[HOW LIFE IS GONNA LOOK LIKE FOR YOU]\n\r\nYou will be involved in the day to day communications and supporting the CEO directly, assisting in random tasks or any tasks that the CEO requires.\n\n\r\nThere is no limit to duties an executive assistant can handle, which is why if you are taking on this role, you must have a confident, problem-solving-can-do attitude.\n\r\nWe will not sugarcoat anything but here’s how it is like as well.\n\r\nYou WILL be in a high pressure environment that will force you to step up and grow as an individual.\n\r\nThere will be no bullshit beautiful lies, but rather ugly truth - although necessary - but ugly all the same that will poise you for growth.\n\r\nWhile it might be intense, the rewards are great.\n\r\nBonuses, employee benefits and perks that will ensure you get well remunerated for your efforts.\n\r\nThe “work hard, play hard and work even harder mantra” is here.\n\r\nBecause we are going to be poised for crazy growth and expansion, you will have to put on your thinking cap, initiative and out of your comfort zone to get things done.\n\n\r\nYou'll get to attend world-class business, marketing and personal development programs for FREE and rub elbows with renowned Asian entrepreneurs and Financial Advisors.\n\r\nYou’ll be working with an international team, and you’ll even get to hang out with them at least once a year at our annual retreat in an exotic location.\n\n\r\n=========\r\nIf you are remotely interested after reading the above, click here for next step: Upgrade to see actual info/executive-hire                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}