{
  "job_id": "1421794",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Outbound-Sales-Representative-1421794",
  "scraped_at": "2025-07-14T23:09:34.084883",
  "title": "Outbound Sales Representative",
  "type_of_work": "Any",
  "salary": "$5-10 Per Hour + Bonuses",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "What You’ll Do:\r\n- Conduct outbound outreach via email, phone, and LinkedIn to generate qualified leads\r\n- Schedule discovery calls and appointments with high-potential prospects\r\n- Research target companies and decision-makers to personalize outreach\r\n- Manage multi-channel outreach campaigns using tools like Apollo, Dripify, Lemlist, etc.\r\n- Keep lead activity organized in our CRM (e.g., HubSpot, Salesforce)\r\n- Collaborate with sales and marketing teams to optimize messaging and campaigns\r\n- Help build SDR systems, workflows, outreach templates, and playbooks\r\n- Stay current on sales automation trends and prospecting best practices\n\r\nWhat We’re Looking For:\r\n- Proven experience in a lead generation or SDR role\r\n- Excellent English communication skills (written and spoken), with a neutral accent\r\n- Proficiency with outreach and sales tools like Apollo, Dripify, Lemlist, Salesloft, Outreach, HubSpot, and LinkedIn Sales Navigator\r\n- Strong interpersonal skills and confidence communicating with professionals\r\n- Highly motivated, self-directed, and target-driven\r\n- Well-organized and able to manage multiple outreach sequences at once\r\n- Comfortable working in fast-paced, evolving environments\r\n- Willingness to work U.S. business hours when needed\n\r\nNice to Have:\r\n- Experience in SaaS or B2B tech sales\r\n- Background in booking meetings for U.S.-based teams\r\n- Familiarity with AI-driven sales outreach and automation tools\r\n- Interest in building a department and advancing into a leadership role\r\n- If you’re ready to help build the foundation of a high-performing sales team while developing your career, we’d love to hear from you.\n\r\nApply now and join a company where your work truly moves the needle.",
  "skill_requirements": [
    "Outbound Sales",
    "Lead Generation",
    "LinkedIn Marketing"
  ]
}