{
  "job_id": "1421667",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421667",
  "scraped_at": "2025-07-14T23:08:25.465969",
  "title": "Full-Time Graphic Designer (Remote | PH Timezone)",
  "type_of_work": "Full Time",
  "salary": "$700",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Monday – Friday | 8 AM – 5 PM PHT\r\n100% Remote | Filipino Applicants Only\n\r\nAbout the Role\r\nCalling all creative minds with an eye for detail!\r\nWe’re looking for a Full-Time Graphic Designer who thrives on variety, collaboration, and delivering high-quality, eye-catching designs. From digital ads and branding to illustrations and motion-ready assets — if you can do it with flair and purpose, we want you on our team.\r\nThis is not your typical design gig. You'll work with global brands, push your creativity, and be part of a supportive, talent-packed creative squad. No micromanaging. No pixel pushing just for the sake of it. Just real impact and real growth.\n\r\nWhat You’ll Do:\r\n• Work with major brands such as Netflix, Nike, Princeton University, and more.\r\n• Collaborate with a team of artists and project managers to craft meaningful, beautiful content.\r\n• Create a wide variety of digital design projects — from branding kits and social media ads to packaging, web assets, and more. (Don’t worry — we don’t expect you to know everything from the start.)\r\n• Take ownership of your work, contribute ideas, and improve with every design.\r\n• Learn from fellow creatives, share your skills, and grow faster than ever before.\n\r\nRequirements:\r\n• Solid portfolio showcasing clean, effective, and versatile design work\r\n• Proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign — bonus for After Effects)\r\n• Strong communication skills (written and spoken English)\r\n• Attention to detail and passion for visual storytelling\r\n• A capable laptop/desktop that can handle design software\r\n• Stable internet connection\r\n• 720p+ webcam and working headset or built-in mic\n\r\nPerks & Benefits:\r\n• Recognition: Compete for Designer of the Month, earn badges, and be celebrated for your excellence.\r\n• Supportive culture: Join a relaxed, collaborative team that lets you be yourself. Hop into fun activities or join our official e-sports crew!\r\n• Career growth: We’re growing fast, and so can you. Learn, challenge yourself, and step into more senior roles over time.\r\n• Remote freedom: Work from home, on a beach, or anywhere you feel most creative.\r\n• Leave benefits: Paid maternity/paternity leave so you can focus on your family.\r\n• Creative contests: Join monthly design battles and win extra rewards.\r\n• Stability: Low-turnover environment with long-term growth potential.\r\n• Paid time off: Earn vacation days every month — you've earned it.\r\n• Mental wellness: Talk to someone when you need it, free of charge. Mental health is a priority.\r\n• Training access: Upskill with exclusive resources and on-the-job learning.\r\n• Creative community: More than a job — it’s a creative family that pushes each other to be better.\n\r\nBonus If You:\r\n• Have experience working in an agency or fast-paced creative setting\r\n• Know how to follow briefs and also know when to bend the rules for a better idea\r\n• Can bring a little fun to the workspace — we appreciate Upgrade to see actual infos\n\r\nDoes that sound like you?\r\nSubmit your application, portfolio, and a short note telling us why you’re the perfect fit.\r\nLet's build beautiful things together — wherever you are in the Philippines.\n\r\nHow to Apply:\r\nWe don’t do generic. If you’ve read this far — prove it. \r\n1. Fill out the official application form here:\nUpgrade to see actual info\r\n2. On the first question — “Please type the magic phrase” — enter:\r\n idesignwithpurpose (or use the phrase given in your job post)\r\n3. Attach your portfolio or relevant work samples when prompted.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}