{
  "job_id": "1421870",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Short-Term-Rental-Virtual-Assistant-1421870",
  "scraped_at": "2025-07-15T05:25:05.422831",
  "title": "Short Term Rental Virtual Assistant",
  "type_of_work": "Full Time",
  "salary": "700 USD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a corporate housing/Airbnb Management company that has over 80 properties + across UK and looking to grow to 150 properties within the next 6 months.\n\r\nWe are currently looking for a Short-Term Rental Coordinator that can help grow our network of businesses booking with us.\n\r\nThe successful candidate will be responsible for performing various tasks related to the operation of rental properties, managing the guest experience, and ensuring the highest level of guest satisfaction. The ideal candidate should have experience in short-term rental management, strong organizational skills, and excellent communication skills.\r\nResponsibilities:\n\r\n* Assisting in programming codes on smart locks to allow guests access to rental properties\r\n* Assisting in scheduling maintenance and turnovers\r\n* Following up on turnovers, maintenance, and inspections to ensure they are completed on time and to a high standard\r\n* Tracking progress and addressing any issues that arise during the process\r\n* Familiarity with Uplisting and using it in previous roles\r\n* Dealing with difficult guests or clients and resolving issues in a timely and professional manner\r\n* Prioritizing tasks when there are multiple demands on your time\r\n* Troubleshooting technical issues related to smart locks or other technology used in STR properties\r\n* Handling Airbnb Resolution and review processes\r\n* Experience working as an Airbnb ambassador preferred\r\n* Staying organized and keeping track of multiple tasks and responsibilities\r\n* Assisting in ensuring a high level of guest satisfaction and repeat bookings for STR properties\r\n* Taking emergency calls and handling emergency situations.\r\n* Knowledge of KPIs and how to track them is an asset.\n\r\nRequirements:\r\n* Experience in short-term rental management\r\n* Strong organizational and communication skills - especially the ability to follow up with guests and the team on issues.\r\n* Familiarity with smart lock programming and technology used in STR properties\r\n* Ability to prioritize tasks and manage multiple responsibilities\r\n* Strong problem-solving skills\r\n* Ability to handle emergency situations in a professional manner\r\n* Experience working as an Airbnb ambassador preferred\r\n* Answering emergency calls and help guests resolve issues such as lockouts, flooding, etc.\n\r\nInterested applicants, please send the following to:\n\r\n1. Resume in PDF format\r\n2. Internet Speed test Result dated December 2024.\r\n3. No less than TWO Professional Work References with name, your relationship with them, their email address, and their mobile number.\r\n4. Photo of your home office with your computer and all backups clearly visible.\r\n5. 1 Minute Introductory Video\n\r\n* Incomplete responses shall not be entertained. Applications not sent to the email provided above will also be rejected*\n\r\nGood Luck and we look forward to hearing from you!\n\r\nThank you very much for your time.",
  "skill_requirements": [
    "English Speaking",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": []
}