{
  "job_id": "1421716",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Visual-Creator-FULL-TIME-URGENT-1421716",
  "scraped_at": "2025-07-14T22:28:50.231480",
  "title": "Remote Visual Creator (FULL-TIME URGENT)",
  "type_of_work": "Any",
  "salary": "up to 40,0000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Apply through submitting an application form : Upgrade to see actual info/Upgrade to see actual info/f/6kxUpgrade to see actual info/G97U1L3CFJFVTE6UHW\n\r\nWhy Join Us?\r\nGrowth Opportunities: Thrive in an environment full of growth prospects.\r\nVibrant Team Culture: Be part of a dynamic and supportive team.\r\nComprehensive Training: Benefit from training designed for go-getters ready to apply their energy and skills.\n\r\nAbout Us\r\nWe are a premier e-commerce growth agency that specializes in running Facebook and Instagram ads for e-commerce brands. As a Premium Agency Partner with Meta, we're at the cutting edge of digital advertising.\r\nPerks Include:\r\nPaid public holidays\r\nGenerous leave entitlements\r\nUnlimited bonus potential\r\nCareer growth pathway – we’re here to develop leaders, not just freelancers or side hustlers!\n\r\nRole Expectations\r\nWe're on the lookout for a Visual Creator who's ready to dive into the exciting world of social media ad marketing. If you're a pro at creating fun and engaging ad contents (Meta, Instagram,, TikTok), comfortable exchanging and collaborating ideas within a team, and love seeing businesses grow through your creation, then you might just be our perfect fit!\n\r\nYour roles and responsibilities are broken down into, but are not limited to:\r\nProduce performing and visually appealing digital marketing ads for our clients \r\nProduce successful iterations based on performance metrics and hypotheses. \r\nThink outside the box and conceptualize creative ad ideas during brainstorming and/or campaign planning.\r\nFacilitate meetings when pitching creative ideas to develop ads for our clients.\r\nLearn and understand media buying success metrics to adapt formulating creative ad ideas. \r\nLearn and adapt digital marketing strategic approaches in formulating creative ad ideas. \r\nReview creative needs/assets in preparation for conceptualizing and executing creative.\r\nMaintain standard internal management processes. \r\nProactively and openly communicate with key stakeholders.\r\nDedicating time and willingness for professional and personal-self development. \r\nParticipate and contribute to teaUpgrade to see actual infoetings and development meetings\r\nParticipate and contribute to department projects that align with the company’s mission and vision.\r\nLearn and adapt to the  company’s standard system and processes.\r\nLearn and adapt to new processes and sudden changes as Right Hook is a rapid growing company\r\nAssist to achieve great team culture through preserving Right Hook’s core values. \r\nDedication in developing mutual goals and success that aligns the company’s mission and vision. \r\nParticipate in departmental and overall Right Hook meetings, trainings/workshops, and project initiatives, including 1:1 coaching calls with the Team Lead.\r\nGROWTH OR DEATH - WE ARE WHAT WE TOLERATE\"\n\r\nJob Requirements\r\nShift Hours: flexible to work in sync either AUS or USA timezone. \r\nAUS : 9am - 6pm PHT \r\nUSA : 7pm - 4am PHT \r\nHigh Proficiency in using Adobe Creative Cloud Applications. \r\nAdvanced English proficiency (both written and spoken).\r\nFast and reliable PC/MAC that supports Adobe Creative Cloud Applications. \r\nFast and internet connection with available backup\r\nPossess critical thinking skills + be able to work autonomously.\r\nBe able to accept feedback and continuously work on improving your skills.\r\nBe hungry for personal growth. Never satisfied with status-quo.\r\nBe a great team player, an awesome communicator, and enjoy a good challenge.\r\nHighly organized and able to manage several projects and clients every day + show resourcefulness.\r\nGreat Attention to Detail\r\nEffective and strong communication skills- written and oral (persuasive, influential, relationship-building)\r\nKnows workaround with ClickUp (or similar platform), G-Suite, Facebook Business Manager, Shopify\r\nSolid experience in Project Management and Client Facing Communications Roles.\r\nBasic to Intermediate understanding of e-Commerce Advertising, media buying, and multi/cross-channel marketing (Paid Social (Meta), Google, e-Mail)\r\nBackground in Scrum-Sprint is a plus but not required.\r\nPrevious experience working with a remote team and marketing agency\r\nNote: This is a full-time, 40-hour-per-week job. We require that you have a camera on your computer because you are required to be on video calls with our team.",
  "skill_requirements": [
    "Google Ads",
    "Graphic Design",
    "Video Editing"
  ],
  "is_active": true,
  "status_history": []
}