{
  "job_id": "1421188",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421188",
  "scraped_at": "2025-07-14T23:09:12.413959",
  "title": "Human Resource Assistant - Payroll Officer",
  "type_of_work": "Full Time",
  "salary": "AUD 300/month",
  "hours_per_week": "38",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Vivi Salon:\nOur Mission\n\nAt our one-stop shop for hair and beauty salons in Perth, we are dedicated to providing exceptional services with a strong emphasis on attention to detail and outstanding customer service. \n\nOur mission is to create a welcoming and inclusive environment where our clients can experience the highest level of care and expertise without compromising affordability. \n\nWe strive to cater to diverse beauty needs, offering a wide range of services and treatments to ensure everyone can feel their best inside and out.\n\nWith humility and gratitude, we are committed to making each visit a delightful and memorable experience, leaving our customers feeling confident, pampered, and valued.\n\nAbout the Job\nThe key focus of this position is to perform the day-to-day activities and tasks for processing and maintaining payroll in a timely and accurate manner, promoting efficiency and compliance. \n\nThe role will primarily focus on payroll activities and extend to assisting with other finance-related tasks if required. \n\nIn the long run, payroll specialists will be within the company’s finance team, where you will be looking after all of the company’s revenue and expenses. \n\nKey Responsibilities\nGeneral Payroll Knowledge\n\nUnderstand the basics of payroll processing, including calculating wages, deductions, and taxes.\n\nBe familiar with payroll laws and regulations, such as the Fair Work Act & Australian Taxes.\n\nUnderstand the different types of payroll systems, including manual, semi-automated, and fully automated systems.\n\nBe able to use payroll software (Google chat & Payroller) to process payroll, including entering timecards, calculating deductions, and generating payslips.\n\nSpecific Payroll Tasks\n\nCollect and verify employee timesheets.\n\nCalculate wages and salaries.\n\nApply deductions for taxes and superannuation.\n\nGenerate payslips and save them to employees'/contractors' G-folder.\n\nPrepare payroll reports for management.\n\nReceive approval from upper management for payments when needed\n\nResponsible for processing payroll accurately and on time (Due every Tuesday 12 PM AWST).\n\nSupport the HR team by managing HR documentation, maintaining employee records, and handling administrative tasks.\n\nReconcile payroll accounts\n\n5 remote team members\n\n5 onsite team atm\n\nReconcile payroll accounts\n\nAdditional Skills and Knowledge\n\nProficient in Google Workspace & Click Up, including Docs and Sheets.\n\nStrong attention to detail and accuracy.\n\nAbility to work independently and meet deadlines.\n\nExcellent communication and interpersonal skills.\n\nAbility to resolve payroll issues promptly and professionally.\n\nManage leaves/holidays.\n\nSkills & Qualifications\nProven experience as a payroll specialist or payroll manager \n\nSolid understanding of accounting fundamentals and payroll best practices \n\nVery good knowledge of legislation and regulations from Fairwork \n\nProficient in Google Workspace and good knowledge of relevant software (e.g. Payroller) and databases \n\nTrustworthy with attention to confidentiality \n\nOutstanding organisational ability with great attention to detail \n\nExcellent communication skills \n\nA BSc/BA in business, accounting or a relevant field is a plus\n\nWork Environment:\nThis fully remote position has flexible hours to accommodate the executive’s schedule. \n\nSome availability outside standard business hours may be required for urgent tasks or international time zone coordination.\n\nHow to Apply\n\nTo apply, please click the link below to access the application form. \n\nComplete all required fields and submit your CV and portfolio as instructed.\n\nJob Application Form\n\nImportant: Please ensure that you apply through this link, or otherwise your application will not be considered.",
  "skill_requirements": [
    "Payroll",
    "Timekeeping",
    "Applicant Tracking Systems"
  ]
}