{
  "job_id": "1421901",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Lead-GenerationCold-Email-Marketing-Specialist-1421901",
  "scraped_at": "2025-07-15T06:39:42.290252",
  "title": "Lead Generation/Cold Email Marketing Specialist",
  "type_of_work": "Full Time",
  "salary": "72,491.52 PHP - $1280 USD / Month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Title: Lead Generation/Cold Email Marketing Specialist\r\nCompany: WireBuzz\r\nIndustry: Marketing | Growth Strategy | Video Production | Lead Generation\r\nLocation: Remote\r\nHours: Full-time (40+ hrs/week)  (must have 4–6 hours overlap with 8 AM – 5 PM EST)\n\r\nAbout WireBuzz:\r\nWireBuzz is a performance-driven marketing and video production agency that specializes in helping growth-focused companies generate qualified leads through strategic campaigns. We blend high-impact messaging with creative execution and data-backed strategies to drive measurable business outcomes.\n\r\nAbout the Role:\r\nWe’re looking for an experienced Lead Generation/Cold Email Specialist to join our team and take charge of outbound email campaigns that fuel our clients pipeline with qualified leads. This role is ideal for someone who is highly skilled in cold emailing, data scraping, and managing multiple campaigns across a variety of projects and industries. You’ll report directly to Sebastian Bayles, Solutions Specialist, and collaborate closely with our internal marketing and creative teams on a daily basis.\n\r\nKey Responsibilities:\r\n- Create, manage, and optimize cold email campaigns to generate qualified leads\n\r\n- Research and scrape targeted prospect data using lead generation platforms\n\r\n- Write compelling cold email sequences that convert\n\r\n- Test and track campaign performance, making data-driven decisions\n\r\n- Collaborate with internal teaUpgrade to see actual infombers to align outreach with marketing goals\n\r\n- Manage multiple lead gen projects and ensure timely execution\n\r\n- Maintain and update lead lists and CRM records accurately\n\r\nRequired Experience & Skills:\r\n- 3+ years of experience in lead generation and cold email outreach\n\r\n- Industry-specific experience in marketing or growth agencies\n\r\n- Proficiency in cold emailing tools and lead gen platforms (e.g., Apollo, Instantly, Lemlist, etc.)\n\r\n- Strong copywriting skills tailored for email marketing\n\r\n- Ability to scrape and organize prospect data\n\r\n- Familiarity with general CRM and lead gen software (HubSpot, Salesforce, etc.)\n\r\n- Excellent organizational skills and attention to detail\n\r\nSoft Skills That Make You a Great Fit:\r\n- Strong communicator and team collaborator\n\r\n- Self-motivated and proactive\n\r\n- Problem solver with a “figure-it-out” attitude\n\r\n- Adaptable and able to pivot when strategies evolve\n\r\nWork Environment & Schedule:\r\n- Remote position with flexible hours\n\r\n- Must maintain 4–6 hours of overlap with 8 AM – 5 PM EST\n\r\n- No weekend or evening availability required\n\r\nWhat You’ll Get:\r\n- The opportunity to make a big impact at a fast-moving agency\n\r\n- A creative and collaborative remote team environment\n\r\n- Flexibility to manage your own hours within business-day overlap\n\r\n- Long-term growth opportunities based on performance\n\r\nTo Be Considered\n\r\nSubmission Requirements:\r\n- Detailed resume\r\n- 1-minute video introduction\r\n- Portfolio or additional materials relevant to your experience\n\r\nApplication Submission Form\r\nPlease fill out this form below completely in order to be considered for this position.\n\nUpgrade to see actual info",
  "skill_requirements": [
    "Email Marketing",
    "Lead Generation",
    "Apollo"
  ],
  "is_active": true,
  "status_history": []
}