{
  "job_id": "1421643",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421643",
  "scraped_at": "2025-07-14T23:10:06.417468",
  "title": "Video Editor (100% Remote | PH Timezone)",
  "type_of_work": "Full Time",
  "salary": "$700",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Monday – Friday | 8 AM – 5 PM PHT\r\nFilipino Applicants Only\n\r\nAbout the Role\r\nAre you a story-driven, detail-obsessed Video Editor who loves turning raw footage into scroll-stopping, high-impact content? Do you live for transitions that feel just right, and edits that give goosebumps?\r\nWe’re looking for a talented Video Editor to join our growing remote creative team. If you thrive in a fast-moving, feedback-rich environment where your creative voice matters — we want to hear from you.\n\r\nWhat You’ll Do:\r\n• Craft polished, engaging videos that tell meaningful stories\r\n•Work alongside project managers and creative leads to deliver exciting client work\r\n• Implement feedback efficiently while maintaining creative integrity\r\n• Edit across a wide range of formats: social media, branded content, ads, explainers, and more\r\n• Communicate clearly and reliably with your team\n\r\nRequirements:\r\n• Strong experience in video editing tools such as Adobe Premiere Pro, Final Cut Pro, or equivalent\r\n• Excellent English communication (both written and spoken)\r\n• A good eye for pacing, storytelling, and visual rhythm\r\n• A solid portfolio showcasing a range of video editing work\r\n• A reliable setup: capable computer, stable internet, 720p+ webcam, and clear audio headset or mic\n\r\nPerks & Benefits:\r\n• Work with global brands across industries — from tech and fashion to non-profits and entertainment\r\n• Creative freedom: You're not just pushing buttons — you're telling stories\r\n• Remote culture: Work from anywhere in the Philippines\r\n• Stability: Long-term role with a low-turnover, supportive team\r\n• Recognition: Compete for Editor of the Month, earn internal badges, and get noticed\r\n• Career growth: Access to training, mentorship, and a team that supports your development\r\n• Monthly PTO (Paid Time Off): Take time to reset and recharge\r\n• Earn points for attending events — convert them into rewards and recognition\r\n• Maternity/Paternity Leave: Paid leave available for qualified employees (1+ year + performance-based eligibility)\r\n• Wellness support: Talk to someone when needed — mental health care is covered\r\n• Fun & community: Join design contests, team games, even e-sports events\r\n• Paid holidays & leave accumulation — rest is encouraged, not frowned upon!\n\r\nHow to Apply:\r\nWe don’t do generic. If you’ve read this far — prove it. ????\r\n1. Fill out the official application form here:\nUpgrade to see actual info\r\n2. On the first question — “Please type the magic phrase” — enter:\r\n ilovevideoediting (or use the phrase given in your job post)\r\n3. Attach your portfolio or relevant work samples when prompted.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}