{
  "job_id": "1421738",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-EditorVFX-Expert-Full-Time-1421738",
  "scraped_at": "2025-07-14T23:09:25.376829",
  "title": "Video Editor/VFX Expert (Full-Time)",
  "type_of_work": "Full Time",
  "salary": "400-550 USD/month (25,000-32,000 Php/month)",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Swerrrv Life is a cutting-edge video production company dedicated to crafting high-quality, cinematic content for creators, businesses, and brands. From sports and reality TV to music videos and social media content, we bring stories to life with visual flair and technical precision. We’re seeking a passionate and skilled Video Editor/VFX Expert to join our team and transform raw footage into visually stunning, impactful productions.\n\r\nJob Description:\r\nWe are looking for a creative and technically proficient Video Editor/VFX Expert with advanced skills in video editing, color grading (specifically S-Log3 footage), and visual effects (VFX). The ideal candidate has a sharp eye for storytelling, mastery of Adobe Creative Suite (Premiere Pro and After Effects), and expertise in DaVinci Resolve for color grading. You will work full-time, collaborating closely with our production team to deliver polished, cinematic videos that captivate audiences across platforms like sports, reality TV, music videos, and digital content.\n\r\nKey Responsibilities:\r\n•  Edit raw video footage into compelling, cinematic content that aligns with project goals and client expectations.\r\n•  Perform advanced color grading and correction on S-Log3 footage to achieve vibrant, professional, and cohesive looks.\r\n•  Create and integrate high-quality visual effects (VFX) using Adobe After Effects to enhance storytelling and production value.\r\n•  Utilize Adobe Premiere Pro, Adobe After Effects, and DaVinci Resolve (or Adobe-based color grading tools) to deliver polished video projects.\r\n•  Collaborate with directors, cinematographers, and the production team to ensure the creative vision is fully realized.\r\n•  Incorporate motion graphics, sound design, and music to elevate the overall production quality.\r\n•  Manage and organize project files for efficient workflows and timely delivery.\r\n•  Stay current with industry trends, VFX techniques, and color grading standards to maintain a competitive edge.\r\n•  Provide creative input during pre-production and post-production to enhance narrative impact.\n\r\nRequired Qualifications:\r\n•  Experience: Minimum of 3-5 years of professional video editing experience, with a strong portfolio showcasing cinematic editing, color grading, and VFX work.\r\n•  Technical Skills:\r\n •  Advanced proficiency in Adobe Premiere Pro and Adobe After Effects (required for editing and VFX).\r\n •  Expertise in color grading S-Log3 footage, preferably using DaVinci Resolve or Adobe-based tools.\r\n •  Strong understanding of VFX workflows, including compositing, motion tracking, and animation in After Effects.\r\n •  Familiarity with audio editing, motion graphics, and sound design.\r\n•  Portfolio: A demo reel or portfolio demonstrating expertise in cinematic editing, S-Log3 color grading, and VFX (e.g., compositing, motion graphics, or effects).\r\n•  Availability: Full-time availability (40 hours/week) with flexibility to meet tight project deadlines.\r\n•  Strong storytelling skills, with an eye for pacing, visual aesthetics, and narrative flow.\r\n•  Excellent communication and collaboration skills to thrive in a team-oriented environment.\r\n•  Ability to manage multiple projects and prioritize tasks in a fast-paced setting.\n\r\nPreferred Qualifications:\r\n•  Experience with S-Log3 footage from Sony cameras (e.g., Sony Alpha, FX series).\r\n•  Proficiency in additional Adobe Creative Suite tools (e.g., Photoshop, Audition) for enhanced VFX and post-production workflows.\r\n•  Knowledge of advanced VFX techniques, such as 3D tracking, particle effects, or green screen keying.\r\n•  Experience creating content for film, advertising, social media, music videos, or branded content.\r\n•  Familiarity with other editing or grading platforms (e.g., Final Cut Pro, Color, or Baselight).\r\nWhat We Offer:\r\n•  Competitive salary based on experience, with opportunities for growth and raises.\r\n•  A collaborative, creative work environment with a passionate and innovative team.\r\n•  The chance to work on diverse, high-profile projects across sports, reality TV, music videos, and digital platforms.\r\n•  Access to cutting-edge tools and resources to bring your creative vision to life.\n\r\nHow to Apply:\r\nPlease submit your resume, a cover letter, and a demo reel/portfolio showcasing your video editing, color grading, and VFX work. We’re excited to see how your skills can elevate Swerrrv Life’s cinematic vision!",
  "skill_requirements": [
    "After Effects",
    "Video Editing",
    "Storytelling"
  ]
}