{
  "job_id": "1421167",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Office-Admin-Wanted-Reporting-Social-MediaBlog-Posting-Photo-and-Video-Editing-Business-Research-1421167",
  "scraped_at": "2025-07-14T23:09:57.674824",
  "title": "Office Admin Wanted - Reporting, Social Media/Blog Posting, Photo and Video Editing, Business Research",
  "type_of_work": "Full Time",
  "salary": "USD 500 / 600 per month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "The Employer ( Company Info ) \r\nWe are OCKHOME – a luxury furniture brand, offering bespoke furniture, interior design, and fit-out services in UAE. The company operate internationally from 2009, in UAE from 2024. \r\nOCKHOME is now in a process of developing and delivering some of the most prestigious interior design projects in UAE (new residential building development - 63 apartments - interior design furniture manufacture and delivery). \n\r\nThis is a full-time position requiring remote efficiency.\n\r\nKey Responsibilities\r\nYou will serve as a multifunctional executive support across administrative, creative, and coordination tasks:\r\n• Answer and manage client phone calls and WhatsApp/text messages with professionalism and urgency\r\n• Maintain accounting logs, including accurate records of invoices, expenses, and income\r\n• Draft and format commercial offers, quotations, and client communications\r\n• Create basic social media content (reels, images, short videos) \r\n• Use tools such as Canva, Photoshop, and video editing platforms to create visual content\r\n• Prepare PowerPoint or Google Slides presentations for internal and external meetings\r\n• Schedule and coordinate appointments with clients, suppliers, contractors, and third parties\r\n• Assist with operational follow-up and basic project tracking\n\r\nCandidate Requirements\r\n• Experience: Minimum 5 years in an administrative, executive assistant, or office coordinator role\r\n• Mandatory experience in design, architecture\r\n• Capable of creating social media contents, including photo editing, video editing\r\n• Language: Fluent in English (spoken and written); other languages are a plus\r\n• Personality: Discreet, highly dependable, detail-oriented, and proactive\r\n• Cultural Sensitivity: Able to work with multicultural teams and clients in the UAE environment\n\r\nTechnical Skills & Tools\r\n• Microsoft Office Suite: Word, Excel, PowerPoint\r\n• Creative Tools: Canva or Adobe Photoshop\r\n• Video Editing: Final Cut Pro, DaVinci Resolve, or equivalent\r\n• Communication Tools: Zoom, WhatsApp Business, Gmail, Google Calendar\n\r\nTo Apply for the job:\r\nTransmittal of presentation letter and CV to: Upgrade to see actual info\n\r\n1. Change the subject like to \"I Want to Work for You - Admin and Social Media VA\"\r\n2. At the top of your message write 2-3 few sentences on why you would like this position, and\r\nwhy you are a good fit. Do not write more then that or else you application will be deleted.\n\r\n3. Under that put the following, and include the numbers to make it easy for me to read.\r\n1. An article you wrote.\r\n2. Your Instagram Profile \r\n3. Come up with a new post (reels) using photos from our instagram \"Upgrade to see actual info==\"                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}