{
  "job_id": "1421940",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Operations-Assistant-1421940",
  "scraped_at": "2025-07-15T06:36:18.782396",
  "title": "Executive Operations Assistant",
  "type_of_work": "Full Time",
  "salary": "$4 - $7 per hour",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Position Summary\r\nWe’re seeking an experienced and highly dependable Executive Virtual Assistant to provide direct support to our CEO. You’ll play a vital role in streamlining daily operations, managing schedules, and handling key communications—freeing up the CEO to focus on top-priority initiatives. This position calls for strong organizational skills, a high level of discretion, and the ability to manage executive-level responsibilities with professionalism.\r\nCore Responsibilities\r\n– Manage the CEO’s calendar and inbox to ensure smooth scheduling and prompt communication\r\n – Draft and follow up on emails with clients, partners, and vendors\r\n – Prepare and organize invoices along with basic financial documentation\r\n – Maintain up-to-date project tracking in Google Sheets or similar tools\r\n – Monitor tasks and progress using Asana or related platforms\r\n – Keep contact lists current and organized\r\n – Identify and escalate time-sensitive tasks to ensure deadlines are met\r\n – Coordinate travel plans and logistics as needed\r\n – Send reminders and follow-ups to maintain workflow Upgrade to see actual infontum\r\n – Handle sensitive communications and records with complete confidentiality\r\nWhat We’re Looking For\r\n– Excellent written and spoken English communication skills\r\n – Experience managing executive calendars, emails, and reports\r\n – Proven background as an Executive Assistant or Personal Assistant\r\n – Strong attention to detail and organizational skills\r\n – Ability to work independently, take initiative, and stay reliable\r\n – Comfort and professionalism in handling confidential information\r\nNice to Have\r\n– Familiarity with Google Workspace, Asana, and other productivity tools\r\n – Confidence in communicating with high-level executives\r\n – Enthusiasm for mission-focused, growth-oriented work\r\nWhy You’ll Love This Role\r\n– Join a supportive, purpose-driven team where your work matters\r\n – Work closely with the CEO and contribute directly to key objectives\r\n – Enjoy flexible, remote work with autonomy and trust\r\n – See tangible results from your contributions every day\r\nReady to take on a trusted, high-impact role? Apply now and let’s build something great together.",
  "skill_requirements": [
    "Performance Tracking",
    "Email Management",
    "Personal Assistant"
  ],
  "is_active": true,
  "status_history": []
}