{
  "job_id": "1421897",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421897",
  "scraped_at": "2025-07-14T23:10:03.501770",
  "title": "Customer Support *Superstar Only*",
  "type_of_work": "Full Time",
  "salary": "PHP 38,000 - PHP 48,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We need to hire more people for this role because our business is expanding, and we have promoted more teaUpgrade to see actual infombers. We need great, high-quality talent to support our growth.\n\r\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\r\nDo you love putting a smile on people's faces or hearing \"you just made my day\"?\n\r\nLove connecting with our customers and fans of a holistic beauty creator with 2M+ followers?\n\r\nDo you want to be part of a fast-growing company and collaborate with the brightest, most talented minds?\n\r\nThen this might be your dream job.\n\r\nBefore you read on, this is NOT a typical customer support job where you just copy+paste standard responses or choose a canned response from the help desk software...if that's what you are looking for then you should stop reading right now, because this job is NOT for you.\n\r\nWe are looking for a Customer Service Specialist to help create an amazing customer experience that turns customers into raving fans.\n\r\nFrom the Upgrade to see actual infont a person clicks \"Follow\" or joins our community, the customer needs to feel like she has a special friend who is there to help and support her along the way....and that's exactly your job as a Customer Service Specialist.\n\r\nAs our Customer Service Specialist, you’re the essence of an extraordinary customer service. You love people and love to enrich their lives through dialogue about our products as well. Having a detailed knowledge, you’re not just serving information, but are also making recommendations and play an advisory role.\n\r\nYou are the heart of our reputation, and ensure feedback flows to all teams in order to improve and innovate our services. And you spark customers with new ways to make their experience continuously better.\n\r\nWe are aiming to be the gold standard for customer support in the beauty industry. Customer support is extremely important to us, and we only hire the warmest and the most positive, genuine and dedicated people to represent our company.\n\r\nABOUT US\n\r\nWe're a fast-growing holistic beauty company that is looking for the brightest, most talented minds to work from home. More details will be shared during the interview, but you’ll have the opportunity to work with one of the fastest-growing holistic beauty creators, boasting over 2,000,000 followers.\n\r\nQUALIFICATIONS\n\r\n- Distinguished by outstanding achievements, such as earning Latin Honors (Summa Cum Laude, Magna Cum Laude, Cum Laude), receiving various excellence awards (ie. \"Customer Support Agent of the Year\" or other awards), demonstrating rapid career advancement in previous positions (like progression to team leader or other roles).\r\n- Minimum of 2 years of experience in customer service. Most of the support will be conducted via email and chat. However, proficiency in phone support is a plus.\r\n- Excellent communication skills, both oral and written. As an email support representative, you will likely interact with US clients whose first language is English. Your level of English needs to be on the level that an English native speaker thinks they are talking to another native speaker. Adherence to a specific writing style (a mix between friendly/semi-casual and formal; depending on the occasion), flawless grammar, and punctuation standards is highly required.\r\n- Enabling an empathy-driven approach by providing exceptional customer service and fostering positive relationships with customers through email communication.\r\n- Fast and accurate typing skills to respond to emails promptly, great attention to detail and reliability are essential qualities for success in this role.\r\n- Highly organized with the ability to efficiently manage multiple tasks and meet deadlines.\r\n- Adeptness at working in a fast-paced environment where others rely on you to deliver is essential. It is expected that you have an innovative mind and are a self-starter.\n\r\nJOB RESPONSIBILITIES INCLUDE\r\n- Customer Care: Provide excellent customer service through various channels, including email, chat, social media and phone.\r\n- Address customer inquiries, concerns, and requests with empathy and professionalism.\r\n- Product Knowledge: Develop an in-depth understanding of our holistic beauty programs, their benefits, and the exercises in it.\r\n- Problem Resolution: Troubleshoot and resolve customer complaints and issues promptly and effectively, ensuring customer satisfaction.\r\n- Educational Support: Provide product recommendations, usage guidance, and holistic beauty advice to customers.\r\n- Feedback Collection: Collect and document customer feedback and suggestions to help improve products and services.\r\n- Organizational Skills: Maintain organized records of customer interactions and orders, ensuring accurate and up-to-date customer profiles.\r\n- Cross-functional Collaboration: Collaborate with other departments, such as marketing and product development, to relay customer insights and feedback.\r\n- Process Enhancement: Document the process and create/adapt SOPs to improve the system\n\r\nREQUIREMENTS FOR EFFECTIVE REMOTE WORK\n\r\n- Reliable Computer/Laptop\r\n- High-Speed Internet Connection (+backup)\r\n- Conducive Work Environment\n\r\nWORKING SCHEDULE\r\n- Full-time Employment Opportunity\n\r\nBENEFITS\r\n- Competitive Salary\r\n- Training and Development Opportunities\r\n- Opportunity to contribute to a rapidly expanding company dedicated to promoting holistic beauty\r\n- Great potential for career advancement into various leadership positions\n\r\nAPPLICATION INSTRUCTIONS\r\nSince this is a long-term position, there will be an in-depth qualification process. If you believe you have what it takes, here's what to do next:\n\r\nPlease click the link below, review the questions carefully, and share the required information.\n Upgrade to see actual info\n\r\nIf you believe you meet our qualifications and requirements, we encourage you to apply now and become a valuable part of our rapidly expanding company.",
  "skill_requirements": [
    "Customer Support",
    "Attention to Detail",
    "English Proficiency"
  ]
}