{
  "job_id": "1421664",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421664",
  "scraped_at": "2025-07-14T23:10:04.230088",
  "title": "Credit Manager – Mortgage Lending (Remote, PH/NZ)",
  "type_of_work": "Full Time",
  "salary": "NZD10,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Location: Philippines (remote) | Auckland or Remote (NZ-based) \r\nEmployment Type: Full-Time \r\nReports To: Director / Principal Adviser\n\r\nAbout The Good Broker \n\r\nWe’re a modern mortgage brokerage built for ambitious brokers and excellent customer outcomes. We back our brokers with marketing, technology, systems—and now, we’re hiring a Credit Manager to lift the standard of deal quality, turnaround times, and broker confidence.\n\r\nRole Summary \n\r\nThe Credit Manager is the go-to expert for loan structuring, credit policy, and lender strategy. You’ll work closely with our team of brokers and support staff to pre-vet deals, identify risks, provide lender matching guidance, and improve our overall approval rate. This is a high-impact, leadership role ideal for someone who loves deal strategy, problem solving, achieving positive customer outcomes and cutting through the red tape.\n\r\nOnly applications with the completely filled out application form will be accommodate. Please fill form here - Upgrade to see actual info\n\r\nKey Responsibilities \r\n? Pre-assess complex applications and provide structuring advice to brokers \r\n? Interpret and stay current on all major NZ lender policies (banks & non-banks) \r\n? Identify risks or potential declines early and offer alternatives \r\n? Coach brokers on credit standards, documentation, and submission quality \r\n? Act as internal “credit escalation point” for tough or borderline deals \r\n? Liaise with BDMs and lender contacts to get exceptions or special consideration \r\n? Help build and maintain our internal credit policy knowledge base \r\n? Track reasons for declined applications and implement feedback loops to prevent them\n\r\nYou’ll Be Great If You Have \r\n? 5+ years experience in mortgage lending, credit assessment, or broking\r\n? Deep working knowledge of NZ lender credit policies \r\n? Proven ability to structure complex loans and troubleshoot tricky deals \r\n? A calm, strategic mindset and strong problem-solving skills \r\n? Experience coaching or mentoring brokers or loan writers \r\n? Excellent communication and documentation skills\n\r\nBonus Points For \r\n? Experience in a similar Head of Credit / Credit Manager role at a brokerage or aggregator \r\n? Adviser or FAP licensing (or working towards it) \r\n? Familiarity with CRM tools like Trail, Mercury, or GoHighLevel\n\r\nWhy Join Us? \r\n? Work with a fast-moving, values-driven team \r\n? Technology-driven company\r\n? Help shape the systems that make brokers' lives better \r\n? Be a key player in our growth, not just a cog in a machine\n\r\nOnly applications with the completely filled out application form will be accommodate. Please fill form here - Upgrade to see actual info",
  "skill_requirements": [
    "Coaching",
    "Mortgage",
    "Regulatory Compliance"
  ]
}