{
  "job_id": "1421911",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Funnel-Page-Designer-Ecom-Dropshipping-Brands-1421911",
  "scraped_at": "2025-07-15T06:42:59.952222",
  "title": "Funnel Page Designer (Ecom Dropshipping Brands)",
  "type_of_work": "Part Time",
  "salary": "$10/hrs",
  "hours_per_week": "18",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for a highly creative and reliable Funnel Page Designer to join our ecommerce team. This is a part-time position (15 to 20 hours per week) with the potential to grow into a full-time role.\n\r\nEach week, we launch a new brand. As part of this, we create 6 to 8 story-based, emotional funnel pages that drive conversions. Your job will be to bring these stories to life using Shopify page builder tools like PageFly, Replo, or GemPages.\n\r\nAbout the role:\n\r\n- Pay: $10/hrs\r\n- Hours: Approximately 15 to 20 hours per week\r\n- Schedule: Flexible, but we work with strict deadlines\r\n- Tools: PageFly, Replo, or GemPages (you must be comfortable with at least one)\r\n- Focus: Story-driven funnel pages for a different ecommerce brand each week\r\n- AI Integration: You will use new AI tools to speed up and improve designs. We will provide training.\n\r\nRequirements\n\r\n- At least 1 year of experience designing funnel pages\r\n- Strong portfolio with (emotional, story-like) landing pages\r\n- Eye for detail\r\n- Being creative\r\n- Open to learning and working with AI tools\n\r\nHow to Apply\r\nIf you're interested, please apply with \"LandingPages123\" in the subject line and answer the following questions:\n\r\n1. What is your experience with creating landing pages for ecommerce stores or dropshippers?\r\n2. What is your preferred Shopify landing page builder app and why?\r\n3. Can you send us 5 or more examples of (emotional) landing pages you designed by yourself? Preferably for ecommerce clients.\r\n4. How long does it usually take you to complete one landing page?\r\n5. Can you work Monday through Saturday?\n\r\nWe look forward to reviewing your application.",
  "skill_requirements": [
    "Copywriting",
    "Landing Page Design",
    "Funnel Design"
  ],
  "is_active": true,
  "status_history": []
}