{
  "job_id": "1421960",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-and-Ads-Manager-1421960",
  "scraped_at": "2025-07-15T02:31:38.095454",
  "title": "Social Media and Ads Manager",
  "type_of_work": "Gig",
  "salary": "300",
  "hours_per_week": "5",
  "date_updated": "Jul 14, 2025",
  "job_overview": "ABOUT US\r\nThe Legal Joint, LLC is a growing law firm focused on providing affordable and accessible legal services in Ohio, USA. We specialize in family law, estate planning, bankruptcy, and unbundled legal services. Our mission is to make quality legal help available to those who need it most — with flat fees, payment plans, and an approachable style.\n\r\nWe're looking for a smart, detail-oriented, and creative teaUpgrade to see actual infomber to help us manage and grow our social media and ad presence across Instagram, Facebook, and more.\n\r\nWHAT YOU’LL DO\n\r\nManage and schedule weekly posts on Instagram, TikTok, and Facebook\n\r\nRepurpose blog content into engaging social media posts\n\r\nCreate scroll stopping graphics (using Canva or similar)\n\r\nWrite captions and select relevant hashtags\n\r\nMonitor engagement and respond to comments/messages\n\r\nRun paid ads on Meta (boosted posts and ad campaigns)\n\r\nHelp strategize promotions (like holiday campaigns or lead magnets)\n\r\nTrack performance and suggest improvements\n\r\nOrganize content in folders/spreadsheets\n\r\nWHO YOU ARE\n\r\nExperienced with Instagram, tiktok, and Facebook content creation\n\r\nKnows how to run Facebook/Instagram ads with a track record of successful campaigns\n\r\nHas excellent English writing and communication skills\n\r\nCreative, detail-oriented, and dependable\n\r\nComfortable working independently but checking in regularly\n\r\nFamiliar with Canva, Meta Ads Manager, Google Drive, etc.\n\r\nBonus: Experience working with law firms, professional services, or coaching/consulting brands\n\r\nWORK HOURS & PAY\n\r\nStart with 5-10 hours per week, with opportunity to grow\n\r\nFlexible working hours (as long as deadlines are met)\n\r\nPay is negotiable based on experience\n\n\n\r\nHOW TO APPLY\r\nPlease send the following:\n\r\nA short intro video (2 minutes or less) introducing yourself\n\r\nA photo of your workspace\n\r\nTell us your favorite food or sport (just for fun!)\n\r\nYour resume or portfolio\n\r\nA few examples of social media content or ads you’ve worked on\n\r\nYour expected hourly rate in USD\n\r\nWe are excited to welcome someone who wants to grow with us, learn our voice, and become a key part of our team at The Legal Joint, LLC.",
  "skill_requirements": [
    "Social Media Management",
    "Google Ads",
    "Facebook Ads"
  ],
  "is_active": true,
  "status_history": []
}