{
  "job_id": "1421758",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Facebook-Ads-Media-Buyer-Meta-1421758",
  "scraped_at": "2025-07-14T23:33:19.819738",
  "title": "Facebook Ads Media Buyer (Meta)",
  "type_of_work": "Full Time",
  "salary": "$500",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for a detail-obsessed, data-driven Media Buyer to help scale a rapidly growing brand.\r\nThis is a part-time role to start, focused initially on launching Meta (Facebook & Instagram) ads. If you're hungry, proactive, and thrive on improving performance through data, this will grow into a full-time position where you’ll take ownership of analyzing and optimizing campaigns.\n\r\n? What You’ll Start Doing:\r\nLaunch ad sets using our simple 3:2:2 method via Upgrade to see actual info (a powerful ad automation tool we love).\n\r\nSchedule and manage ads inside our one-CBO-per-country structure — nothing complicated here.\n\r\nExecute instructions precisely and consistently — we don’t change strategies often, so reliability is key.\n\r\n???? What This Can Grow Into:\r\nIf you’re the right fit, you'll transition into a full media buying role, where you'll:\n\r\nDive deep into metrics like conversion rate, hook rate, hold rate, and more.\n\r\nIdentify what’s working and what’s not — and share actionable insights with the team.\n\r\nHelp drive iteration and creative testing decisions.\n\r\n???? Who We're Looking For:\r\nSome experience with Meta ads is preferred — but being amazing with data and attention to detail is non-negotiable.\n\r\nHigh-accuracy thinker: You catch inconsistencies, double-check your work, and never skip over the small stuff.\n\r\nProactive learner who wants to become world-class at media buying, even if you’re still early in your career.\n\r\nNot afraid of feedback and holds themselves to a high standard.\n\r\n???? If you often make sloppy mistakes or skip over details, please do not apply. You won’t enjoy this job (and I won’t enjoy working with you).\n\r\n? If you're the type who triple-checks your work and takes pride in accuracy, you'll love working here — and I’ll do everything I can to help you grow.\n\r\n???? Bonus Opportunity (Optional):\r\nAfter a few months in the account, you'll also have the chance to contribute as a creative strategist.\r\nIf any ad ideas you come up with turn into winning ads, we’ll pay you a $250/month bonus per ad that scales.\n\r\nE.g. You create 2 new winners = $500 extra/month.\r\n(Again — this is optional, and not part of the core job description.)\n\r\n???? Why Join Us?\r\nWe’re growing fast, and we keep things simple and effective.\n\r\nYou’ll work directly with the founder (that’s me — I’ve done all the media buying so far).\n\r\nWe reward performance, attention to detail, and initiative.\n\r\n???? Summary:\r\nJob Type: Part-Time (with potential for Full-Time)\n\r\nRole: Meta Ads Media Buyer\n\r\nTools: Upgrade to see actual info, Meta Ads Manager\n\r\nStart: ASAP\n\r\nSkills Needed: Meta Ads (basic), Data Analysis, High Attention to Detail\n\r\nIf you're hungry, detail-obsessed, and eager to grow, I’d love to hear from you.\r\nTell me why you'd be a great fit — and include your favorite campaign or stat you've worked on (if you have one).\n\r\nLet’s scale this together ????",
  "skill_requirements": [
    "Facebook marketing",
    "Facebook Ads",
    "Meta Business Suite"
  ],
  "is_active": true,
  "status_history": []
}