{
  "job_id": "1421831",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Real-Estate-Virtual-Assistant-1421831",
  "scraped_at": "2025-07-15T03:43:51.833901",
  "title": "Real Estate Virtual Assistant",
  "type_of_work": "Full Time",
  "salary": "PHP 20,000 ++",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Real Estate Virtual Assistant Wanted (Full-Time | Long-Term | Work From Home)\n\r\nLocation: Remote \r\nIndustry: Real Estate – Property Management, Lead Generation, Admin Support\r\nSchedule: Monday to Friday | Full-Time | Aligned with Australian time zone\n\r\nAbout Us\n\r\nWe are a rapidly growing real estate business based in Australia, and we’re on the lookout for an experienced Virtual Assistant with a strong background in the real estate industry. You’ll be joining a friendly team with opportunities to grow and contribute meaningfully to our success.\n\r\nYour Role Will Include:\n\r\n Generating and nurturing real estate leads\r\n Following up leads via phone, email, and CRM\r\n Answering and making calls to clients, companies, and directors\r\n Managing rental properties, listings, and tenant inquiries\r\n Researching company websites, collecting data, and sending professional emails\r\n Following up with contacts to schedule meetings with directors\r\n Updating CRM and managing calendars, tasks, and communication\r\n Following instructions, processes, and systems provided (training available)\n\r\nMust-Have Qualifications:\n\r\n Proven VA experience in the real estate industry (AU/US preferred)\r\n Excellent spoken and written English communication skills\r\n Confident in handling phone calls and client interactions\r\n Skilled in lead generation, follow-up, and CRM updates\r\n Highly organized and able to multitask\r\n Proficient with tools like Google Workspace, CRMs, Excel, dialers, etc.\r\n Fast, reliable internet connection and quiet work environment\n\r\n*Bonus Points If You Have:*\n\r\n* Experience with property managers, brokers, or investors\r\n* Worked with property listing or inspection coordination tools\r\n* Experience in LinkedIn/email outreach or appointment setting\r\n* Knowledge of Australian rental/property platforms\n\r\nSalary:\n\r\nCompetitive – Based on experience (Please include expected monthly rate in PHP in your application)\n\n\r\nWhy Join Us?\n\r\n Work with a growing Australian real estate business\r\n Friendly and respectful team environment\r\n Long-term, stable employment with career growth\r\n Full training and clear systems provided\n\r\nTo Apply, Please Complete the Following Questionnaire:\n\r\nOnly applicants who complete all fields will be considered.\n\r\n1. How many years have you worked as a Virtual Assistant?\r\n2. How many years have you worked in the real estate industry?\r\n3. Have you worked with real estate agents, brokers, or property managers before? Please describe.\r\n4. What CRMs or tools have you used (e.g., PropertyMe, Salesforce, Podio, HubSpot)?\r\n5. Have you managed property listings, tenant communication, or inspections?\r\n6. Do you have experience in lead generation? How did you do it?\r\n7. Are you comfortable making and answering calls to clients and directors?\r\n8. Share an example where your follow-up helped close a deal or schedule a meeting.\n\r\nTechnical & Admin Abilities\n\r\n9. Have you researched and gathered contact data from websites before?\r\n10. Can you write and send professional business emails?\r\n11. List all tools/software you’re comfortable using (e.g., Google Workspace, Canva, CRMs, Slack, Zoom):\r\n12. Can you work full-time during AEST business hours?\n\r\nCompensation & Commitment\n\r\n13. What is your expected monthly salary in PHP (full-time)?\r\n14. When can you start?\r\n15. Are you seeking long-term work?\n\r\nBonus (Optional but Appreciated)\n\r\n16 Share any past work samples (e.g., screenshots, Google Drive, CRM reports):\r\n17. Anything else you’d like to add about your experience or why we should hire you?\n\n\r\nHow to Submit Your Application\n\r\nPlease send your completed application (including all answers above) via OnlineJobs.ph or directly to our hiring team if you received this through another platform. Incomplete applications **will not be reviewed**.\n\n\r\nWe’re excited to meet dedicated and skilled individuals who are ready to grow with us. If that sounds like you, apply now!",
  "skill_requirements": [
    "Real Estate Marketing",
    "Accounting",
    "Appointment Setting"
  ],
  "is_active": true,
  "status_history": []
}