{
  "job_id": "1421981",
  "url": "https://www.onlinejobs.ph/jobseekers/job/IT-Tech-Savy-Coordinator-1421981",
  "scraped_at": "2025-07-15T07:42:25.030723",
  "title": "IT Tech Savy Coordinator",
  "type_of_work": "Full Time",
  "salary": "50,000 - 70,000 PHP",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Join Our Mission\n\r\nWe’re seeking a dynamic Innovation Coordinator to collaborate closely with our Innovation Manager, driving technology initiatives that elevate our brand and delight our customers. If you’re passionate about tech, teamwork, and coffee, join us to shape the future of 7 Leaves!\n\r\nAbout the Role\r\nAs the Innovation Coordinator, you’ll work hand-in-hand with the Innovation Manager to bring transformative projects to life, from cutting-edge POS systems to a customer-focused mobile app. You’ll facilitate research, coordinate rollouts, and support cross-departmental initiatives, stepping in as a capable backup to ensure continuity. This role is ideal for a tech-savvy collaborator eager to innovate, learn, and grow in a vibrant, community-driven environment.\n\r\nWhat You’ll Do\r\n- Support Key Projects: Collaborate on the research, testing, and rollout of new POS systems and a mobile app to enhance ordering, loyalty, and guest engagement.\r\n- Streamline Systems: Help optimize tools like Airtable, ClickUp, and Google Workspace to boost team efficiency and collaboration.\r\n- Enable Integrations: Assist in building seamless connections between systems (e.g., POS, inventory, HR) and external platforms (e.g., delivery, loyalty).\r\n- Explore Automation & AI: Research and pilot automation tools and AI solutions for inventory, analytics, and personalized marketing.\r\n- Drive Industry Innovation: Contribute to coffee and tea-specific projects, like real-time inventory tracking, digital training platforms, or sustainability tools.\r\n- Facilitate Collaboration: Coordinate project timelines, gather feedback, and align with Marketing, Operations, and IT to ensure smooth execution.\r\n- Act as Backup: Step into the Innovation Manager’s role when needed, ensuring continuity and driving initiatives forward.\r\nLearn & Innovate: Embrace the Innovation Manager’s vision, build your expertise, and prepare for future leadership opportunities.\n\r\nRequirements\r\n- Tech-Savvy: Proficient in popular programming languages (e.g., Python, JavaScript, or Java) to support development and scripting tasks.\r\n- AI Skills & Curiosity: Familiarity with AI concepts (e.g., machine learning, predictive analytics) and a strong willingness to learn and apply emerging AI tools.\r\n- Database Knowledge: Understanding of databases, including SQL, for querying, managing, and analyzing data to support business insights.\r\n- Integration Expertise: Experience with system integrations (e.g., APIs, middleware) to ensure seamless data flow between platforms.\r\n- Project Coordination: Strong organizational skills to manage timelines, stakeholder feedback, and project deliverables.\r\n- Analytical Mindset: Ability to analyze workflows, identify inefficiencies, and propose data-driven solutions.\r\n- Collaboration & Communication: Excellent interpersonal skills to work effectively with cross-functional teams and translate technical concepts for non-technical stakeholders.\r\n- Adaptability: Comfortable thriving in a fast-paced environment and adapting to evolving technologies and business needs.\r\n- Passion for Coffee & Tea: Enthusiasm for 7 Leaves’ mission and the food and beverage industry, with a desire to enhance customer experiences through technology.\n\r\nWhy 7 Leaves?\r\nJoin a passionate team dedicated to crafting exceptional experiences. As Innovation Coordinator, you’ll collaborate with a visionary leader, gain hands-on experience with transformative tech, and help shape how we delight our customers. With opportunities to grow and make a real impact, you’ll be part of a brand brewing innovation and creating Upgrade to see actual infonts that matter!\n\r\nApply Now\r\nReady to spark the future at 7 Leaves? Send your resume and a brief cover letter to Upgrade to see actual info and tell us how you’ll fuel innovation.",
  "skill_requirements": [
    "IT",
    "Python",
    "Databases"
  ],
  "is_active": true,
  "status_history": []
}