{
  "job_id": "1421948",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Content-Manager-1421948",
  "scraped_at": "2025-07-15T06:40:25.529276",
  "title": "Content Manager",
  "type_of_work": "Full Time",
  "salary": "300-500",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Content Manager for Fast-Growing E-commerce Brand (Trend Research, Creator Liaising & Asset Organization)\n\r\nWe’re looking for a highly organized, proactive, and creative Content Manager to join our fast-moving team. This is a central role that touches nearly every part of the content lifecycle — from liaising with creators, organizing assets, scheduling content, and identifying the latest trends to bringing ideas into our creative pipeline.\n\r\nYou’ll act as the bridge between creators, editors, strategists, and the rest of the team — ensuring content flows smoothly from ideation to execution.\n\r\n? What You’ll Be Responsible For:\r\n???? Content Organization & Asset Management\r\nOrganize and maintain a clean structure across Google Drive and Recharm for all content files.\n\r\nEnsure new content from creators is uploaded, filed correctly, and easy for the team to access.\n\r\nTrack which assets are ready for use, need revisions, or are missing according to the original briefs.\n\r\n???? Creator Management & Briefing\r\nCoordinate with influencers and UGC creators: send briefs, choose creators, ship complimentary products.\n\r\nCross-check submitted footage against briefs — flag missing pieces and communicate clearly with both the creative team and the creator for revisions.\n\r\nBuild and maintain a simple creator database (preferred creators, past performance, contact status).\n\r\n???? Content Research & Trend Spotting\r\nMonitor TikTok, Instagram, Facebook, and other relevant platforms for video trends, hooks, and formats.\n\r\nSave and categorize high-performing content examples into a Miro board for inspiration.\n\r\nTake submissions from the team and file them for creative team access.\n\r\n???? Content Scheduling & Posting\r\nSchedule and/or publish organic content across Instagram, Facebook, TikTok, and other platforms.\n\r\nEnsure captions, hashtags, tags, and posting times follow brand guidelines.\n\r\n???? Creative Collaboration & Insights\r\nAttend all creative meetings — act as the “content brain” of the team.\n\r\nSuggest content ideas based on what we already have, and flag gaps in footage or trends we should explore.\n\r\nWork closely with video editors, graphic designers, creative strategists, copywriters, website/landing page builders, and the founder to align on creative priorities.\n\r\n???? Ad-Hoc Tasks & Influencer Outreach\r\nOccasionally help with influencer research and outreach (sourcing new creators that fit our brand).\n\r\nTake on other lightweight content tasks to support the team — this is a generalist role with a creative heartbeat.\n\r\n???? Who This Role Is Perfect For:\r\nHyper-organized: You love folders, clean naming systems, and everything in its place.\n\r\nObsessed with TikTok, Reels, or YouTube Shorts: You're not just casually aware — you’re deep in the trends. You love dissecting hooks, pacing, visuals, and what makes content go viral.\n\r\nDetail-obsessed: You catch mistakes others miss and follow through on every part of a process.\n\r\nTeam player: You’re excited to collaborate with people across disciplines and be the go-to content person everyone trusts.\n\r\nProactive communicator: You follow up, close the loop, and never leave people hanging.\n\r\n???? Summary:\r\nJob Type: Part-Time (with potential for Full-Time as brand scales)\n\r\nRole: Content Manager / Content Researcher / Creator Coordinator\n\r\nStart Date: ASAP\n\r\nLocation: Remote (must have excellent written English)\n\r\nKey Tools: Google Drive, Recharm, Slack, Miro, TikTok, Instagram, Meta Business Suite (or scheduling tools), possibly Notion or Airtable\n\r\n???? Why Join Us?\r\nWe’re a fast-growing brand with a lean, smart, creative team that values quality work, initiative, and good energy. You’ll have autonomy, a direct line to the founder, and the chance to make a meaningful impact every single week. If you love content, thrive on organization, and want to grow with a fast-moving team — you’ll love it here.\n\r\nReady to apply?\r\nSend a short note about:\n\r\nWhy this role excites you\n\r\nOne recent content trend or social format you love (and why)\n\r\nAny relevant past experience or transferable skills\n\r\nLet’s make magic happen ????",
  "skill_requirements": [
    "Content Management",
    "Organization",
    "Content Planning"
  ],
  "is_active": true,
  "status_history": []
}