{
  "job_id": "1421966",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Internal-Operations-Admin-Support-Specialist-Tech-Savvy-Detail-Oriented-Reliable-1421966",
  "scraped_at": "2025-07-15T07:32:35.710111",
  "title": "Internal Operations & Admin Support Specialist – Tech-Savvy, Detail-Oriented, Reliable",
  "type_of_work": "Any",
  "salary": "1200",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us\r\nWe are Emergent Learning – a high-impact Australian consultancy that delivers powerful face-to-face and virtual professional development programs across sectors such as government, finance, healthcare, and infrastructure. Our mission is to build more adaptive, human-centred workplaces through evidence-based learning, and we are growing — fast.\n\r\nRole Overview\r\nWe’re seeking a highly organised, detail-oriented Operations & Administrative Support Specialist to assist our directors and senior consultants with day-to-day business operations. This is a key internal support role — not client-facing, but absolutely critical to ensuring smooth, high-quality execution across our projects, documents, and systems. If you're the type who finds satisfaction in making things work behind the scenes, we’d love to hear from you.\n\r\nKey Responsibilities\r\nExecute admin and ops tasks directly from the Directors and Ops Mgr\r\nOrganise travel and book flights and logistics for facilitators\r\nFormat, update, and maintain internal documentation and templates\r\nSupport version control of policy, process and program documents\r\nConsolidate Excel reports and assist with dashboard creation\r\nWrite or draft internal reports and status updates as required\r\nMaintain and organise SharePoint, LMS and MS Teams files\r\nLearn and adapt to new internal platforms when needed (e.g., LMS, Miro)\n\r\nMust-Have Qualifications\r\n2+ years of admin, operations, or virtual assistant experience\r\nStrong written and spoken English communication\r\nExcellent Microsoft Office 365 skills – especially Word, Excel, PowerPoint\r\nStrong experience with file systems like SharePoint or Teams\r\nOrganised, proactive, and able to balance competing admin requests\r\nCommercial acumen and ability to understand business context\n\r\nNice-to-Have Qualifications\r\nFamiliarity with Dynamics 365 CRM\r\nExperience supporting professional services or consulting businesses\r\nStrong document formatting, dashboard building, or reporting skills\r\nAbility to document SOPs, procedures or templates clearly\n\r\nWork Hours & Time Zone\r\nMust be available during Australian Eastern Standard Time (AEST) hours\r\nIdeally 7am–3pm PH time, but can be discussed\n\r\nWork Setup & Tools\r\nFully remote, work-from-home\r\nMust have own laptop/PC, reliable internet, and a quiet environment\r\nTools used: Microsoft Office 365, SharePoint, MS Teams, Excel, PowerPoint, Dynamics 365, Miro, LMS\n\r\nCompensation & Benefits\r\nUp to USD $15/hour, depending on skills and experience\r\nPaid on time, with long-term continuity expected\n\r\nHow to Apply\r\nSubmit your OnlineJobs.ph application with your resume/CV\r\nInclude a brief cover letter explaining why you’re the right fit for a high-trust admin support role\r\nIn your message, please answer these 2 short questions:\r\nWhat’s one way you’ve helped improve admin processes in a previous role?\r\nDescribe your comfort level with Excel and SharePoint – beginner, intermediate, or advanced?\r\nShortlisted applicants will be invited to a video interview and test task simulation",
  "skill_requirements": [
    "Project Management",
    "Office and Administration",
    "Microsoft Excel"
  ],
  "is_active": true,
  "status_history": []
}