{
  "job_id": "1421956",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Employee-Relations-Advisor-1421956",
  "scraped_at": "2025-07-14T23:09:21.505309",
  "title": "Employee Relations Advisor",
  "type_of_work": "Full Time",
  "salary": "$1700 - $2500 per month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "SBFM Limited, an organisation experiencing rapid growth, is seeking a dynamic and experienced Employee Relations Advisor to join our HR team. Experience of UK Employment law will be required in order to hit the ground running in this position. \n\r\nAs an Employee Relations Advisor, you will be responsible for managing a caseload of 75 - 125 cases, providing comprehensive support and guidance on a range of employee relations matters within our organisation. \n\r\nKey Responsibilities: \n\r\nCase Management: Handle a caseload of 75 - 125 employee relations cases, including disciplinary, grievances, performance management.\n\r\nSickness / Absences and other related matters.  \n\r\nAdvisory Services: Provide expert advice and guidance to managers and employees on HR policies, procedures, and best practices to ensure fair and consistent resolutions.  \n\r\nInvestigations: Conduct thorough and impartial investigations via teams or by telephone into employee complaints, grievances, and disciplinary issues, maintaining accurate records and documentation throughout the process.  \n\r\nMediation and Conflict Resolution: Facilitate discussions and mediate conflicts to achieve positive outcomes and maintain a productive work environment. \n\r\nPolicy Development and Implementation: Collaborate with the HR team to develop, review, and implement HR policies and procedures in line with current legislation and best practices. \n\r\nTraining and Support: Deliver training sessions to managers and employees on employee relations topics, promoting a culture of understanding and compliance.  \n\r\nPerformance Management: Assist in developing and implementing performance improvement plans and strategies, ensuring alignment with organizational objectives.  \n\r\nAdditional Requirements: Experience: Proven experience in a similar employee relations role, handling a substantial caseload and providing expert advice in a fast-paced environment is preferred.  \n\r\nKnowledge: Sound knowledge of employment law, HR policies, and procedures, with the ability to interpret and apply them effectively.  \n\r\nCommunication Skills: Excellent interpersonal and communication skills, with the ability to interact confidently and effectively with stakeholders at all levels. \n\r\nAnalytical Thinking: Strong analytical and problem-solving skills to assess complex situations and provide pragmatic solutions.  \n\r\nConfidentiality: Ability to handle sensitive information with discretion and maintain confidentiality at all times.  \n\r\nNegotiation Skills: Proficiency in negotiation techniques to resolve conflicts and reach mutually beneficial agreements.  \n\r\nAdaptability: Ability to thrive in a dynamic, rapidly changing environment and adapt to new situations effectively.  \n\r\nTeam Player: Collaborative mindset with a demonstrated ability to work effectively within a team environment.  \n\r\nEducation: A degree in HR management or a related field is preferred, UK based knowledge is required. CIPD or equivalent HR qualification is advantageous. \n\r\nReporting Structure: This role will report directly to the Head of HR and will collaborate closely with other HR teaUpgrade to see actual infombers to ensure consistent and effective HR practices across the organisation.  \n\r\nCompany Values: \n\r\n • Be a good person • Play as a team • Think differently • Make an Impact",
  "skill_requirements": [
    "Human Resources",
    "Case Management",
    "Labor Relations"
  ]
}