{
  "job_id": "1421695",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Manager-Video-Editor-Health-Fitness-Focus-1421695",
  "scraped_at": "2025-07-14T22:22:24.684601",
  "title": "Social Media Manager & Video Editor (Health & Fitness Focus)",
  "type_of_work": "Part Time",
  "salary": "~$15/video",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Role: Video Editor & Social Media Manager (Part-Time or Project-Based)\r\nIndustry: Holistic Health, Fitness, and Lifestyle\r\nCommitment: Ongoing (7 videos/week)\r\nLocation: Remote\r\nPay: Competitive, based on experience and output\n\r\nAbout Me\r\nI run a brand called Haplete (Happy Athlete) that empowers people to live healthier, happier, more adventurous lives. My content mixes fitness, holistic health, nutrition, lifestyle and spiritual connection.\n\r\nI'm committed to posting 1 reel per day for the next year, and I need a creative, reliable partner to help bring my content to life.\n\r\nWhat You’ll Be Doing\r\n- Take raw video clips (filmed on phone) and edit them into highly engaging, emotionally-resonant reels (15–60 sec)\r\n- Add storytelling elements: text overlays, pacing, transitions, color grading, and music\r\n- Select royalty-free or trending sounds where appropriate\r\n- Repurpose content for Instagram, TikTok, and YouTube Shorts\r\n- Assist with scheduling, caption writing, and basic analytics tracking\n\r\n Ideal Candidate\r\n- Has experience editing for fitness, wellness, or lifestyle creators\r\n- Understands storytelling and emotional beats not just flashy transitions\r\n- Proficient in CapCut (IDEAL), Adobe Premiere, or similar mobile-friendly editing tools\r\n- Can work quickly (24–72 hr turnaround max)\r\n- Has a feel for aesthetic, minimalist, natural vibes (not overdone or gimmicky)\r\n- Is passionate about health, personal growth, movement, or spirituality\n\r\nBonus if you:\r\n- Are familiar with Instagram/TikTok algorithms\r\n- Can help brainstorm hooks and video concepts\r\n- Enjoy working with creators on meaningful missions\n\r\n To Apply, send me:\r\n- 2–3 short-form videos you've edited for a creator or brand Upgrade to see actual info\r\n- A short note on why this work excites you\r\n- Your rates (per video or per batch)\n\r\nBonuses will be given for hitting certain milestones (virality, page growth).",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Management",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": []
}