{
  "job_id": "1421713",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421713",
  "scraped_at": "2025-07-14T23:09:07.859959",
  "title": "Experienced US Tax Senior - CPA Required!",
  "type_of_work": "Full Time",
  "salary": "$3,000+",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us:\n\r\nLeichter Accounting Services, LLC is a family-friendly CPA firm providing high-quality tax and accounting services to mental health practitioners as well as other professional services across the U.S. We operate remotely and are committed to delivering exceptional client service with a personal touch. As a forward-thinking team, we continually seek to improve by incorporating relevant technology into our workflows to better serve our clients and one another.\n\r\nThe Opportunity:\n\r\nWe’re on a mission to replace financial fear with clarity and peace of mind—and we’re looking for a Tax Senior who wants to be part of that transformation! If you are a highly experienced Senior Tax Accountant with a minimum of 3 years in US Tax accounting and wish to join our team on a full-time, remote basis, we'd love to hear from you. In this role, you will be responsible for preparing complex, multi-state tax returns, advising on special tax projects, and communicating clearly and professionally with clients. You’ll play a vital role in ensuring accuracy, compliance, and great service across our portfolio of clients.\n\r\nKey Responsibilities:\n\r\n- Prepare business and individual tax returns (Forms 1120, 1120S, 1065, 990, and 1040)\r\n- Handle occasional complex or special tax projects\r\n- Communicate effectively with clients to provide guidance and clarity\r\n- Collaborate with our internal team and your superiors to ensure seamless service and delivery\r\n- Provide support and mentorship to junior tax staff as needed\n\r\nWhat Were Looking For:\n\r\n- Minimum 3 years of experience with a public accounting firm in tax preparation \r\n- Proficiency in business and personal tax return types, including corporations, S-corps, partnerships, nonprofits, and individuals\r\n- Strong communication and client service skills\r\n- Comfortable working independently and remotely\r\n- Experience with tax software and cloud-based accounting platforms\r\n- CPA required\n\r\nSchedule & Hours:\n\r\n- Approx. 40 hours/week during non-tax season\r\n- Up to 10 hours/week additional during tax season\n\r\nWhy Join Us?\n\r\n- Flexible schedule with remote work\r\n- Collaborative, respectful, and supportive work culture\r\n- Mission-driven firm with a niche in the mental health community\r\n- Opportunities to grow and make a meaningful impact\n\n\r\nIf you're a seasoned tax professional looking to work with a firm that values both excellence and people, we’d love to hear from you. Please send a resume and a cover letter - including your favorite color - indicating why you feel you are the right candidate for the job and what you are ideally looking for with your next opportunity. Please include any spelling or grammatical mistakes you caught in this job description posting.",
  "skill_requirements": [
    "Quickbooks",
    "Tax Preparation",
    "English Proficiency"
  ]
}