{
  "job_id": "1421975",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Product-Designer-UIUX-Service-Planning-1421975",
  "scraped_at": "2025-07-14T23:08:45.761925",
  "title": "Product Designer (UI/UX + Service Planning)",
  "type_of_work": "Part Time",
  "salary": "Php 23,000 per month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us\r\nWe are a fast-growing Korean online education company providing premium video call English lessons.\r\nTo enhance our service experience, we are looking for a talented and detail-oriented Product Designer who can cover both UI/UX design and service planning.\n\r\nResponsibilities\r\n• Plan and design the overall UX structure and user flow of our online English learning platform.\r\n• Create wireframes, prototypes, and final UI designs using Figma.\r\n• Collaborate closely with the founder to understand service goals and user needs.\r\n• Work with developers to ensure designs are implemented accurately.\r\n• Continuously improve user experience based on feedback and usage data.\n\r\nRequirements\r\n• At least 2 years of experience in UI/UX or Product Design.\r\n• Strong skills in Figma and prototyping.\r\n• Experience designing service-oriented platforms (preferably EdTech or online services).\r\n• Good communication skills in English (for collaboration with founder and developer).\r\n• Ability to take ownership and think critically about UX problems.\n\r\nNice to Have\r\n• Experience working with Korean or East Asian clients.\r\n• Familiarity with Notion, Figjam, and other collaboration tools.\r\n• Basic understanding of frontend process (HTML, CSS, or development handoff).\n\r\nWork Details\r\n• Stable and long-term remote position\r\n• Philippines only\r\n• Monthly salary: PHP 23,000\r\n• Work schedule: 12:30 PM to 4:30 PM (PHT)\n\n\r\nHow to Apply\r\nPlease send your CV, portfolio (Figma link preferred), and a brief introduction.\r\nSelected candidates will be asked to complete a small test project.\r\nPlease include examples of UX flow, UI design, and any planning documents if available.\n\r\nIf you’re interested, please provide your WhatsApp number along with your application so we can contact you for the next steps",
  "skill_requirements": [
    "Wireframing",
    "Figma",
    "UI UX Design"
  ]
}