{
  "job_id": "1421097",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Excel-Google-Sheets-Scoring-System-Expert-Custom-Matching-Logic-1421097",
  "scraped_at": "2025-07-14T23:08:27.108775",
  "title": "Excel & Google Sheets Scoring System Expert – Custom Matching Logic",
  "type_of_work": "Gig",
  "salary": "255",
  "hours_per_week": "8",
  "date_updated": "Jul 14, 2025",
  "job_overview": "???? Job Title:\r\nExcel & Google Sheets Scoring System Expert – Custom Matching Logic\n\r\n???? About the Project:\r\nWe’re building a data-driven platform in the college recruiting space and need a spreadsheet expert to help implement a custom scoring and matching system. The system will analyze multiple data points and return a ranked list of best-fit options for users based on defined logic and weighted inputs.\n\r\nWe already have the framework and data structure. Now we need someone to help bring it to life in Excel or Google Sheets using formulas, conditional logic, and smart automation.\n\r\n???? What You'll Do:\r\nBuild out a flexible, reliable scoring model using Excel and/or Google Sheets\n\r\nNormalize and score various data types from different sources\n\r\nCreate logic to return ranked matches based on predefined criteria\n\r\nHelp clean, structure, and connect datasets within the spreadsheet\n\r\nEnsure scalability and accuracy for future additions\n\r\n???? Key Skills Required:\r\nAdvanced proficiency in Excel and Google Sheets\n\r\nStrong understanding of formulas, scoring systems, and conditional logic\n\r\nAbility to structure data for matching or recommendation tools\n\r\nClean, organized spreadsheet design and documentation\n\r\nStrong communication skills and attention to detail\n\r\n???? Bonus Skills (Not Required, but Nice to Have):\r\nExperience with performance evaluation tools or matching systems\n\r\nAirtable or Notion familiarity\n\r\nInterest or experience in sports, education, or student platforms\n\r\n? Timeline & Scope:\r\nEstimated workload: 15–30 hours\n\r\nLooking to hire immediately\n\r\nPotential for ongoing work after initial project if there's a strong fit\n\r\n???? Compensation:\r\nOpen to hourly or fixed-rate proposals\n\r\nPreference for applicants in the Philippines or similar time zones, but open to all\n\r\n? To Apply, Please Include:\r\nExamples of past spreadsheet projects you've completed (especially scoring or logic-based work)\n\r\nA short description of your experience with complex Excel/Sheets logic",
  "skill_requirements": [
    "Airtable",
    "Microsoft Excel",
    "Google Sheets"
  ]
}