{
  "job_id": "1421954",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1421954",
  "scraped_at": "2025-07-14T23:07:01.928382",
  "title": "Part-Time YouTube Video Editor - Remote: Shape the Future of AI Content!",
  "type_of_work": "Part Time",
  "salary": "7000 -  9000 PHP / month, 200- 250 AUD / month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Position: Part-Time YouTube Video Editor\r\nLocation: Remote\r\nHours: Approximately 20 hours per week (flexible, based on video volume and project deadlines). Minimum 1-2 videos per week posted on YouTube.\r\nCompensation: Depending on experience level, AUDUpgrade to see actual info/ 7000 - 9,000 PHP per month for approximately 20 hours of work per week. This compensation reflects a foundational rate for a role that offers significant learning and growth opportunities in a cutting-edge field.\n\r\nAbout Us:\r\nAI InspiredShifter is a rapidly growing online education and resource platform dedicated to empowering individuals to leverage cutting-edge AI tools and automation (like AI image/video generation, AI effects). We empower individuals to transform their online presence and businesses by mastering cutting-edge AI tools (like AI image/video generation, AI effects) and automation strategies. Our mission is to equip our audience with the knowledge to make money online, scale their ventures, and unlock unprecedented efficiency. We're launching an exciting YouTube channel, and we need a talented editor to bring our vision to life – and grow with us!\n\r\nKey Responsibilities - What You'll Be Doing:\n\r\n    • Dialogue Cleanup & Pacing: Master the art of seamless conversation. Efficiently remove filler words (ums, uhs), awkward pauses, and imperfect takes using advanced, AI-assisted editing tools (e.g., text-based editing features). Craft a smooth, natural, and engaging narrative flow.\n\r\n    • Multi-Track Editing: Expertly combine and synchronize screen recordings with webcam footage, ensuring precise cutting and seamless transitions between different camera angles and screen views.\n\r\n    • Visual Layering & Branding: Implement consistent and impactful intro/outro sequences, lower thirds, and on-screen text for clarity and strong brand identity. Dynamically apply circular or square masks to webcam footage, strategically positioning it (e.g., corner, full-screen, responsive placement) to maximize viewer engagement. Integrate compelling B-roll footage, overlays, and graphics to illustrate complex concepts and maintain visual interest.\n\r\n    • Effects & Transitions: Add professional, subtle, and impactful transitions between clips. Apply sophisticated post-production background blur for webcam footage, ensuring focus remains on the speaker. Implement clear cursor click effects, subtle zooms, pans, and spotlight/magnify effects to guide the viewer's eye to key areas on screen.\n\r\n    • Audio Enhancement: Achieve broadcast-quality sound. Perform global loudness normalization, effective noise reduction, and voice enhancement to ensure crystal-clear audio. Strategically add appropriate (optional background music) and sound effects (SFX) to elevate the viewer experience without distraction.\n\r\n    • Content Repurposing: Become a master of multi-platform content. Efficiently edit long-form YouTube videos into engaging, short-form content optimized for YouTube Shorts and TikTok.\n\r\n    • Thumbnail Creation: Design compelling, click-worthy YouTube thumbnails that accurately represent video content and are engineered for high click-through rates.\n\r\n    • YouTube Upload & Optimization: Handle the final publishing steps. Upload finished videos to YouTube, ensuring basic SEO best practices are applied (e.g., compelling titles, detailed descriptions, relevant tags, effective end screens, and cards).\n\r\n    • Collaboration & Communication: Thrive in a remote, collaborative environment. Maintain proactive and clear communication with the content teammate, be open to constructive feedback, and iterate on edits with precision.\n\r\n    • Occasional Tutorial Content Creation (New Clause - Your Opportunity to Teach & Learn!): This is where you'll truly shine and expand your skillset. The editor must agree to record their screen to create short video editing tutorials demonstrating specific editing tips, fast workflows, or special effects (e.g., using CapCut, integrating AI images/effects/videos, applying background blur, creating circular webcam layouts, etc.). These tutorials will be for posting on our YouTube channel . The employer will provide the voiceover for these tutorials; your speaking or guiding during the recording is optional. This is a fantastic chance to deepen your understanding of these techniques and contribute to a growing educational resource.\n\r\n    • Additional Video Content: Over time, we may require additional, smaller YouTube videos to be posted. This will be discussed and factored into the workload and compensation review.\n\r\nWhy Join Us? What You'll Gain:\n\r\n    • Hands-On AI Integration: Work directly with cutting-edge AI image and video generation tools, learning how to seamlessly integrate them into professional video productions.\n\r\n    • Master Advanced Editing Techniques: Continuously refine your skills with AI-assisted dialogue editing, dynamic visual effects, and optimized workflows.\n\r\n    • Impact & Growth: Directly contribute to a rapidly growing YouTube channel and a platform that genuinely helps others build online businesses. Your work will have a tangible impact.\n\r\n    • Stable Remote Role: Enjoy the security of a consistent part-time position within a supportive and innovative remote team.\n\r\n    • Continuous Learning: Be at the forefront of AI content creation, constantly learning and applying new technologies.\n\r\n    • Performance Review & Compensation Growth: Your perfomance & compensation will be reviewed after 2-3 months of work. We are committed to increasing your salary based on consistent high-quality delivery and strong communication. Payments can be done via Upgrade to see actual info on a fortnightly or monthly basis, based on your preference.\n\r\nRequired Skills & Experience - What We Need From You:\n\r\n    • Proven professional video editing experience with a strong portfolio (YouTube channel links or specific video links are highly preferred).\n\r\n    • Crucial Application Question: How long have you been video editing, and which editor and tools do you primarily use (e.g., CapCut, Adobe Premiere Pro, DaVinci Resolve, Final Cut Pro, etc.)?\r\n- What is your workstation setup? please provide specs and internet speed test and what you have as a backup when electricity or internet outage happen in the Philippines.\n\r\n    • Experience with AI-assisted dialogue editing tools (e.g., CapCut's text-based editing, or familiarity with Descript/Gling.ai concepts for efficient filler word removal and pacing adjustment).\n\r\n    • Strong understanding of YouTube best practices for engagement, retention, and discoverability.\r\n    • Familiarity with screen and webcam recording and editing styles.\r\n    • Excellent eye for detail, pacing, and visual storytelling – you have a passion for making content shine!\r\n    • Ability to work independently and manage multiple projects simultaneously in a fast-paced environment.\r\n    • Reliable high-speed internet connection and a capable computer setup for demanding video editing tasks.\n\r\nBonus Points - Stand Out From the Crowd:\n\r\n    • Experience with AI image/video generation tools to create effects, animations etc (e.g., Imagen 4, Midjourney, DALL-E, RunwayML, Veo).\n\r\n    • Proficiency in green screen (Chroma Key) editing.\n\r\nApplication Instructions:\n\r\nTo apply for this exciting opportunity and embark on a journey of growth with Us, please submit the following:\r\n    1. Your updated Resume.\n\r\n    2. A Cover Letter explaining why you are a great fit for this role, specifically answering the crucial application question: \"How long have you been video editing and which editor and tools do you primarily use?\" Please also mention your experience or familiarity with AI-assisted dialogue editing and AI image or video generation.\n\r\n    3. Links to your Video Editing Portfolio (YouTube channel links or specific video examples are highly preferred).\r\nWe look forward to reviewing your application and potentially welcoming you to the AI InspiredShifter team!",
  "skill_requirements": [
    "Video Content Creation",
    "Video Editing",
    "CapCut"
  ]
}