{
  "job_id": "1421807",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Talent-Engagement-Placement-Specialist-1421807",
  "scraped_at": "2025-07-15T03:48:07.306830",
  "title": "Talent Engagement & Placement Specialist",
  "type_of_work": "Full Time",
  "salary": "40,000",
  "hours_per_week": "48",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Talent Engagement & Placement Specialist\n\r\nWe are seeking a Talent Engagement & Placement Specialist to support job placement across our company’s client programs, with a focus on employment outcomes and job readiness. This is a non-coaching, operational role responsible for preparing clients for employment, generating \r\njob opportunities, and supporting job clubs and coaches with tools and coordination. \n\r\nThe candidates must have strong organizational and coordination skills — able to manage multiple priorities and stakeholders and able to create or support the development of job readiness resources, such as resume templates, interview prep materials, or employer lists.\n\n\r\nKey Duties and Responsibilities:\r\n1. Job Placement Support \r\nTrack all job-seeking clients across programs and coordinate with Operations and coaching teams. \r\nDeliver 1:1 resume review and mock interview sessions to ensure 100% coverage for job-ready clients. \r\nMaintain accurate documentation and tracking of client job placement progress and outcomes. \r\n2. Job Club Enablement \r\nProvide logistical and content support for Job Club planning with Program Coordinators. \r\nCurate and share weekly job leads aligned with client interests and cohort timelines. \r\nCoordinate employer guest speakers or panels and assist in post-session follow-ups. (Note: This role does not lead or host Job Club sessions.) \r\n3. Employer Engagement & Job Lead Generation \r\nConduct outreach to employers, workforce partners, job boards, and industry associations to build hiring pipelines. \r\nIdentify inclusive and accessible job opportunities aligned with client profiles. \r\nCoordinate logistics for employer-led webinars or info sessions, and document outcomes. \r\n4. Tracking & Reporting \r\nMaintain dashboards tracking employer engagement, job leads, and client milestones. \r\nSupport internal reporting on job placement outcomes and service delivery. \r\nCollaborate with Operations on QA and compliance for job placement processes. \r\n5. Collaboration and Communication \r\nParticipate in weekly planning meetings and service delivery syncs. \r\nContribute insights to improve job placement strategy and operational efficiency. \r\nShare field learnings from employer outreach and job club coordination.\r\nDesired Skills and Experience:\r\n2+ years of experience in job development, talent sourcing, career readiness, or workforce development.\r\nFamiliarity with the disability community and inclusive hiring practices.\r\nStrong organizational and communication skills with a proactive and collaborative approach.\r\nProficient in digital tools (e.g., spreadsheets, CRMs, project management platforms).\r\nComfortable using AI tools or modern platforms to enhance service delivery.\r\nRemote work experience and comfort coordinating across distributed teams and amenable to work in US EST and Arizona time zones.\r\nBachelor’s degree (or equivalent experience) in any of the following:\r\nPsychology, Social Work, or Human Services\r\nEducation (Special Education or Adult Learning)\r\nBusiness Administration, Human Resource Management, or Workforce Development\r\nCommunications, Public Relations, or Marketing\r\nRehabilitation Counseling or related vocational programs\r\nCertifications (a plus but not required)\n\r\nWhy Remotify?\n\r\nRemotify focuses on putting Filipino talents in the spotlight in the global workforce scene. We are an Employer of Record in the Philippines and we enable small to medium businesses across the world to scale their teams securely and cost-effectively through remote outsourcing. Through our services, we ensure that every remote employee enjoys the social benefits the law provides while receiving internationally competitive salaries.\n\r\nWith Remotify, you will have the opportunity to work directly with international businesses while having an employee contract bound in the Philippines, social benefits, and tax contributions, through us. As you work internationally from your home, you have a local HR to help you with local labor compliance. We have created a community of Filipino Remote workers who value the flexibility of remote work while enjoying the togetherness a great virtual workplace brings both professionally and personally.\n\r\nHere are the perks of working with us:\n\r\nCompetitive salary (Php40,000 + Allowances)\r\nI.N.S.P.I.R.E program that will help you build personal and professional character\r\nA payroll system that assures on-time payments at all times\r\nGreat team environment and culture\r\nSSS, Philhealth, and Pag-ibig\r\n13th Month Pay\r\nNight differential pay\r\nPaid local holidays\r\nAnnual leaves\r\nHMO Benefit\n\r\nIf you are the one we're looking for, send us your application now. All shortlisted applicants will receive an email from our HR for the next steps of your recruitment process.\n\r\nYou may also review our other job openings",
  "skill_requirements": [
    "Human Resources",
    "Talent Acquisition",
    "Workforce Management"
  ],
  "is_active": true,
  "status_history": []
}