{
  "job_id": "1421927",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Expert-Instagram-Virtual-Assistant-Manager-1421927",
  "scraped_at": "2025-07-14T23:09:42.667497",
  "title": "Expert Instagram Virtual Assistant / Manager",
  "type_of_work": "Full Time",
  "salary": "1500",
  "hours_per_week": "50",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hi, I'm Eric.\n\r\nWe’re looking for a driven, high motivated digital professional to help manage and grow all aspects of our online presence.\n\r\nThis isn’t for someone who needs constant direction. We want a self-starter who can:\r\n • Manage social platforms (especially Instagram).\r\n • Stay on top of digital trends across multiple platforms.\r\n • Handle outreach, DMs, and community engagement.\r\n • Assist with content, research, and other growth-focused tasks.\n\r\nWhat You’ll Do\r\n • Grow and manage social media accounts (posting, engagement, analytics).\r\n • Research trends and create fresh content ideas.\r\n • Manage DMs and build relationships with followers and partners.\r\n • Support digital operations (light admin, outreach, and creative tasks).\n\r\nWhat We’re Looking For\r\n • Experience with social media and digital marketing.\r\n • Strong understanding of online trends and audience engagement.\r\n • Excellent written English for captions and DMs.\r\n • Proactive, resourceful, and results-driven.\r\n • Reliable internet and ability to work US hours (or partial overlap).\r\n • (Preference: Young Male, 18 - 30, understands social media trends)\n\r\nHow to Apply - Response to these questions:\r\n 1. Share links to your portfolio / social media accounts or digital work you’ve done.\r\n 2. What’s the hardest you’ve ever worked on something in your life, and why did you do it?\r\n 3. Why should we hire you out of the 1,000+ applicants we recieve?\n\r\nApply now if you’re ready to prove you’re the one.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Management",
    "Social Media Marketing"
  ]
}