{
  "job_id": "1422298",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Magazine-Designer-1422298",
  "scraped_at": "2025-07-14T23:09:02.499223",
  "title": "Magazine Designer",
  "type_of_work": "Any",
  "salary": "$850–$1250/month (depending on experience)",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re Boss Navigator Publishing, a US-based media company producing print + digital magazines that teach business, ownership, and wealth strategies — especially for underserved and overlooked communities. At Boss Navigator, we care about results — not just hours worked.\r\nWe’re hiring a full-time, long-term graphic designer to help build two powerful monthly magazines from the ground up.\r\nYou’ll design:\n\r\n64+ page monthly magazine layouts in Canva\n\r\nTemplates and workflows to speed up creative production\n\r\nWho We’re Looking For:\r\nWe only hire A-players — designers who take pride in structure, speed, and clean layout.\r\nIf you’re obsessed with high standards, AI-powered efficiency, and design that makes people stop and read, this is for you.\r\nYou MUST:\n\r\nBe highly skilled in Canva Pro\n\r\nKnow how to structure and execute full print-style layout spreads\n\r\nBe comfortable creating or using design templates to move faster\n\r\nKnow how to source visuals (or create them using AI tools)\n\r\nHit deadlines without micromanagement\n\r\nBe capable of handling multiple publications at once\n\r\nDaily Use of AI Tools Is Expected\r\nYou’ll be expected to use AI tools every day to assist with idea generation, content cleanup, automation, and faster execution.\r\nWe highly value applicants with strong knowledge of:\n\r\nChatGPT\n\r\nClaude\n\r\nNotebookLM\n\r\nAI design tools or prompt engines\n\n\r\nCompensation:\n\r\n$850–$1250/month (depending on experience)\n\r\nBi-weekly pay via Wise, PayPal, or Wave After 30 day probationary period\n\r\nPerformance bonuses\n\r\nLong-term role with consistent, growing workload\n\r\nHow to Apply (READ CAREFULLY)\r\nWe do not accept messages through OnlineJobs.ph.\r\nTo apply, fill out this application form only:\nUpgrade to see actual info/apps6GaBFWV1JOfVM/pagtreBMaue1h8Qem/form\r\nInside the form:\r\nSubmit your best Canva project (magazine layout preferred)\n\n\r\nShare your AI experience\n\n\r\nComplete a secret instruction to prove you read this post- Use word Watermelon\n\n\r\nIf shortlisted, you’ll receive a test assignment where you’ll turn a real YouTube video into a magazine article layout using Canva. AI tools are encouraged.\n\r\nOur Culture: Results, Growth, and Opportunity\r\nAt Boss Navigator, we care about results — not just hours worked.\r\nWhether it takes you two hours or ten to deliver great work, what matters is the quality, consistency, and impact of what you produce.\r\nIf you're someone who thrives on solving problems, delivering clean creative work, and growing professionally — you’ll love it here.\r\nThis isn’t just a freelance gig — it’s a career opportunity.\r\nWe’re expanding quickly. We’ll need future creative leads, brand managers, and content directors. If you want to grow into those roles, we’ll show you how — and give you real chances to earn them based on merit.\r\nPromotions don’t happen on a calendar. They happen when you ask for feedback, grow fast, and prove your value.\r\nIf you become someone the company can’t live without, you’ll be rewarded:\r\nCompetitive pay increases\n\n\r\nPerformance bonuses\n\n\r\nFun projects and creative freedom\n\n\r\nA long-term role you can be proud of\n\n\r\nWe’re not building a side hustle. We’re building a legacy brand.\r\nAnd if you help us build it, we’ll make sure you grow right alongside it.\n\r\n?? Final Note:\r\nIf you just skimmed this post, don’t apply.\r\nWe’re looking for professionals who care about details, craft, and long-term results.\r\nIf that’s you — apply here:\nUpgrade to see actual info/apps6GaBFWV1JOfVM/pagtreBMaue1h8Qem/form",
  "skill_requirements": [
    "Creative Writing",
    "Graphic Design",
    "Canva"
  ]
}