{
  "job_id": "1422350",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422350",
  "scraped_at": "2025-07-14T23:09:05.421817",
  "title": "Automation & Marketing Systems Specialist",
  "type_of_work": "Any",
  "salary": "5.00",
  "hours_per_week": "30",
  "date_updated": "Jul 14, 2025",
  "job_overview": "???? Now Hiring: Automation & Marketing Systems Lead\r\nAbout Logos Health\r\nLogos Health is a Christ-centered integrative and functional medicine practice based in North Carolina, USA, founded and led by Dr. Alesha Logan, NP. We serve children and adults through both Direct Primary Care and high-impact, premium wellness programs focused on hormone health, metabolic optimization, gut healing, weight loss, and more.\n\r\nWe are a fast-growing, mission-driven practice dedicated to whole-person care and medical freedom. As we continue to scale our programs and serve more patients, we are looking for a tech-savvy, proactive automation and marketing expert based in the Philippines to join our remote team.\n\r\n???? Who We're Looking For\r\nWe’re in search of a skilled Systems Integrator & Automation Specialist to streamline and scale our operations through automation, lead generation, CRM management, and efficient tech integrations. Your role will be critical in helping us generate, nurture, and convert leads, improve patient onboarding, and automate delivery of program education.\n\r\n???? Key Responsibilities\r\nYou will support and improve the following areas:\n\r\nLead Generation & Ad Integration\n\r\nCreate and optimize Upgrade to see actual info for Facebook Ads and other lead sources\n\r\nSales Funnels & CRM\n\r\nBuild out funnels and workflows that convert leads into paying clients\n\r\nClient Nurturing & Email Automation\n\r\nCreate campaigns for both cold leads and existing clients (education, upsell, re-engagement)\n\r\nClient Onboarding\n\r\nAutomate onboarding tasks for patients enrolled in wellness and medical programs\n\r\nPatient Education Delivery\n\r\nSet up timed content delivery (emails, video, handouts, etc.) over the course of a 12–16 week program\n\r\n???? Our Current Tech Stack\r\nYou’ll be helping us streamline and integrate the following tools:\n\r\nElation (EHR): Used for medical charting, visit documentation, and patient scheduling (HIPAA-compliant platform).\n\r\nSpruce (Messaging + VOIP): Central hub for secure patient communications (calls, texts, app messaging).\n\r\nHint Health (Billing + Membership): Manages DPC memberships and wellness programs. Integrates with Stripe for payment processing.\n\r\nFlodesk (Email Marketing): Used for email automations, list management, and lead magnet delivery.\n\r\nZentake (Digital Forms): For patient intake and onboarding documents.\n\r\nSlack (Internal Team Communication): Used for daily communication with our virtual and in-person team.\n\r\nZoom (Meetings & Webinars): Used for group coaching, webinars, and virtual consults.\n\r\nTeachable (Online Courses): Where we host and deliver educational video content for select programs.\n\r\nGoogle Workspace: For forms, drive storage, and document collaboration.\n\r\n???? Note: We are currently lacking a comprehensive CRM and are considering platforms like GoHighLevel. Your input on this will be valuable!\n\r\n? Ideal Candidate Profile\r\n???? Proven experience in CRM setup, sales funnels, automated onboarding, and lead generation\n\r\n?? Bonus if you’ve worked with healthcare, functional medicine, or direct primary care\n\r\n???? Strong understanding of HIPAA-compliant workflows\n\r\n???? Familiarity with tools like GoHighLevel, ClickFunnels, or Keragon\n\r\n???? Excellent English and communication skills, both written and verbal\n\r\n???? Tech-savvy, self-motivated, and solution-oriented\n\r\n???? Bonus: Experience with Elation, Hint, or Spruce\n\r\n???? Application Instructions\r\nTo apply, please reply with a short video answering the following:\n\r\n?Introduce yourself (name, location, and years of experience in automation and marketing)\n\r\n?What experience do you have in healthcare or HIPAA-compliant systems?\n\r\n?Availability (When can you start and do you currently have another job?)\n\r\n?Your proposal (in under 5 minutes): How would you connect and automate our current platforms? Which CRM or additional tools would you recommend to streamline our process?\n\r\n???? Start Date\r\nASAP – Flexible for the right candidate\n\r\n???? Job Type & Hours\r\nFreelance/Part-Time (with potential for Full-Time)\n\r\nFlexible Hours (PH Timezone okay, must overlap with 2–4 hours of EST at least 2x/week)\n\r\n???? To Learn More\r\nVisit Upgrade to see actual info to learn about our mission and services.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}