{
  "job_id": "1422688",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Frontend-Developers-1422688",
  "scraped_at": "2025-07-15T12:31:16.286062",
  "title": "Shopify Frontend Developers",
  "type_of_work": "Any",
  "salary": "$1,280/mo",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are hiring for 4 Shopify Frontend Developers to join our team!\n\r\nThe company is dedicated to enhancing the performance of Shopify stores across a variety of markets. To support this initiative, we are on the lookout for a seasoned Frontend Developers with proven expertise in Shopify frontend development. This role will be instrumental in building responsive, high-performance web applications that enhance user experience and drive conversions.\n\r\nWe would love to hear from you if…\r\n- You have at least 1 year experience in Shopify front end development\r\n- You have strong proficiency in HTML, CSS, and JavaScript, along with experience in Shopify-specific frameworks and tools.\r\n- Experience in UI/UX design is required.\r\n- You have demonstrated experience with responsive design principles, particularly for creating promotional layouts that work effectively on various devices.\r\n- You have excellent problem-solving skills with a keen attention to detail\r\n- You have strong communication skills and the ability to collaborate effectively with the team\n\r\nCouple of the notes about the role\r\n- This is not a salaried position. This is an Independent Contractor role.\r\n- You must be able to commit at least 8 hours per day, 40 hours per week.\r\n- We require everybody in the team to use Hubstaff (Upgrade to see actual info/) to track hours worked.\n\r\nCompensation - EUR 7.4 ($8) per hour\n\r\nInterview process: initial screening > HR interview > trial task > offer\n\r\nTo apply, please email your resume and cover letter detailing your similar experience to Upgrade to see actual info",
  "skill_requirements": [
    "Shopify"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:32:24.216333",
      "reason": "Job first discovered"
    }
  ]
}