{
  "job_id": "1422814",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-Social-Media-Manager-Graphic-Designer-with-SEO-Expertise-1422814",
  "scraped_at": "2025-07-15T12:26:15.444364",
  "title": "Experienced Social Media Manager & Graphic Designer  with SEO Expertise",
  "type_of_work": "Full Time",
  "salary": "$4/Hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Location: Remote\r\nJob Type: Full-Time?\r\nCompensation: $4/hour (hourly pay, not salary-based)\n\r\nExciting. Dynamic. Urgent.??\n\r\nWe are searching for an Experienced Social Media Ninja & Graphic Art Guru to join our team at Instinctive Branding! You will be working independently while utilizing SocialPilot to monitor  If you're ready to take your social media and design skills to the next level and make a significant impact, this is the opportunity for you!\n\r\nAbout Us:\r\nInstinctive Branding—where creativity meets strategy! We are on a mission to transform brands into unforgettable experiences. If you're a passionate and innovative professional who thrives in a fast-paced environment and knows how to create compelling content that captures attention, we want you to join our team!\n\r\nWhy Instinctive Branding?\r\n* Work Independently: Embrace the freedom of remote work while being a vital part of a collaborative team.\r\n* Dynamic Culture: Be surrounded by forward-thinking professionals dedicated to pushing the boundaries of branding and marketing.\r\n* Transparent Tracking System: We utilize a tracking system to monitor hours worked, allowing you to focus on creativity without worrying about micromanagement.\r\n* Compensation Policy: We compensate teaUpgrade to see actual infombers for actual hours worked, up to 40 hours/week. It is expected that all scheduled hours are actively worked and productive to ensure alignment with our goals.\n\r\nYour Responsibilities:\r\n* Strategic Management: Oversee and grow our social media channels with engaging, on-brand content.\r\n* Content Creation: Craft eye-catching brand-specific graphics, videos, blogs, and other written content.\r\n* Graphic Design: Design digital materials—social media posts, brochures, promotional graphics, etc.\r\n* Video Creation & Reels: Be the go-to creator for short-form video content and reels that drive engagement and go viral.\r\n* SEO Expertise: Use your SEO knowledge (keywords, backlinks) to maximize content reach.\r\n* Analytics & Optimization: Track and refine strategies based on performance metrics.\r\n* Trend Engagement: Stay ahead of trends and jump on viral Upgrade to see actual infonts with timely, brand-aligned content.\r\n* Community Engagement: Cultivate a vibrant, loyal audience through active social listening and engagement.\r\n* Effective Communication: Use Slack, WhatsApp, and Zoom to collaborate with the team clearly and consistently.\n\r\nWhat We’re Looking For:\r\n* Viral Creator: Proven track record of launching viral content—especially video and Reels. Show us your success!\r\n* Video Expert: You must be highly skilled in short-form video content creation, reels editing, storytelling, and understanding audio + visual trends.\r\n* Digital Native: Master of Instagram, TikTok, LinkedIn, Facebook, and YouTube—with smart hashtag and algorithm knowledge.\r\n* Graphic Design Pro: Fluent in Adobe Creative Suite, Canva, CapCut, and other creative tools.\r\n* SEO Savvy: Skilled in writing and optimizing content with keywords, backlinks, and metadata.\r\n* Creative Innovator: You think differently, create boldly, and execute effectively.\r\n* Analytical Mind: Understands how to interpret data and refine content strategy accordingly.\r\n* Community Builder: You make audiences feel like they’re part of something meaningful.\n\r\nWhat to Include in Your Application:\r\n* Years of experience\r\n* Why you’re passionate about social media\r\n* 3 examples of your own social media content:\r\n    * 1 video (Reel or short-form content)\r\n    * 1 static post\r\n    * 1 blog you’ve written\r\n* Rate your level of understanding (1–5) for:\r\n    * Facebook\r\n    * Instagram\r\n    * LinkedIn\r\n    * TikTok\n\n\r\nApply now—we can’t wait to see the magic you’ll bring to our team!",
  "skill_requirements": [
    "Social Media Management",
    "Graphic Design",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:30:22.188311",
      "reason": "Job first discovered"
    }
  ]
}