{
  "job_id": "1422359",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Accountant-1422359",
  "scraped_at": "2025-07-15T15:36:06.171574",
  "title": "Senior Accountant",
  "type_of_work": "Full Time",
  "salary": "750",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Position Summary: Senior Accountants prepare budgets, conduct risk assessments, and can supervise other accounting staff as well. Ensure the integrity of the company’s broader accounting information and processes.  Preparing financial statements, budgets and analyzing budget variances. Implement internal controls, conduct risk assessments, evaluations, and reviews to strengthen the company’s accounting controls. Additionally, they maintain amortization, fixed assets, lease, prepaid and accrual monthly schedules. Senior accounts keep accurate records of both accounts payable and accounts receivable, ensuring that invoices are paid where necessary, and that clients pay invoices as required. Prepare departmental reports, general ledger entries and bank reconciliations.\n\r\nYou will…\r\n? Processing payments (cash receipts) by applying the check stubs to open invoices \r\n? Perform day to day financial transactions, including verifying, classifying, computing, posting, and recording accounts receivables’ data (temporary – 6 months or less)\r\n? Assist, when required, invoicing customers in a timely manner, including invoicing through EDI and portals\r\n? Record daily, weekly, and monthly ACH payments.\r\n? Manage bad debt accounts accordingly. \r\n? Assure prices changes are entered accurately and one time in customer profiles and portals.\r\n? Develop, update and report AR vs AP turnover metric to Director of Finance monthly.\r\n? Prepare and report weekly sales, invoices and dollars, and lost opportunities to Director of Operation’s \r\n? Prepare monthly Bank Reconciliations.\r\n? Prepare and interpret Monthly P&L statements to Director of Finance and President.\r\n? Develop monthly sales report, $’s and Units, by customer to Director of Finance and President.\r\n? Develop Sales margin analysis in $’s by product line to Director of Finance and President. \r\n? Prepare annual budget and quarterly forecast. \r\n? Updates job knowledge by participating in educational opportunities. \r\n? Protects organization’s value by keeping information confidential.\r\n? Works as a team player, covering other responsibilities and miscellaneous tasks as needed when request\n\r\nYou have…\r\n? Bachelor’s degree in accounting. \r\n? 3-5 years’ experience with accounts payable or general accounting\r\n? Ability to demonstrate a thorough understand of the complete accounting cycle\r\n? Proficient Microsoft Office, knowledge, and skills. Strong Excel a must. \r\n? Strong time management and organizational skills\r\n? Knowledge of basic accounting principles\r\n? High degree of attention to detail\r\n? Ability to work independently and prioritize tasks\r\n? Strong analytic abilities\n\r\nYou are...\r\n? Logical, pragmatic and 'data-driven' in your decision-making.\r\n? Curious and in constant search of improvement and learning\r\n? Highly organized, proactive, adaptable, and able to work independently\r\n? Knowledgeable in NetSuite or Oracle systems\r\n? Team player who enjoys leading their team and getting the best out of others\r\n? Attention to detail is your priority, you have a taste for a job well done.\r\n? You are not afraid of a challenge and are able to work in a growing company\r\n? Drive to continuously improve and build processes\n\r\nYou enjoy...\r\n? Working with people – must be a team player and lead by example.\r\n? Working with a team & independently\r\n? Problem solving\r\n? Building teams, coaching, and educating others for growth opportunities\n\r\nThis position will need you... \r\n? Monday through Friday, between 40-50 hours per week mostly between the hours of 8:00am - 5:00pm, with Saturday and Sunday as your days off. *Some weeks require longer hours* \n\r\nThis role demonstrates Goodness Garden’s commitment to a GRWOTH Culture Code\r\nThe GROWTH Culture Code is more than just guidelines; it embodies our passion for continuous improvement, respect, and unity. Here’s how each part inspires us to reach greater heights:\r\n• Greet and acknowledge each other\r\n(Example: Say hello and acknowledge colleagues by name every day, fostering connection and belonging.)\r\n• Respect everyone's contributions\r\n(Example: Value each person's unique insights, actively listen, and collaborate to achieve greatness together.)\r\n• Own your actions\r\n(Example: Take initiative and responsibility, turning challenges into opportunities for growth.)\r\n• Welcome feedback\r\n(Example: Openly seek and graciously receive feedback, using it as fuel for personal and professional development.)\r\n• Treat each other with fairness\r\n(Example: Ensure everyone has equitable opportunities, building an environment of trust and respect.)\r\n• Honor commitments\r\n(Example: Consistently deliver on promises, reinforcing reliability and teamwork.)",
  "skill_requirements": [
    "Accounts Reconciliations",
    "Accounts Payable",
    "Bookkeeping"
  ],
  "is_active": true,
  "status_history": []
}