{
  "job_id": "1422938",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Facebook-Ads-Specialist-1422938",
  "scraped_at": "2025-07-15T14:26:13.335932",
  "title": "Facebook Ads Specialist",
  "type_of_work": "Any",
  "salary": "600",
  "hours_per_week": "15",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Facebook Media Buyer Wanted – $600/month + Performance Bonuses\n\r\nWe’re looking for a skilled and reliable Facebook Media Buyer to join our team!\n\r\nWhat you’ll do:\r\n – Run and scale conversion-focused Facebook & Instagram ads (no lead gen)\r\n – Work closely with our creative team to test and optimize ad creatives\r\n – Analyze performance data and make fast, smart decisions to improve ROAS\n\r\nCompensation:\r\n – $600/month base - 2-3x Hours a Day \r\n – Performance-based bonuses (Up to 200$ a month) \r\n – Remote – Work from anywhere\r\n – Flexible hours – We only care about performance\r\n – Long-term position – We’re looking for someone to grow with us\n\r\nImportant:\r\n We’re looking for someone who knows how to keep things simple and scale profitably using the 1 Campaign Strategy on Facebook Ads.\r\n(Note: If you just send a CV or a long ChatGPT-style message, you’ll be skipped automatically. Read carefully and only include what’s necessary. )\n\n\n\r\nIf you're serious, message my assistant on WhatsApp: Upgrade to see actual info)\n\r\nWhat we’re looking for:\r\n – You’ve worked with eCommerce brands before\r\n – You know exactly how the 1 Campaign Strategy works (and why)\r\n – You’ve got recent proof that you can deliver results (past 30 days)\r\n – You’re comfortable working with strong creatives and testing fast\r\n – You focus on quality over quantity in campaigns\n\r\nTo apply:\r\n – Tell us what the 1 Campaign Strategy is\r\n – Show us results from the last 30 days (screenshots or breakdowns)\r\n – Let us know your rate and how soon you can start\n\r\nLooking forward to seeing your work. Let’s scale something great.\r\nSend my assistant A MESSAGE ON WHATSAPP : Upgrade to see actual info",
  "skill_requirements": [
    "Marketing",
    "Facebook marketing",
    "Facebook Ads"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:39:53.828068",
      "reason": "Job first discovered"
    }
  ]
}