{
  "job_id": "1422555",
  "url": "https://www.onlinejobs.ph/jobseekers/job/n8n-Workflow-Specialist-Join-Our-Automation-Journey-1422555",
  "scraped_at": "2025-07-15T14:40:45.394632",
  "title": "n8n Workflow Specialist - Join Our Automation Journey!",
  "type_of_work": "Gig",
  "salary": "$100-200",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Love building automations that just work? We're looking for an n8n enthusiast to help us connect our tools and streamline our processes!\n\r\nWhat You'll Do\n\r\n• Build and maintain n8n workflows that connect our various SaaS platforms\r\n• Create automations for tasks like data syncing, notifications, and report generation  \r\n• Test workflows to ensure they run smoothly and reliably\r\n• Document your workflows so the team understands how they work\r\n• Collaborate with us to identify new automation opportunities\r\n• Monitor existing workflows and fix any issues that pop up\n\r\nWhat We're Looking For\n\r\n• n8n Experience - You've built real workflows and understand how n8n works\r\n• JavaScript Basics - Comfortable writing simple code snippets when needed\r\n• SaaS Platform Knowledge - Experience connecting popular tools like Slack, Google Sheets, Airtable, HubSpot, etc. using n8n's built-in nodes\r\n• Problem-Solving Skills - You enjoy figuring out how to make different systems talk to each other\r\n• Clear Communication - You can explain what your workflows do in simple terms\n\r\nDon't worry about complex API knowledge or database expertise - we'll support you with the technical deep-dives when needed. We just need someone who loves building workflows!\n\r\nPerfect If You\n\r\n• Get excited about automation possibilities\r\n• Have a knack for spotting repetitive tasks that could be automated\r\n• Enjoy tinkering with workflows until they're just right\r\n• Like helping teams work more efficiently\n\r\nHow to Apply\n\r\nSend us:\r\n• Your resume highlighting your n8n experience\r\n• 2-3 examples of workflows you've built (screenshots or descriptions work!)\r\n• A quick note about which SaaS tools you've connected with n8n\r\n• Your favorite automation win - what did it do and why was it awesome?\n\r\nReady to automate with us? We can't wait to see what you've built!",
  "skill_requirements": [
    "Marketing Automation",
    "Javascript",
    "Make.com"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:21:48.207236",
      "reason": "Job first discovered"
    }
  ]
}