{
  "job_id": "1422277",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422277",
  "scraped_at": "2025-07-14T23:10:11.317528",
  "title": "Brand & Website Designer for Everyday Order",
  "type_of_work": "Gig",
  "salary": "NOT SURE",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "If interested and meet the qualifications, please fill out this form: Upgrade to see actual info \n\r\nWe will reach out in 72 hours and if you have not heard back, unfortunately, we will not be moving forward.\n\r\nAbout Everyday Order:\r\nEveryday Order is one of North Jersey premier professional organizing companies, specializing in creating calm, beautiful, and functional spaces for busy families. We believe an organized home is the foundation for a peaceful life, and we help our clients achieve this through thoughtful systems and stylish, sustainable solutions.\n\r\nAs our business grows into new markets and offerings, we're seeking a skilled and strategic Brand & Website Designer to refresh our brand identity and website experience to better reflect who we are today — and where we’re going.\n\r\nPosition Overview:\r\nWe’re looking for a creative partner to help us elevate our online presence through clean, minimal, lifestyle-forward branding and a user-friendly, high-converting website experience. The ideal candidate has a strong sense of visual storytelling, understands how to market service-based businesses to women, and can confidently lead both brand refinement and web design.\n\r\n Responsibilities:\r\nAudit our existing website and brand materials and recommend updates for alignment, clarity, and conversion.\n\r\nRefine or refresh brand identity — including typography, color palette, photo direction, and tone.\n\r\nRedesign and rebuild our website on Squarespace.\n\r\nAdvise on what types of photos, videos, and brand assets we need for a cohesive site and marketing presence.\n\r\nCollaborate with our founder on site structure, user experience, and page flow strategy.\n\r\nEnsure mobile optimization, SEO best practices, and ease of backend updates for our team.\n\n\r\nIdeal Candidate:\r\nProven experience in brand and web design for lifestyle, home, or service-based brands\n\r\nStrong eye for clean, feminine, minimal, modern design\n\r\nComfortable managing both visual identity and website execution\n\r\nUp to date on current web design trends\n\r\nAbility to manage timelines and deliverables independently\n\n\r\nProject Details:\r\nProject-based contract/Gig\n\r\nEstimated scope: Brand refresh, website redesign",
  "skill_requirements": [
    "Packaging & Brand Idenity Design",
    "Squarespace",
    "Creative Direction"
  ]
}