{
  "job_id": "1422396",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Cold-Caller-Appointment-Setter-1422396",
  "scraped_at": "2025-07-15T15:28:06.369073",
  "title": "Cold Caller / Appointment Setter",
  "type_of_work": "Any",
  "salary": "44,500 - $72,000 PHP Per month Based on experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "** We are seeking candidates who are fluent in English and have a clear, neutral accent suited for American audiences.\n\r\nPlease include a voice recording of the following script- \" Good afternoon. My name is [Candidate’s Name], and I’m calling on behalf of That Company. I hope this message finds you well. I’d like to briefly introduce myself and provide you with some relevant information regarding our services. We specialize in providing tailored digital marketing solutions aimed at enhancing online visibility and driving growth for businesses in various industries. From comprehensive search engine optimization strategies to managing targeted advertising campaigns, we focus on achieving measurable results for our clients.\n\r\nI would like to highlight our approach to understanding each client’s unique challenges. For instance, if a client is struggling to gain traction with a newly launched product, we conduct an in-depth market analysis, identifying potential opportunities and recommending targeted marketing tactics. Our aim is not only to boost immediate visibility but to cultivate long-term success through consistent engagement and strategic planning.\n\r\nWe prioritize clear and consistent communication with our clients, ensuring transparency at every step. Whether it’s sharing detailed analytics reports or explaining the nuances of a complex marketing strategy, we strive to keep our clients informed and confident in our partnership.\n\r\nThank you for taking the time to listen. If you have any questions or require further details about our services, please feel free to reach out. Have a wonderful day!”\n\r\nApplicants without this voice recording will not be selected for a follow up interview\n\r\n--Job Requirements:\n\r\n• Exceptionally High English Proficiency (Written and Spoken)\r\n• American accent Preferred\r\n• Handling incoming and outbound calls and other communications.\r\n• Proactively manage the day-to-day needs and requests from PMs you're assigned to.\r\n• Develop a general understanding of the team’s function\r\n• Respond to calendar scheduling requests and internal/external meeting coordination\r\n• Recording information as needed.\r\n• Updating paperwork, maintaining documents and word processing.\r\n• Aiding with client reception as needed.\r\n• Creating, maintaining, and entering information into databases.\r\n• Ability to write clearly and help with word processing when necessary.\r\n• Warm personality with Great communication skills.\r\n• Ability to work well under limited supervision.\r\n• Monitor email communications, send canned responses, and elevate important messages that need to be responded to correct persons\r\n• Partner with other Vas for coordination and to provide additional support or backup\r\n• Reach out to prospects via phone calls to schedule appointments.\n\r\n---Preferred Skills and Qualities:\n\r\n• Attention to detail and the ability to effectively multi-task in a deadline-driven atmosphere.\r\n• Ability to clearly and effectively articulate thoughts and points\r\n• High levels of integrity, autonomy, and self-motivation.\r\n• Excellent analytical, organizational, project management, and time management skills.\r\n• Tech savvy with expertise in All Microsoft Office Products, Excel, Word, Outlook, and Microsoft Teams especially.\r\n• Heavy calendar management experience\r\n• Handle highly confidential materials with discretion and tact\r\n• Demonstrated ability and willingness to continuously acquire new competencies and accept new challenges\r\n• Extremely organized and able to prioritize and manage multiple projects simultaneously\r\n• Ability to create and understand reports\n\r\n--Requirements:\r\n• Exceptionally High English Proficiency (Written and Spoken)\r\n•Dependable Computer - must be Windows 10 able to run Microsoft Teams and Office 365\r\n•Dependable Internet Connection\r\n•Quiet Working Space\r\n•Able to work Monday thru Friday 8 am - 5 pm EST (8 pm - 5 am PHT)",
  "skill_requirements": [
    "English Speaking",
    "Sales"
  ],
  "is_active": true,
  "status_history": []
}