{
  "job_id": "1422241",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Account-Coordinator-Medical-Billing-1422241",
  "scraped_at": "2025-07-15T13:27:10.126960",
  "title": "Account Coordinator – Medical Billing",
  "type_of_work": "Full Time",
  "salary": "TBA",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Work Type: Full-time | Long-term | Remote | Digital-only\r\nSchedule: Graveyard Shift — Must be willing to work US business hours (California Time, PST)\n\r\nJob Overview:\r\nWe are looking to add a highly detail-oriented, reliable, and organized Account Coordinator to support our Medical Billing account. Our company is based in California, and this is a key role for someone who thrives in a fast-paced environment, enjoys problem-solving, and takes pride in completing tasks efficiently and accurately.\r\nThis is a remote position for someone who is self-motivated, takes ownership of their work, and wants to be part of a dependable, hard-working team.\r\nIf you are someone who does not like to leave tasks unfinished, enjoys working independently while collaborating with a team, and has experience with health insurance or medical claims — we want to hear from you!\n\r\nKey Responsibilities:\r\n ? Manage and process 50+ tickets/emails daily — ensuring all are completed ASAP and no     later than EOD (End of Day)\\\r\n ? Extreme attention to detail and understanding of the medical Revenue Cycle are a MUST\r\n ? Sort, categorize, prioritize, and respond to tickets — escalate to the manager if needed\r\n ? Provide fast and accurate initial responses to all inquiries — escalate if unsure\r\n ? Track progress of all tickets, emails, Teams messages, SMS, and other communications\r\n ? Proactively follow up with teaUpgrade to see actual infombers to keep tickets moving toward resolution\r\n ? Review ticket details and attachments to categorize by department, priority, and escalation needs\r\n ? Maintain clear and organized communication records\r\n ? Health insurance or medical claims knowledge is a must— ability to read insurance documents such as EOBs (Explanation of Benefits)\r\n ? Experience with claim follow-ups or payment posting is a bonus\n\r\nQualifications:\r\n?? Extremely detail-oriented — you notice the small things that others may miss\r\n ?? Comfortable managing high-volume tasks and staying organized under pressure\r\n ?? Strong experience with ticketing systems or task management tools\r\n ?? Excellent written and verbal English communication skills\r\n ?? Fast learner, reliable, and punctual\r\n ?? Able to work independently and coordinate with a team\r\n ?? Strong computer skills — proficiency with Microsoft Office (Outlook, Teams, etc.)\r\n ?? Must be responsible, self-motivated, and eager to complete tasks on time\r\n ?? Health insurance, claims processing, or medical billing experience is preferred\n\r\nThis is a digital-only, remote position. We are looking for committed individuals seeking long-term, stable work with room to grow. You may be required to meet with people over Microsoft Teams, Zoom, etc for alignment meetings, etc.\n\r\nTo Apply:\r\nPlease fill out the following form:  Upgrade to see actual info\r\nThank you, and we will be in contact if we’re interested in you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}