{
  "job_id": "1422746",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Email-Marketing-Specialist-for-Vacation-Property-Management-Company-1422746",
  "scraped_at": "2025-07-15T12:27:10.590203",
  "title": "Email Marketing Specialist for Vacation Property Management Company",
  "type_of_work": "Part Time",
  "salary": "300",
  "hours_per_week": "25",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Vacation Key Property Management is looking for an experienced Email Marketing Specialist to plan, execute, and optimize email outreach campaigns targeting absentee vacation homeowners and realtors across Florida.\n\r\nYour primary goal will be to help us generate qualified leads and build referral relationships by running personalized, high-deliverability email campaigns that highlight our white-glove property management services.\n\r\n????? Key Responsibilities:\r\nDevelop and manage cold email outreach campaigns targeting homeowners and real estate agents.\n\r\nCreate compelling email copy tailored to each audience segment (homeowners vs. realtors).\n\r\nUse email platforms (e.g., Mailmeteor, Brevo, Instantly, etc.) to manage sends and track performance.\n\r\nOptimize email deliverability (SPF, DKIM, DMARC setup, inbox warm-up).\n\r\nMonitor metrics like open rates, click-throughs, and replies — and iterate based on results.\n\r\nMaintain and clean lead lists to maximize engagement and compliance.\n\r\nCoordinate follow-up sequences and automations to nurture leads over time.\n\r\nRecommend and test subject lines, sending schedules, and personalization strategies.\n\r\n???? Qualifications:\r\nProven experience running cold email campaigns for service businesses or real estate.\n\r\nStrong copywriting skills — clear, engaging, and action-driven.\n\r\nKnowledge of email warm-up, inbox health, and domain reputation.\n\r\nExperience with CRM or email automation tools (e.g., HubSpot, Brevo, Instantly, Lemlist).\n\r\nAbility to analyze campaign data and adjust strategies accordingly.\n\r\n???? Bonus Points If You:\r\nHave experience in real estate, vacation rentals, or property management\n\r\nKnow how to segment lists by location, owner type, or property value\n\r\nCan suggest scalable systems to grow email outreach volume without spam risk",
  "skill_requirements": [
    "CRM",
    "Email Marketing",
    "Social Media Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:27:02.729266",
      "reason": "Job first discovered"
    }
  ]
}