{
  "job_id": "1422151",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Content-Social-Media-VA-Copy-Design-Visibility-1422151",
  "scraped_at": "2025-07-14T23:09:23.287749",
  "title": "Content & Social Media VA – Copy, Design & Visibility",
  "type_of_work": "Part Time",
  "salary": "$120 - 240 per month",
  "hours_per_week": "10",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Creative Content VA Wanted – Long-Term Role for a Fast-Growing Online Business!\n\r\nHey there \n\r\nI’m looking for a reliable, creative, and organized Virtual Assistant to help bring our brands to life online. This is NOT just a copy-paste job—I’m looking for someone who thinks like a marketer, takes initiative, and is excited to grow with a purpose-driven business.\n\r\nWe work fast. We care deeply. We celebrate consistency and accountability. TeaUpgrade to see actual infombers stay with me for years—and I want the same for this role.\n\r\nOutcome:\r\nDeliver strategic, scroll-stopping content across Instagram, Facebook, and LinkedIn that drives visibility, engagement, and trust—so we grow our brand and impact without me having to post manually every day.\n\r\nResponsibilities:\r\n• Write engaging captions for Instagram, Facebook, and LinkedIn (using our voice)\r\n• Repurpose long-form content (emails, blogs, videos) into social posts\r\n• Design clean, brand-aligned visuals in Canva\r\n• Schedule posts via Meta Business Suite or similar\r\n• Maintain a content calendar and plan posts ahead (1+ week minimum)\r\n• Optional: reply to DMs, comments, or support light community engagement\r\n• Bonus: support with email campaign formatting or Kajabi blog posts\n\r\nYou’ll Be a Great Fit If:\r\n• You’re fluent in writing for social and can follow tone guides easily\r\n• You have experience managing Facebook, Instagram, and LinkedIn\r\n• You love batching, scheduling, and planning content\r\n• You’re proactive, self-sufficient, and detail-oriented\r\n• You take ownership of deadlines and deliver your best work, consistently\r\n• You want to grow with a business, not just bounce from gig to gig\r\n• You enjoy using AI tools like ChatGPT to brainstorm and outline content ideas\n\r\nWhat’s In It for You:\r\n• Competitive pay\r\n• Respect, flexibility, and growth opportunities\r\n• Stable, long-term work where you’re appreciated\r\n• A boss who values your time and talents\r\n• Long-term opportunity with room to take on more responsibility\r\n• Meaningful work that helps elevate leaders and entrepreneurs\n\r\nHow to Apply:\r\nFill out the application form here: Upgrade to see actual info\r\nYou’ll need to upload:\r\n• A 2–3 minute intro video\r\n• 2–3 samples of content (posts, captions, visuals, reels, or blogs)\r\n• Your Facebook Messenger User ID\r\n• A link to a social account you admire (and why)\r\n• When asked for your favorite social media platform, write: pancakes\n\r\nLet’s build something powerful, authentic, and lasting.\r\n— Aaron",
  "skill_requirements": [
    "LinkedIn Marketing",
    "Canva",
    "Meta Business Suite"
  ]
}