{
  "job_id": "1422075",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Bookkeeper-1422075",
  "scraped_at": "2025-07-14T23:06:27.779849",
  "title": "Bookkeeper",
  "type_of_work": "Full Time",
  "salary": "$1000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Kindly submit your application here: Upgrade to see actual info\n\n\r\nKey Responsibilities:\n\r\n- Maintain books and records of all clients in Quickbooks Online, Upgrade to see actual info, Gusto, Google Drive, Google Sheets, Slack, iMessage and other systems.\r\n- Ensure effective and efficient recording of accounting transactions for all clients.\r\n- Prepares accurate and timely financial statements.\r\n- Maintains tax and financial records\r\n- Monitors adherence to established operating procedures and internal controls.\r\n- Prepares/reviews general ledger accounts to ensure the integrity and accuracy of accounts and develops charts of accounts.\r\n- Manages and performs accounting and month end closings.\r\n- Prepare and deliver 1099s\r\n- Performs other assignments as directed and works on special projects as needed.\n\r\nWhat You Bring:\n\r\n- CPA - a plus but not required\r\n- Bachelors degree in Finance/Accounting or equivalent experience\r\n- 4+ years finance and accounting experience.\r\n- Strong technical skills with finance/accounting systems and advanced in spreadsheets, particularly Google Sheets. \r\n- Quickbooks experience a plus.\r\n- Strong background in day to day management of accounting and finance; able to be tactical as well as strategic and doesn’t mind the day to day “grind”\r\n- Multi-tasker who can get stuff done while balancing multiple priorities\r\n- Strong executive presentation and communication skills\r\n- Analytical, organized and detail oriented\r\n- A “driver” who is constantly seeking to improve systems and processes and create change\r\n- Experience in high growth or start-up organizations is a plus \n\r\nWhat We Offer:\n\r\n- Fully Remote Work Environment\r\n- Flexible Vacation\r\n- Work with brilliant, hard-working, caring people daily",
  "skill_requirements": [
    "Quickbooks",
    "Financial Accounting",
    "Attention to Detail"
  ]
}