{
  "job_id": "1422520",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Interior-Designer-1422520",
  "scraped_at": "2025-07-15T12:31:57.113681",
  "title": "Interior Designer",
  "type_of_work": "Full Time",
  "salary": "$600",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for an experienced and talented Interior Designer who is proficient in Chief\r\nArchitect, SketchUp, or other rendering software to join our team. This role requires a\r\nsolid understanding of interior design principles, along with the ability to work with detailed\r\nfloor plans and spaces. The ideal candidate will have experience working in residential\r\ndesign, with a deep knowledge of materials, color schemes, furniture, lighting, and spatial\r\nplanning.\n\r\nKey Responsibilities:\r\n• Create comprehensive interior design plans and layouts using Chief Architect,\r\nSketchUp, or other 3D rendering software.\r\n• Develop mood boards, color palettes, and material selections to bring each project\r\nvision to life.\r\n• Ensure designs meet all necessary functional, safety, and accessibility\r\nrequirements.\r\n• Maintain project documentation, including design drawings, specifications, and\r\nschedules.\r\n• Create detailed specification sheets for materials, furniture, finishes, lighting, and\r\nother elements of the design.\n\r\nRequired Skills & Qualifications:\r\n• Proven experience in interior design with a strong portfolio of completed projects.\r\n• Expertise in Chief Architect and SketchUp (or other comparable rendering\r\nsoftware).\r\n• Ability to create detailed, high-quality 3D visualizations and floor plans.\r\n• Strong understanding of the American imperial system for design and construction\r\n(inches, feet, etc.).\r\n• Excellent communication skills and the ability to collaborate effectively in a remote\r\nteam environment.\r\n• Ability to manage multiple projects simultaneously and meet deadlines.\r\n• Knowledge of current trends in interior design, furniture, lighting, and finishes.\r\n• Familiarity with basic building codes and regulations in the United States.\r\n• Strong attention to detail and a keen eye for design aesthetics.\r\n• A degree in Interior Design or a related field is required.\n\r\nHow to Apply:\r\nPlease submit your resume, portfolio, a brief cover letter and a short video outlining your\r\nexperience and why you’d be a great fit for this role. In your portfolio, please highlight your\r\nexpertise in Chief Architect or SketchUp and any relevant design work completed. Please\r\nchange the subject line to your name and potential start date.\n\r\nWe look forward to reviewing your application and potentially welcoming you to our\r\ncreative team!",
  "skill_requirements": [
    "3D Design",
    "Attention to Detail",
    "Communication"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:33:43.578168",
      "reason": "Job first discovered"
    }
  ]
}