{
  "job_id": "1422349",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Ecommerce-Video-Editor-1422349",
  "scraped_at": "2025-07-15T12:33:18.138820",
  "title": "Ecommerce Video Editor",
  "type_of_work": "Part Time",
  "salary": "$250-300",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Compensation: $250–$300/month\r\nSchedule: 10–20 hours/week (flexible, async with some deadline alignment)\n\r\nAbout Us\r\nWe’re a U.S.-based women’s clothing brand known for heirloom-quality pieces and thoughtful design. We’re looking for a part-time video editor who can help us create simple, clean, effective video content for Meta ads and social media. No fancy transitions or cinematic flair needed — we care more about speed, flow, and clarity.\n\r\nWhat You’ll Be Doing\r\nCut down longer footage from brand shoots or UGC into 15, 30, and 60-second ads\r\nEdit clips to match our brand tone and reference examples provided\r\nAdd text overlays, light transitions, and basic graphics (if needed)\r\nWork with existing content pillars and brief templates\r\nDeliver 3–6 short-form videos per week for Meta ads and social use\r\nOccasionally organize and rename content libraries for easier access\n\r\nTools We Use\r\nCapCut or Adobe Premiere (we’re flexible)\r\nCanva for text overlays or basic graphics\r\nGoogle Drive for sharing + feedback\n\r\nYou Might Be a Fit If You...\r\nAre a quick, clean editor who doesn’t overcomplicate things\r\nAre fluent in social video formats and short-form timing\r\nCan follow brand references and stick to simple creative briefs\r\nCommunicate well and deliver on deadline\r\nAre comfortable editing content featuring models, clothes, and lifestyle settings\r\nAre flexible, responsive, and happy to work async\n\r\nThis Role Is NOT for You If You...\r\nSpecialize in animation-heavy, effects-driven video\r\nNeed to be told what to do every step of the way\r\nStruggle with consistency, feedback, or async communication\n\n\r\nTo Apply\r\nComplete this application: Upgrade to see actual info",
  "skill_requirements": [
    "Asana",
    "Social Media Video Editing",
    "Video Marketing"
  ],
  "is_active": true,
  "status_history": []
}