{
  "job_id": "1422818",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Bookkeeper-Remote-Full-Time-1422818",
  "scraped_at": "2025-07-15T12:25:39.044360",
  "title": "Bookkeeper (Remote, Full-Time)",
  "type_of_work": "Full Time",
  "salary": "P40,000 - P50,000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role\n\r\nWe are seeking a detail-oriented and experienced Bookkeeper to join our team. In this role, you will be responsible for managing the day-to-day bookkeeping needs of a portfolio of clients, with a focus on accuracy, timeliness, and client service. You'll be working within a supportive team that values collaboration and continuous improvement.\n\r\nKey Responsibilities\n\r\n• Manage end-to-end bookkeeping for a portfolio of clients using Xero and other software.\r\n• Prepare and lodge Business Activity Statements (BAS).\r\n• Handle payroll processing and superannuation obligations as required.\r\n• Maintain detailed and organized work papers and client records.\r\n• Liaise with clients to clarify financial data and improve record-keeping practices.\r\n• Collaborate with accountants to ensure seamless client support and compliance.\r\n• Support general administrative and accounting tasks as needed.\n\r\nQualifications & Experience\n\r\n• Minimum 2-3 years of bookkeeping experience (public practice or similar environment preferred).\r\n• Proficiency in Xero and its ecosystem.\r\n• Bookkeeping or Accounting qualifications highly regarded.\r\n• Experience with Microsoft Office 365, particularly Outlook, Excel, Word, and Teams.\r\n• Familiarity with Australian Taxation and compliance requirements is highly desirable.\n\r\n Why Join Us?\n\r\n• A collaborative and professional work culture.\r\n• Exposure to a diverse range of clients and industries.\r\n• Growth opportunities in a supportive environment.\r\n• Flexible working arrangements available.\n\r\nHow to Apply\n\r\nPlease send your resume and a brief cover letter outlining your suitability for the role.",
  "skill_requirements": [
    "Accounts Reconciliations",
    "Bookkeeping",
    "Tax Preparation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:30:03.773562",
      "reason": "Job first discovered"
    }
  ]
}