{
  "job_id": "1422700",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Executive-Assistant-NIGHT-SHIFT-1422700",
  "scraped_at": "2025-07-15T14:36:11.191754",
  "title": "Full Time - Executive Assistant - NIGHT SHIFT",
  "type_of_work": "Full Time",
  "salary": "Php 65,000 - 115,000",
  "hours_per_week": "30",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Executive Assistant - FULL TIME - NIGHT SHIFT\r\nCompany: Upstack Data\r\nLocation: Remote (Global)\r\nCompensation: 65,Upgrade to see actual info,000 PHP\n\r\nAbout Upstack Data\r\nUpstack Data is a remote-first software company specializing in utilizing data to drive intelligent marketing decisions. We prioritize merit, excellence, and intelligence—focusing on impactful results rather than checkboxes. Our culture thrives on asynchronous collaboration, continuous learning, and customer-centric innovation, enabling our teams to work autonomously while staying highly connected.\n\r\nRole Overview\r\nAs the Chief of Staff at Upstack Data, you will serve as the right hand to our executive leadership, ensuring seamless coordination across strategic priorities, operations, and cross-functional teams. You’ll leverage your organizational acumen to orchestrate key initiatives, streamline decision-making, and help scale the company’s impact. This is a high-visibility role with the potential to significantly influence Upstack Data’s growth trajectory.\n\r\nIf you would like to be considered for this role, you MUST fill out the following application form:\nUpgrade to see actual info\n\r\nWe will only consider completed applications.\n\r\nKey Responsibilities\r\nExecutive Support & Administration\r\nExecutive Support: Provide day-to-day support to the CEO and executive team, including meeting preparation, agenda setting, and follow-up actions, inbox and communications management\r\nCalendar Management: Coordinate complex schedules across multiple time zones, schedule meetings, manage conflicts, and optimize executive time allocation \nEmail Management: Monitor, prioritize, and respond to emails on behalf of executives; draft professional correspondence and maintain organized email systems\r\nTravel Coordination: Plan and book domestic and international travel including flights, accommodations, ground transportation, and detailed itineraries\r\nMeeting Support: Prepare meeting agendas, coordinate logistics, take detailed notes, and manage follow-up action items\r\nDocument Management: Create, edit, and maintain important documents, presentations, contracts, and reports using various software platforms\r\nTechnical Operations & Tool Management\r\nCRM Administration: Manage customer relationships in HubSpot including data entry, pipeline management, contact organization, and reporting\r\nE-commerce Support: Assist with Shopify store operations including product uploads, order management, customer service, and basic troubleshooting \nEmail Marketing: Create and manage email campaigns through various platforms, maintain subscriber lists, and analyze performance metrics\r\nAI Tools Integration: Utilize ChatGPT, Claude, and other AI tools to optimize workflows, generate content, and enhance productivity\r\nData Management: Maintain accurate databases, create reports, and ensure data integrity across all platforms\r\nProject Management & Coordination\r\nTask Prioritization: Manage multiple projects simultaneously, set priorities, track deadlines, and ensure timely completion\r\nTeam Coordination: Facilitate communication between teaUpgrade to see actual infombers, coordinate project timelines, and manage collaborative workflows\r\nProcess Documentation: Create and maintain standard operating procedures (SOPs) for recurring tasks and processes\r\nQuality Assurance: Review work for accuracy, completeness, and adherence to company standards before final delivery\r\nCommunication & Relationship Management\r\nClient Interaction: Serve as a professional point of contact for clients, partners, and vendors via phone, email, and video calls\r\nInternal Communication: Facilitate clear communication between departments and ensure all stakeholders are informed of relevant updates\r\nProfessional Representation: Represent the executive and company with professionalism, discretion, and excellent judgment in all interactions\n\r\nQualifications\r\nExperience:\r\n- 5+ years of experience in strategic operations, project management, or a similar leadership role within a fast-paced, tech-forward environment.\r\n- Exceptional written and verbal communication skills, with the ability to facilitate smooth collaboration in an async, remote setting.\r\n- Adaptability: Comfortable working in a fast-evolving, high-growth environment, balancing multiple priorities with precision.\r\n- Education:\r\nBachelor’s or Master’s degree in Business, Management, or a related field (or equivalent experience).\n\r\nWhy Join Us?\r\nRemote-First Culture: Work from anywhere while staying closely connected through modern collaboration tools.\r\nGrowth Opportunities: Benefit from our merit-based approach and take your career to the next level.\r\nCutting-Edge Environment: Collaborate with forward-thinking professionals dedicated to data, excellence, and relentless innovation.\r\nImpactful Work: Shape the future of data-driven marketing performance for a global client base.",
  "skill_requirements": [
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:42:50.126406",
      "reason": "Job first discovered"
    }
  ]
}