{
  "job_id": "1422065",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-for-Lead-Generation-Podcast-Pitching-1422065",
  "scraped_at": "2025-07-15T11:39:06.054721",
  "title": "Virtual Assistant for Lead Generation + Podcast Pitching",
  "type_of_work": "Part Time",
  "salary": "300",
  "hours_per_week": "12",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us\n\r\nWe’re Biohack The Fat, a fast-growing health and weight loss company helping men and women over 40 lose 30–50 lbs, reverse metabolic issues, and reclaim their energy — without drugs, starvation, or gimmicks.\n\r\nWe’re on a mission to change lives, and we need a Rockstar VA to help get this system in front of more people — through LinkedIn outreach, podcast pitching, and lead generation.\n\r\nRole Overview\n\r\nWe’re hiring a Virtual Assistant to support with:\n\r\n- Searching and messaging potential podcast hosts to pitch our founder\r\n- Researching and connecting with potential licensee candidates (health coaches, nutritionists, fitness pros)\r\n- Sending and managing DM outreach on LinkedIn\r\n- Creating basic tracking spreadsheets and organizing communication\r\n- Helping manage leads and follow-up inside our CRM (Go High Level)\n\r\nSkills & Qualifications\n\r\nTo succeed in this role, you’ll need:\n\r\n1) Strong written English and communication skills\r\n2) Experience with LinkedIn and/or podcast pitching (or ability to learn quickly)\r\n3) High attention to detail and ability to follow SOPs\r\n4) Reliable internet and ability to work independently\n\r\nBONUS: Experience with Go High Level or lead generation\n\r\nHours & Pay\n\r\nStarting at 10–12 hours/week\n\r\n- Flexible schedule (we just need consistency)\r\n- Room to grow into a full-time position\r\n- Starting rate: $3–$5/hour USD (based on experience)\n\r\nHow to Apply\n\r\nIf you're excited to be part of something meaningful and want to grow with a mission-driven team — we’d love to hear from you!\n\r\nPlease email your resume and a short cover letter to: Upgrade to see actual info\r\nSubject line: “I’m Your Rockstar VA – [Your Name]”\n\r\nIn your message, please include:\n\r\n1) Why you’re a great fit for this role\r\n2) Your experience with outreach, lead generation, or LinkedIn\r\n3) One fun fact about yourself ????\n\r\nLooking forward to connecting with you!\n\r\nTrevor Folgering\r\nFounder, Biohack The Fat\nUpgrade to see actual info",
  "skill_requirements": [
    "Sales Support",
    "Lead Generation",
    "LinkedIn Marketing"
  ],
  "is_active": true,
  "status_history": []
}