{
  "job_id": "1422613",
  "url": "https://www.onlinejobs.ph/jobseekers/job/NDIS-Virtual-Assistant-1422613",
  "scraped_at": "2025-07-15T15:37:17.985328",
  "title": "NDIS Virtual Assistant",
  "type_of_work": "Full Time",
  "salary": "Php 40,000 - 50,000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are looking for a reliable and experienced NDIS Virtual Assistant to support our team. You will assist with day-to-day administrative tasks related to the National Disability Insurance Scheme (NDIS), helping to ensure smooth and efficient operations.\n\r\nYour Responsibilities Will Include:\n\r\nRostering & Scheduling:\r\nManage shift changes and cancellations in real time\r\nEnsure client bookings are accurate and rescheduled where needed\r\nCoordinate with support workers and allied health staff on schedule updates\n\r\nGeneral Operations:\r\nMonitor and organise progress notes and documentation\r\nMaintain clear communication with plan managers, clients, and staff\r\nHelp streamline day-to-day admin to reduce workload on the business owner\n\n\r\nWho We’re Looking For:\r\nExperience in NDIS, allied health, or in-home care admin support\r\nConfident using platforms like ShiftCare, Invoice Home, and Xero\r\nHighly organised, proactive, and responsive\r\nSkilled at chasing payments diplomatically and tracking financials\r\nAble to work independently while keeping up with a fast-paced and growing business\r\nComfortable with both client-facing communication and internal coordination\n\r\nThis is a great opportunity to work with a compassionate and community-focused provider that is expanding quickly. You’ll be supporting a hands-on team who are often on the move, so your ability to keep things running smoothly behind the scenes will be highly valued.\n\n\r\nPerks:\r\nFlexible working hours\r\nOne-year contract with job security\r\nPerformance-based rewards and bonuses\r\nSupportive work environment with regular coaching and feedback\r\nOpportunity to grow with the business\r\nHMO coverage for 12 months\n\r\nTo Apply for the Job:\r\nChange the subject line to:\r\n“Ready to Support! I'm your next Virtual Assistant”\n\r\n(Label this answer 1.)\r\nSend the PUBLIC link of your resume and your video or audio intro\n\r\n(Label this answer 2.)\r\nWrite 2–3 sentences explaining why you would like this position and why you believe you would be a good fit for the role.\n\r\n(Label this answer 3.)\r\nBriefly describe your experience with the NDIS industry, including any tools you have used, if applicable.\n\r\n(Label this answer 4.)\r\nShare any experience you have with providing administrative, front-end or back-end support in an NDIS setting.\n\r\n(Label this answer 5.)\r\nProvide your WhatsApp number for communication.\n\r\nMake sure to follow all the steps above. Only applicants who follow instructions precisely will be considered.\n\r\nIf selected, you will be invited to a short Zoom interview (camera required).",
  "skill_requirements": [
    "Administrative Management",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:27:55.286923",
      "reason": "Job first discovered"
    }
  ]
}