{
  "job_id": "1422465",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Specialist-1422465",
  "scraped_at": "2025-07-15T12:33:25.336506",
  "title": "Marketing Specialist",
  "type_of_work": "Full Time",
  "salary": "40,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking a Marketing Specialist with expertise in campaign execution and CRM system development for sister companies in the legal and title settlement industries. This role involves building CRM platforms from scratch, transforming industry content into client-ready communications, and executing targeted campaigns, enabling the CEO to focus on strategic growth. The ideal candidate will be tech-savvy, proactive, and capable of managing dual-company marketing operations without handling legal/settlement documentation. You will be working 40-50 hours per week during US business hours, and get paid weekly. \n\n\r\nKey Responsibilities: \n\r\n- Design and deploy campaigns via tools like Mailchimp, Constant Contact, or Hootsuite\n\r\n- Support email marketing efforts, including preparing and sending newsletters.\n\r\n- Maintain databases in Excel, Google Sheets, or CRM tools. Create pivot tables, track KPIs, and report on campaign health\r\nConduct research on industry trends, competitors, and potential marketing opportunities\n\r\n- Managing and organizing marketing assets, ensuring that all content is up-to-date and easily accessible.\n\r\n- Provide administrative support to the team as needed.\n\n\r\nQualifications:\n\r\n- 2+ years of experience in marketing, experience marketing to real estate professionals (agents, lenders, title agents)\r\n- Experience in various CRM systems (setup, management, data hygiene).\r\n- Experience in email marketing tools (e.g MailChimp, GoHighLevel, Brevo)\r\n- Knowledge of excel spreadsheets and legal software such as Clio, myCase is a plus\r\n- Familiarity with compliance in legal/financial services marketing\n\n\r\nKindly attach your updated CV or save on a Google drive (open for public viewing) before sending your application.",
  "skill_requirements": [
    "HubSpot CRM",
    "Email Marketing",
    "Mailchimp"
  ],
  "is_active": true,
  "status_history": []
}