{
  "job_id": "1422159",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Real-Estate-Assistant-Remote-1422159",
  "scraped_at": "2025-07-15T12:30:42.554101",
  "title": "Virtual Real Estate Assistant - Remote",
  "type_of_work": "Full Time",
  "salary": "600",
  "hours_per_week": "30",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Real Estate Virtual Assistant (Remote – Philippines Only)\n\r\nHours: Approximately 30 hours/week\r\nPay: $5/hour\r\nLocation: Remote (Philippines only)\r\nStart Date: ASAP\r\nLanguage Requirement: Fluent English (spoken and written) – required\n\r\nAbout the Role\n\r\nWe are a top-producing real estate team based in Chicago, affiliated Upgrade to see actual info | Christie’s International Real Estate. We are looking for a reliable, organized, and detail-oriented Virtual Assistant to support our agents with administrative, communication, and transaction coordination tasks. You will be trained directly by our current assistant.\n\r\nKey Responsibilities\n\r\n    Communicate professionally via email and text with clients, attorneys, vendors, and real estate agents\n\r\n    Coordinate property showings and inspections (scheduling often via text, email, or ShowingTime Plus)\n\r\n    Prepare and manage documents using DocuSign\n\r\n    Enter and update property listings and transactions in our MLS and CRM\n\r\n    Organize and track deal progress from contract to close\n\r\n    Assist in maintaining internal systems and databases\n\r\n    Perform general administrative support and team coordination tasks\n\r\nRequired Skills and Qualifications\n\r\n    Fluent English (written and spoken) – must be confident and professional in client-facing communication\n\r\n    Prior experience as a virtual assistant (real estate background preferred but not required)\n\r\n    Organized, detail-oriented, and responsive\n\r\n    Tech-savvy with the ability to learn new systems quickly\n\r\n    Consistent internet connection and a quiet remote work setup\n\r\nPlatforms You Will Use\n\r\n    Follow Up Boss (CRM)\n\r\n    DocuSign\n\r\n    MLS systems\n\r\n    Outlook\n\r\n    Google Drive\n\nUpgrade to see actual info\n\r\n    ShowingTime Plus (one of several scheduling tools)\n\r\nHow to Apply\n\r\nPlease submit the following:\n\r\n    Brief introduction\n\r\n    Resume or OnlineJobs.ph profile\n\r\n    Screenshot of internet speed\n\r\n    List of tools and platforms you’ve used\n\r\n    Availability (days/times per week)\n\r\nApplicants must be based in the Philippines and fluent in English. We're seeking someone dependable, proactive, and eager to grow with our team. If that sounds like you, we look forward to your application.",
  "skill_requirements": [
    "Communication",
    "Organization",
    "Technology Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:29:27.448102",
      "reason": "Job first discovered"
    }
  ]
}