{
  "job_id": "1422398",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Bookkeeper-Remote-USA-1422398",
  "scraped_at": "2025-07-14T23:09:46.457198",
  "title": "Bookkeeper (Remote USA)",
  "type_of_work": "Full Time",
  "salary": "$550 - 600",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About the Role\r\nWe are looking for a motivated candidate who pays attention to detail and is extremely organized. As a Bookkeeper for Everylite, you will own A/R and A/P responsibilities, manage the company billing process, and be accountable for maintaining accurate records. In this role, you’ll ensure that every invoice, payment, and ledger entry tells the true story of our growth—because, after all, numbers sing when managed well.\n\r\nKey Responsibilities\n\r\nAccounts Receivable (A/R):\n\r\n* Generate and send invoices in a timely manner.\r\n* Follow up on outstanding balances—gently, but firmly—so we get paid on time.\r\n* Reconcile incoming payments, matching them to open invoices.\n\r\nAccounts Payable (A/P):\n\r\n* Review vendor bills for accuracy and proper coding.\r\n* Prepare and process payments (checks, ACH, etc.) according to payment schedules.\r\n* Communicate with vendors to resolve discrepancies—think of it as shepherding invoices to their happy ending.\n\r\nBilling & Invoicing Process:\n\r\n* Oversee the end-to-end billing cycle, from data entry to final reconciliation.\r\n* Confirm that job costs and project milestones are billed correctly—because nobody likes surprises (except maybe birthdays).\r\n* Collaborate with Sales and Operations to ensure billing data matches contractual terms.\n\r\nGeneral Ledger & Reconciliation:\n\r\n* Post journal entries, including month-end and year-end adjustments.\r\n* Reconcile bank statements, credit card statements, and balance sheet accounts each month, ensuring every penny is accounted for.\r\n* Prepare and maintain schedules for fixed assets and depreciation.\n\r\nFinancial Reporting Support:\n\r\n* Assist Controller or CFO with monthly financial close tasks—closing the books isn’t glamorous, but it’s crucial.\r\n* Generate basic reports (A/R aging, A/P aging, cash flow projections) to keep leadership informed.\r\n* Provide ad hoc analyses on cash position, overdue receivables, and vendor payment trends.\n\r\nProcess Improvement & Documentation:\n\r\n* Identify opportunities to streamline billing and payment procedures—because efficiency is the backbone of accuracy.\r\n* Document standard operating procedures (SOPs) for A/R, A/P, and billing workflows.\r\n* Train and support teaUpgrade to see actual infombers on best practices: spreadsheets should be tamed, not feared.\n\r\nCompliance & Controls:\n\r\n* Maintain proper backup for all financial transactions.\r\n* Work closely with external auditors during quarterly or annual reviews.\r\n* Ensure internal controls are followed to prevent errors or fraud—think of yourself as the guardian of our financial integrity.\n\r\n---\n\r\nQualifications & Skills\n\r\nExperience:\n\r\n* 2+ years of hands-on bookkeeping experience, preferably in a small to mid-sized manufacturing or distribution environment.\r\n* Proven track record managing both A/R and A/P cycles from start to finish.\n\r\nTechnical Proficiency:\n\r\n* Strong working knowledge of QuickBooks (Online or Desktop) or Excel.\r\n* Advanced proficiency in Microsoft Excel (VLOOKUP, pivot tables, basic macros).\r\n* Comfortable learning new systems—RFQs have nothing on your spreadsheet skills.\n\r\nAttention to Detail & Organization:\n\r\n* Meticulous data entry—typos in ledgers are your kryptonite.\r\n* Ability to juggle multiple month-end tasks without breaking a sweat.\r\n* A systematic approach: checklists, clear file naming, version control—old-school rigor meets modern efficiency.\n\r\nCommunication & Teamwork:\n\r\n* Clear verbal and written communication. You’ll chat with sales reps, vendors, and the finance team alike.\r\n* Comfortable asking questions and escalating issues when needed—better to clarify than to replicate errors.\r\n* A can-do, collaborative attitude; numbers are serious business, but you know teamwork keeps things moving.\n\r\nEducation & Certifications (Preferred):\n\r\n* Associate’s or Bachelor’s degree in Accounting, Finance, or related field, or equivalent professional experience.\r\n* Certification such as QuickBooks ProAdvisor or a bookkeeping certificate is a plus.",
  "skill_requirements": [
    "Quickbooks",
    "Bookkeeping",
    "Microsoft Excel"
  ]
}