{
  "job_id": "1422812",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Global-Healthcare-Recruiter-1422812",
  "scraped_at": "2025-07-15T15:33:29.209814",
  "title": "Global Healthcare Recruiter",
  "type_of_work": "Full Time",
  "salary": "Php 80,000 starting",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking an experienced and strategic Global Healthcare Recruiter to lead international hiring efforts across key healthcare markets—including the United States, United Kingdom, Canada, Middle East, and Australia. This is a high-impact role that not only involves end-to-end recruitment of top-tier healthcare professionals but also offers the opportunity to lead and grow a recruitment division. The ideal candidate is a self-starter with deep healthcare industry insight, global recruitment experience, and the drive to build scalable, high-performing recruitment operations.\n\r\nKey Responsibilities\r\nSource, screen, and qualify experienced nurses and allied health professionals for placements in hospitals and healthcare systems across multiple international markets.\n\r\nEvaluate candidates’ credentials, licensing, certifications, and compliance with region-specific healthcare standards and immigration requirements.\n\r\nConduct thorough interviews to assess clinical competence, professional background, and cultural adaptability.\n\r\nCollaborate with internal stakeholders and hiring partners to present top-tier talent tailored to market needs.\n\r\nBuild, manage, and scale a recruitment pipeline that supports international hiring goals across diverse time zones.\n\r\nLead and mentor a team of recruiters as the division grows, helping to define performance metrics and recruitment strategy.\n\r\nTake ownership of the recruitment function, including planning, reporting, and optimization of sourcing channels.\n\r\nUtilize advanced sourcing strategies including global job boards, healthcare talent pools, digital marketing, and professional networks.\n\r\nQualifications\r\nMinimum 5 years of experience in healthcare recruitment, with a strong background in international hiring across at least two of the following markets: U.S., U.K., Canada, Middle East, or Australia.\n\r\nIn-depth knowledge of licensing, credentialing, and immigration processes for international healthcare professionals.\n\r\nProven leadership experience or strong interest in leading a recruitment team or division, with the ability to set goals, mentor others, and drive performance.\n\r\nA self-starter with excellent judgment, initiative, and the ability to operate independently while aligning with broader business goals.\n\r\nResults-driven and competitive, with a strong track record of meeting or exceeding hiring targets.\n\r\nExceptional interpersonal and communication skills, with cultural sensitivity and a global mindset.\n\r\nProficiency in applicant tracking systems (ATS) and sourcing platforms is essential.\n\r\nComfortable working in a fast-paced, remote, performance-based environment.\n\r\nWillingness to work night shifts to accommodate global time zones.\n\r\nAvailability to work during Philippine holidays, as needed.\n\r\nReady to take the lead in global healthcare recruitment?\n\r\nApply now and help us build the future of international clinical staffing.",
  "skill_requirements": [
    "Recruiting",
    "Healthcare",
    "Applicant Tracking Systems"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:34:05.472197",
      "reason": "Job first discovered"
    }
  ]
}