{
  "job_id": "1422551",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-1422551",
  "scraped_at": "2025-07-15T12:24:19.850612",
  "title": "Video Editor",
  "type_of_work": "Full Time",
  "salary": "PHP 15000 - 35000",
  "hours_per_week": "38",
  "date_updated": "Jul 14, 2025",
  "job_overview": "What you’ll do\n\r\n• Receive raw footage from our in-house team, then edit, colour-grade and master it for YouTube, Instagram, TikTok, reels and paid ads.\r\n• Craft short-form and long-form cuts that showcase products, builds, customer stories and events.\r\n• Add motion graphics, titles, sound design and basic VFX to keep viewers hooked.\r\n• Ensure videos are optimised for various platforms in terms of format, length, and content style.\r\n• Maintain a consistent DMW look, feel and tone across all assets.\r\n• Stay ahead of editing trends, transitions and effects, proposing fresh ideas to the marketing squad.\r\n• Manage multiple projects, revisions and deadlines in a cloud-based workflow (we use Upgrade to see actual info).\n\r\nWhat skills you should have (We are happy to train you!!)\n\r\n• Exposure to Premiere Pro, Final Cut or DaVinci Resolve.\r\n• An understanding of video production processes (pre-production, shooting, editing, post-production).\r\n• Ability to organise large media libraries and work asynchronously with a distributed team.\r\n• Excellent written English and proactive communication—time-zone differences don’t slow you down.\n\r\nBonus skills you might have.\n\r\n• Basic colour-grading skills and LUT creation.\r\n• Familiarity with motion-graphics tools would be great. (After Effects preferred)\r\n• Experience editing automotive, action-sports or outdoor lifestyle content.\r\n• Knowledge of YouTube SEO and social-video analytics.\r\n• Graphic-design abilities in Photoshop/Illustrator.\n\r\nWhy you’ll love working with us\r\n• Reliable Salary, 13th month, medical and a possible annual performance bonus.\r\n• We supply or subsidise the hardware/software licences you need to be lightning fast.\r\n• Clear briefs, quick feedback loops and a friendly, no-ego team that values creativity.\r\n• See your edits inspire a growing community of 4x4 and adventure enthusiasts.\n\n\r\nApplication Test :\n\nUpgrade to see actual info\n\r\nYou will need to copy this document and send via email.",
  "skill_requirements": [
    "Video Editing",
    "Social Media Video Editing",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:34:52.314869",
      "reason": "Job first discovered"
    }
  ]
}