{
  "job_id": "1422569",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Part-Time-Virtual-Assistant-for-New-Start-Up-1422569",
  "scraped_at": "2025-07-15T12:36:56.042841",
  "title": "Part-Time Virtual Assistant for New Start-Up",
  "type_of_work": "Part Time",
  "salary": "$200-$400",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Opportunity to begin part-time with a new start-up ... QueerBoss ... with the potential to convert to full-time in the future. \n\r\nOverall scope of QueerBoss Virtual Assistant responsibilities:\n\r\n# Funnel & Website Building\r\n- Building sales funnels and multi-page websites (dUpgrade to see actual info between GoHighLevel and Kajabit now)\r\n- Creating and optimizing landing pages and sales pages\r\n- Managing, editing, and organizing client information, funnels, and pipelines\n\r\n# Automation & CRM\r\n- Creating workflow automations for payment processes, lead nurturing, and marketing promotions\r\n- Manage leads, respond to inquiries, and build CRM pipelines\r\n- Effective use of AI tools that help build professional content at scale\n\r\n# Email Marketing & Copywriting\r\n- Writing and designing email templates and marketing campaigns\r\n- Drafting SEO-optimized captions, descriptions, and blog posts\r\n- Copywriting for captions, promotions, and event materials\r\n- Managing email outreach and follow-ups for guest posting and marketing\n\r\n# SEO & Digital Marketing\r\n- Implementing SEO strategies on sales pages, websites, and blogs\r\n- Writing and proofreading SEO-optimized blog posts and articles\r\n- Adding metadata, layouts, and copyright-free images to support SEO\n\r\n# Video Editing & Content Creation\r\n- Editing short-form and long-form videos and reels using Descript, CapCut, Adobe Premiere Pro\r\n- Designing and implementing membership courses (documents, quizzes, resources)\r\n- Transcribing videos using Descript for captions or blog repurposing\n\r\n# Social Media Management & Design\r\n- Creating, scheduling, and posting content across platforms using GHL or other tools\r\n- Designing graphics, infographics, posters, and presentations in Canva\r\n- Managing events, groups, inquiries, and social media pages\n\r\n# Research, Writing & Administrative Tasks\r\n- Researching topics for content, captions, SEO, and design\r\n- Creating ebooks (content, layout, design, formatting)\r\n- Managing spreadsheets, templates, and organizing assets\r\n- General virtual assistant tasks\r\n- Content formatting, proofreading, and client support\n\r\nInitial projects to be completed:\n\r\n- Build initial website landing pages in GHL\r\n- Build initial offer funnel and email automations in GHL\r\n- Edit course videos (add branded intro, cut and edit for final publication)\r\n- Create captions fo courses\r\n- Build social brand awareness (create posts, reply to DMs/comments, etc)\r\n- Effective use of AI tools\n\r\nApplicants must be an LGBTQ+ ally and comfortable supporting the community. QueerBoss is an online professional development course community for the LGBTQ+ community.\n\r\nLooking for someone willing to work hourly for approximately $3.00 to $5.00 USD / hour as we build up to a full-time position. Number of hours per week will vary on work.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Clickfunnels",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:22:44.483457",
      "reason": "Job first discovered"
    }
  ]
}