{
  "job_id": "1422070",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-1422070",
  "scraped_at": "2025-07-15T11:33:34.944811",
  "title": "Executive Assistant",
  "type_of_work": "Full Time",
  "salary": "$800",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Position: Executive Assistant\n\r\nJob Description:\r\n- Virtual Meeting Coordination: Schedule, set up, and manage virtual meetings and video conferences, including client touch bases and discovery calls.\r\n- Communication Management: Handle phone calls and SMS via the company’s direct line, ensuring timely, professional communication.\r\n- Email and Calendar Management: Oversee and manage email correspondence, calendar scheduling, and appointments for the founders.\r\n- Client Relations and Support: Act as the primary point of contact for my clients, addressing their needs and resolving queries efficiently.\r\n- Administrative Support: Provide comprehensive administrative support to our operations department\r\n- Contract Management: Draft, send, track, and manage client contract agreements and ensure all necessary documentation is in place.\r\n- Lead Management: Actively engage in lead nurturing to ensure a warm pipeline of potential clients.\r\n- Social Media Assistance: Collaborate with the marketing team to manage social media accounts and contribute to ongoing campaigns.\r\n- Project Support: Assist the founders with various tasks, projects, and ad-hoc assignments as needed.\n\r\nPreferred Qualifications:\r\n- Lead mining experience using Linkedin and Sales Navigator\r\n- Proficiency with project management tools (e.g., Asana, Trello)\r\n- Familiarity with remote work tools and best practices\r\n- Experience in a remote administrative or virtual assistant role\r\n- Ability to manage additional duties and special projects as assigned\r\n- Strong command of communication and collaboration platforms (e.g., Zoom, Microsoft Teams, Slack, Google Workspace)\r\n- Excellent written and verbal communication skills\r\n- Outstanding organizational and time management skills\r\n- Strong attention to detail and accuracy\r\n- Use AI tools like Chatgpt and Google Gemini for day-to-day work\r\n- Ability to work independently, prioritize tasks, and meet deadlines\r\n- Demonstrated discretion and confidentiality in handling sensitive information",
  "skill_requirements": [
    "Project Management",
    "Administrative Support",
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": []
}