{
  "job_id": "1422152",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422152",
  "scraped_at": "2025-07-14T23:08:44.370404",
  "title": "Social Media Specialist VA",
  "type_of_work": "Full Time",
  "salary": "starts Php46,000/month+ ($5/hr), with possibilities of raises tied to your spectacular performance or experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "This is a full-time remote role for a Social Media Specialist VA. He/She will be responsible for managing our social media accounts, creating engaging social media content, assisting with implementing digital marketing strategies, and communicating with the target audience to increase brand awareness and drive engagement.\n\r\nWork Hours and Schedule: Mon-Fri, 8am-5pm MST/MDT (40 hours per week)\r\nRate: Starts at $5/hour, negotiable if you have notable experience, with raise for visible results and good performance. \n\r\nYour Role:\n\r\n-Oversee and maintain our presence on Facebook, Instagram, Pinterest, YouTube, Houzz, and X, ensuring consistent scheduled posting and engagement with our audience.\r\n-Produce content and captions tailored to each platform's audience, including posts, graphics, videos, and other multimedia elements. Minimal graphic work.\r\n-Edit and enhance photos and videos to maintain a cohesive brand image and maximize engagement on social media platforms. Videos and images are provided.\r\n-Produce walkthrough videos showcasing our products, services, or brand stories to engage and captivate our audience.\r\n-Monitor and analyze insights, dashboards, and analytics to assess the performance of our social media efforts. \n\n\r\nQualifications:\n\r\n-Proven experience managing social media accounts and creating engaging content\r\n-Ability to develop visually appealing and engaging content that resonates with our target audience.\r\n-Proficiency in any photo and video editing software and familiarity with social media management tools.\r\n-Ability to interpret social media analytics and derive actionable insights to improve performance and inform strategic decisions.\r\n-Strong written and verbal communication skills, with the ability to collaborate effectively with teaUpgrade to see actual infombers, audience, and stakeholders.\r\n-Must have own PC/Laptop \r\n-Must be willing to use Hubstaff for time tracking for pay\n\n\r\nCompany Description\n\r\nEstablished in 1996, Old World Stone Imports (OWSI) Flooring & Design, has become one of Utah’s top distributors for flooring and home design. Originally known for its Travertine stone expertise, OWSI offers complete home solutions, from design consultations to materials and installations. With a vast inventory and a trusted network of expert installers, we provide everything from natural stone, hardwood, tile, countertops, lighting and more. Our dedicated team ensures a seamless experience for builders, designers, and homeowners alike.\n\r\nFounded in 2020 in Orem, Gemstone Development LLC specializes in high-end residential and commercial construction projects. Backed by the expertise of OWSI Flooring & Design and LG Concrete LLC, we offer a complete range of services, from ground-up construction to finishing details. With over two decades of experience through our partner companies, we provide quality craftsmanship, affordable solutions, and seamless project execution, ensuring clients achieve their dream homes or projects.\n\n\r\nAdditional Information:\n\r\nThis is a full-time position, home-based/remote.\r\nPortfolio required, can be past work or personal work.\n \nEmail Applications with Resume/CV or portfolio links HERE or to Upgrade to see actual info with the subject line \"Let's be amazing! - Social Media Specialist VA\"\n\r\nPlease take a Upgrade to see actual infont to get to know the company a little better before applying by using the following links:\n\nUpgrade to see actual info\nUpgrade to see actual info\nUpgrade to see actual info\nUpgrade to see actual info\n\n\r\n#tile #wood #carpet #flooring #lighting #design #construction #homeimprovement",
  "skill_requirements": [
    "Social Media Management",
    "Social Media Video Editing",
    "Photo Editing"
  ]
}