{
  "job_id": "1422444",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Graphic-Designer-1422444",
  "scraped_at": "2025-07-15T12:33:33.207147",
  "title": "Full-Time Graphic Designer",
  "type_of_work": "Full Time",
  "salary": "$800/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a fast-growing, dynamic company seeking a dedicated full-time Graphic Designer to join our global operations team. This role demands focus, commitment, and creativity. We are looking for individuals ready to bring their skills to a collaborative environment, where you’ll work directly with our operations team based in the Philippines using Asana for task management. We provide all the tools you need to succeed.\n\r\nPlease Note: This role requires strict alignment with U.S. working hours from 8 AM to 5 PM. Your availability and responsiveness during these hours are mandatory.\n\r\nKey Responsibilities:\r\n• Create and design a range of digital assets, including social media graphics, banners, infographics, and more.\r\n• Work on presentations, utilizing your expertise in PowerPoint (PPT) and Google Slides to produce visually compelling and on-brand materials.\r\n• Collaborate with the global team to ensure all designs meet brand standards and project goals.\r\n• Maintain consistent availability and responsiveness during work hours, adhering strictly to deadlines.\r\n• Provide innovative solutions and input for design-related projects.\r\n• Ensure continuous project updates through Asana.\n\r\nRequirements:\r\n• Proven experience as a graphic designer (portfolio required).\r\n• Proficiency in design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign, etc.).\r\n• High attention to detail, creativity, and strong visual design sense.\r\n• Proficiency in PowerPoint (PPT) and Google Slides for creating impactful presentations.\r\n• Strong communication skills and ability to work with a global team.\r\n• Ability to follow brand guidelines and produce consistent, high-quality designs.\n\r\nIMPORTANT: This role requires your full commitment during allocated hours, no other jobs, side projects, or freelance work during your shift. We value dedicated individuals, and job-hoppers or side hustlers need not apply.\n\n\r\nWhat We Offer:\r\n– Competitive pay of $5.00/hour with a bonus and raise structure after the first year.\r\n– Recognition of the 13th month bonus.\r\n– All tools and resources needed for the job.\r\n– A fast-growing, dynamic work environment with opportunities for growth and impact.\n\n\r\nIf you are dedicated, creative, and committed to growing with a dynamic team, we encourage you to apply. Join us and make a lasting impact through your design work!",
  "skill_requirements": [
    "Photoshop",
    "Graphic Design",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": []
}