{
  "job_id": "1422748",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Application-New-User-Support-Client-Relations-1422748",
  "scraped_at": "2025-07-15T15:41:03.699689",
  "title": "Application New User Support Client Relations",
  "type_of_work": "Part Time",
  "salary": "PHP 20000 - PHP 30000",
  "hours_per_week": "60",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Hopee is an innovative e-commerce distribution platform built in official partnership with Shopee and Temu. It is scheduled to launch on both Google Play and the Apple App Store in this July.\n\r\nI. What Makes Hopee Unique:\r\n• Exclusive Shopping Rebates – Hopee offers products at prices noticeably lower than market average, with every completed purchase earning users 3% to 5?shback.\r\n• Engaging Social Community – The platform features an in-app space called “Square”, where users can connect, share content, and interact based on common interests.\n\r\nRole: Platform New User Support Assistant/Agents\r\nWork Setup: Fully remote (Applicants must be based in the Philippines)\n\r\nII. Main Duties:\r\n• Provide assistance to users in understanding and effectively using the Hopee app and all its features.\r\n• Respond promptly and clearly to questions, helping users resolve issues in a friendly and professional manner.\r\n• No need to source or invite new users—all users will be acquired through the company’s own marketing efforts.\n\r\nIII. Compensation & Work Details\r\n• Schedule: Daily (Flexible working hours)\r\n• Mode: 100% remote work (Philippines only)\r\n• Monthly Earnings: Basic salary 500 pesos//day (we have daily performance expectations or quotas in place to ensure productivity, which is standard for all part-time roles in our company).\r\nWe can assure that you will earn PHP 20,000/mo. above, including performance-based incentives and commissions\r\n• Note: All work hours are fully paid. We do not require unpaid trial tasks or sample work.",
  "skill_requirements": [
    "Telemarketing",
    "Customer Support",
    "Customer Support Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:32:31.164512",
      "reason": "Job first discovered"
    }
  ]
}