{
  "job_id": "1422358",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Insurance-Verification-Specialist-1422358",
  "scraped_at": "2025-07-15T15:40:23.601331",
  "title": "Insurance Verification Specialist",
  "type_of_work": "Full Time",
  "salary": "$5.25/hr",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Company Background:\r\nA quickly growing real estate investment company is seeking a new teaUpgrade to see actual infomber to help guide families through the process of purchasing their forever home. We pride ourselves on helping them by solving a problem they didn’t think there was a solution for.  We have had people cry because they were so thankful that we purchased their house or sold them a home.  We also help people buy a home that wouldn’t qualify for a traditional bank loan.  It is an excellent and exciting feeling!\n\r\nOur positions do not require prior real estate experience because we will slowly teach the industry.  We have a hard-working yet fun and energetic team that is mainly remote-based.  We spend time on professional and personal development for all employees and end the week with Dad Joke Fridays.\n\r\nThis is an excellent opportunity to learn more about the real estate industry and the non-retail method of buying and selling properties.  You will work closely with the business owner and take on more responsibilities over time.  We are only looking for a full-time role but are flexible with our work schedule as we don’t track sick or time off days, you are a professional and would be treated that way.  \n\r\nJob Description:\r\nAs our Insurance Verification Specialist, you will use your strong communication skills with buyers and tenants to refine their insurance needs.  After the disposition team sells a property, you will manage the intricate details with the homeowner/tenant, mortgage company, and insurance provider.  This role requires attention to detail and good problem-solving skills as you will be helping people through one of the most stressful activities of their lives: buying their family home.\n\r\nWith your strong analytical skills, you will review and verify policies, ensuring accuracy and compliance throughout transactions, and be the single point of contact for both the buyer/tenant and the loan servicing company. You will be responsible for maintaining an up-to-date record of tasks in Salesforce, our CRM.\n\r\nWe are looking for someone who is detail-oriented and dedicated and possesses excellent organizational skills. The more experience you have in real estate, the better, but it is not required for this role.  We will conduct on-the-job training as you grow into the role over time.  \n\r\nMessages from current teaUpgrade to see actual infombers: Here is a collection of short videos from existing teaUpgrade to see actual infombers on their thoughts on working with us.  We pride ourselves on our culture and would love to add you to our team:  Upgrade to see actual info \n\r\nResponsibilities and Duties:\r\n* Enter insurance details into Salesforce\r\n* Communicate with Insurance companies to update records and manage claims\r\n* Provide borrowers with a list of insurance agents and assist in obtaining coverage\r\n* Manage insurance renewals by communicating with borrowers and renters\r\n* Serve as a liaison between all parties involved, establishing effective communication channels until closing.\r\n* Maintain an updated record of all completed tasks in the Salesforce CRM\r\n* Organize and maintain document filing in our database.\r\n* Update the seller's insurance contact details for our records.\r\n* Obtain insurance quotes from agents for newly contracted properties.\r\n* Cancel the seller's insurance policy after closing and ensure the refund is sent to our designated mailing address\r\n* Secure new insurance policies for newly purchased properties.\r\n* Build training guides to outline all processes you complete regularly\r\n* Perform a variety of other miscellaneous tasks\n\r\nPerks:\r\n* $5.25/hr ($10,920/year)\r\n* $50.00 Bonus when you help onboard a new loan\r\n* Health Insurance\r\n* Flexible work schedule\r\n* 13th month pay\r\n* We want to make sure you are well compensated for your work efforts and are only looking for full-time employees.\n\r\nQualifications\r\n* Bachelor’s Degree\r\n* VA experience for at least 2 years\r\n* Attention to detail across all projects\r\n* Fluent in English - written and verbal\r\n* Proficient with Google Drive/Docs/Sheets, Salesforce, Dropbox, and Slack\r\n* Familiar with Mac; if you don't have one, we can help you get one if so desired \r\n* Consistent, reliable, and fast internet connection\n\r\n---------------\n\r\nWhy should you join us over anyone and everyone else? \r\n1) Steady paycheck with the chance for bonuses based on performance \r\n2) Opportunity to work from home without a boss breathing down your neck \r\n3) Team environment where you work with others to share the workload\n\r\nHow do you know if you’re qualified for this opportunity? \r\nWe don’t care if you have prior experience in the real estate field.  We can teach you everything you need to know about our clients and our field so you can excel at your job.  We can teach anyone with a good attitude who is self-motivated for more.  These are things you must demonstrate in the interview process. \n\r\nThe working hours? \r\nAs I stated before, our company is based in Texas, so we require you to work during US business hours, preferably 9:00 AM to 5:00 PM CST (with an hour off for lunch) or 10:00 AM to 6:00 PM CST.  There is some flexibility here, but you would interact with us during business hours and follow up with U.S. companies and families living in the Central Standard Time zone.\n\r\nWhat about pay?\r\nWe are serious about hiring someone and are looking to fill this position ASAP.  I also want this to be a real job that can meet your financial needs.  We pay your 13th month pay, bonuses, annual pay increases, etc. \n\r\nWhat about the 13th Month? \r\nDo we pay the 13th month?  Of course, we do.  It’s part of Filipino culture, and we want to be a part of it too. We pay half of the 13th month in the 3rd quarter for school supplies, etc., for your kids (or whatever else you choose) and the other half right before Christmas. \n\r\nWhat happens next? \r\nSince our jobs are so popular, we generally get deluged with applicants.  So, I have designed a multi-part interview process to make the process simple and efficient for all parties.  \n\r\nThe first part of the interview process is designed to examine your English-speaking & writing skills, personality type, internet speed, and ability to follow directions. Please be advised that those who submit incomplete applications will be ignored.\n\r\nIf you make it through this first round, we will talk via video chat to answer any questions and get to know you better. \n\r\nWe will then ultimately hire someone, potentially you!!!\n\r\nHow to Apply:\r\nTo submit your application for the job, please complete all of the following and email them to us at Upgrade to see actual info Please complete this quick assessment, as it will be our primary initial qualification: Upgrade to see actual info\r\n2. Video yourself looking at the camera and explain why you would be a good fit for this position. Then, send me a link to see your video. \r\n3. Perform an Internet speed test at Upgrade to see actual info, send a screenshot of your results, and include them in your email with the video.\r\n4. Along with your resume, send us the names of at least 3 references we can contact who would say good things about working with you.  This could be a priest, former employer, bank manager, school teacher, or anyone.  No more than 1 of these people can be a family member.",
  "skill_requirements": [
    "Home Insurance",
    "Attention to Detail",
    "Claims Processing"
  ],
  "is_active": true,
  "status_history": []
}