{
  "job_id": "1422784",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-Premier-Pro-Specialist-1422784",
  "scraped_at": "2025-07-15T14:41:31.534709",
  "title": "Video Editor - Premier Pro Specialist",
  "type_of_work": "Full Time",
  "salary": "45000 PHP",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Looking for a hard working, detail-obsessed video editor who lives and breathes Adobe Premiere Pro.\r\nYour role will be to cut high-quality video ads (including Meta, YouTube and TV streaming) that are visually striking, emotionally engaging, and designed to sell.\n\r\nResponsibilities:\r\n- Edit raw footage or AI generated clips into compelling short-form ads (15s, 30s, 60s) using Adobe Premiere Pro\r\n- Create multiple versions for different platforms (Meta, YouTube, TV, etc.)\r\n- Sync footage with voiceover, SFX, and licensed music\r\n- Add transitions, typography, simple motion graphics and pacing to match ad strategy \r\n- Colour grade and audio balance clips to a professional finish\n\r\nWork fast, take feedback well, and meet deadlines. \n\r\nRequirements:\r\n- Expert in Adobe Premiere Pro (After Effects is a bonus)\r\n- Portfolio showcasing ad-style editing — ideally in luxury, lifestyle or digital brands. \r\n- Strong eye for composition, pacing, and tone\r\n- Able to edit in different styles and eras (e.g. 70s-inspired, cinematic, fast-cut digital ads)\r\n- Basic colour correction and grading experience\r\n- Familiar with exporting in multiple formats and aspect ratios (e.g. 16:9, 9:16, 1:1)\r\n- Understands how to cut to emotion and brand tone, not just assemble clips\r\n- Fluent in English and able to communicate clearly via email\n\n\r\nSkills in AI generation (VEO & Leonardo) is a bonus but not essential.\n\r\nIf you meet these requirements, please send:\r\n- A quick intro\r\n- Your 3 best video edits \r\n- Your monthly rate\n\r\n*Please only respond if you are dedicated.\n\r\nThanks!\r\nBlake",
  "skill_requirements": [
    "Video Editing",
    "Social Media Video Editing",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T05:27:40.786460",
      "reason": "Job first discovered"
    }
  ]
}