{
  "job_id": "1422300",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422300",
  "scraped_at": "2025-07-14T23:09:33.667188",
  "title": "Shopify Graphic Designer",
  "type_of_work": "Full Time",
  "salary": "Based on Experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hi there,\n\r\nI am the founder of Adgenix Media and now also Edgewater Brands — a new DTC brand focused on high-quality supplements and beauty products. While I’m new to e-commerce brand ownership, I bring 8+ years of experience running a successful performance marketing agency specializing in paid media.\n\r\nNow that we’ve mastered traffic, I’m ready to build something of my own — and I’m looking for a highly skilled Shopify expert with strong graphic design abilities to help bring this vision to life.??\n\r\nWho We Are Looking For??\r\nYou are a creative Shopify expert who knows how to build beautiful, high-converting eCommerce pages — and understands what makes a customer click buy. You combine technical skill with an eye for design and branding.\n\r\nWhat You’ll Be Doing?\r\n- Customizing & optimizing Shopify themes (must be fluent in Liquid/CSS)\r\n- Designing high-converting product and landing pages\r\n- Creating advertorial/interstitial pages for paid traffic\r\n- Designing visual assets: product mockups, banners, graphics, etc.\r\n- Building upsells, bundles, and AOV boosters into the funnel\r\n- Implementing and testing email/SMS flows using Klaviyo or similar\r\n- Executing basic split-tests and visual CRO tweaks\n\n\r\nYour Skills:\r\n- 5+ years working with Shopify stores (especially beauty/wellness)\r\n- Strong graphic design experience (Figma, Adobe, Canva, etc.)\r\n- Familiar with page builders (Replo, GemPages, PageFly) and/or custom coding\r\n- Understanding of conversion-focused design for DTC brands\r\n- Ability to work independently and deliver high-quality work quickly\r\n- Available during 9am–5pm EST (or overlapping hours)\r\n- Fluent in English\n\r\nWhy Join Us?\r\nWe’re in early-stage growth — and that means lots of creative freedom, a collaborative working style, and the opportunity to be a key part of our launch and scale. For the right person, there’s also long-term potential.",
  "skill_requirements": [
    "Graphic Design",
    "Advertising And Marketing Design",
    "Shopify"
  ]
}