{
  "job_id": "1422474",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Bookkeeper-for-Small-US-Businesses-Part-Time-Contractor-1422474",
  "scraped_at": "2025-07-15T14:29:02.663693",
  "title": "Remote Bookkeeper for Small U.S. Businesses (Part-Time, Contractor)",
  "type_of_work": "Any",
  "salary": "$5 - $7/hour",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "WATCH ME TO LEARN MORE ABOUT THIS ROLE: Upgrade to see actual info\n\r\n– About Us –\r\nWe are a fast-growing, founder-led company that helps blue-collar business owners get financial clarity and stay on top of their numbers. We provide back-office support and bookkeeping services that simplify their lives and help them make better decisions.\n\r\nOur clients are mostly landscapers, contractors, and other hands-on operators — they don’t want fluff. They want reliable support from people who know what they’re doing and speak their language (they aren’t bookkeepers!).\n\r\n– The Role –\r\nWe’re looking for a reliable, detail-oriented bookkeeper to join our remote team. You’ll manage the books for a small set of U.S.-based clients — making sure their transactions are categorized correctly, reconciliations are done, and monthly reports are accurate and on time.\n\r\nThis is a part-time contractor role, with the potential to grow as our client base expands. Most clients use QuickBooks Online (QBO), and share bank statements and notes via Google Sheets or similar tools.\n\r\n– Key Responsibilities –\r\nSet up or clean up chart of accounts in QBO (when needed)\r\nCategorize income and expense transactions accurately\r\nPerform monthly bank and credit card reconciliations\r\nFlag unclear, personal, or inconsistent transactions\r\nDeliver clear, simple monthly reports\r\nWork with the Account Manager to keep books clean and current\r\nFollow documentation standards and leave a paper trail of your work\n\r\n– You’re a great fit if you –\r\nAre fluent in QuickBooks Online (QBO)\r\nHave 2+ years of bookkeeping experience with U.S.-based small businesses\r\nUnderstand U.S. expense categories and general tax guidelines\r\nHave strong attention to detail and self-management\r\nCommunicate clearly and professionally in English\r\nCan overlap partially with U.S. business hours\r\nAre comfortable documenting your work in Google Docs or Sheets\n\r\n– Compensation –\r\nHourly rate between $5–$7 USD, depending on experience and skill\r\nPaid bi-weekly via Wise or similar platform\n\r\n– How to Apply –\r\nSubmit your application using the following form:\nUpgrade to see actual info\n\r\nWe are looking to move forward with a candidate by 7/18! Apply today!",
  "skill_requirements": [
    "Accounts Receivable",
    "Quickbooks",
    "Bookkeeping"
  ],
  "is_active": true,
  "status_history": []
}