{
  "job_id": "1422060",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-Meta-Ads-Direct-Response-1422060",
  "scraped_at": "2025-07-15T10:22:54.459464",
  "title": "Video Editor Meta Ads - Direct Response",
  "type_of_work": "Any",
  "salary": "Competitive",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About The Role:\r\nWe are looking for a Video Editor who has proven experience in creating direct response and engaging FB ads creatives that convert and generate sales.\n\r\nAs a video editor, you will work on your own terms, do what you enjoy and have a direct impact on the success of our brand! \n\r\nIf this sounds exciting to you then keep on reading. \n\n\r\nAbout Us: \r\nWe are one of the fastest growing jewellery brands in the UK. In a short space of time, we have sold over 2 million jewellery pieces to 800,000+ customers around the world in just under 5 years.\n\r\nOur goal is to create an amazing & well known international brand that deeply serves our customers by providing beautiful & high quality jewelry at very affordable pricing. We truly want to make a positive impact on this world through our jewellery but also through various charitable projects we are a part of.\n\r\nOur team is kind, talented and driven with big goals. We consistently innovate, test new things and we learn and adapt quickly.\n\n\r\nWhat will you be working on?\r\n- Edit Winning Ads Videos: Produce videos for paid advertising campaigns that will drive positive ROI.\r\n- Content Sourcing: Prepare content sourcing briefs/requests to help our content team source footage from lifestyle shoots and content creators that will drive conversions in paid ads\r\n- Research to learn from our competitors (ad spying & up to date trends): Have a deep understanding of what's working in the DTC space on social media to produce winning video ads\r\n- Analyse ads data: hook rates, hold rates, conversions, ROAS and engagement to drive decisions and improve future content.\n\n\r\nRequirements:\r\n- A proven track-record of creating winning FB/IG Ads for other brands/clients.\r\n- Creative wizard - you are never short of great ideas.\r\n- Ability to create short-form videos from creative briefs or storyboards\r\n- Ability to enhance edits with color correction and audio sweetening techniques\r\n- Expertise in professional editing software and file delivery: i.e., Adobe Premiere Pro, Final Cut Pro, CapCut etc.\r\n- Must be fluent in English.\n\r\nIf this sounds exciting to you, please apply for this role. We would love to hear from you!\n\r\nTo complete your application, please fill out this form: Upgrade to see actual info",
  "skill_requirements": [
    "Facebook Ads",
    "Ads Creation",
    "Video Editing"
  ],
  "is_active": true,
  "status_history": []
}