{
  "job_id": "1422942",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Creative-Content-Specialist-with-Amazon-A-Experience-Product-Images-Infographics-1422942",
  "scraped_at": "2025-07-15T12:30:06.186564",
  "title": "Creative Content Specialist with Amazon A+ Experience - Product Images - Infographics",
  "type_of_work": "Full Time",
  "salary": "$1200",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you skilled in creating high-converting visuals and content for e-commerce products? Do you have hands-on experience with Amazon A+ Content and are you looking to grow within a tight-knit, specialized team? Then we’d love to hear from you!\n\r\nWhat You’ll Do\r\n- Create Amazon A+ Content including banners, comparison tables, and infographics\r\n- Design engaging infographics and product images\r\n- Improve existing content with a focus on boosting conversions\r\n- Collaborate closely with a small team, each with their own area of expertise\n\r\nWhat We’re Looking For\r\n- Proven experience in content creation for e-commerce, particularly Amazon listings\r\n- A solid understanding of Amazon A+ Content guidelines and hands-on experience with A+ modules\r\n- Someone who is looking for a long-term collaboration and wants to grow with us\r\n- A hardworking, proactive professional who can take initiative and work independently\r\n- Experience working with Western European brands or familiarity with that market is a strong plus\n\r\nWe are a Western European company based in the Netherlands, so experience with European markets and audiences is highly valued.\n\r\nWhat We Offer\r\n- A dynamic, fast-growing e-commerce environment where your work truly makes an impact\r\n- Creative freedom and the opportunity to bring your ideas to life\r\n- A long-term freelance or employment opportunity\r\n- Competitive compensation based on your experience and skill set\n\r\nInterested?\r\nReply to this post and send a WhatsApp message to Upgrade to see actual infoincluding:\r\n- Your experience\r\n- Examples of content you've created\r\n- A short motivation letter",
  "skill_requirements": [
    "Content Creation",
    "Infographics",
    "Amazon"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:29:08.932361",
      "reason": "Job first discovered"
    }
  ]
}