{
  "job_id": "1422390",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Long-Term-Data-Entry-Assistant-Medical-Residency-Research-English-Required-1422390",
  "scraped_at": "2025-07-14T23:07:13.688567",
  "title": "Long-Term Data Entry Assistant – Medical Residency Research (English Required)",
  "type_of_work": "Part Time",
  "salary": "$340-$360",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "JOB TITLE:\r\nPart-Time Data Entry Assistant – Medical Residency Research (Strong English Required)\n\r\nABOUT US:\r\nWe are a U.S.-based healthcare recruitment company building a platform to help medical residents and hospitals connect more easily. We're looking for reliable, detail-oriented virtual assistants to join our growing team.\n\r\nJOB DESCRIPTION:\r\nYou will help us collect and enter information from U.S. medical residency program websites into our online system. The work is straightforward but requires accuracy, focus, and a comfort with repetitive tasks.\n\r\nTASKS INCLUDE:\n\r\nVisiting U.S. residency websites to find information about current residents\n\r\nCopying names, medical schools, and graduation years into our system\n\r\nMatching medical schools from dropdowns\n\r\nMarking data as complete once confirmed\n\r\nFlagging unclear or missing entries\n\r\nWe will provide:\n\r\nStep-by-step written and video training\n\r\nSupport via chat or email as needed\n\r\nWHO WE’RE LOOKING FOR:\n\r\nStrong written and spoken English\n\r\nHigh attention to detail and accuracy\n\r\nAbility to follow instructions (written and video)\n\r\nFamiliar with Google Docs, spreadsheets, and online forms\n\r\nAvailable 10–20 hours/week to start\n\r\nWilling to grow into full-time (40 hours/week) if it's a good fit\n\r\nBonus: Experience in healthcare, medical research, education, or calling U.S.-based professionals\n\r\nPAY:\n\r\n$4.00 USD per hour\n\r\nPaid weekly via Wise or PayPal\n\r\nGROWTH OPPORTUNITY:\r\nWe are hiring multiple assistants and looking for long-term contributors. After training, this role may expand to full-time and potentially include calling residency programs or communicating with U.S.-based doctors.\n\r\nLOCATION:\n\r\nRemote work\n\r\nPriority given to applicants in Southeast Asia\n\r\nI may be able to meet you in person during my upcoming trip to the Philippines, Vietnam, Cambodia, Thailand, or Malaysia\n\r\nHOW TO APPLY:\r\nPlease send a message including:\n\r\nA short introduction (your location, experience, English level)\n\r\nWeekly availability (hours/week and preferred work hours)\n\r\nYour hourly rate\n\r\nWhy you’re a good fit for this role\n\r\nAny experience with medical data, academic websites, or calling professionals\n\r\nTO CONFIRM YOU READ THIS POST, START YOUR MESSAGE WITH THE WORD: RESIDENCY",
  "skill_requirements": [
    "Data Entry",
    "English Speaking",
    "Research"
  ]
}