{
  "job_id": "1422980",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Email-Cleanup-Assistant-Build-Sender-List-1422980",
  "scraped_at": "2025-07-15T15:40:42.376230",
  "title": "Email Cleanup Assistant: Build Sender List",
  "type_of_work": "Gig",
  "salary": "300",
  "hours_per_week": "8",
  "date_updated": "Jul 15, 2025",
  "job_overview": "I’m looking for a detail-oriented virtual assistant to help me with the first phase of an email decluttering project.\n\r\nYour task will be to go through my Gmail and ProtonMail accounts and create a comprehensive list of all unique senders who have emailed me in the last 12 to 18 months.\n\r\nThis list will be used to dUpgrade to see actual info which senders to keep, unsubscribe from, filter into folders, or delete.\n\r\nImportant: This is phase one of a larger project. If this goes well, I may have additional work for you later (including helping with older archived emails).\n\r\nScope of Work:\r\nReview my Gmail and ProtonMail accounts.\n\r\nIdentify all unique senders in the past 12–18 months.\n\r\nFor each sender, record:\r\n-Sender Name (if available)\n-Email Address\r\n-1–3 Example Subject Lines\r\n-Approximate Number of Emails Received (if feasible)\n\r\nOrganize results in a clear, tidy spreadsheet with columns like:\r\n| Sender Name | Email Address | Example Subject(s) | Count of Emails | Notes |\n\r\n**Include all senders — do not filter anything out.\n\r\nGoal: To help me see exactly who is emailing me recently so I can make decisions about unsubscribing, filtering, or keeping them in my inbox.\n\r\nRequirements:\r\nGood Gmail and ProtonMail experience (or ability to learn quickly).\r\nExcellent attention to detail.\r\nFamiliarity with spreadsheets (Google Sheets, Excel).\r\nTrustworthy and respectful of confidentiality (you will see personal email data).\r\nGood communication — please ask questions if anything isn’t clear.\n\r\nTimeline: I’d like this completed within 2–4 days of starting. I expect this to be around 6–8 hours of work.\n\r\nHow to Apply:\r\nBriefly explain any similar experience you have.\r\nConfirm you understand you’ll be working with personal email data and can keep it confidential.\r\nShare your hourly rate or proposed fixed price.\r\nLet me know your availability and how quickly you can complete the task.\n\r\n$5USD per hour.",
  "skill_requirements": [
    "Office and Administration",
    "Email Handling",
    "Organization"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:29:05.514137",
      "reason": "Job first discovered"
    }
  ]
}