{
  "job_id": "1422497",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Real-Estate-Agent-Recruiter-1422497",
  "scraped_at": "2025-07-15T15:36:43.938308",
  "title": "Real Estate Agent Recruiter",
  "type_of_work": "Part Time",
  "salary": "$6.00",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "???? WE’RE HIRING: Real Estate Agent Recruiter | Join the Terra Buckley Upgrade to see actual info ????\n\r\nAre you a powerhouse recruiter with a track record of attracting top talent? Do you thrive in fast-paced environments and know how to fill pipelines with licensed agents ready to produce? The Terra Buckley Group, a top-producing Zillow Flex team at LoKation Real Estate, is expanding—and we’re looking for a Real Estate Agent Recruiter with heavy recruiting experience and MarketView Broker knowledge to lead our growth efforts.\n\r\n???? Location: Remote \r\n???? Position: Part time to a Full-Time | Hourly + Bonuses\r\n???? Industry: Real Estate | Recruiting | Growth & Development\n\r\nWhat You'll Be Doing:\r\nActively recruit licensed agents into our proven, performance-driven team model\n\r\nRun high-volume outreach campaigns via phone, email, text, and social channels\n\r\nConduct one-on-one discovery calls, interviews, and team presentations\n\r\nUse MarketView Broker and other data tools to target, source, and track recruiting KPIs\n\r\nCollaborate with leadership to hit weekly recruiting goals and pipeline metrics\n\r\nHelp onboard new hires and ensure alignment with our systems, tech stack, and culture\n\r\nWhy Agents Say YES to the Terra Buckley Group:\r\n? Zillow Flex Lead Program\r\n? Full Transaction Coordination Department\r\n? In-House Lending = More Deals Closed\r\n? Proven Systems, Automation, and CRM Support\r\n? Coaching, Culture, and Accountability That Delivers\r\n? 100% Commission Model via LoKation Brokerage\r\n? Focus on Net Profit and True Agent Support\n\r\nWhat We're Looking For:\r\nReal estate recruiting experience is a must\n\r\nProven track record in high-volume recruiting (internal, agency, or brokerage-based)\n\r\nProficiency in MarketView Broker or similar agent data platforms\n\r\nStrong communication skills and the ability to close top talent\n\r\nTech-savvy and CRM fluent (Follow Up Boss experience a plus)\n\r\nA self-starter who thrives in a results-driven environment\n\r\nCompensation:\r\nHourly salary + aggressive per-agent hire bonus\n\r\nTiered monthly/quarterly performance incentives\n\r\nFull systems, tools, and team support provided\n\r\n???? If you’re ready to help us scale one of Florida’s most tech-forward real estate teams—apply now.",
  "skill_requirements": [
    "Recruiting",
    "ISA Real Estate"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:28:40.653338",
      "reason": "Job first discovered"
    }
  ]
}