{
  "job_id": "1422097",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Digital-Marketing-Specialist-Ad-Designer-1422097",
  "scraped_at": "2025-07-14T23:09:32.745503",
  "title": "Digital Marketing Specialist | Ad Designer",
  "type_of_work": "Full Time",
  "salary": "800-3200",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "TO APPLY CLICK HERE: Upgrade to see actual info\n\r\nWe are looking for a proactive and results-driven Digital Marketing Specialist | Ad Designer to join our team. The ideal candidate will be responsible for planning, executing, and optimizing digital marketing campaigns across various channels to drive engagement, leads, and conversions.\n\r\n*Key Responsibilities:\r\n- Create and control ads on Google Ads, ensuring campaigns are performance-driven and aligned with business goals.\r\n- Create and control ads on Meta platforms (Facebook & Instagram), including audience targeting, budgeting, and optimization.\r\n- Prepare detailed briefs for ad creatives, collaborating with designers and content creators to develop compelling visuals and messaging.\r\n- Manage email marketing campaigns from planning to execution and analysis.\r\n- Write engaging email subject lines and body copy tailored to different audience segments.\r\n- Design and implement email templates in Brevo (formerly Sendinblue), ensuring responsive and visually appealing layouts.\n\r\n*Requirements:\r\n- Proven experience in digital marketing, including hands-on campaign management.\r\n- Strong knowledge of Google Ads and Meta Ads platforms.\r\n- Experience with email marketing tools, preferably Brevo.\r\n- Excellent written communication skills in English.\r\n- Ability to analyze campaign performance and make data-driven decisions.\r\n- Detail-oriented, creative, and able to manage multiple projects simultaneously.\n\r\n*Nice to Have:\r\n- Experience with A/B testing and conversion optimization.\r\n- Familiarity with basic graphic design tools or briefing processes.",
  "skill_requirements": [
    "Advertising",
    "Digital Marketing"
  ]
}