{
  "job_id": "1422683",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Real-Estate-Video-editor-Very-Experienced-1422683",
  "scraped_at": "2025-07-15T12:24:03.340923",
  "title": "Real Estate Video editor - Very Experienced",
  "type_of_work": "Any",
  "salary": "400",
  "hours_per_week": "15",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Real Estate Video Editor (Modern Style +Motion Graphics)\r\nWe’re a fast-growing real estate media company looking for a skilled and reliable video editor to join our team. We shoot beautiful cinematic walkthroughs of homes, and we need an editor who can turn raw footage into high-impact listing videos—and create short, engaging social media edits from the same footage. Familiarity with modern real estate video styles like what you see Upgrade to see actual info on Instagram.\n\n\r\nWhat You’ll Be Editing:\r\nMain videos (landscape, cinematic walkthroughs, 60–120 seconds)\n\n\r\nVertical social media edits (Reels, TikToks) pulled from main footage\n\n\r\nSome voiceover syncing\n\n\r\nSpeed ramping, motion blur, modern transitions, and day-to-night matching\n\n\r\nAgent text overlays and trendy text animations behind subjects\n\n\r\nOccasional single-shot “speed tour” edits for social media (no talking)\n\n\r\nOur Workflow:\r\nYou’ll receive footage and basic notes via Google Drive\n\n\r\nEditors use their own system (Premiere Pro or Final Cut both OK)\n\n\r\nWe expect 48-hour turnaround for first drafts\n\n\r\nRevisions due within 4 hours of notes\n\n\r\nWork is consistent: 3–5 projects/week, with room to grow into additional editing work (like social media/talking heads/course content)\n\n\r\nRequirements:\r\nExperience editing real estate listings (Please provide samples)\n\n\r\nStrong understanding of pacing, property flow, and visual storytelling\n\n\r\nAbility to match edits to voiceover, create clean transitions, and build a cohesive timeline\n\n\r\nSkill with music selection, especially trending or cinematic tracks for social content\n\n\r\nFamiliarity with modern styles like what you see Upgrade to see actual info on Instagram\n\n\r\nCompensation:\r\nOpen to either flat rate per video or hourly ($8/hr)\n\n\r\nLong-term opportunity for the right editor\n\n\r\nTo Apply:\r\nPlease send:\r\nYour best real estate video samples",
  "skill_requirements": [
    "Adobe Premiere Pro",
    "Apple Final Cut Pro"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:35:25.894188",
      "reason": "Job first discovered"
    }
  ]
}