{
  "job_id": "1422650",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Collection-Specialist-1422650",
  "scraped_at": "2025-07-15T14:31:01.773157",
  "title": "Collection Specialist",
  "type_of_work": "Full Time",
  "salary": "1200",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "******TO BE CONSIDERED FOR THIS ROLE, YOU MUST SUBMIT YOUR RESUME AND VIDEO INTRODUCTION.******\n\r\nJob Type: Full-Time\r\nWork Hours: Monday to Friday, 8:00 AM to 5:00 PM Pacific Time, with a 1-hour unpaid break\r\nSalary: $1200 per month\n\r\nJob Overview:\r\nWe are seeking a detail-oriented and dependable Accounts Receivable/Data Entry and Collections Specialist to join our team. This role is responsible for accurately entering invoices, applying payments to customer accounts, managing customer accounts, and following up on outstanding payments to ensure timely collections. The ideal candidate will possess excellent time management skills, strong communication abilities, and a keen eye for accuracy.\n\r\nKey Responsibilities:\r\nAR/Data Entry:\r\nAccurately enter, update, and maintain information in internal databases and systems\n\r\nInvoice Entry\r\nVerify and correct data to ensure completeness and accuracy\r\nOrganize and maintain electronic and paper filing systems\r\nPayment Processing\n\r\nCollections:\r\nContact customers via phone, email, or written correspondence regarding past due accounts\r\nMonitor accounts receivable and identify overdue payments\r\nNegotiate and establish payment arrangements in accordance with company policies\r\nDocument collection activity in system notes and escalate problematic accounts as needed\r\nCollaborate with internal departments to resolve account discrepancies\r\nFiling Preliminary Liens on projects per the direction of upper management.\n\r\nQualifications:\r\n1–2 years of experience in data entry, collections, or a similar administrative role\r\nProficient in Microsoft Office Suite (especially Excel and Outlook), Sage and Point of Rental software experience a plus.\r\nExcellent attention to detail and accuracy\r\nStrong verbal and written communication skills\r\nAbility to handle sensitive information with confidentiality\r\nKnowledge of basic accounting or billing processes a plus",
  "skill_requirements": [
    "Data Collection",
    "Collection",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:33:32.114132",
      "reason": "Job first discovered"
    }
  ]
}