{
  "job_id": "1422579",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Nonprofit-consulting-bookkeeper-assistant-1422579",
  "scraped_at": "2025-07-15T12:24:48.855994",
  "title": "Nonprofit consulting bookkeeper assistant",
  "type_of_work": "Part Time",
  "salary": "$200 - 600",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us\r\nTerrapin Operations Consulting is a growing firm that supports small and mid-sized non-profit organizations with operations, finance, and strategic growth. We pride ourselves on precision, responsiveness, and high-impact support. View our website at Upgrade to see actual info for more information on our services. \n\r\nWe’re seeking a remote Bookkeeping Assistant to help manage financial records, ensure accuracy, and support smooth operations. This is a part-time position; hours will vary depending on client needs. Pay will vary depending on experience level and available hours.\n\r\nKey Responsibilities\r\nEnter and categorize transactions in QuickBooks Online\r\nPerform bank and credit card reconciliations\r\nAssist with managing accounts payable and receivable using BILL\r\nSupport monthly closing and preparation of financial summaries\r\nOrganize and maintain accurate digital records\r\nOrganize contractor files in Google Drive and Microsoft\r\nPerform other remote assistant work as needed\n\n\r\nQualifications\r\nAt least 1–2 years of experience in bookkeeping or accounting support\r\nStrong proficiency with QuickBooks Online (non-negotiable)\r\nFamiliarity with Google Workspace (Sheets, Docs, Drive)\r\nProficiency in Microsoft Office, especially Excel\r\nExcellent English communication skills (written and verbal)\r\nDetail-oriented, organized, and trustworthy with sensitive financial data\n\r\nRequirements\r\nA reliable internet connection (minimum 10 Mbps)\r\nA quiet working environment and a backup power/internet source is a plus\n\n\r\nHow to Apply\r\nPlease send the following:\r\nYour resume or CV\r\nA brief cover letter introducing yourself and your bookkeeping experience",
  "skill_requirements": [
    "Quickbooks",
    "Bookkeeping",
    "File Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:29:34.241721",
      "reason": "Job first discovered"
    }
  ]
}