{
  "job_id": "1422208",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Part-Time-Community-Engagement-Assistant-Childcare-Brands-20-hrsweek-1422208",
  "scraped_at": "2025-07-15T13:29:56.682214",
  "title": "Part-Time Community & Engagement Assistant (Childcare Brands – 20 hrs/week)",
  "type_of_work": "Any",
  "salary": "$400-$600monthly",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re a company helping modern families find trusted childcare:\n\r\nLittle Minders is a curated babysitting membership connecting busy parents with fully vetted sitters.\r\nHouse of Nannies is a boutique nanny agency placing amazing nannies with families across NYC, Westchester, and the Hamptons.\n\r\nWe’re a small, warm, family-first team—and we’re looking for someone to help us grow and nurture our online community through authentic engagement and email marketing.\n\r\nWhat You’ll Do:\r\nYou won’t need to create any content—we already have someone for that. Instead, you’ll focus on engagement, visibility, and email list growth across Instagram and Facebook groups.\n\r\nYour day-to-day will include:\r\nReplying to comments and DMs on Instagram\r\nFollowing and engaging with ideal clients and local parenting accounts\r\nCommenting on relevant posts (parent influencers, local family businesses, etc.) to build brand visibility\n\r\nManaging our Facebook groups:\r\nAccepting new members\r\nWelcoming and commenting on member posts\r\nStarting conversations (we’ll provide guidance)\r\nAdding qualified leads to our Flodesk email list\r\nSending out weekly emails in Flodesk using templates we already have\r\nHelping track growth: new followers, email signups, engagement activity\n\r\nYou’re a Great Fit If:\r\nYou love connecting with people and know how to build online relationships\r\nYou have experience with Instagram, Facebook groups, and Flodesk\r\nYou’re detail-oriented and tech-savvy enough to manage basic email flows\r\nYou understand how to engage without sounding salesy\r\nYou’re proactive and don’t wait for someone to tell you what to do\n\r\nBonus: You’ve worked with family-centered or women-focused brands\n\r\nHours & Pay:\r\nPart-time: 20 hours/week\r\nFlexible schedule but must check in on socials at least twice per day\r\nPay: $400–$600/month depending on experience\r\nThis is a long-term, stable role with room to grow\n\r\nTo Apply:\r\nPlease send:\n\r\nA short video or paragraph about you and your experience\r\nScreenshots or examples of Instagram or Facebook engagement you’ve handled\r\nA sample of an email campaign or newsletter (if you have one)\r\nOne creative way you’d help our brand connect with more families online",
  "skill_requirements": [
    "Marketing",
    "Email Marketing",
    "Social Media Engagement"
  ],
  "is_active": true,
  "status_history": []
}