{
  "job_id": "1422034",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Expert-Cold-Caller-Inside-Sales-Agent-1422034",
  "scraped_at": "2025-07-15T09:34:04.075240",
  "title": "Expert Cold Caller / Inside Sales Agent",
  "type_of_work": "Full Time",
  "salary": "$1400 - $3000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Real Estate Cold Caller – Experienced Only – $8–$20 USD /hr\r\nWe’re looking for a serious, highly experienced cold caller / inside sales agent to help us qualify motivated sellers for our real estate investment business. \n\r\nDo NOT apply unless you meet all requirements below.\n\r\nAbout the Role\r\nThis is a performance-based role. You’ll be calling skip-traced homeowner lists using REI Reply (GoHighLevel CRM), following our script, and identifying property owners who may be open to selling. Your focus is volume, quality conversations, and consistent lead generation.\n\r\nThis is not a training position. We expect you to hit the ground running.\n\r\nSTRICT Daily Performance Requirements\r\nWe track results daily — not effort, not intention, but outcomes.\n\r\nYou must consistently hit:\n\r\n200–300 calls per day (single-line dialer)\n\r\n20–30 conversations per day\n\r\n1–2 qualified leads per day (homeowners open to talking about selling)\n\r\nClean, real-time updates in our CRM (REI Reply)\n\r\nDo NOT Apply If You:\r\n- Have less than 2 years cold calling experience in U.S. real estate\n\r\n- Struggle with conversational English or a heavy accent\n\r\n- Need to be micromanaged or can’t follow systems\n\r\n- Don’t want to be held accountable to KPIs\n\r\n- Haven’t worked in a Real Estate CRM before\n\n\r\nYou’re a Fit If You:\r\n- Have 2+ years experience cold calling for real estate investors or wholesalers\n\r\n- Are confident on the phone, great at building rapport, and can handle objections\n\r\n- Speak fluent, neutral-accent English — we will test this\n\r\n- Can follow scripts and think on your feet\n\r\n- Are self-managed, consistent, and driven by results\n\r\n- Want a long-term opportunity with growth potential\n\r\nCompensation & Hours\r\nPay: $8–$12/hour USD via Wise or PayPal (based on experience)\n\r\nSchedule: 11 AM – 7 PM CST, Monday–Friday\n\r\nBonuses for lead volume and consistency\n\r\nDaily KPI tracking via WhatsApp\n\r\nWeekly check-ins + performance reviews\n\r\nHow to Apply\r\nStep 1: Send a voice recording (Vocaroo, Loom, etc.) saying:\n\r\n“Hi, my name is [your name]. I’m calling about a property I believe you might own on [123 Main Street]. I just wanted to see if you’d ever consider selling that property?”\n\r\nStep 2: Submit the following:\n\r\nResume or summary of past real estate cold calling experience\n\r\nList of CRMs and dialers you’ve used\n\r\nHow many calls you made per day in your last position\n\r\nAverage number of leads you generated per week\n\r\nFailure to follow these instructions = immediate disqualification.\r\nWe are only hiring A-players who want to earn well and work with a serious team.",
  "skill_requirements": [
    "Outbound Sales",
    "Cold Calling",
    "English"
  ],
  "is_active": true,
  "status_history": []
}