{
  "job_id": "1422250",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Manager-1422250",
  "scraped_at": "2025-07-15T12:37:08.865438",
  "title": "Marketing Manager",
  "type_of_work": "Full Time",
  "salary": "PHP 60,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Pet Business Marketing Ltd is hiring a full-time Marketing Manager to handle content creation, social media, email marketing, automation, and funnels. This role ensures marketing efforts stay consistent, organized, and effective, allowing the business to grow without getting stuck in execution.\n\r\nWhat You’ll Do\n\r\n- Content & Social Media\r\n- Repurpose content into short-form posts, reels, and video clips\r\n- Schedule and publish five or more posts per week across Facebook, Instagram, LinkedIn, and Facebook groups\r\n- Use Canva and AI-powered tools to optimize content\n \nEmail & Webinar Marketing\n\r\n- Write and send email sequences for launches and events using GoHighLevel\r\n- Tag webinar non-buyers for follow-ups and targeted campaigns\r\n- Use AI to refine and personalize email copy\n\r\nFunnels, Automation & Lead Generation\n\r\n- Build landing pages and lead magnets in GoHighLevel\r\n- Create automated follow-up sequences to nurture leads\r\n- Use AI where applicable to optimize copy and improve conversion rates\n\r\nMarketing Operations & Admin\n\r\n- Maintain a content calendar and keep marketing assets organized\r\n- Conduct light research for free reports, using AI to streamline the process\r\n- Track key performance metrics and suggest improvements\n\r\nWho You Are\n\r\n- Marketing-Focused – You understand funnels, email sequences, and lead generation\r\n- Social Media Savvy – You know how to create and repurpose content for engagement\r\n- Tech-Savvy & AI-Literate – You are comfortable using AI tools to enhance efficiency, but you also bring creativity and strategy to the table\r\n- Organized & Reliable – You meet deadlines and maintain structure\r\n- Process-Oriented – You don’t just complete tasks; you find ways to improve workflows\n\r\nBonus Skills\n\r\n- Experience with ClickUp, Notion, or other project management tools\r\n- Knowledge of AI-driven video editing and automation tools\r\n- Familiarity with the pet industry (not required but helpful)\n\r\nWhy Join Us?\n\r\n- Work directly with a growing coaching business in the pet industry\r\n- Contribute to a company that values efficiency and execution\r\n- Fully remote role with flexibility\r\n- Gain experience using AI to optimize marketing operations\n\r\nPay & Details\n\r\n- Full-time role\r\n- Competitive pay based on experience\r\n- Remote position\n\r\nHow to Apply\n\r\nAnd reply with the subject line: Rockstar Marketing Manager and let us know:\n\r\nA short blurb explaining how you use AI\n\r\nExamples of past marketing work, note if AI was used                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}