{
  "job_id": "1422498",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Cold-Calling-Sales-Rep-Looking-for-former-Solar-Reps-or-Experience-with-Excess-Proceeds-1422498",
  "scraped_at": "2025-07-15T12:34:53.984894",
  "title": "Cold Calling Sales Rep - (Looking for former Solar Reps or Experience with Excess Proceeds)",
  "type_of_work": "Any",
  "salary": "800",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "(Must have experience in Excess Proceeds or Virtual Solar Sales)\n\r\n???? Who We Are\r\nWe’re a fast-growing land investment company that buys vacant land directly from owners. We’re not some huge corporate giant — we’re lean, we move fast, and we close deals every single week.\n\r\nIf you’ve worked excess proceeds, virtual solar sales, or any high-volume outbound environment, you already know the grind — and the kind of money that comes with it.\n\r\n???? What We’re Looking For\r\n- You’ve sold excess proceeds or virtual solar over the phone — you know how to build quick trust, handle objections, and close.\r\n- You’re aggressive, self-managed, and love chasing down deals.\r\n- You’re used to making 100+ calls a day, pushing through hang-ups and “not interested,” and still staying upbeat.\r\n- You’re obsessed with follow-up — texts, calls, voicemails until it closes.\r\n- You thrive on targets and making real money, not just hitting minimums.\n\r\n???? What You’ll Do\r\n- Make outbound calls to landowners, qualify them, and set up appointments for our team to close.\r\n- Keep your pipeline full and tight — notes, follow-ups, next steps always ready.\r\n- Use our dialer, CRM, and follow our proven process to keep deals moving.\n\r\n???? What You Get\r\n- Base ($800/M) + Big commissions with real earning upside. If you are performing, you will be the highest paid person in your friend group. \r\n- All data + tools provided. You focus on dialing and closing.\n\r\n???? How To Apply\r\nSend a 60-second video with:\r\n- Your background in sales (especially excess proceeds or virtual solar).\r\n- The favorite sale you ever made - why it was your favorite and how you closed it.",
  "skill_requirements": [
    "Outbound Sales",
    "Cold Calling"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:17:59.599125",
      "reason": "Job first discovered"
    }
  ]
}