{
  "job_id": "1422886",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Experienced-Bilingual-Spanish-English-Customer-Support-Specialist-weekends-for-Growing-E-commerce-Brand-1422886",
  "scraped_at": "2025-07-15T14:31:47.014236",
  "title": "Experienced Bilingual (Spanish-English) Customer Support Specialist weekends for Growing E-commerce Brand",
  "type_of_work": "Part Time",
  "salary": "N/A",
  "hours_per_week": "8",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are an ambitious and fast-growing e-commerce company with a primary focus on the Spanish market. We are looking for a dedicated, proactive, and highly experienced Customer Support Specialist to join our team.\n\r\nThis is not your average customer support job — we want someone who goes above and beyond, thrives under pressure, and is looking for long-term growth within our organization.\n\r\nYour responsibilities will include:\n\r\n- Managing customer communication across multiple channels: email, live chat, WhatsApp, and phone support (occasionally).\r\n- Delivering fast, empathetic, and solution-oriented service to our customers.\r\n- Helping to optimize and document processes (SOPs, KPIs) together with our current customer support lead.\r\n- Taking full ownership of your work, working independently and showing initiative.\r\n-  Being available on weekends (rotating schedule possible once new hires are onboarded).\n\r\nRequirements:\r\n? Native in both Spanish and English (spoken and written)\r\n? Mandatory: Proven hands-on experience with Shopify\r\n? Mandatory: Customer service experience at established e-commerce brands (preferably brands with significant order volume)\r\n? Experience working with CRM/helpdesk tools like Freshdesk, Zendesk, Gorgias, or similar\r\n? Ability to handle pressure, multitask, and communicate with empathy\r\n? Willingness to grow with the company — we offer real career advancement opportunities for top performers\r\n? Availability to work flexible hours, including some weekends\r\n? Mandatory: Ability and commitment to work according to European time zones (Central European Time, CET)\r\n? No strict 9-5 mentality — we are looking for someone highly driven and responsible\n\r\nBonus points if you have experience:\n\r\n- Working for a DTC (direct-to-consumer) brand or a major dropshipping operation\r\n- Handling voice support and WhatsApp Business communication\r\n- Contributing to team processes and helping implement SOPs\n\r\n???? IMPORTANT:\r\nTo ensure you've read this carefully, please include your favorite ice cream flavor in your application message. Applications without this will not be considered.\n\r\nWhat we offer:\r\n? A fast-growing company with real potential for career progression\r\n? A role where you can take full ownership and grow into a team leader position if you perform\r\n? A dynamic and international environment\r\n? Flexibility in working hours and remote work from anywhere (but during CET hours)\n\r\nWe are specifically looking for talent based in Latin America or Spain for this role. This role will start only during the weekends but since we're scaling hard, has the possibility to go to fulltime.",
  "skill_requirements": [
    "Shopify",
    "Phone Support",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:47:05.323697",
      "reason": "Job first discovered"
    }
  ]
}