{
  "job_id": "1422412",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Google-Ads-Expert-1422412",
  "scraped_at": "2025-07-15T14:39:13.685900",
  "title": "Google Ads Expert",
  "type_of_work": "Part Time",
  "salary": "$1000/month",
  "hours_per_week": "18",
  "date_updated": "Jul 14, 2025",
  "job_overview": "WHO WE ARE\r\nWe are a boutique web design and marketing agency located in Canada, that are passionate about helping our clients grow their businesses online. We serve a wide range of clients including construction, landscaping, home services, and real estate.\n\r\nWHO WE ARE LOOKING FOR\r\nWe are looking for an experienced Media Buyer / Google & Facebook Ads Expert to join our team. Specifically, this person should be results-driven and passionate about providing high-quality pay-per-click and social media ads for a wide range of niches. They should be committed to a common goal of driving results for our clients.\n\r\nThis is a remote or work from the home role and would ideally suit someone wanting to work on a part-time, 20 hour a week basis, and grow with our company. You should be ready and willing to get great satisfaction from serving our audience and become an integral part of our creative team over the long term.\n\r\nRESPONSIBILITIES\r\nYour job will be to use your past experience to:\n\r\n- Research keywords and search terms\r\n- Setup new Google Ads and Facebook Ads accounts\r\n- Build and refine campaigns, ad sets and ads, including written content\r\n- Constantly look for new ways to improve results, reduce spending and increase conversions\r\n- Test different audiences, ads and opportunities to improve results\n\r\nEXPERIENCE\r\nYou should have 5+ years past experience creating and managing ads, and understand best practices to consistently improve ad performance. You should know how to complete keyword and competitor research, with mastery of the English language.\n\r\nYou should be comfortable using internal communication and collaboration software like Dropbox, Google docs, Zoom, Clickup, and Slack. You should also be comfortable with getting critical feedback on your work.\n\r\n**We have a designer on our team, who you will work collaboratively with to create ads graphics in Canva.\n\r\nHOW WE WILL HELP YOU SUCCEED\r\nWe want you to succeed in this role. We will provide any additional training you may need to get on board and hit the ground running. We're not going to teach you how to do your job, because your past experience will serve you well.\n\r\nHowever, we will train you regarding our systems, our processes, and our customers so you can apply your skills to help us achieve our mission. We will also support you and encourage you in any way we can.\n\r\nEMPLOYMENT TYPE\r\nThis is a part time role and we're not looking for an agency.\n\r\n*Please add the words \"Pink Monkey\" at the top of your application*.\n\r\nDo NOT contact our business outside of this website, and apply only through onlinejobs.ph\n\r\nMake sure to include samples of your work, proof of previous ad results and note relevant certifications.",
  "skill_requirements": [
    "Google Ads",
    "Facebook Ads",
    "Google Analytics"
  ],
  "is_active": true,
  "status_history": []
}