{
  "job_id": "1422133",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422133",
  "scraped_at": "2025-07-14T23:08:22.905341",
  "title": "Brand Strategist & Content Operations Specialist",
  "type_of_work": "Full Time",
  "salary": "$8-12/hour depending on experience",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "JOB OVERVIEW\r\nWe’re hiring a high-performance Brand Strategist & Content Operations Specialist to spearhead our personal brand and organic content efforts. This role is designed for someone who thrives at the intersection of marketing strategy, content creation, and visual communication. You’ll position our founder as the #1 authority in the SMMA space, develop unique frameworks, craft compelling narratives, and lead our brand visibility efforts across platforms like Instagram and YouTube.\n\n\r\nABOUT THE COMPANY\r\nLEADFUSE is a performance-driven lead generation agency serving service-based businesses. With 59,000+ leads delivered and over $1.46M in revenue generated in 2024, our content, systems, and execution set the gold standard. We don’t do fluff—we do results. Every post, video, and campaign is built to educate, build authority, and convert.\n\n\r\nRESPONSIBILITIES\n\r\nContent Strategy & Execution\r\n-Develop and own the complete content strategy for our personal brand\r\n-Build frameworks that differentiate LEADFUSE in the SMMA and coaching space\r\n-Script 1–2 daily Reels with high-performing hooks, value content, and CTAs\r\n-Plan and structure long-form YouTube videos (20–60 min) that drive authority\n\r\nVisual Communication & Framework Development\r\n-Design Miro boards and visual frameworks that simplify SMMA concepts\r\n-Create diagrams, process flows, and step-by-step solutions for agency challenges\r\n-Optimize visuals for both educational impact and social virality\n\r\nCopywriting & Messaging\r\n-Write all social captions, sales copy, and organic marketing emails\r\n-Develop messaging frameworks tailored to SMMA agency pain points\r\n-Test and iterate on hooks, angles, and subject lines to boost engagement\n\r\nPlatform Management\r\n-Monitor and optimize performance on Instagram and YouTube using analytics\r\n-Maintain consistent brand voice and visual identity across all media\r\n-Collaborate with video editors, social media managers, and sales team\n\r\nReporting & Optimization\r\n-Track KPIs: engagement rates, conversion rates, monthly lead volume\r\n-Adjust strategy weekly based on data feedback\r\n-Submit daily and weekly reports to CEO on performance and pipeline impact\n\n\r\nQUALIFICATIONS\n\r\nExperience\r\n2+ years in content strategy or brand marketing, ideally in SMMA or coaching space\r\nProven ability to generate qualified leads via organic content\r\nFamiliarity with SMMA industry pain points and buyer psychology\n\r\nSkills\r\nExpert-level content strategy and script writing\r\nAdvanced proficiency in Miro, Canva/Figma, Google Workspace\r\nIntermediate YouTube Studio and Instagram Creator Studio use\r\nStrong copywriting, storytelling, and visual structuring skills\n\n\r\nTraits\r\nHigh attention to detail and zero tolerance for quality compromise\r\nStrategic thinker who turns insights into scalable systems\r\nOperates with urgency, ownership, and clarity\n\n\r\nTOOLS & PLATFORMS\n\r\nSlack (daily communication)\r\nGoogle Docs, Google Sheets, Google Drive\r\nGoHighLevel (light usage for team oversight)\r\nLoom (for async instructions)\r\nGoogle Meet (team and candidate calls)\r\nAsana (Project Management)\r\nYouTube Studio, Instagram Creator Studio\n\r\nWHY JOIN US?\r\nCompetitive Salary & Benefits: $5–12/hr + commissions\r\nBonus incentives for exceeding content and revenue KPIs\r\nCollaborative Environment: Work with a creative, supportive team focused on growth.\r\nCareer acceleration: Help scale a 7–8 figure brand and build industry dominance\n\n\r\nHOW TO APPLY?\n\r\nUse the subject line: “Brand Strategist & Content Operations Specialist | Your Name | Stage 1 Application”\n\r\nRecord a Loom video (3 minutes max) answering:\r\n-What makes content convert in the SMMA space?\r\n-Show 1 example of a content framework you've built and its results.\r\n-How would you structure a content plan for a founder-led brand?",
  "skill_requirements": [
    "Copywriting",
    "Content Creation",
    "Creative Direction"
  ]
}