{
  "job_id": "1422529",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Executive-Admin-VA-1422529",
  "scraped_at": "2025-07-15T12:32:17.168130",
  "title": "Full-Time Executive Admin VA",
  "type_of_work": "Full Time",
  "salary": "USD $750 - $1,000 Per Month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Full-Time Executive Admin VA – High Growth Role (Thinker + Doer + Tech-Savvy)\n\r\nWe’re a fast-growing marketing consulting agency that helps home service businesses scale with proven systems. We’re getting amazing results for our clients, and now we’re ready to scale up our own internal operations.\n\r\nWe’re hiring a full-time Executive Operations VA — but this is not your typical VA role.\n\r\n- We’re looking for someone who:\n\r\n- Can think on their feet\n\r\n- Is extremely organized\n\r\n- Loves solving problems and improving systems\n\r\n- Has strong working knowledge of Zapier, GHL, Google Sheets, Upgrade to see actual info, and automation tools\n\r\n- Understands that systems run the business, and people run the systems\n\r\n- Takes full ownership — no micromanagement, no hand-holding\n\r\nThis role is perfect if you're excited to work directly with a founder, thrive in fast-moving environments, and want to grow into a second-in-command leadership role — with the support and resources to eventually help run operations.\n\r\nWhat You'll Actually Do:\r\nThis is a dynamic, evolving role — meaning what you do this week might look different next week. If that excites you, keep reading.\n\r\nSome examples of tasks you’ll handle:\n\r\n- Calling and confirming same-day appointments (phone support, reschedules, no-shows)\n\r\n- Daily appointment review (ensure logical drive times, conflicts, overlaps)\n\r\n- On-call support tasks like: blocking off calendar time, connecting domains, collecting data\n\r\n- Managing onboarding and client follow-up checklists\n\r\n- Organizing SOPs and documenting systems\n\r\n- Handling support tickets or minor tech issues\n\r\n- Running reports, tracking lead/job data, assisting with appointment setting, and sending updates\n\r\n- Providing oversight of daily operations\n\r\n- Solving problems independently — resourceful first, questions second\n\r\nMust-Have Skills:\n\r\n- Excellent spoken and written English\n\r\n- Strong tech background: Zapier, GHL, Google Workspace, Airtable, Upgrade to see actual info\n\r\n- Reliable internet, strong time management, and high attention to detail\n\r\n- Comfortable speaking on the phone in clear, professional English (for confirming appointments)\n\r\n- Bonus: Experience working with agencies or consulting teams\n\r\n- Bonus: Automation experience with Upgrade to see actual info, Zapier, n8n, etc.\n\r\nCompensation & Benefits:\n\r\n- Starting Salary: $750–$1,000 USD/month (based on experience and skill)\n\r\n- Opportunity to grow to $1,200+/month quickly based on performance, ownership, and impact\n\r\n- 13th Month Pay (standard for PH-based roles)\n\r\n- Performance-Based Bonuses for results and reliability\n\r\n- Paid Local Holidays after 3-month probation\n\r\n- Long-Term Role with potential promotion to Operations Manager\n\r\n- Ongoing Training & Mentorship — you’ll learn systems, automation, and agency ops\n\r\n- Access to Tools & Resources to grow your skills and responsibilities over time\n\r\n- You’ll work directly with the founder — not buried under layers of management\n\r\nGrowth Path:\r\nThis is not a stepping-stone VA gig. We’re looking for someone who wants to grow into an Ops Manager role — take on more responsibility, and eventually lead parts of the business.\n\r\nIf you're hungry, reliable, and capable — this could be a long-term opportunity with bonuses, leadership growth, and ongoing training.\n\r\nReady to Apply?\r\nFollow the link below and complete all steps carefully:\nUpgrade to see actual info\n\r\nWe are excited to grow with you!",
  "skill_requirements": [
    "GoHighLevel",
    "Operation Management",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:22:29.615717",
      "reason": "Job first discovered"
    }
  ]
}