{
  "job_id": "1422718",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Representative-Appointment-Setter-1422718",
  "scraped_at": "2025-07-15T12:29:35.713094",
  "title": "Sales Representative Appointment Setter",
  "type_of_work": "Part Time",
  "salary": "22,8800 OTE (base + commission) on part-time role",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re Hiring: Remote Part-Time Appointment Setter (Philippines-Based)\n\r\nIdeal for women passionate about confidence, empowerment & deep connection\n\r\nWork from home | 92–140 PHP/hour (based on experience) + 400 PHP commission per closed sale\r\nPart-Time: 20 hours per week | 4 hours per day | 5 shifts per week\r\nShifts available Monday–Sunday\r\nPart-Time Shift Hours: 3:30pm–7:30pm AEST\n\r\nWith 20 hours worked, you have the potential to earn an extra 2,000 PHP per week in commission alone\n\r\nStudio Republic is an empowerment photography studio based in Australia. We help people rediscover their confidence, self-worth, and inner fire. We're looking for a Part-Time Appointment Setter who can speak to our clients with heart, conviction, and professionalism.\n\r\nMost of our clients are women stepping into life-changing experiences, so we need someone who can hold space for vulnerability, self-doubt, and transformation. This role is best suited to someone who deeply understands the female experience and makes others feel seen, heard, and safe.\n\r\nYou may only apply if you meet ALL of the following:\n\r\n    Crystal-clear spoken English, minimal accent, easily understood by Australians\r\n    Emotionally intelligent, warm, and deeply present on calls\r\n    Quiet, distraction-free background (no kids, no roosters, no interruptions)\r\n    Noise-cancelling headset\r\n    Reliable, high-speed internet connection\r\n    Available to work:\r\n        Five shifts per week\r\n        3:30pm–7:30pm AEST (Australian Eastern Standard Time)\r\n    Passionate about empowerment, vulnerability, and women’s stories\r\n    Able to guide people through self-doubt without pressure or robotic replies\n\r\nHow to Apply:\n\r\nSend a 2-minute audio message answering:\n\r\n1.  Why do you want to work with Studio Republic?\r\n2.   What does “empowerment” mean to you?\r\n3.   Share a time in your life when your self-esteem was low — and how you rebuilt it.\r\n4.   What makes someone feel truly heard and seen?\r\n5.   What would you say to someone who’s nervous about being photographed?\r\n6.  See scenario below\n\r\nObjection Scenario:\n\r\n\"I really want to do it… but it just feels like a lot of money to spend on myself. I never do things like this. I just don’t know if I can justify it.\"\n\r\nWhat would you say to help her feel empowered and supported — without pressure?\n\r\nSend To: Upgrade to see actual info\r\nSubject line: Part-Time Appointment Setter Application – [Your Name]\n\r\nInclude:\n\r\n1. Your audio message\r\n2. Short CV or background\r\n3. Photo of your workspace\r\n4. Confirmation of internet speed, noise-cancelling headset, and quiet working conditions",
  "skill_requirements": [
    "Outbound Sales",
    "Sales Management",
    "Account Acquisition"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:37:20.224439",
      "reason": "Job first discovered"
    }
  ]
}