{
  "job_id": "1422809",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Influencer-Marketing-Manager-1422809",
  "scraped_at": "2025-07-15T15:43:59.505560",
  "title": "Influencer Marketing Manager",
  "type_of_work": "Full Time",
  "salary": "700",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re growing fast — and we’re hiring an Influencer Marketing Manager who can move with us, help scale our streetwear brand authentically, and deliver results.\n\r\nResponsibilities:\n\r\nDaily outreach and relationship-building with influencers and creators.\r\nScout and identify fresh, culturally relevant talent that aligns with our streetwear aesthetic.\r\nManage influencer partnerships end-to-end, including negotiation and briefing.\r\nTrack performance metrics (reach, engagement, conversions) and optimize campaigns.\r\nWork closely with internal teams to analyze results and stay organized.\n\r\nRequirements:\n\r\n2+ years of influencer marketing experience, preferably in fashion/streetwear.\r\nStrong communication, negotiation, and relationship-building skills.\r\nHighly organized and data-driven, with attention to performance metrics.\r\nDeep understanding of youth culture, streetwear trends, and influencer ecosystems.\r\nProactive, resourceful, and able to bring influencer suggestions and campaign ideas quickly.\n\n\r\nWhat We Offer:\n\r\nCompetitive pay.\r\nCreative freedom and meaningful impact on a scaling brand.\r\nAccess to exclusive drops and collaborations.\r\nClear growth opportunities in a dynamic, fast-paced environment.\n\r\nWhat we’re looking:\n\r\nProven track record of influencer campaigns (show us your results!).\r\nAn existing network or a clear plan to quickly source relevant influencers.\r\nStrong cultural awareness and trend-spotting ability.\r\nAnalytical and results-oriented mindset.\n\r\nHow to Apply:\n\r\nInclude the word “BREAD” in your application so we know you’re paying attention.\n\r\nQuestion to applicant:\n\r\nIf you joined our team tomorrow, how would you approach finding and selecting influencers for our streetwear brand in your first 30 days? Please describe the criteria you would use to evaluate them and how you would ensure they’re a good fit for both our audience and brand culture.\n\r\nOnly experienced candidates will be considered.",
  "skill_requirements": [
    "Influencer Marketing",
    "Affiliate Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:34:57.688394",
      "reason": "Job first discovered"
    }
  ]
}