{
  "job_id": "1422423",
  "url": "https://www.onlinejobs.ph/jobseekers/job/TikTokShorts-Video-creator-editor-Fishing-niche-1422423",
  "scraped_at": "2025-07-14T23:25:21.531945",
  "title": "TikTok/Shorts Video creator & editor, Fishing niche",
  "type_of_work": "Part Time",
  "salary": "300",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a TikTok/Instagram Reels brainrot scroller who lives and breathes fishing Upgrade to see actual infos? Do you know how to take a trending format and turn it into pure viral gold? We’re looking for a creative and passionate UGC Upgrade to see actual info creator to join our team part-time.\n\r\nIf you’re a Upgrade to see actual info master who loves fishing and can create organic TikTok/Instagram content that drives hype for fishing products, this is the role for you.\n\r\nRequirements (applications without these will not be considered):\n\r\nShare who your favorite creators are and which platforms you watch them on.\n\r\nLink a recent fishing TikTok/Reel that you liked/saved\n\r\nWhat You’ll Do:\n\r\nCreate fishing Upgrade to see actual infos, funny edits, and entertaining videos tailored for TikTok/Instagram that showcase our fishing app and products.\n\r\nFollow and replicate viral trends while adding your own creative spin to make content irresistible.\n\r\nUse tools like CapCut, or Figma for simple, effective editing (this isn’t about fancy edits—it’s about the content).\n\r\nWork remotely and independently to brainstorm and execute fresh ideas.\n\r\nWhat We’re Looking For:\n\r\nA Upgrade to see actual info master: You know what’s trending and what’s funny in fishing TikTok (US audience).\n\r\nPassion for fishing culture and the outdoors.\n\r\nA knack for storytelling in short, punchy formats that hook people fast.\n\r\nFamiliarity with CapCut or other basic editing tools.\n\r\nStrong understanding of TikTok/Instagram culture and trends.\n\r\nWhat We Offer:\n\r\nPart-time, remote work with flexible hours.\n\r\nThe chance to grow professionally while creating fun and viral content.\n\r\ninclude at the end of your application: “fishtime.”",
  "skill_requirements": [
    "Content Creation"
  ]
}