{
  "job_id": "1422558",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AccountantBookkeepingFinancial-Analysis-1422558",
  "scraped_at": "2025-07-15T15:41:34.301785",
  "title": "Accountant/Bookkeeping/Financial Analysis",
  "type_of_work": "Full Time",
  "salary": "based on experience.  Minimum $5.00 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Senior Bookkeeper / Excel Accountant – Real Estate, RV Park, & Consulting \n\r\nI am seeking a highly experienced, detail-oriented Bookkeeper / Accountant to manage and optimize monthly financial records across multiple businesses — including a real estate portfolio, an RV/recreational park, and a consulting company.\r\nI have several businesses including consulting, real estate and personal lending.  This is an opportunity for someone to come in and grow with my companies.  \n\r\nThis is a hands-on, Excel-driven accounting role — not software-based — requiring a strong understanding of real estate accounting, tenant collections, and balance sheet reconciliations. You will also manage income tracking from online booking platforms and help build systems that improve financial visibility and accuracy.\r\nYou will be preparing tax and accounting financial records but also “operational” or management reporting including KPIs and other tracking for operational purposes.\n\r\nThis is a remote, long-term opportunity to work directly with an entrepreneur managing multiple ventures.  Opportunity to grow with the role and looking for long-term position.  \n\r\nThe reporting now is done on excel so the candidate must have strong excel skills and proficient.  Opportunity to transition to simplified platform (will not transition to Quickbooks)\n\r\nKey Responsibilities\r\n- Track rent collections, tenant balances, and occupancy status across multiple rental units\r\n- Record and reconcile daily/weekly/monthly revenues from RV park bookings (Airbnb, Hipcamp, or direct bookings)\r\n- Build and maintain structured Excel workbooks for each entity (P&L, Balance Sheet, Cash Flow)\r\n- Perform monthly bank and account reconciliations for each business\r\n- Track CapEx projects, repairs, and operating expenses\r\n- Implement financial controls and audit trails for all income and expense transactions\r\n- Identify and deploy efficiencies and automation using advanced Excel functions (e.g., lookups, pivot tables, conditional logic)\r\n- Compile monthly financial reports and executive summaries\r\n- Learn and leverage booking platform exports to reconcile against payments received\r\n- Support year-end financial preparation for external accountants\n\r\nRequired Qualifications\r\n- 5+ years of professional bookkeeping/accounting experience.  CPA is required.  Tax accounting and preparation a plus. \r\n- Direct experience with U.S. real estate accounting, including rental property operations and tenant management\r\n- Consolidations and understanding of the tax and accounting books.  \r\n- Advanced proficiency in Microsoft Excel, including pivot tables, VLOOKUP/XLOOKUP, nested formulas, and multi-entity tracking\r\n- Prior experience managing the finances of multiple businesses or properties\r\n- Strong understanding of balance sheet structure, cash vs accrual tracking, and reconciliations\r\n- Fluent in English (written and verbal), with clear and proactive communication skills\r\n- \r\nPreferred but not required:\r\n- Experience with Airbnb or RV/hospitality platforms for tracking customer bookings \r\n- Experience supporting a U.S.-based business owner or entrepreneur\n\r\nLocation\r\nMust be available to overlap at least 4 hours per day with U.S. Central Time\r\nSelf-starter, must be able to meet deadlines, work independently and be proactive, not just looking for daily work direction.  \n\r\nHours & Compensation\r\n- Part-time to full-time (30–40 hrs/week, depending on fit)\r\n- Competitive hourly pay in USD\r\n- Direct-hire, long-term engagement with performance-based increases\n\r\nHow to Apply\r\nPlease submit:\r\n1. Your resume (in English)\r\n2. (Optional) A 1-minute video introduction about your background and experience\r\n3. A short description or Excel sample of a financial tracking system you've built for real estate or multi-entity businesses\r\n4. Your weekly availability and time zone",
  "skill_requirements": [
    "Accounting",
    "Microsoft Excel",
    "Financial Analysis"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:24:26.690961",
      "reason": "Job first discovered"
    }
  ]
}