{
  "job_id": "1422392",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Marketing-and-Patient-Support-Assistant-1422392",
  "scraped_at": "2025-07-15T15:38:24.723945",
  "title": "Virtual Marketing and Patient Support Assistant",
  "type_of_work": "Full Time",
  "salary": "$125 USD per week",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us\r\nMendCo Physiotherapy is an Ontario-based clinic specializing in hypermobility, movement dysfunction, and chronic pain. We’re known for our evidence-based care, strong physician referrals, and our focus on educating and empowering patients.\r\nWe’re professional, patient-centered, and privacy-compliant (PIPEDA/PHIPA).\n\n\r\nAbout the Role\r\nWe’re hiring a virtual assistant who’s organized, reliable, and creative. Your work will support both our front-end patient communication and back-end content systems.\r\nYou'll handle social media, email marketing, and blog formatting while guiding new and returning patients through the booking journey.\n\n\r\nKey Responsibilities\r\n-Manage and schedule social media content (TikTok, IG, YouTube, X)\r\n-Create visuals, format blogs, and assist with email marketing\r\n-Answer calls, respond to leads, and guide bookings via Noterro\r\n-Follow up with past patients and request reviews\r\n-Track payments, organize digital files, and maintain SOPs\n\n\r\nRequired Skills\r\n-Excellent written and spoken English\r\n-Experience in VA, customer service, or healthcare admin\r\n-Proficient with Canva, Google Workspace, and social schedulers\r\n-Comfortable using or learning Noterro, Beehiiv/Mailchimp, and CRM tools\n\n\r\n*********If interested please visit Upgrade to see actual info and answer the following questions ***********\n\r\n1. What condition do we specialize in and where are we located?\r\n2. If a new patient calls asking for a next-day appointment but we’re fully booked, how would you handle it?\r\n3. If someone outside Ontario wants to book, what service can we offer?",
  "skill_requirements": [
    "Phone Support",
    "Office and Administration",
    "Social Media Marketing"
  ],
  "is_active": true,
  "status_history": []
}