{
  "job_id": "1422330",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-YouTube-Long-Short-Form-1422330",
  "scraped_at": "2025-07-14T23:10:05.116744",
  "title": "Video Editor - YouTube Long & Short Form",
  "type_of_work": "Part Time",
  "salary": "5",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you passionate about video editing...and want to get PAID WELL to do what you LOVE!\n\r\nDo you have experience editing YouTube LONG-FORM videos and understand how to make videos engaging and interesting to maximize audience interest?\n\r\nDo you have experience adding b-roll, text graphics, motion, transitions to LONG FORM content? \n\r\nIf you said, YES, please keep reading and apply if you meet the criteria. \n\r\nAs the Video Editor, you will be responsible for editing long-form and shorts videos for a successful YouTube channel.\n\n\r\nTO QUALIFY, YOU MUST HAVE:\n\r\n- Adobe Premier Pro or Final Cut Pro on your computer (or a professional editing software). \r\n- 2 years of experience editing LONG-FORM YouTube content. \r\n- Access to a library of many different motion graphics, text overlays, b-roll, transitions and sound effects. \r\n- Excellent English language skills.\r\n- Excellent attention to detail.\r\n- Speed and the ability to complete editing projects quickly.\n\r\nSALARY:\n\r\n$3.75/r during the training period (1-2 months, depending on how fast you learn our style and preferences). \n\r\n$5.00/hr once fully trained plus bonuses for editing quality and speed. \n\r\nHours - 15-25/week to complete a set number of videos. \n\r\nHOW TO APPLY: (If you don't include everything in this list, your application will not be considered)\n\r\n- When applying, put \"elephant\" in the subject heading.\r\n- Attach your resume that explains how you meet the specific criteria in this posting.\r\n- You must include THREE LINKS to different YouTube LONG-FORM videos you've edited that show your video editing skills and abilities.\n\r\nAFTER YOU APPLY:\n\r\n- If you meet the criteria, we will schedule a video interview on Zoom. Your camera must be on during the interview.\r\n- During the interview, you will be asked to explain your experience.\r\n- During the interview, you will also be asked to share your screen and complete specific tasks to prove you have the qualifications we require.\n\r\nVIDEO EDITING PROJECT TASK:\n\r\nIf you are successful in the interview, you will then be asked to complete a video editing sample project to judge your editing skills and ability to follow instructions, communicate clearly and meet deadlines.",
  "skill_requirements": [
    "Social Media Video Editing",
    "Adobe Premiere Pro",
    "Apple Final Cut Pro"
  ]
}