{
  "job_id": "1422231",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Content-Writer-Blogs-GBP-Posts-Backlink-Content-1422231",
  "scraped_at": "2025-07-15T12:36:16.365560",
  "title": "Content Writer – Blogs, GBP Posts & Backlink Content",
  "type_of_work": "Full Time",
  "salary": "$800+",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Overview\r\nWe’re looking for a focused and reliable content writer to handle our ongoing blog posts, Google Business Profile (GBP) content, and backlink articles. This role is ideal for someone with excellent research and writing skills who can write clearly and quickly for the ABA therapy and healthcare industries.\n\r\nResponsibilities\r\nWrite weekly blog posts for multiple ABA therapy and healthcare clients\r\nDevelop GBP content that’s geo-targeted and localized\r\nDraft high-quality content for backlinking and guest post purposes\r\nRepurpose and edit AI-generated drafts for clarity, tone, and engagement\r\nFollow and refine internal workflows to keep pace with publishing needs\r\nCommunicate regularly with the SEO team for topic coordination\r\nDeliver clean, proofread, plagiarism-free copy on time\n\n\r\nWhat We’re Looking For\r\nProven writing experience (healthcare, ABA, or educational topics a plus)\r\nFamiliarity with basic SEO concepts (H1s, keyword use, internal linking)\r\nAbility to work fast without sacrificing quality\r\nComfortable editing or enhancing AI-generated content\r\nStrong communication and accountability in a remote setting\r\nWillingness to learn our style guide and stick to it\n\r\nTools & Workflow\r\nWe use Google Docs, Upgrade to see actual info, Slack, and Loom for most team communications and task tracking\r\nYou’ll receive assignments via Upgrade to see actual info, with clear deadlines and word count expectations\r\nAI support (e.g., ChatGPT) may be provided to help with drafts, but all content must be polished, original, and aligned with our tone\r\nYou’ll be trained on our internal SOPs, including formatting, keyword integration, linking strategies, and publishing steps\r\nAll content must be submitted through our internal QA checklist before review.\n\r\nSuccess in This Role Looks Like\r\nYou consistently hit weekly writing targets (3–5 pieces, depending on type and length)\r\nYou maintain a low revision rate by following briefs closely and self-editing thoroughly\r\nYou’re responsive during PH working hours and communicate clearly if you’re stuck or need help\r\nYou demonstrate improvement over time in writing speed, accuracy, and strategic keyword use\r\nYou accept feedback well and apply it to future drafts without repeating the same issues\n\r\nAlong with your resume, please submit a 200-word original writing sample on the topic: “What Is ABA Therapy?”\r\nYour sample should include relevant facts and statistics, and it must be written manually—do not use AI tools to generate the content.\n\r\nWe’re looking for clear, informative writing that reflects your understanding of the topic and your ability to communicate it effectively.",
  "skill_requirements": [
    "Copywriting",
    "Article Writing",
    "Communication"
  ],
  "is_active": true,
  "status_history": []
}