{
  "job_id": "1422446",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Administrative-Assistant-Scheduling-Coordinator-1422446",
  "scraped_at": "2025-07-15T14:29:26.755804",
  "title": "Administrative Assistant / Scheduling Coordinator",
  "type_of_work": "Full Time",
  "salary": "$1000/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About the Role\r\nWe are seeking a highly organized and detail-oriented Administrative & Scheduling Assistant to support our leadership team remotely. This role involves managing complex calendars, coordinating meetings with multiple participants, and assisting with administrative and billing tasks. You will play a key role in keeping our operations efficient and our team aligned.\n\r\nKey Responsibilities\r\nYou will coordinate, schedule, and confirm appointments and hearings. You will communicate professionally with clients, attorneys, and teaUpgrade to see actual infombers via email. Managing calendars to reduce conflicts and maximize efficiency will be an important part of your role. You will assist with billing tasks such as trust fund requests, entering billable hours, and including billing details in scheduling emails. Tracking and updating appointments, deadlines, and case notes in shared tools is essential. Preparing and reviewing documents such as summons, agendas, forms, summaries, and decisions will also be part of your duties. You will proactively resolve scheduling conflicts, maintain organized and confidential documentation, send reminders and follow-ups before meetings, and support leadership with general administrative tasks as needed.\n\r\nRequirements\r\nYou should have at least 2.5 years of experience as an executive assistant, administrative coordinator, legal assistant, or a similar role. You must have proven ability to manage complex scheduling and coordinate across multiple stakeholders. Excellent written and spoken English is required. You should be proficient with Google Calendar, Zoom, and Google Workspace. Experience with case management systems is a plus. Above all, you need to be extremely organized, responsive, and reliable.\n\r\nHow to Apply (Please follow all steps)\r\nPlease include the phrase “I read this” in your subject line or first sentence of your application. Attach your updated resume (PDF format preferred). Also, send a 1–2 minute video introducing yourself and briefly sharing your relevant experience. A simple phone video is fine — we just want to get to know you!\n\r\nAdditional Information\r\nThis is a 100% remote position. Working hours must overlap with U.S. Eastern Time. We intend to use Skuad as our Employer of Record (EOR) platform, and this position is as an employee, not a contractor. Benefits include healthcare, social security, paid leave, and 13th month pay. We review applications daily and will contact qualified candidates for a Zoom interview.",
  "skill_requirements": [
    "Documentation",
    "Coordination",
    "Scheduling"
  ],
  "is_active": true,
  "status_history": []
}