{
  "job_id": "1422424",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Automation-Growth-Architect-1422424",
  "scraped_at": "2025-07-15T15:43:01.581405",
  "title": "Marketing Automation & Growth Architect",
  "type_of_work": "Full Time",
  "salary": "Up to $1,600.00 USD per month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Marketing Automation & Growth Architect (Advisory Seat, Not a Task List)\n\r\nAbout Us:\r\nWe are not your typical agency. We’re a full-spectrum strategic growth firm, serving founders and executive teams who are scaling, raising capital, or entering new markets. We steward Upgrade to see actual infontum, not just marketing. Our work is built around advisory, structure, and systems that protect upside and drive disciplined, enduring results. We don’t chase trends; we architect growth.\n\r\nWho We’re Looking For:\r\nWe’re not hiring an order-taker or a task-runner. We’re seeking a true partner; an ambitious builder who thrives on autonomy, stewardship, and high-trust collaboration. You’ll take a seat at the advisory table, entrusted to help design and optimize the operational intelligence layer that powers our clients’ success and our own internal evolution.\n\r\nWhat You’ll Do:\r\nArchitect and automate: Own our marketing and client automation stack (HubSpot, N8N, Upgrade to see actual info, Airtable, APIs, JSON, etc.), designing and implementing systems that accelerate business, not just awareness campaigns.\n\r\nAdvance internal tools: Develop and improve on proprietary frameworks and AI-driven solutions that expand our advisory impact and futureproof our client relationships.\n\r\nDrive outcomes: Track, analyze, and refine systems for performance, always seeking structural improvements and leverage…never just busywork.\n\r\nSteward client data: Manage SEO, Linkedin, CRM, segmentation, and email marketing with discipline, discretion, and a drive to make every touchpoint count.\n\r\nThink ahead: Spot opportunities to evolve, systematize, and optimize. Be the one who brings the “next right move” before being asked.\r\nOptional skills: Run end-to-end LinkedIn marketing and engagement (organic, outreach, automation, reporting) that creates meaningful relationships and pipeline, not just vanity metrics.\n\n\r\nWho You Are:\r\nYou operate with the discernment and discipline of an advisor, not a freelancer.\n\r\nYou have deep experience with HubSpot, LinkedIn marketing, and automation platforms like Upgrade to see actual info, N8N, Airtable, and LLMs (ChatGPT, Claude, etc.).\n\r\nYou’re passionate about staying ahead of the AI curve. Therefore, constantly learning, testing, and building new capabilities.\n\r\nYou see yourself as a growth professional: trusted to architect systems, not just execute lists.\n\r\nYou’re a self-manager: organized, proactive, and always aligning actions to outcomes.\n\r\nYou communicate with clarity, bring structure to chaos, and don’t wait to be told what’s broken or what’s possible.\n\r\nYou value precision, process, and partnership. You’d rather steward growth than chase fads.\n\n\r\nWhy Join Us?\r\nStep into a high-trust, high-impact seat at a strategic table, and work directly with world-class consultants and be mentored at the highest level.\n\r\nPlay a key role in architecting the next generation of operational intelligence, both for client work and our own internal evolution.\n\r\nBe empowered to create, propose, and implement. Your ideas will be valued, not boxed in.\n\r\nShape systems and outcomes that have lasting impact, not just fleeting deliverables.\n\r\nEnjoy flexible work, autonomy, and the respect that comes from being part of a curated, outcomes-driven team.\n\r\nTo Apply:\r\nIn addition to your resume, include system or automation you built that delivered lasting value, or describe how you’ve led or grown a LinkedIn or SEO marketing for yourself or a client. \n\r\nShow us how you think like a leader, not a vendor.\n\r\nOnly applicants who demonstrate this “growth architect” mindset and real-world automation wins will be considered.",
  "skill_requirements": [
    "HubSpot CRM",
    "JSON",
    "Make.com"
  ],
  "is_active": true,
  "status_history": []
}