{
  "job_id": "1422076",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Assistant-Email-Design-Social-Media-CRM-1422076",
  "scraped_at": "2025-07-15T14:27:20.556711",
  "title": "Marketing Assistant: Email Design, Social Media & CRM",
  "type_of_work": "Part Time",
  "salary": "$350-$450 USD",
  "hours_per_week": "5",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Part-Time Virtual Assistant: Email Marketing, Social Media & Graphic Design\r\nRemote | $3–$6 USD/hour | Long-Term Growth\n\r\nAbout Us\r\nWe’re a small, friendly team of two based in Houston, TX, and we’re looking for our very first virtual assistant! Our mission is to help awesome businesses grow by making marketing simple, smart, and fun—no confusing jargon, no shady tactics, just real results and real connection.\n\r\nOur Core Values\r\nWe believe in Radical Transparency, Client-First Mindset, Innovation Over Imitation, and Growth Through Honest Feedback. We own our wins and mistakes together, always put our clients first, and love learning new things. If you value clear, honest communication and want to be part of a team that supports your growth, you’ll fit right in.\n\r\nWho We’re Looking For\r\nYou’re creative, organized, and excited to help businesses succeed. You love designing emails and creating social media graphics that get attention. You can follow SOPs, communicate clearly, and pay attention to details. You’re not afraid to learn new tools or ask questions.\n\r\nWhat You’ll Do\r\nYou’ll design and schedule engaging email campaigns, making sure they land in the inbox and look great. You’ll create graphics for both email and social media using platforms like Adobe Express, Canva, or Figma. You’ll help schedule social posts and support basic DM automations. Most communication will be async via Slack or Upgrade to see actual info, but we’ll check in together on Google Meet a few times, especially during your first few weeks, and a video interview via Google Meet is required as part of the hiring process.\r\nYou don’t need to overlap with our schedule (Central Standard Time, Houston), as long as your tasks are done on time and you’re available for occasional meetings. We care about results, not hours on the clock.\r\nIf you’re not familiar with email deliverability or with tools (like GoHighLevel, TapMango, or Notion), don’t worry—we’ll provide training through SOPs and YouTube resources. The only must-have is experience designing emails in a platform like Adobe Express, Canva, or Figma.\n\r\nRequirements\r\nExperience designing marketing emails (samples required)\r\nProficiency with at least one design tool: Adobe Express, Canva, or Figma\r\nGood written and spoken English\r\nOrganized, detail-oriented, and reliable\r\nComfortable with Google Workspace (Docs, Sheets, etc.)\r\nWillingness to learn new platforms\n\r\nNice-to-Haves\r\nExperience with GoHighLevel, TapMango, or Notion\r\nPrevious remote or agency work\n\r\nCompensation and Growth\r\n$3–$6 USD/hour depending on experience\r\nPlease state your desired hourly rate in your application\r\nPart-time (4–6 hours/day), with room to grow into full-time or management\r\n100% remote, long-term position\n\r\nHow to Apply\r\nPlease follow these steps CAREFULLY; attention to detail matters to us!\r\nUse the subject line: “I am your next Rockstar VA – [Your Name]”\r\nUse a minimum of 6 Apply Points for your application.\r\nTake the free DISC test  and share your results \r\nAttach or link to your best email design samples.\r\nIn 2–3 sentences, tell us why you’d love this job and which of our values you connect with most.\r\nState your expected hourly rate in USD.\r\nInclude a funny Upgrade to see actual info or GIF in your application (photo or gif format is fine).\r\n (We’re all about getting work done, but that doesn’t mean we can’t have fun!)\r\nIf you’re shortlisted, you’ll receive a small paid task and be invited to a video interview via Google Meet.\n\r\n We respect your time: You’ll hear back from us within 24 hours of your application.\n\r\nWhy Join Us?\r\nSupportive, transparent team\r\nClear training and SOPs\r\nFlexible schedule—work when you’re most productive\r\nReal growth opportunities\r\nA culture that values learning, honesty, and teamwork\n\r\nReady? Apply now—we can’t wait to meet our first superstar VA!",
  "skill_requirements": [
    "Email Marketing",
    "Social Media Management",
    "Graphic Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:40:02.625594",
      "reason": "Job first discovered"
    }
  ]
}