{
  "job_id": "1422888",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Ecommerce-Director-1422888",
  "scraped_at": "2025-07-15T12:36:01.117594",
  "title": "Ecommerce Director",
  "type_of_work": "Full Time",
  "salary": "$640/month Base or Negotiable Performance-Based Revenue Share",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us:\r\nWe are a fast-growing direct-to-consumer brand focused on delivering high-quality products and a seamless online shopping experience. As we continue to scale, we’re looking for an experienced Ecommerce Director to lead our digital storefront strategy and execution. This role is ideal for someone with hands-on ecommerce experience—particularly former operators or founders with a background in dropshipping or running Shopify-based brands.\n\r\nRole Overview:\r\nThe Ecommerce Director will be responsible for overseeing the performance, design, and profitability of our Shopify storefront. This includes website optimization, pricing strategy, funnel development, user-generated content (UGC) management, and cross-functional team coordination. We’re seeking someone who is data-driven, results-oriented, and confident in their ability to both lead and delegate.\n\r\nKey Responsibilities:\n\r\nWebsite Experience & Optimization:\r\n-Oversee the design and structure of our Shopify website to ensure a clean, modern, and conversion-optimized user experience\r\n-Collaborate with the web developer to maintain site speed, mobile responsiveness, and functionality\r\n-Ensure product pages are clear, compelling, and informative\n\r\nFunnel Development:\r\n-Build and manage sales funnels, including upsells, post-purchase offers, and abandoned cart recovery flows\r\n-Leverage tools like Zipify, ReConvert, or similar platforms to increase average order value and customer lifetime value\r\n-Work closely with the email marketing team to align funnel flows with campaign objectives\n\r\nPricing Strategy & Profitability:\r\n-Set product pricing based on a strong understanding of cost of goods, shipping, fulfillment models (including dropshipping), and gross margins\r\n-Monitor profitability metrics including breakeven ROAS, CAC, and contribution margin\r\n-Adjust pricing strategies dynamically in response to product performance and market trends\n\r\nUser-Generated Content (UGC) Oversight:\r\n-Evaluate and select content creators and UGC partners that align with brand goals\r\n-Provide clear, actionable creative direction to maximize the effectiveness of produced content\r\n-Review and approve final assets to ensure quality and conversion potential\n\r\nTeam Coordination & Delegation:\r\n-Assign tasks and manage deliverables across a cross-functional team including customer service VAs, email marketers, and web developers\r\n-Set clear expectations, timelines, and priorities to ensure smooth execution of ecommerce initiatives\r\n-Act as a central point of leadership for ecommerce operations, reporting directly to company leadership\n\r\nPerformance Analysis:\r\n-Track and report on key performance indicators (KPIs) such as AOV, conversion rate, ROAS, LTV, and site performance\r\n-Use data to identify opportunities for growth, efficiency, and user experience improvements\r\n-Deliver regular insights and updates to leadership, making recommendations for continuous optimization\n\r\nQualifications:\r\n-5+ years of experience in ecommerce, preferably with DTC or dropshipping business models\r\n-Proven experience running or managing a Shopify-based store\r\n-Strong understanding of ecommerce metrics, financial modeling, and customer journey mapping\r\n-Excellent project management and delegation skills across remote or distributed teams\r\n-Familiarity with tools like Klaviyo, Zipify, ReConvert, Meta Ads Manager, and Shopify analytics\r\n-A proactive mindset, capable of working independently and solving problems efficiently\n\r\nBonus Skills:\r\n-Experience managing creative talent or freelancers\r\n-Background in paid media strategy or performance marketing\r\n-Exposure to product launches, inventory management, or fulfillment workflows                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:48:38.408976",
      "reason": "Job first discovered"
    }
  ]
}