{
  "job_id": "1422464",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Ecommerce-Virtual-Assistant-Operations-Officer-for-Growing-Footwear-Brand-1422464",
  "scraped_at": "2025-07-15T12:22:55.773242",
  "title": "Ecommerce Virtual Assistant / Operations Officer for Growing Footwear Brand",
  "type_of_work": "Any",
  "salary": "$500 a month with bonuses",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a fast-growing ecommerce footwear brand generating 7 figures annually, and we're looking to bring on an experienced Ecommerce Virtual Assistant (VA) to join our team. This is an exciting opportunity to be part of a thriving company, with the potential for growth into a COO role as we scale.\n\r\nKey Responsibilities:\n\r\nCoordinate with creators for content and product promotion.\n\r\nRespond to customer comments and inquiries on Facebook and other social media platforms.\n\r\nManage customer service emails, ensuring timely and professional responses.\n\r\nWeekly teaUpgrade to see actual infoetings to align with our goals and strategies.\n\r\nDaily reporting via Slack on tasks, updates, and priorities.\n\r\nAs we expand, take on additional responsibilities with the opportunity to grow into a COO role.\n\r\nRequirements:\n\r\nProven experience working for an ecommerce brand.\n\r\nProficient in using ChatGPT for content generation and automation tasks.\n\r\nFluent in English with excellent written and verbal communication skills.\n\r\nBig bonus if you are experienced with management tools like Notion, Zapier, Slack, ClickUp, Asana, or similar.\n\r\nHighly organized with an ability to manage multiple tasks simultaneously.\n\r\nProactive, self-driven, and a quick learner.\n\r\nAdditional Information:\n\r\nYou will be expected to attend weekly teaUpgrade to see actual infoetings.\n\r\nThis is a full-time position with a monthly salary plus performance-based bonuses.\n\r\nAs the company grows, there will be room for advancement into a higher leadership role.\n\r\nIf you are looking for a long-term opportunity in a fast-growing ecom brand and have the skills to back it up, we'd love to hear from you!\n\r\nHow to Apply:\n\r\nPlease submit your resume, detailing your relevant experience in ecommerce, as well as any proficiency with the tools mentioned above. We look forward to seeing how you can help us scale to the next level!",
  "skill_requirements": [
    "Influencer Marketing",
    "Ecommerce",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:29:02.218754",
      "reason": "Job first discovered"
    }
  ]
}