{
  "job_id": "1422634",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Associate-for-Australian-Financial-Planning-Firm-1422634",
  "scraped_at": "2025-07-15T12:34:15.912058",
  "title": "Marketing Associate for Australian Financial Planning Firm",
  "type_of_work": "Any",
  "salary": "Based on Experience",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Looking for a marketing associate with meta paid ad experience \n\r\nContracted hourly basis - open to permanent part time for the right candidate\r\n$ based on experience \n\r\nStart – from August 2025\n\r\nWe are an Australian financial advice practice. We are a team of seven with a practice that specialises in foreign pensions (both private and government) for people living in Australia.\n\r\nDue to continued growth, we are looking for a long term candidate to grow within the business and be responsible for our marketing activities across our two brands.\n\r\nThe role would include but not limited to:\r\n• Preparing creative assets, audience and posting paid Meta ads, with ongoing review and tweaking as required\r\n• Managing lead data and ensuring it gets to CRM\r\n• Assist in the layout and drafting of client newsletter\r\n• Support other marketing activities – e.g. presentation for pitch to client or referral partners\n\r\nAttributes\r\n• Keen attention to detail\r\n• Effective and efficient communicator\r\n• Highly organised\r\n• Eager learner\r\n• Team Player\n\r\nExperience\r\nRequired\r\n• At least one years previous experience in paid ads on Meta (specifically Facebook) including audience setting and review\r\n• Previous experience in brand asset production\r\n• Experience with applications such as MS office, Google Chrome, CRM systems\r\n• Be process orientated and keen to find a better way to do things\n\r\nHighly regarded\r\n• Copywriting experience\r\n• Video editing\r\n• Tertiary qualification in relevant subjects\n\r\nYou would need:\r\nReliable internet and backup internet\r\nReliable computer\r\nHeadset or headphones and camera for video calls\n\r\nApplication\r\nPlease send your CV/Resume and cover letter outlining how your experience will be invaluable to this role to Upgrade to see actual info",
  "skill_requirements": [
    "eMail Marketing",
    "Social Media Content Creation",
    "Social Media Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:26:29.088197",
      "reason": "Job first discovered"
    }
  ]
}