{
  "job_id": "1422851",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Operations-Assistant-Electrical-Trade-Business-Remote-1422851",
  "scraped_at": "2025-07-15T14:39:07.058852",
  "title": "Operations Assistant – Electrical Trade Business (Remote)",
  "type_of_work": "Part Time",
  "salary": "8-10 AUD",
  "hours_per_week": "30",
  "date_updated": "Jul 15, 2025",
  "job_overview": "\"This job opportunity is with one of our valued clients, an established electrical trade business based in Perth, Australia. You’ll be working directly with our client, a reputable electrical trade company located in Perth, known for delivering high-quality services across commercial, residential, and industrial sectors.”\n\n\r\nAbout the Role:\r\nThis is a dynamic client-facing admin and ops role for someone who is proactive, reliable, and organized. You’ll assist with job tracking, pricing, client quotes, reporting, and daily operational support,  all while using tools like Xero, ServiceM8, and Google Workspace.\n\r\nYour ability to communicate clearly, follow procedures, and juggle competing priorities will be essential.\n\r\nKey Responsibilities:\r\nOperations, Quotes, and Client Support\n\r\nPrepare and send quotes, tenders, and proposals using ServiceM8 and Xero\r\nFollow up with clients to clarify requirements and finalize bookings\r\nAssist with technician scheduling and dispatch coordination\r\nSales & Customer Service\n\r\nManage customer communications across email, phone, and WhatsApp\r\nTrack client queries and job feedback, escalating where needed\r\nSupport proactive follow-up and debt collection for outstanding invoices\r\nReporting & Data Entry\n\r\nMaintain accurate operational records and time sheets\r\nMonitor job progress and technician notes in job management systems\r\nAssist with financial reporting and reconciliation using Xero\r\nProcess & Documentation Support\n\r\nUpdate SOPs, compliance templates, and WHS/SWMS documentation\r\nEnsure document accuracy and version control across projects\r\nFlag discrepancies (e.g., technician timesheets vs. clock-ins) and resolve with team\n\r\nTools You’ll Use:\r\nXero (invoicing, reconciliation, expense claims, bills)\r\nServiceM8 (quotes, scheduling, job tracking)\r\nGoogle Workspace (Docs, Sheets, Gmail, Drive)\r\nMicrosoft Excel (data accuracy and reporting)\r\nCanva (light design for social media or documentation)\r\nMeta Business Suite (basic post scheduling – optional)\r\nWhatsApp, Email, Slack, Zoom or Google Meet\n\r\nYou Might Be a Great Fit If You:\r\nHave 1–2 years of VA/Admin experience, especially in trades, construction, or service businesses\r\nAre familiar with ServiceM8, Xero, and Australian business tools\r\nWorked with or supported Australian clients or trade teams\r\nCommunicate clearly and can resolve client or technician issues proactively\r\nSpot problems early and take action — like noticing repeated complaints from one tech and escalating\r\nStay organized even when managing 30–50+ invoices or multi-step processes\r\nAre responsive during working hours and understand the importance of urgency in operations\n\r\nWhat We Offer:\r\nCompetitive pay based on experience and performance\r\nRemote, stable long-term role with regular reviews\r\nDirect work with a supportive Aussie team\r\nExposure to modern software and operational systems\n\r\nHow to Apply:\r\nIf this sounds like you, kindly apply using this form Upgrade to see actual info\n\r\nYour updated resume\r\nA short  video intro explaining your experience\r\nInclude \"Operations Assistant – Electrical\" in your subject line                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:34:26.734810",
      "reason": "Job first discovered"
    }
  ]
}