{
  "job_id": "1422897",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-Dispatch-VA-1422897",
  "scraped_at": "2025-07-15T15:47:52.176648",
  "title": "Customer Service Dispatch VA",
  "type_of_work": "Full Time",
  "salary": "$2.5 - $4 per hour",
  "hours_per_week": "55",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking a proactive, highly organized Customer Service & Dispatch Virtual Assistant to support our garage door service operations in managing day-to-day customer communications, technician coordination, and service scheduling. The ideal candidate is dependable, detail-oriented, and experienced in working independently in a virtual setting while maintaining high levels of efficiency and customer satisfaction.\n\r\nKey Responsibilities:\r\n- Answer and manage incoming customer service calls for garage door repairs\r\n- Collect comprehensive customer information and service requirements\r\n- Schedule service appointments and coordinate timing with customers\r\n- Manage and coordinate WhatsApp communications with field technicians\r\n- Receive and process work orders from advertising partners\r\n- Assign service jobs to technicians based on location, availability, and expertise\r\n- Input and maintain customer data in GoHighLevel CRM system\r\n- Track technician schedules and optimize service routing\r\n- Monitor service delivery timelines and send follow-up communications\r\n- Handle customer inquiries and service coordination with professionalism\r\n- Support field operations, logistics, and appointment management\n\r\nRequirements:\r\n- Excellent English communication skills (written and verbal)\r\n- Experience in customer service, phone support, and dispatch operations\r\n- Prior role as a Customer Service or Dispatch Virtual Assistant\r\n- Strong attention to detail, time management, and coordination abilities\r\n- High level of professionalism and customer service orientation\r\n- Comfortable collaborating with field service teams and management\n\r\nPreferred Skills:\r\n- Proficiency in GoHighLevel CRM, WhatsApp Business, and service management tools\r\n- Strong interpersonal skills and relationship-building mindset\r\n- Experience in service industry operations or field service coordination\n\r\nWhy Join Us?\r\nBe part of a growing garage door service company with a commitment to excellence\r\nGain direct experience in service operations and customer relationship management\r\nWork remotely with flexibility, autonomy, and the chance to make a real impact\r\nIf you're resourceful, efficient, and ready to support a fast-moving service operation, apply now and help drive our customer service excellence.",
  "skill_requirements": [
    "Customer Service",
    "GoHighLevel",
    "Dispatching"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:32:15.160072",
      "reason": "Job first discovered"
    }
  ]
}