{
  "job_id": "1422449",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422449",
  "scraped_at": "2025-07-14T23:08:48.899233",
  "title": "Remote Project Manager (Construction Experience Required)",
  "type_of_work": "Full Time",
  "salary": "Negotiable",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us:\r\nLynch Power is a commercial and industrial electrical contractor based in New Jersey. We’re a fast-growing, no-nonsense team focused on quality work and strong communication. We’re looking for a remote Project Manager to help manage active jobs and work closely with our U.S.-based PMs to keep things moving.\n\r\nWho You Are:\n\r\nYou’ve got at least 2 years of construction project management experience (electrical or MEP is a plus)\n\r\nYou’re detail-oriented, organized, and don’t need to be micromanaged\n\r\nYou communicate clearly in English—both written and spoken\n\r\nYou’re comfortable with Google Workspace and can learn Knowify quickly\n\r\nYou collaborate well across time zones and keep others in the loop\n\r\nWhat You’ll Do:\n\r\nManage multiple projects from start to finish\n\r\nTrack and follow up on submittals and approvals\n\r\nBuild and update basic project schedules\n\r\nPrepare change orders and AIA-style pay applications (G702/G703) in Knowify\n\r\nOrganize and maintain project documentation in Google Drive\n\r\nCoordinate closely with our U.S.-based Project Managers and field teams\n\r\nProvide consistent project updates and escalate issues when needed\n\r\nNice-to-Haves:\n\r\nExperience with U.S. construction or electrical contracting\n\r\nAbility to read and interpret construction drawings/specs\n\r\nFamiliarity with AIA billing documents\n\r\nEstimating or preconstruction experience\n\r\nAccess to CAD software for updating as-built drawings\n\r\nPerks:\n\r\nStable, long-term remote role\n\r\nCompetitive monthly pay\n\r\nReal projects and responsibilities—no fluff\n\r\nSupport from an experienced, down-to-earth team\n\r\nTo Apply:\n\r\nSend your resume and a short intro\n\r\nInclude the word “Grounded” somewhere in your message\n\r\n(Optional) Share examples of schedules, submittals, or pay apps you’ve created\n\r\nWe’re looking for someone who can take ownership, work well with our U.S. team, and keep projects on track. If that’s you, let’s talk.",
  "skill_requirements": [
    "Construction Project Manager",
    "Documentation",
    "Electrical Design"
  ]
}