{
  "job_id": "1422379",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422379",
  "scraped_at": "2025-07-14T23:08:42.961839",
  "title": "Administrative Assistant",
  "type_of_work": "Full Time",
  "salary": "$700/month + 13th Month Pay",
  "hours_per_week": "35",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Sticky Fingers Cooking®\r\nSticky Fingers Cooking® (Upgrade to see actual info) is a fast-growing, mobile children’s cooking school that brings hands-on, healthy cooking classes to hundreds of schools and camps across the Denver/Boulder area—and beyond. Our mission is to inspire a lifelong love of cooking and healthy food through joyful learning and real-life skills.\n\r\nRole Summary\r\nWe’re looking for a highly organized, fast-moving, and warm-hearted Administrative Assistant to serve as the key connector between our Chef Instructors, Area Director, and the families and schools we serve. You’ll be fielding incoming calls, texts, and emails, solving small (and big!) inquiries, and keeping the moving parts of our cooking classes running smoothly.\r\nSticky Fingers Cooking® (SFC) is a cooking school for children headquartered in Denver, Colorado that teaches after-school enrichment classes and summer camps in hundreds of locations across the front range. We love sharing our passion for cooking through our fun, hands-on, and deliciously healthy cooking classes and camps. We strive to inspire and celebrate comprehensive education directly related to the essential role of real healthy food, cooking, and nutrition in our everyday lives.\n\r\nThe Administrative Assistant is responsible for managing incoming phone calls, texts and other communications with SFC staff (Chef Instructors) as well as families enrolled in our program. We are seeking an individual who is able to work well in a team environment, is comfortable with a fast pace of incoming tasks, and has strong communication as well as organizational skills. This position reports directly to the Area Director and Director of Chef Operations. \n\r\nThis role is full-time Monday-Friday, 9am- 5pm MST. \n\r\nKey Responsibilities\n\r\n-Provide live support for our Chef Instructors during class times via text and phone calls (1–5 PM MST)\r\n-Troubleshoot hotline calls (e.g., late chefs, venue access issues, ingredient questions) in a friendly, calm, and resourceful way.\r\n-Support the hiring process through tasks including resume reviews and interview scheduling\r\n-Update and maintain tools such as The Dash (our internal ops system), Brevo CRM, and various operational spreadsheets\r\n-Assist with inventory ordering for summer camps and Chef Kits\r\n-Keep track of staff birthdays and team milestones \r\n-Manage communication with parents, school staff and SFC staff \r\n-Help submit facility use applications and maintain district staffing records (e.g., DPS)\r\n-Support the Area Director and Director of Chef Operations with other duties, as needed, including general administrative support\n\r\nQualifications\n\r\n-Highly effective, positive and enthusiastic verbal and written communication skills \r\n-Team player with a flexible, positive, and creative approach and high sense of urgency to problem solving \r\n-Self-directed, independent work ethic\r\n-Comfortable learning new technology and software systems\r\n-At least 1 year of experience in a customer-service related role (in-bound and out-bound calls preferred)\r\n-Proficiency in computer software programs such as Google Drive, Pages and Numbers (or Microsoft Excel and Word) and -Adobe Acrobat or Preview\r\n-Ability to work in a fast paced environment\r\n-Great communication skills\r\n-Calm under pressure with a can-do attitude and strong problem-solving instincts\n\r\nWe can't wait to hear from you!",
  "skill_requirements": [
    "Google Sheets",
    "English Speaking",
    "Communication"
  ]
}