{
  "job_id": "1422521",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Google-Business-Profile-GBP-Consultant-1422521",
  "scraped_at": "2025-07-15T14:37:59.224318",
  "title": "Google Business Profile (GBP) Consultant",
  "type_of_work": "Part Time",
  "salary": "$7-$10 / hour",
  "hours_per_week": "10",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Title: Google Business Profile (GBP) Consultant\n\r\nLocation: Remote\r\nEmployment Type: Part-Time (10 hours per week)\r\nShift: Flexible within 9:00 AM - 6:00 PM PST\n\n\r\nAbout the Role\n\r\nWe are looking for a GBP Consultant to manage and optimize Google Business Profile (GBP) and search engine marketing activities. In this part-time role, you will be responsible for improving the visibility of the firm through local SEO and Google My Business (GMB) optimization, in addition to running SEM campaigns across Google, Yahoo, and Bing. This position requires an expert in SEO strategies, content marketing, and SEM management, and you will work collaboratively with marketing teams to boost organic rankings and drive meaningful ROI.\n\n\r\nKey Responsibilities\n\r\nGoogle Business Profile & Local SEO\r\n> Optimize Google Business Profile (GBP) to improve local search rankings and customer reviews.\r\n> Drive SEO strategies and implementation across various platforms to improve organic search rankings.\r\n> Conduct in-depth keyword research and competitive analysis to strengthen local search presence.\r\n> Implement on-page and off-page SEO optimizations, ensuring the best practices for GBP are applied.\r\n> Monitor KPIs related to GBP and prepare analytics reports to assess the effectiveness of SEO and GMB strategies.\r\n> Stay current with Google algorithm updates and SEO industry trends to drive relevant changes in strategy.\n\r\nSEO and SEM Campaigns\r\n> Execute SEO campaigns across Google, Yahoo, and Bing, focusing on improving search rankings and maximizing ROI.\r\n> Track, report, and analyze website analytics using Google Analytics to evaluate SEO and PPC initiatives.\r\n> Collaborate with the Marketing Strategist to manage campaign expenses, estimate monthly costs, and reconcile discrepancies.\r\n> Optimize copy and landing pages for search engine marketing.\r\n> Perform ongoing keyword discovery, expansion, and optimization to ensure maximum exposure.\r\n> Research and implement search engine optimization recommendations, focusing on competitive link analysis and content optimization.\r\n> Develop and implement link-building strategies to improve domain authority and overall rankings.\r\n> Work with development teams to ensure SEO best practices are properly implemented in newly developed code.\n\r\nCollaboration & Reporting\r\n> Work closely with editorial, sales, and product development teams to drive SEO within content creation and content programming.\r\n> Create and deliver SEO reports to track performance and assess the impact of the SEO and SEM strategies on the firm’s online visibility.\r\n> Provide regular updates to management and stakeholders, focusing on actionable insights and optimization recommendations.\n\r\nRequirements and Skills\r\n> Proven SEO experience, particularly with Google Business Profile (GBP) and local SEO strategies.\r\n> Proven SEM experience managing PPC campaigns across Google, Yahoo, and Bing.\r\n> Solid understanding of performance marketing, conversion rates, and online customer acquisition.\r\n> In-depth experience with website analytics tools such as Google Analytics and Search Console.\r\n> Experience with bid management tools (e.g., DoubleClick and Search Ignite) and A/B/multivariate testing.\r\n> Strong knowledge of HTML, CSS, and JavaScript development and constraints related to SEO.\r\n> Up-to-date with the latest trends and best practices in SEO, SEM, and Google Business Profile management.\r\n> BS degree in a quantitative, test-driven field or equivalent work experience in digital marketing.\n\r\nWhy Join Us?\r\n> Flexible work schedule: Work part-time (10 hours/week) with a flexible schedule within 9:00 AM - 6:00 PM PST.\r\n> Remote opportunity: Enjoy the convenience and flexibility of working remotely.\r\n> Impactful work: Contribute directly to the firm’s success by optimizing local search rankings and managing high-impact SEO/SEM campaigns.\r\n> Collaborative environment: Work with a highly motivated, data-driven team passionate about optimizing performance.\r\n> Career Growth: Opportunities to enhance your expertise in SEO, SEM, and local search strategies while making a real impact.\n\r\nHow to Apply\n\r\nReady to optimize and drive success with Google Business Profile and SEO/SEM strategies? We want to hear from you! Apply today with your resume and a brief summary of your experience.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:33:55.373282",
      "reason": "Job first discovered"
    }
  ]
}