{
  "job_id": "1422386",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Outbound-CallerDialer-PH-1422386",
  "scraped_at": "2025-07-15T12:35:30.655430",
  "title": "Remote Outbound Caller/Dialer - PH",
  "type_of_work": "Full Time",
  "salary": "US$700",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a confident communicator who enjoys connecting with people and contributing to a team’s growth? As a Remote Outbound Caller/Dialer for Town Web, promoting our product ClerkMinutes, you’ll play a vital role in generating interest, engaging potential clients, and helping to build a robust sales pipeline. You’ll be responsible for initiating outreach, qualifying leads, scheduling demos, and following up across multiple touchpoints— all while adhering to a structured process designed to drive results.\n\r\n###Key Responsibilities\n\r\nHigh-Volume Outbound Calling: Make 80–100 outbound calls per day using an auto-dialer system. Engage clerks and city staff using a structured call script to identify qualified leads.\n\r\nDemo Scheduling and Presentation: Encourage qualified leads to book product demos by clearly communicating ClerkMinutes’ value. Conduct engaging and informative demo sessions tailored to the prospect’s needs, highlighting key features and addressing common pain points.\n\r\nFollow-Up and Re-engagement: Conduct structured follow-ups with leads post-demo, after no-shows, or after initial objections. Re-engage cold or undUpgrade to see actual info prospects through timely calls and email outreach.\r\nCRM Management and Progress Tracking: Maintain accurate and up-to-date records of all calls, lead interactions, demo outcomes, and sales progress in the CRM system for effective tracking and reporting.\n\r\nFeedback and Continuous Improvement: Share frontline insights from calls with internal teams to help improve scripts, messaging, and processes. Participate in training and coaching sessions to refine outreach effectiveness.\n\r\n###Who We’re Looking For: \r\nCompetitive, self-directed, and proactive.\r\nComfortable in a respectfully-candid communication environment and willing to accept constructive feedback. \r\nComfortable working in a fast-paced environment with high output expectations. \r\nConfident making cold calls and navigating objections.\r\nA strategic communicator who can clearly connect client challenges with ClerkMinutes’ solutions.\n\r\n###Skills and Qualifications: \r\nMinimum of three years' experience in outbound sales, from appointment setting through close. \r\nStrong English communication skills (verbal and written). \r\nAble to clearly explain value propositions. \r\nExperience working remotely with US-based clients, ideally in B2B sales or SaaS.\r\nFamiliar with CRMs, call tracking tools, and email outreach platforms.\n\r\n###Compensation: \r\nMonthly base rate of $700\r\nParticipation in incentive plan depending on number of demos booked and deals closed\n\r\n###To Apply: \r\nVisit official Job Posting via Workable: Upgrade to see actual info",
  "skill_requirements": [
    "Outbound Sales",
    "Appointment Setting",
    "Cold Calling"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:25:41.751424",
      "reason": "Job first discovered"
    }
  ]
}