{
  "job_id": "1422027",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422027",
  "scraped_at": "2025-07-14T23:09:39.638136",
  "title": "UX Website Designer",
  "type_of_work": "Full Time",
  "salary": "$640.00",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "WEBBLDR is a website development company that builds clean, strategic websites for construction and blue-collar companies across the U.S. We’re currently hiring a UX Website Designer who can turn creative ideas into clean, functional website designs using Figma.\n\r\nThis role is part-time and perfect for someone looking to build real-world experience while contributing to high-quality websites.\n\r\nYour Responsibilities Will Include:\r\n • Designing desktop and mobile-friendly websites using Figma\r\n • Creating clean, responsive UX layouts (usually 5–7 pages per project)\r\n • Collaborating with our creative director and web developer\r\n • Organizing and preparing final Figma files for handoff to development\r\n • Thinking creatively—avoiding template designs and bringing fresh ideas\r\n • Occasionally assisting with wireframes, style guides, or UI kits\n\r\nRequired:\r\n • Strong Figma experience (you’ll be tested on this)\r\n • A good eye for layout, spacing, and hierarchy\r\n • Understanding of UX principles and responsive design\r\n • Able to work with developers and communicate design decisions\r\n • Portfolio showcasing web design and UX/UI layout experience\r\n • Detail-oriented and comfortable working remotely with deadlines\r\n • Excellent English and communication skills\r\n • Bonus: Familiarity with WordPress or Webflow is a plus\n\r\nApplication Instructions:\r\n • You must include your resume, a cover letter explaining your relevant experience, and portfolio links\r\n • Use the subject line: “UX Application – [Your Name]”\r\n • The word “UX” is your secret keyword. If you don’t include that in the subject line, your application will be rejected without review.",
  "skill_requirements": [
    "Web Design & Page Layout",
    "Figma",
    "UI UX Design"
  ]
}