{
  "job_id": "1422502",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Sales-Representative-1422502",
  "scraped_at": "2025-07-15T14:40:35.948418",
  "title": "Virtual Sales Representative",
  "type_of_work": "Full Time",
  "salary": "$960",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a highly motivated and results-driven individual with a passion for client success? Moes Group is seeking a dedicated Virtual Sales Representative to join our growing Business Development team. In this pivotal role, you'll be the first point of contact for our new clients, guiding them from initial inquiry to successful project launch. If you thrive in a fast-paced environment and are committed to building lasting partnerships, we want to hear from you!\n\r\nWhat You'll Do:\r\nAs a Sales Representative at Moes Group, your core responsibilities will include:\r\nServe as the initial point of contact for all incoming leads (from forms, marketing, referrals, and digital inquiries).\r\nPromptly qualify leads based on business type, product needs, timelines, and budget to ensure project viability.\r\nBuild rapport and understand core client needs through clear, early communication.\r\nEscalate complex leads or negotiations to the Sales Director while providing essential support.\r\nMaintain meticulous records of all sales activities and client communications in HubSpot (transitioning to Odoo).\r\nProvide weekly updates to the Sales Director on new leads contacted, deals closed, deals in negotiation, and any prospect feedback or obstacles.\r\nRepresent Moes Group with the highest level of professionalism, reflecting our brand values in all interactions.\n\r\nWhat We're Looking For:\r\nProven experience in a sales or business development role, ideally in a related industry.\r\nExceptional communication, negotiation, and interpersonal skills.\r\nStrong organizational abilities and meticulous attention to detail.\r\nAbility to manage multiple leads and projects simultaneously.\r\nProficiency with CRM software (HubSpot experience preferred).\r\nA proactive mindset with a strong drive to achieve and exceed sales targets.\r\nAbility to work both independently and collaboratively within a team.\r\nUnderstanding of the sales lifecycle from lead generation to closing.\r\nComfortable using Hubstaff for hourly time tracking (mandatory).\n\r\nWhy Join Moes Group?\r\nJoin a dynamic team poised for significant growth! You'll play a crucial role in expanding our client base and benefit from a supportive environment that values professionalism, continuous improvement, and strong partnerships.",
  "skill_requirements": [
    "Inbound Sales",
    "Outbound Sales",
    "Lead Generation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:28:13.932286",
      "reason": "Job first discovered"
    }
  ]
}