{
  "job_id": "1422009",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422009",
  "scraped_at": "2025-07-14T23:05:53.925305",
  "title": "Classifieds website designer",
  "type_of_work": "Gig",
  "salary": "25000 Total",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Project Request: Build a Marine Classifieds Website with Backend, Frontend, and Payment Levels\n\r\nI am seeking an experienced developer (or development team) to build a marine classifieds website that includes both backend and frontend functionalities, as well as integration for different payment levels for ads. The platform should be dedicated to listing boats, marine equipment, accessories, services, and other related categories. The website must be user-friendly and scalable, with a variety of categories and the ability for users to choose premium ad options to boost their visibility.\n\r\nKey Features & Functionality:\n\r\nFrontend:\n\r\nHomepage:\n\r\nModern, visually appealing design optimized for the marine industry.\r\nA large, easily accessible search bar for browsing ads (search by keyword, category, location, etc.).\r\nFeatured Ads section for premium listings.\r\nQuick links to popular categories (e.g., Boats for Sale, Marine Services, Marine Equipment, Jobs, etc.).\r\nRegistration and login buttons with social media login options (Google, Facebook, etc.).\r\nCategory Pages:\n\r\nMultiple categories such as:\r\nBoats for Sale\r\nMarine Equipment\r\nAccessories\r\nMarine Services\r\nMarine Jobs\r\nCharters & Rentals\r\nSailing Gear\r\nSubcategories for each (e.g., under \"Boats for Sale\" there can be \"Yachts,\" \"Sailboats,\" \"Fishing Boats,\" etc.).\r\nFiltering options by price, location, year, brand, and condition.\n\r\nAd Detail Pages:\n\r\nDisplay detailed information about the ad, including high-quality images, a full description, contact details, and location.\r\nOption for users to contact the seller through the site (via messaging or contact form).\r\nMap integration for location-based search.\r\nButtons for sharing the ad on social media.\r\nUser Accounts and Dashboards:\n\r\nUser profile page to manage account details, saved ads, and messages.\r\nDashboard to manage the user’s posted ads (edit, update, delete).\r\nAd management for users to add new ads and choose between free or paid listing options (basic, premium, or featured).\r\nResponsive Design:\n\r\nMobile-friendly design to ensure smooth access and browsing across all devices.\r\nSearch & Filter:\n\r\nAdvanced search filters by price, location, boat type, condition, year, and more.\r\nDynamic sorting options (by most recent, price low-high, etc.).\n\r\nBackend:\n\r\nUser Authentication and Management:\n\r\nUser registration, login, and password recovery.\r\nOption to sign in with social media accounts (Google, Facebook, etc.).\r\nProfile management (personal details, contact info, password).\r\nAd Management:\n\r\nAdmin interface to approve, edit, or delete user-submitted ads.\r\nAbility for users to create and edit their own ads (with image uploads and ad descriptions).\r\nOption to mark ads as sold, expired, or pending.\r\nCategories and subcategories to help organize ads.\r\nAd Payment Levels:\n\r\nIntegration of different payment tiers for ads (e.g., Basic, Premium, and Featured listings).\r\nBasic: Free listing with standard visibility.\r\nPremium: Paid listing with enhanced visibility, highlighted in search results, and more prominent display.\r\nFeatured: Top placement on the homepage or category page for maximum exposure.\r\nIntegration with payment gateways (e.g., Stripe, PayPal) for handling payments for premium ads.\r\nMessaging System:\n\r\nA secure messaging system that allows buyers to contact sellers directly within the platform.\r\nOptional email notifications for new messages, responses to ads, and inquiries.\r\nAdmin Dashboard:\n\r\nA backend admin panel to manage users, ads, categories, payments, and site settings.\r\nAnalytics for tracking traffic, ad views, and conversions.\r\nTools for managing flagged or inappropriate content.\r\nLocation Integration:\n\r\nIntegration of geolocation services to allow users to search ads by city, region, or postal code.\r\nOption for map integration to visualize listings on a map.\r\nSecurity:\n\r\nSecure user data storage and encrypted transactions.\r\nProtection from spam and fake ads (e.g., CAPTCHA for form submissions, email verification).\r\nSEO Optimization:\n\r\nSEO-friendly URLs, metadata, and content optimization for better search engine ranking.\r\nCustom URL slugs for each ad (e.g., \"/boats-for-sale/brand-model-year\").\r\nScalability:\n\r\nThe platform should be designed to handle a growing user base and increasing number of ads, with the potential for expansion into additional categories or geographies.\n\r\nPayment and Monetization:\n\r\nAd Payment Integration:\r\nAbility for users to pay for premium ad options via PayPal or Stripe.\r\nAbility to set different prices for premium ads (e.g., $10 for premium, $30 for featured).\n\r\nPaid Listings:\r\nUsers should have the option to post basic ads or choose paid options for greater visibility.\n\r\nRevenue Tracking for Admin:\r\nAdmin should be able to track ad payments, monitor ad revenue, and generate reports for financial analysis.\n\r\nTechnologies:\n\r\nFrontend: HTML, CSS, JavaScript (React or Vue.js for dynamic behavior), Bootstrap or Material UI for responsive design.\r\nBackend: Node.js, PHP, Python (Django/Flask), or Ruby on Rails for server-side logic.\r\nDatabase: MySQL, PostgreSQL, or MongoDB to store user and ad data.\r\nPayment Integration: PayPal, Stripe for payment gateway integration.\r\nMaps API: Google Maps API for location-based services.\r\nSecurity: SSL certificates, data encryption, CAPTCHA, and other security features.\n\r\nTimeline & Budget:\n\r\nTimeline: Please provide your estimated timeline for project completion.\r\nBudget: 25000PHP.\n\r\nIf you're interested in this project, please provide examples of previous work, relevant experience, and any initial design or technical suggestions. We are looking for a high-quality, user-friendly platform with a professional design and excellent performance.",
  "skill_requirements": [
    "Web Design & Page Layout",
    "Website Builder",
    "MySQL"
  ]
}