{
  "job_id": "1422819",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SEO-EXPERT-GOOGLE-ADWORDS-1422819",
  "scraped_at": "2025-07-15T14:29:29.525634",
  "title": "SEO EXPERT / GOOGLE ADWORDS",
  "type_of_work": "Full Time",
  "salary": "$1200-$1500",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "HI , WE ARE A GROUP OF SMALL COMPANIES,  LOOKING FOR A SEO AND GOOGLE ADWORDS SPECIALIST TO JOIN OUR COMPANY ON A FULLTIME BASIS.\n\r\nWhat will be your responsibilities? \n\r\nSetting up and managing paid search campaigns on Google and Bing Ads\r\nAnalysing, optimising and reporting on paid search campaigns\r\nTesting different bid and match strategies to achieve the best results \r\nUsing SEO tools (e.g. Semrush) to report on organic search metrics\r\nKeep up to date with the latest SEO practices and algorithm updates\r\nConduct site audits and develop strategies to improve rankings and domain authority\r\nCollate, analyse, and produce insightful reports for all search marketing activities in collaboration with our data & insights specialist\n\r\nWhat skills and experience will you bring to the table? \n\r\nAdvanced knowledge of SEO tools like Google Analytics, Google Search Console, Google Tag Manager, Semrush, Moz, Ahrefs, Google Trends\r\n2+ years' experience developing and implementing SEO strategies, ideally in an agency\r\nStrong understanding of content strategy, keyword strategy, domain authority and link building\r\n2+ years’ experience managing paid search campaigns\r\nProblem solving (you will need it for Google Tag Manager!)\r\nConfident and clear communicator (able to ‘dumb down’ tech when needed)\r\nPassion for all things web & digital\r\nAmbition - we aim to delight our clients every day and this means staying ahead of the search game",
  "skill_requirements": [
    "Google Ads",
    "Local SEO",
    "SEO Analysis"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:30:30.683910",
      "reason": "Job first discovered"
    }
  ]
}