{
  "job_id": "1422669",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-Call-Center-HIGH-SALARY-At-Home-Long-Term-Opportunity-1422669",
  "scraped_at": "2025-07-15T12:27:51.762824",
  "title": "Customer Service Call Center - HIGH SALARY - At Home - Long Term Opportunity",
  "type_of_work": "Full Time",
  "salary": "- At Home - Long Term Opportunity - OnlineJobs.ph",
  "hours_per_week": "48",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Please watch this Loom video for a detailed explanation from our CEO:\nUpgrade to see actual info/share/e3b2bc537eb94eecb9aUpgrade to see actual infoaf38\n\n\r\nRequirements/Strengths:\n\r\n-A Perfect English level is required\n\r\n-Available 40/50 Hours per week\n\r\n-Good Computer\n\r\n-Good Internet connection\n\r\n-Not working for other companies(not even part time)\n\r\n-Interested in a long term opportunity(2+ years minimum)\n\r\nPLEASE DO NOT APPLY IF you don’t match with ALL the requirements.\n\n\r\nThe Company:\n\r\nWe are a dynamic and extremely fast growing eCommerce company specializing in the hearing loss niche, serving customers across the United States. We aim to offer our customers the best experience possible, especially when it comes to customer support. We strive for excellence in everything that we do, and we are looking for individuals that match our standards, our work ethic and our growth oriented mindset.\n\n\r\nThe Job:\n\r\nWe are looking for dedicated and enthusiastic Customer Service Representatives to join our team. The job is NOT on site, it is 100% from home. This role is crucial in ensuring our customers receive the highest level of service and support.\r\nWe are looking for individuals that want to join us for the long term, and work for us for at least 2 years.\n\n\r\nWorking Hours:\n\r\nYou will be working around 48 hours per week.\r\nSchedule will be discussed before getting started. We can adjust it based on your preferences.\n\n\r\nSalary:\n\r\nSalary varies from 1000$ to 2000$ per month.\r\nCombined with being 100% work from home, this is the perfect opportunity for A level customer support representatives that want to earn well.",
  "skill_requirements": [
    "Customer Support",
    "Phone Support",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:31:41.445848",
      "reason": "Job first discovered"
    }
  ]
}