{
  "job_id": "1422066",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Research-Data-Collection-Coordinator-Remote-1422066",
  "scraped_at": "2025-07-15T11:34:49.839722",
  "title": "Research & Data Collection Coordinator (Remote)",
  "type_of_work": "Full Time",
  "salary": "Php 30,000-35,000 / month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking a Research & Data Collection Specialist to assist with skip tracing, data scraping, and compiling critical information to support our business loan operations. This role requires excellent research skills, strong attention to detail, and the ability to pull together accurate and relevant data from various online sources.\n\r\nThe ideal candidate is resourceful, organized, and capable of handling large amounts of information efficiently. Experience with skip tracing, data scraping, or lead research is highly valued.\n\r\nResponsibilities include, but are not limited to:\r\n- Conduct skip tracing and data scraping to gather contact details, ownership information, and other relevant business data.\r\n- Pull together and organize information from multiple online sources, databases, and public records.\r\n- Research potential leads and compile data lists based on provided criteria.\r\n- Verify and cross-reference gathered information for accuracy and completeness.\r\n- Maintain accurate records and update internal databases regularly.\r\n- Provide timely updates and summaries of research findings to the team.\r\n- Handle sensitive information with confidentiality and discretion.\n\r\nQualifications:\r\n- Prior experience in data research, skip tracing, lead generation, or online data scraping is a plus.\r\n- Familiarity with the business loan industry is preferred but not required.\r\n- Strong online research skills with the ability to find hard-to-locate information.\r\n- High attention to detail and a commitment to accuracy.\r\n- Ability to organize large sets of data efficiently.\r\n- Proficiency in using Google Workspace (Sheets, Docs) and basic spreadsheet tools.\r\n- Strong written communication skills.\r\n- Ability to work independently and manage time effectively in a remote setting.\r\n- Willingness to undergo a background check.\n\r\nCompensation + Perks:\r\n- Salary based on experience and expertise\r\n- Long-term employment focus with opportunities for mutual growth\r\n- Monthly benefits package starting after 6 months: Premium healthcare plan, Paid holidays and vacation days, Additional incentives\r\n- Annual performance reviews for potential salary increases\r\n- Monthly virtual team-building events with fun activities, games, and rewards\n\r\nTo apply:\n\r\nFollow this format:\n\r\nSubject: Research & Data Collection Coordinator - [Name]\n\r\nWhat to include in the email:\r\nNight shift (PH time) experience: [Y/N]\r\nVA experience: [Y/N]\r\nHas active employment: [Y/N]\n\r\nAttachments:\r\n- Resume\r\n- A 2-minute or less audio recording explaining why you would be a good fit for the position\r\n- A photo of your work-from-home setup\r\n- Equipment/computer specs\n\r\nSend to: Upgrade to see actual info",
  "skill_requirements": [
    "Data Entry",
    "Data Collection",
    "Research"
  ],
  "is_active": true,
  "status_history": []
}