{
  "job_id": "1422740",
  "url": "https://www.onlinejobs.ph/jobseekers/job/WooCommerce-API-Integration-Developer-1422740",
  "scraped_at": "2025-07-15T12:35:50.486129",
  "title": "WooCommerce & API Integration Developer",
  "type_of_work": "Full Time",
  "salary": "60,000-80,000 PHP, depending on experience",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "For PH applicants only\n\r\nNOVA Signage is a leading provider of innovative signage solutions for sign and printing shops across North America. Our website serves as a B2B member login portal where we offer custom signage products and services designed to enhance visibility and efficiency for our clients.\n\r\nWe are looking for a Senior Full Stack Web Developer to join our team. This is a remote position.\n\r\nResponsibilities:\r\nDevelop and maintain a WooCommerce store, including writing custom child themes following UI designs.\r\nEnhance user experience by developing custom web features and building new WordPress plugins.\r\nOptimize web pages for maximum speed, scalability, and SEO.\r\nIntegrate and connect web applications (such as Zendesk, Shipstation, Trello) with APIs to streamline workflows.\r\nAutomate organizational processes by building AI-powered integrations and automating tasks across departments.\r\nTroubleshoot website issues, ensuring smooth functionality and user experience.\n\r\nQualifications:\r\nBachelor’s degree in Computer Science or a similar field.\r\n4+ years of experience as a WordPress Developer, with at least 2 years working with WooCommerce.\r\nSolid knowledge of front-end technologies including CSS3, JavaScript, HTML5, and jQuery.\r\nUnderstanding of WordPress architecture, MySQL, and strong back-end PHP development skills.\r\nExperience with debugging tools such as Chrome Inspector and Firebug.\r\nFamiliarity with UX and mobile development best practices.\r\nFluent in spoken and written English.\n\r\nGood to Have:\r\nExperience with AI-powered automation tools or integrations (e.g., API-driven automation, task automation frameworks).\r\nHands-on experience with automation platforms or integration tools.\n\r\nHow We Work:\r\nWe offer a highly entrepreneurial, fast-paced, and operational work environment.\r\nWe prioritize action over discussion, and we value radical open-mindedness and a growth-oriented mindset.\r\nFeedback is given openly and regularly to encourage continuous improvement.\n\r\nCompensation:\r\nPart-time position: Monthly 30,000-40,000 PHP, depending on experience (20 hrs/week).\r\nFull-time position: Monthly 60,000-80,000 PHP, depending on experience.\n\r\nHow to Apply\r\nPlease send your application through this form: forms(dot)gle/HszKwFqR5GaeXRNa6\n\r\nThis is the only way to get shortlisted. Please do not contact us through other channels.",
  "skill_requirements": [
    "Wordpress",
    "Woocommerce"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:30:15.627670",
      "reason": "Job first discovered"
    }
  ]
}