{
  "job_id": "1422025",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Appointment-Setter-Sales-1422025",
  "scraped_at": "2025-07-15T09:27:01.774298",
  "title": "Appointment Setter (Sales)",
  "type_of_work": "Full Time",
  "salary": "$4 per hour + bonuses",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "At Heal Better Health Center, we specialize in all-natural, non-surgical treatments for Peripheral Neuropathy and Chronic Knee Pain. We focus on addressing the root cause, not just the symptoms, to help our patients achieve long-lasting relief. We are committed to helping patients avoid medications and surgeries so they can enjoy the lives they love.\n\r\nWho We Are Looking For:\n\r\nWe are seeking an Appointment Setter/Direct to Office (DTO) Representative with exceptional English-speaking skills. As the first point of contact for individuals seeking care, you will play a critical role in supporting potential patients with chronic conditions. We need someone compassionate, professional, and dedicated to delivering outstanding service while guiding leads toward potentially life-changing treatments.\n\r\nKey Responsibilities:\n\r\n-Communicate empathetically with leads, assisting them in scheduling their appointment.\r\n-Respond to inquiries, reach out to potential patients, and include their support person in the scheduling process.\r\n-Maintain a friendly, patient, and supportive demeanor, ensuring each caller feels valued.\r\n-Utilize tools such as GoHighLevel, Google Calendar, and Gmail for appointment management and communication.\r\n-Track leads, appointments, and outcomes to ensure organization and timely follow-ups.\r\n-Collaborate effectively with the team to maintain smooth and positive operations.\r\n-Participate in comprehensive training to ensure confidence and success in the role.\r\n-Maintain and input KPI's to ensure accurate data handling\n\r\nCompensation:\r\nCompetitive base salary\r\nCompetitive Performance-based bonuses\n\r\nWork Schedule:\r\nEastern Standard Time (EST) clinic hours\n\r\nRequired Skills & Qualifications:\r\n-Excellent English communication and customer service skills.\r\n-Strong ability to empathize with patients experiencing pain or discomfort.\r\n-Experience with CRM systems, scheduling tools, and email platforms.\r\n-High attention to detail and commitment to accuracy.\r\n-Ability to work collaboratively in a team and manage multiple tasks efficiently.\r\n-A passion for helping others and improving their quality of life.\n\r\nIMPORTANT: Please provide an active link to your resume and a voice recording when you apply to help us assess your background and skillset.",
  "skill_requirements": [
    "Outbound Sales",
    "Appointment Setting",
    "Sales"
  ],
  "is_active": true,
  "status_history": []
}