{
  "job_id": "1422458",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-FBA-VA-Online-Arbitrage-Product-Researcher-Remote-Full-Time-1422458",
  "scraped_at": "2025-07-15T14:41:10.432260",
  "title": "Amazon FBA VA – Online Arbitrage Product Researcher (Remote, Full-Time)",
  "type_of_work": "Full Time",
  "salary": "450",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re an e-commerce business based in Canada, looking for a highly motivated, detail-oriented Virtual Assistant with proven experience in Amazon FBA Online Arbitrage, especially for the US and Canadian marketplaces.\n\r\nThis is a long-term, full-time role with growth opportunities for the right candidate.\n\r\n? Your Responsibilities\n\r\n- Source profitable products for Online Arbitrage using tools like Keepa and SellerAmp\r\n- Perform manual sourcing through retail websites\r\n- Evaluate product profitability and ROI using sales rank and historical data\r\n- Record all leads accurately in Google Sheets\r\n- Assist with other Amazon Seller Central tasks as needed\n\r\n????? Required Skills & Tools\n\r\n- Strong experience with Keepa (Preferred)\r\n- Familiarity with SellerAmp and Amazon Seller Central (Preferred)\r\n- Solid understanding of Sales Rank and basic product criteria\r\n- Good command of written English\r\n- Reliable, high-speed internet connection\n\r\n???? What You Get\n\r\n- Flexible working hours (as long as tasks are done daily)\r\n- Bi-weekly payments via Wise or Payoneer\r\n- Paid time off (flexible and upon request)\r\n- Opportunity to grow within a fast-moving Amazon FBA business\r\n- Supportive team and ongoing training\n\r\n???? Hiring Process\r\nApplicants will be asked to complete a short test task (30 minutes max) to evaluate sourcing skills and attention to detail. Only those who pass will proceed to the final interview.\n\r\n???? To Apply\n\r\nPlease reply with the following:\r\n- Your experience with Keepa, SellerAmp, and product sourcing\r\n- Your favorite product category to source and why\r\n- The sport you practice (just for fun — helps us get to know you!)\r\n- Include the word “FINDGEMS” in your subject line or first sentence so we know you read the full post",
  "skill_requirements": [
    "Keepa",
    "Product Sourcing",
    "Seller Amp SAS"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:33:18.300029",
      "reason": "Job first discovered"
    }
  ]
}