{
  "job_id": "1422219",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422219",
  "scraped_at": "2025-07-14T23:10:04.176087",
  "title": "»»» SEO Manager ¤ Full-Time ¤ Lead High-Impact Strategies + Competitive Perks «««",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you what we are looking for? APPLY NOW! \n\r\nThe SEO Manager is a key leader in our digital marketing team, responsible for driving our SEO efforts and delivering tangible results that significantly impact our company's success. This role is pivotal in developing and executing advanced optimization strategies to enhance our website’s search engine rankings and overall online presence.\n\r\nInterested applicants can apply via Upgrade to see actual info\n\r\nKey Responsibilities\r\n+Develop optimization strategies to enhance the company’s website search engine rankings.\r\n+Create and execute link-building strategies.\r\n+Conduct tests, collect and analyze data and results, and identify trends and insights to achieve maximum ROI.\r\n+Set appropriate metrics and measurable goals to demonstrate improvements in marketing efforts.\r\n+Effectively supervise and help manage teaUpgrade to see actual infombers, progress, and check the quality of work.\r\n+Stay current on SEO industry changes and communicate technical improvements to management.\r\n+Perform keyword research and competitor analysis regularly to generate topic ideas that will deliver the SEO commercial and strategic goals.\r\n+Collaborate with various teams to ensure new pages and projects are optimized for search from launch.\r\n+Support our content team for content ideation, development, design, and delivery of SEO-optimized content\r\n+Provide detailed content briefs and advise on best practices for technical implementation. \r\n+Coordinate with management and help oversee SEO-based content creation that aligns with the firm’s marketing and business objectives.\n\r\nQualifications And Skills\r\n-Over 5 years of experience building and delivering impactful SEO roadmaps\r\n-Proven track record in collaborating on complex site redesigns, rebuilds, and implementations\r\n-Extensive knowledge of current and emerging SEO best practices\r\n-Ability to analyze and respond to algorithm updates, new search features, and new tools\r\n-Subject matter expertise in the technical aspects of SEO, including HTML, CSS, JavaScript, URL structures, keyword analysis, content optimization, indexing, algorithms, and other factors that may impact SEO efforts\r\n-Ability to analyze and interpret site code and perform technical SEO analysis\r\n-Proficiency in SEO tools and analytics platforms (SEMrush, Ahrefs, Google Search Console, and Screaming Frog)\r\n-Strong analytical skills and the ability to make data-driven decisions\r\n-Experience working with cross-functional teams\r\n-Strong communication skills with both technical and non-technical individuals\r\n-Proactive in initiating and leading efforts, projects, and programs\r\n-Thrives in building new initiatives and embraces ambiguity as an opportunity\r\n-Strong problem-solving abilities and a problem-solving mindset\n\r\nBasic Requirements\r\nDevice Specifications: Intel i5 processor or higher with a minimum of 8GB RAM\r\nEquipment: Webcam, speakers, and a microphone or headphones\r\nInternet Speed: Minimum of 100Mbps with a backup connection in case of outages\n\r\nWork Details\r\nWorking Hours: Monday to Friday, 8 AM to 5 PM Pacific Standard Time | Tuesday to Saturday, 12 AM to 8 AM Manila Time\r\nLocation: Anywhere in the Philippines\n\r\nWhy Join Us?\r\nStable employment\r\nCompetitive salary\r\nBi-monthly salary\r\nA-Z benefits, including bonuses and annual raises\r\nWork-life balance \r\nWork-from-home opportunity\n\r\n*** The company uses a time tracker and maintains a virtual office setup via Google Meet.\n\r\n(Note: DO NOT SEND YOUR APPLICATION through our websites or social media platforms. FAILURE TO COMPLY WITH THIS INSTRUCTION may result in DISQUALIFICATION)",
  "skill_requirements": [
    "SEO Analysis",
    "Keyword Research"
  ]
}