{
  "job_id": "1422968",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Researcher-Creative-Director-Branding-1422968",
  "scraped_at": "2025-07-15T15:44:55.084741",
  "title": "Researcher & Creative Director (Branding)",
  "type_of_work": "Full Time",
  "salary": "650",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re looking for a Virtual Assistant who’s equal parts strategic, creative, and organized to help support our fast-moving, detail-focused nano studio. If you thrive in a self-led environment, can juggle research with creative direction, and love building clarity from chaos—we’d love to meet you.\n\r\nWhat You’ll Be Doing\r\n- Calendar & Inbox Management: Schedule meetings, manage priorities, and keep the team on track.\r\n- Research: Conduct detailed research related to the studio’s work—creative trends, tools, competitors, and collaborators.\r\n- Creative Direction Coordination: Help manage projects and direct creatives (designers, editors, etc.) to meet deadlines and creative briefs.\r\n- Presentation Support: Build clean, effective decks using Google Slides, Canva, or Keynote.\n\r\nLearning & Development: Take courses assigned by the founder and distill takeaways or apply them across studio systems or projects.\n\r\nWhat We’re Looking For\r\nStrong organizational & time management skills\r\nExcellent written & verbal communication\r\nTech-savvy: You’re comfortable using clickup, Slack, GSuite, Canva, etc.\r\nProactive, self-led, and solution-oriented\r\nCreative sensibility or background is a strong plus\n\r\nBonus if you’ve worked in a creative studio, agency, or startup environment\n\r\nDetails\r\nType: Part-time - Full-time (with potential to scale)\r\nLocation: Remote partial graveyard shift\n\r\nAbout Us\r\nWe’re a small but nimble nano studio working on projects across media, nanotech, design, and culture. We move quickly, love thoughtful work, and value clarity, initiative, and integrity.\n\r\nTo Apply:\r\nSend a short intro video on why you’re a fit, your availability, and a quick portfolio or example of work if relevant. Bonus if you include your favorite productivity tool and why.\n\r\n>> You must include \"Nano Studio\" in your application headline or you won't be contacted.",
  "skill_requirements": [
    "Research Writing",
    "Content Planning",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:31:57.832804",
      "reason": "Job first discovered"
    }
  ]
}