{
  "job_id": "1422815",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Junior-Accountant-Remote-Full-Time-1422815",
  "scraped_at": "2025-07-15T15:36:52.749328",
  "title": "Junior Accountant (Remote – Full-Time)",
  "type_of_work": "Full Time",
  "salary": "P50,000 - P60,000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role\n\r\nWe are looking for a motivated and detail-oriented Junior Accountant with Australian taxation experience to join our growing team. This is a fantastic opportunity for someone with at least 6 months of tax and accounting experience who is looking to further develop their career in a dynamic and supportive remote environment.\r\nAs part of our team, you will play an important role in preparing Tax Returns, Financial Statements, and Business Activity Statements for our key clients across a range of industries. You’ll also contribute to budgeting, client support, and staying current with technical requirements in the accounting field.\n\r\nKey Responsibilities\n\r\n• Prepare tax returns for individuals, partnerships, companies, and trusts.\r\n• Prepare annual PAYG summaries and assist with PAYG tax instalments.\r\n• Support in the preparation of job budgets and financial planning.\r\n• Maintain working knowledge of client-used software platforms (especially Xero).\r\n• Keep up to date with technical and legislative changes and apply them to client scenarios.\r\n• Prepare accounts and Business Activity Statements (BAS).\r\n• Complete associated workpapers and documentation for compliance and review.\n\r\nAbout You – Selection Criteria\n\r\n• A university degree in Accounting, Business, or Commerce (or equivalent).\r\n• Have commenced the CPA Program.\r\n• A minimum of 2 years of experience working with Australian tax/accounting standards.\r\n• Proficient in Xero accounting software.\r\n• Strong organizational and multi-tasking abilities.\r\n• Excellent verbal and written communication skills in English.\r\n• Must have a stable and reliable internet connection suitable for remote work.\n\r\nWhat We Offer\n\r\n• A permanent work-from-home arrangement.\r\n• A structured workday that supports work-life balance.\r\n• Opportunity to grow and upskill within a collaborative team.\r\n• Exposure to a variety of clients and industries.\r\n• Support and mentorship from experienced senior accountants.\n\r\nHow to Apply\n\r\nTo apply, please send your CV and a short cover letter outlining your qualifications and interest in the role.",
  "skill_requirements": [
    "Financial Accounting",
    "Accounting Management",
    "Tax Preparation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:30:32.598181",
      "reason": "Job first discovered"
    }
  ]
}