{
  "job_id": "1422528",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Graphic-Designer-with-AI-Skills-Vector-Illustration-1422528",
  "scraped_at": "2025-07-15T15:34:04.825551",
  "title": "Graphic Designer with AI Skills (Vector Illustration)",
  "type_of_work": "Full Time",
  "salary": "$800-$1400 per month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "ABOUT US\r\nWe are a fast-growing U.S.-based custom apparel company. We create high-quality, quick-turn designs for screen printing, DTF, DTG, and embroidery. Most of our work is for colleges, fraternities, sororities, and student organizations. We’re known for fast turnaround, excellent customer service, and killer artwork.\n\r\nWe are transitioning into an AI-first company including our design workflow, and we’re looking for someone who is excited about implementing AI into their process. We have a very relaxed work environment. As long as you do your job well, you will excel here.\n\r\nABOUT THE ROLE\r\nThis is not a basic Canva gig. We’re looking for an expert in Adobe Illustrator who’s also deeply familiar with AI art tools (like MidJourney, Photoshop AI, or similar). You should be able to take a concept and quickly generate something beautiful and usable for print. A lot of our art is illustration style. Designs may require you to make them from scratch or make complex edits to an existing template.\n\r\nWe’ll give you the training to understand our audience and processes, but you need to come in with the technical design skill and the ability to work fast, independently, and smart with AI.\n\r\nYou’ll work directly with our Head of Design to learn our workflow, but you take ownership of your own queue of design projects every day. We aren't going to micromanage you, so we expect you be a strong independent contributor.\n\r\nWHAT YOU'LL DO\r\n-Create custom illustrations and apparel designs using Adobe Illustrator and Photoshop\r\n-Use AI tools (e.g. ChatGPT, MidJourney, Photoshop AI, etc.) to speed up design creation\r\n-Follow clear prompts and creative directions to generate fast design iterations\r\n-Edit and prep files for vector or raster use depending on the project\r\n-Communicate clearly with teaUpgrade to see actual infombers and accept feedback quickly\r\n-Take ownership of the quality and speed of your own design queue\r\n-Help us reduce design costs by getting it right the first time and avoiding revisions\n\r\nHere's a link to a handful of designs styles that we do: Upgrade to see actual info\n\r\nWHAT YOU NEED\r\n-Expert-level Adobe Illustrator skills (this is a must)\r\n-Comfortable in Photoshop (especially raster cleanup, compositing, mockups)\r\n-Real-world experience using AI tools in your design workflow\r\n-Strong eye for visual quality and consistency\r\n-Illustration skills — not just layout design (you can build or adapt from scratch)\r\n-Clear English communication\r\n-Fast turnaround and reliable time management\r\n-Ability to work independently and manage your output without hand-holding\n\r\nNICE TO HAVE (NOT REQUIRED)\r\n-Apparel or merchandise design experience\r\n-Familiarity with screen print or embroidery limitations\r\n-Experience with prompt-based workflows or iterative art direction\r\n-Experience working in high-volume, fast-turnaround environments\r\n-Knowledge of tools like Leonardo.ai, Firefly, or Photoshop Generative Fill\n\r\nWORKING HOURS\r\nThis is a full-time role Monday-Friday with approximate hours of 9AM-6PM EST including a one hour lunch break. Working hour may have slight flexibility if you prefer. (10AM-7PM, 11AM-8PM)\n\r\nCOMPENSATION\r\n$800–$1,500/month paid biweekly. Pay depends on experience and output.\r\nWe also offer performance based bonuses and PTO.\r\nWe’re looking for someone strong, and your earning ability will be determined by speed and quality.\n\r\nHOW TO APPLY\r\nSend us a message on OnlineJobs.ph with all of the following *These are all required*:\r\n-Your experience with Adobe Illustrator and AI Tools\r\n-Your resume\r\n-A link to your design portfolio\r\n-Your requested salary\n\r\nPLEASE DO NOT APPLY IF:\r\n-You only use Canva or other drag-and-drop tools\r\n-You’ve never used AI tools in a real design workflow\r\n-You need close supervision or daily check-ins to stay productive\n\r\nWe will begin reaching out to schedule interviews on 7/21, and hope to make a hire by the end of the month to begin working immediately!",
  "skill_requirements": [
    "Photoshop",
    "Illustrator",
    "Illustration"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:30:55.933421",
      "reason": "Job first discovered"
    }
  ]
}