{
  "job_id": "1422001",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422001",
  "scraped_at": "2025-07-14T23:07:02.491104",
  "title": "Experienced SHOPIFY Product Lister and Researcher",
  "type_of_work": "Full Time",
  "salary": "500",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Seasoned Shopify Experts Wanted – Join Us to Shape the Next Big E-Commerce Brand\n\r\nWe’re not looking for beginners—we’re looking for proven professionals who’ve been in the trenches of e-commerce. If you’ve already mastered product research, built high-converting Shopify listings, and know exactly what it takes to turn a product into a bestseller—we want to hear from you.\n\r\nWhy This Role Stands Out\n\r\nAs a fast-scaling brand, we’re building a team of high-level experts who know how to move the needle. This isn’t about trial and error—we’re looking for someone who brings experience, strategy, and sharp instincts to the table. If you know how to find products before they explode and you’ve listed hundreds (or thousands) of winning products, this role has your name on it.\n\r\nWhat You’ll Own\n\r\nProduct Research with Purpose – You won’t just guess—you’ll use real tools, data, and experience to uncover what’s trending and what sells.\n\r\nListing Creation That Sells – You know how to write descriptions that hook buyers and lead them straight to checkout.\n\r\nConversion Optimization – You understand how small details impact performance and aren’t afraid to tweak until results peak.\n\r\nVisual Merchandising – You’ve worked with images and layouts enough to know what drives clicks and conversions.\n\r\nWhat We’re Looking For\n\r\nExperienced Shopify Specialist – You’ve done this before and have results to show for it.\n\r\nStrong Trend-Spotting Skills – You’re quick to recognize what’s hot and why it matters.\n\r\nCopywriting That Converts – Your writing persuades, not just informs.\n\r\nDesign Awareness – You know how to present products in a way that makes them shine.\n\r\nProactive Thinker – You take initiative, bring ideas, and look for ways to improve and scale.\n\r\nReady to Apply?\n\r\nWe don’t need a formal cover letter. Instead, tell us what you’ve done.\n\r\nShare your experience working with Shopify product research and listing. How do you find winners? What’s your method for creating high-performing product pages? Let us know which tools you use and share results you’re proud of. Have you worked on successful Shopify stores? Send us links or screenshots!\n\r\nExtra points if you’ve worked with fast-growing e-commerce brands—show us your best work.\n\r\nWhat’s in It for You\n\r\nA full-time, long-term role with a company that values expertise.\n\r\nThe chance to work with a driven, experienced team on exciting projects.\n\r\nFlexibility to work remotely and independently.\n\r\nGrowth opportunities in a company that’s scaling fast.\n\r\nIf you’re confident in your experience and hungry to be part of something big, let’s talk.\n\r\n(And just to make sure you’re paying attention—include your favorite color in your message.)\n\r\nLet’s create something incredible—together.",
  "skill_requirements": [
    "Product Research",
    "Shopify",
    "Product Listing"
  ]
}