{
  "job_id": "1422214",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-to-the-CEO-Remote-PH-Based-1422214",
  "scraped_at": "2025-07-15T13:29:13.310298",
  "title": "Executive Assistant to the CEO (Remote - PH-Based)",
  "type_of_work": "Any",
  "salary": "$5 - $7 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About the Company:\r\n Leaders Marketing LLC is a fast-growing digital marketing agency based in the U.S., serving personal injury law firms across the country. We’re looking for a highly dependable and responsive Executive Assistant to directly support our CEO. This is a critical role that requires strong communication, attention to detail, and the ability to stay highly organized in a fast-paced virtual environment.\n\r\nWhat You’ll Do:\r\nServe as the CEO’s right hand—staying closely in touch and always responsive during your shift 9-5 CST\r\nManage and confirm all CEO-related meetings and appointments\r\nPrepare and send out meeting agendas and take detailed meeting notes\r\nHandle personal executive tasks such as travel booking and basic research\r\nDraft, format, or organize company documents when needed\r\nTrack deadlines and follow-ups to ensure the CEO stays on schedule\r\nOrganize digital files and ensure everything is properly stored and labeled\r\nRespond to CEO-related emails and messages in a timely and professional manner\r\nPerform other general administrative duties as assigned\n\r\nRequired Qualifications:\r\nExcellent written and verbal English skills with a neutral or minimal accent\r\nAt least 2 years of experience supporting executives or working as a virtual assistant\r\nProficient in tools like Google Workspace, Zoom, Slack, Asana, and other productivity apps\r\nHighly organized and detail-oriented\r\nAble to work U.S. hours and be consistently available during shift hours\r\nTrustworthy, discreet, and able to handle confidential information professionally\r\nCan work independently and take initiative without waiting to be told what to do\n\n\r\nNice to Have:\r\nExperience working with CEOs or high-level managers in a virtual setup\r\nFamiliarity with digital marketing agencies or professional services firms\r\nStrong time management and multitasking skill\n\r\nTo Apply:\r\n Please send the following:\r\nYour updated resume\r\nA short cover letter explaining why you're the perfect fit\n\r\nA 1-minute voice recording introducing yourself and explaining your most relevant experience (upload via Vocaroo or any link-based voice recorder)\n\r\nWe are looking to fill this role ASAP, so early applicants will be prioritized.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}