{
  "job_id": "1422672",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-1422672",
  "scraped_at": "2025-07-15T12:27:38.252683",
  "title": "Virtual Assistant",
  "type_of_work": "Any",
  "salary": "USD $3.75/Hour",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Ideally, we need virtual assistants that will specialize in recruiting, hiring, and customer service in relation to tour experiences in the U.S. These tours occur between the hours of 7pm and 11pm EST. We are looking for candidates with open availability between 9am EST and 3am EST. Shifts will be flexible 8-9 hour shift within that time range, so that they can work with tour managers and supervisors who are also on shift.\n\r\nYou will be focused on email and data management and following procedures for recruiting, hiring, communicating training procedures, and onboarding part-time employees for evening work as a tour guide.\n\r\nYou will also be trained on customer service relations and communication related to tour bookings, refunds, reschedules, and more.\n\r\nRECRUITING AND HIRING\r\n-Posting and maintaining job postings across all outlets to include Facebook, Indeed, Handshake, and other job site boards and platforms\r\n-Screen applicants and send hiring emails in accordance with the established process.\r\n-Send, receive, and add all contracts and paperwork into their respective folder in Dropbox\r\n-Send script materials once the contract is received, add candidate's information into the spreadsheet, and Set a date and calendar invitation to the candidate for delivery of their final audition.\r\n-Check-in with all candidates in training once a week by email to check on their progress and ask if they have any questions.\r\n-Review final auditions and finalize onboarding paperwork.\r\n-Enter new staff member's payment and personal details into payment information spreadsheet or on dropbox\r\n-Add completed candidates to national tracker spreadsheet and update report tab.\r\n-Add guide’s information onto the equipment sheet so we can mail their supply package\r\n-When the candidate has been onboarded, make an introduction for the completed candidate to the operations manager for that city. This completes the recruitment process.\n\r\nCUSTOMER SERVICE\r\nIn addition to recruiting, you will be asked to field customer service emails and text messages periodically that will appear in the email inbox as well\r\n-Customer General Inquiries\r\n-Customer Reschedule Requests\r\n-Customer Booking Requests\r\n-Customer Refund Requests\n\r\nREVIEW MANAGEMENT AND RESPONSE\r\nYou will be trained on reading reviews, responding to positive and negative reviews, tracking reviews across different cities, coordinating with tour managers to contact customers to get feedback and recover unhappy customers\n\r\nEMPLOYEE MANAGEMENT\r\n-Onboarding candidates into the booking system\r\n-Assigning tour guides to tour dates\r\n-Communicating with tour guides about scheduling\r\n-Communicating with tour guides regarding tours in real-time\n \nFACEBOOK AND CUSTOMER COMMUNICATION\r\n-Respond to customer inquiries on social media                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:36:13.179256",
      "reason": "Job first discovered"
    }
  ]
}