{
  "job_id": "1422622",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Google-Ads-Expert-1422622",
  "scraped_at": "2025-07-15T14:37:35.195326",
  "title": "Google Ads Expert",
  "type_of_work": "Any",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you ready to harness data and craft campaigns that resonate? At The Cultivator, we shape Google Ads into engines of growth. We treat each campaign as a craft, sculpting every bid and keyword until it sings.\n\r\nWe also have team managers based in the Philippines, so you can speak in Tagalog if you would like!\n\r\nNOTE: Please submit your CV via the following link so we can review it ASAP, if you are passionate and dedicated, we would love to work with you asap: thecultivator.co/applynow\n\r\nWho we are\r\nThe Cultivator is a marketing agency focused on lead generation and e-commerce growth. We power campaigns that deliver results without gimmicks or fancy jargon and focus on reliable performance.\n\r\nYour mission\r\nYou will design, launch, and optimize Google Ads accounts that drive real outcomes. You’ll speak English with confidence, translate metrics into clear strategies, and work hand in glove with our strategists.\n\r\nWhat you’ll own\r\nPlanning and launching search, shopping, and display campaigns aligned with client goals\r\nDiving into analytics to uncover trends and pivot strategies based on data\r\nWriting ad copy that grabs attention and compels action\r\nManaging budgets and bids to maximise return on ad spend\r\nCreating straightforward reports that tell the story behind the numbers\r\nCollaborating with the team to integrate ads into wider marketing plans\n\r\nWhat you bring\r\nProven track record running Google Ads for e-commerce or service clients\r\nStrong command of English in both writing and conversation\r\nAnalytical mindset with a focus on real-world impact\r\nExperience with Google Ads Editor, Analytics, and spreadsheet tools\r\nSelf-motivation and dependability, ready to own your campaigns end to end\n\r\nBonus if you’ve worked with GoHighLevel or a similar CRM/automation platform\n\r\nWhat we offer\r\nA seat in a fast-moving agency where your work makes a visible difference\r\nClear paths for skill development and leadership growth\r\nFlexible work arrangements and a supportive team culture\r\nCompensation that rewards your expertise and results\n\r\nNOTE: Please submit your CV via the following link so we can review it ASAP, if you are passionate and dedicated, we would love to work with you asap: thecultivator.co/applynow",
  "skill_requirements": [
    "Google Ads",
    "Shopify",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:31:00.565674",
      "reason": "Job first discovered"
    }
  ]
}