{
  "job_id": "1422878",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Content-Manager-1422878",
  "scraped_at": "2025-07-15T15:40:50.189580",
  "title": "Social Media & Content Manager",
  "type_of_work": "Full Time",
  "salary": "$3- $5  per hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role:\r\nWe are looking for a creative and proactive Social Media & Content Manager to join our growing team. In this role, you will be responsible for managing and expanding our digital presence across TikTok, Instagram, YouTube, and Telegram, while producing engaging content that showcases our games. You’ll lead the content strategy from planning through execution, using both traditional tools and AI-powered solutions to bring fresh ideas to life.\r\n This is an exciting opportunity for someone who thrives in a fast-paced, creative environment and is passionate about gaming, content creation, and community engagement.\n\r\nKey Responsibilities:\r\n- Manage and grow our social media platforms: TikTok, Instagram, YouTube, and Telegram\r\n- Create engaging, game-focused content—short videos, posts, stories, and interactive updates\r\n- Leverage AI tools and editing platforms to enhance and streamline content production\r\n- Monitor trends and apply them to keep content fresh and culturally relevant\r\n- Actively engage with our community and respond to messages and comments\r\n- Collaborate with marketing and creative teams to ensure alignment with broader goals\r\n- Track content performance and adjust strategies based on analytics and insights\n\r\nRequirements:\r\n- Proven experience managing multiple social media platforms\r\n- Strong skills in short-form content creation (especially video)\r\n- Familiarity with AI tools (e.g., ChatGPT, video editors) to support ideation and execution\r\n- Excellent English communication skills—both written and spoken\r\n- Self-starter with strong organization and time management abilities\r\n- Creative mindset with a passion for storytelling and gaming culture\n\r\nBonus Points:\r\n- Experience building and managing Telegram communities\r\n- Background in gaming, esports, or entertainment content\r\n- Basic video editing or graphic design skills\r\n- Knowledge of UGC (User-Generated Content) and influencer marketing strategies\n\r\nWhy Join Us:\r\nYou’ll be part of a team of passionate creatives in a performance-driven environment that values originality and innovation. As a Social Media & Content Manager, you’ll have the freedom to test bold ideas, contribute to exciting projects, and shape our digital voice. If you love games, content creation, and making an impact—this role is made for you.",
  "skill_requirements": [
    "Content Creation",
    "Social Media Management",
    "Community Moderation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:35:20.920554",
      "reason": "Job first discovered"
    }
  ]
}