{
  "job_id": "1422394",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-Prospect-Research-LogoImage-Collection-Data-Entry-1422394",
  "scraped_at": "2025-07-15T02:23:49.868706",
  "title": "Virtual Assistant – Prospect Research, Logo/Image Collection & Data Entry",
  "type_of_work": "Part Time",
  "salary": "Php 320/hour ~ $5.50 USD",
  "hours_per_week": "10",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hello!\n\r\nWe will begin with a 1-week, paid trial to ensure we make a good team that works well together. We will start with 10 hours per week, and we hope to be able to increase the hours as our business grows.\n\r\nPart-Time | Remote | Flexible Hours\r\nWe are seeking a detail-oriented and tech-savvy Virtual Assistant to support a research-based data entry project focused on identifying and qualifying prospective clients in Central Texas (regions will expand over time). This role is ideal for someone who enjoys internet research, organizing files and spreadsheets, and working independently with a high standard of accuracy.\n\r\nRole Overview:\r\nYou will be responsible for prospecting and qualifying pool companies in Central Texas that have an outdated website or no website. You will be gathering key business information, collecting branding assets (logos and example images of their work), organizing files in Google Drive, and entering all data and hyperlinks into a shared Google Spreadsheet. (We are starting with pool companies, but will be incorporating other types of companies/services soon.)\n\r\nKey Responsibilities:\n\r\n1. Prospecting & Qualifying\r\nIdentify prospective pool-related businesses (companies, owners, and independent contractors) in Central Texas cities and towns, including: Austin, Round Rock, Cedar Park, Leander, Georgetown, Liberty Hill, San Antonio, Waco, Temple, Belton, Salado, Jarrell, Buda, Kyle, San Marcos, Lockhart, and New Braunfels.\n\r\nConfirm that each business is currently active by reviewing recent posts, reviews, or updates. Please do not contact them.\n\r\nInput accurate business details into the tracking spreadsheet:\r\nCompany Name\r\nOwner/Manager Contact\r\nPhone Number \nEmail\r\nWebsite URL (if any)\r\nGoogle Maps Link\r\nSocial Media Links (please double-check and ensure they are accurate)\n\n\r\n2. Logo & Image Collection\r\nCollect publicly available company logos and 3–5 high-quality images showing their best work from the business website, LinkedIn, Google Business Profile, Facebook, or other sources.\n\r\nEnsure all Logos are clear and not blurry.\n\r\nEnsure all Example Images are of sparkling clean, high-end pools with nice landscaping - images that are in focus with vibrant colors and good framing/composition.\n\r\nEnsure all images are saved as JPG files at the highest available resolution.\n\r\nUpload:\r\nLogos ----> Company Logos folder in Google Drive\r\nExample Images ----> Company Examples folder in Google Drive.\n\r\nName files consistently:\r\nLogos: CompanyName_Upgrade to see actual infog\r\nImages: CompanyName_1.jpg, CompanyName_2.jpg, etc.\n\r\nGenerate and copy Google Drive share links for the Company Logo and each of the Example Images.\n\r\nPaste them into the appropriate columns in the shared spreadsheet as hyperlinked text (e.g., CompanyName_Logo, CompanyName_1, etc.)\n\n\r\nRequired Skills & Tools:\r\nGoogle Workspace: Google Drive, Google Sheets, basic file sharing, and link generation\r\nInternet research skills\r\nBasic file sharing & hyperlink generation\r\nFamiliarity with downloading images and verifying social media links\r\nAttention to detail and consistent naming/organization\r\nBasic understanding of image file formats (JPG required)\n\r\nHours & Flexibility:\r\nFlexible schedule - work when it suits you!\r\nHourly-based, with potential for ongoing work depending on quality and reliability\n\r\nWhat We Value:\r\nAccuracy, consistency, and independence\r\nMindful of time and driven to finish efficiently without rushing or sacrificing quality\r\nGood communication and responsiveness\r\nProblem-solving and resourcefulness (e.g., finding the Company’s high-quality logo and example images if not on their website or if they don’t have a website)\n\r\nTo Apply:\r\nPlease include a brief note about your experience with similar research or data entry tasks, your availability, and why you know you are a good fit for this project. Applications without an introduction note will, unfortunately, not be considered.\n\r\nIf you have any questions, please include them with your submission.\n\r\nThank you very much! We are looking forward to hearing from you!",
  "skill_requirements": [
    "Data Entry",
    "Google Workspace",
    "Research"
  ],
  "is_active": true,
  "status_history": []
}