{
  "job_id": "1422391",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Go-High-Level-Master-Social-Media-VA-Golf-Brand-1422391",
  "scraped_at": "2025-07-15T12:29:27.426993",
  "title": "Go High Level Master + Social Media VA (Golf Brand)",
  "type_of_work": "Full Time",
  "salary": "800",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Go High Level Master + Social Media VA (Golf Brand)\n\r\nWhat We’re Looking For:\n\r\nA tech-savvy, creative, self-starting Go High Level expert and Social Media VA who thrives on taking ownership of systems, automation, and making a brand look amazing online. You must understand English humour, golf lingo is a bonus, and initiative is essential.\n\r\nAbout Big Swing Kings:\n\r\nWe’re Big Swing Kings – an online golf coaching brand built around fun, community, and swing breakthroughs. We help golfers \"Golf Better Together\" through online courses, 1:1 coaching, hilarious content, and seriously helpful swing advice. Our tone is cheeky, our methods are proven, and our goal is to help people love golf more.\n\r\n Ideal Skills & Experience:\r\nGo High Level (Primary Focus):\n\r\n- Advanced experience in Go High Level — you live for the back end, not just the drag-and-drop front end\r\n- Can build and optimize full funnels, landing pages, lead magnets, opt-ins, and tripwires\r\n- Skilled at creating automations, smart workflows, tags, custom fields, and triggers\r\n- Confident setting up and connecting products, upsells, payment links, and course access\r\n- Can manage and build out email sequences, broadcasts, and lead nurturing automations\r\n- Able to track leads, build pipelines, and set up dashboards to monitor funnel and campaign performance\r\n- Understands how to segment audiences, clean up inactive leads, and drive re-engagement\r\n- Can integrate Go High Level with Instagram DMs, ManyChat, and third-party tools\r\n- Connect with affiliate tracking and campaign performance tools\r\n- A/B testing where needed\r\n- Knows how to organize the system for clarity and performance — build it once, make it work forever\n\r\nSocial Media Management (Secondary Focus):\n\r\n- We’re looking for someone to own both strategy and execution — if you’re experienced in content strategy and love getting hands-on with Canva, captions, and scheduling, this role is for you.\r\n- Familiarity with Canva and tools like CapCut, Shot Tracer Pro to create content from existing media and design posts, carousels, and IG story templates\r\n- Repurpose existing videos, screenshots, and content into social posts\r\n- Schedule and post daily content to Instagram and Facebook (and possibly TikTok/YouTube)\r\n- Craft engaging Hooks and captions with our brand voice (fun, cheeky, clear)\r\n- Create simple IG highlight covers and organize the IG feed\r\n- Suggest fun content ideas from our media vault or trends\n\r\n+ Additional Skills & Bonus Experience:\n\r\n- Excellent written English and ability to match brand voice\r\n- Understanding of golf culture, golf humor, and coaching brands (or a fast learner!)\r\n- Proactive, organized, and independent — takes initiative and gets things done\r\n- Bonus: Experience with Skillest, affiliate marketing, \n\r\nWhy You’ll Love Working With Us:\n\r\n- You’ll help grow a fun and impactful golf brand that’s gaining traction fast\r\n- You’ll have creative freedom and the opportunity to contribute big ideas\r\n- We love a business that runs smoothly and efficiently — and we deeply value the kind of person who makes that happen behind the scenes.\r\n- We’re flexible, travel-loving, and build in fun whenever possible\r\n- Long-term opportunity for growth into a larger role\n\r\nTo Apply:\n \nEmail Upgrade to see actual info with:\r\n- Subject: \"GHL + Social Media Wizard – [Your Name]\"\r\n- A quick intro about yourself and your favorite golf joke (yes, really ????)\r\n- Your resume or portfolio\r\n- Links to any work you’ve done in Go High Level or Canva\r\n- Bonus: Show us one fun idea you’d create for our IG",
  "skill_requirements": [
    "Email Marketing",
    "Social Media Management",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": []
}