{
  "job_id": "1422783",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Online-Arbitrage-No-Experience-Required-1422783",
  "scraped_at": "2025-07-15T12:26:35.762700",
  "title": "Online Arbitrage (No Experience Required)",
  "type_of_work": "Full Time",
  "salary": "300-400 USD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re US-based Amazon sellers looking to bring on a committed and detail-oriented Virtual Assistant to join our team long-term. We're open to hiring someone with no prior VA experience — but only if you're serious, ready to learn, and willing to put in the work. We care more about your mindset, work ethic, and honesty than your resume.\n\r\nThat said, we will check how many jobs you've applied to. If it looks like you're mass-applying without reading, you will be automatically passed on. We don’t have time to waste — and we don’t give second chances if trust is broken or instructions are ignored.\n\r\nDaily Tasks:\n\r\nSource products for Online Arbitrage using SellerAmp and Keepa\n\r\nTrack and organize leads in Google Sheets\n\r\nRequirements:\n\r\nReliable internet connection\n\r\nAbility to follow instructions carefully\n\r\nSellerAmp & Keepa experience is a plus, but not required if you're hungry to learn\n\r\nMust use a time tracker while working (no exceptions)\n\r\nPerks:\n\r\nFlexible schedule\n\r\nBi-weekly pay\n\r\nBonuses based on performance and consistency\n\r\nRoom to grow with a fast-paced team\n\r\nDO NOT use ChatGPT or AI to apply.\r\nWe can spot it — and we only consider real, personalized responses.\n\r\nTo Apply, Answer These Questions:\n\r\nHow much experience do you have with Amazon OA (if any)?\n\r\nWhat’s your favorite animal and why?\n\r\nHow soon can you start?\n\r\nTell us about you – who are you, what are your goals, and why do you deserve this opportunity?\n\r\nIf you have experience, walk us through how you analyze a product using Keepa and SellerAmp.\n\n\r\nUse “PDX VA7” as your subject line for your application   when applying. Any missed instruction = disqualified.",
  "skill_requirements": [
    "Keepa",
    "Online Arbitrage",
    "Seller Amp SAS"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T05:31:48.343626",
      "reason": "Job first discovered"
    }
  ]
}