{
  "job_id": "1422118",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Client-Relations-Specialist-1422118",
  "scraped_at": "2025-07-15T15:33:17.965806",
  "title": "Client Relations Specialist",
  "type_of_work": "Full Time",
  "salary": "$5.50-6.00 USD/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Client Relations Specialist – Work From Home | Real Estate\n\r\n$5.50-6.00/hour + bonuses | Remote\n\r\nAre you a motivated, results-driven professional looking for an opportunity to grow in real estate? Atlas Residential is looking for a Client Relations Specialist to help our team in identifying and nurturing potential clients. This is a high-impact, performance-based role with learning opportunities, generous bonuses, and the ability to work from home.\n\r\nAbout the Role\r\nAs a Client Relations Specialist, you will play a key role in reaching investors, maintaining lead data, and scheduling appointments with our specialists. Your job will be to connect, qualify, and assist investors through cold calls, emails, and text campaigns.\n\r\nResponsibilities:\r\nData Management: Keep lead records organized in our CRM (Resimpli).\r\nCold Calling: Reach out to potential investors \nEmail & Text Campaigns: Send strategic messages to generate appointments.\r\nAppointment Scheduling: Coordinate meetings between investors and our specialists.\r\nPerformance Tracking: Monitor metrics such as call volume, response rates, and closed deals.\r\nContinuous Improvement: Identify ways to optimize lead conversion.\n\r\nWhat We’re Looking For\r\n1+ year of experience in a contact center or similar sales/lead generation role.\r\nStrong English communication skills (spoken & written).\r\nExperience using CRM software (Resimpli preferred), Microsoft Office, & Google tools.\r\nTech-savvy: Knows Excel, data sorting, and lead management.\r\nComputer specs: Minimum Core i3 processor + stable internet connection.\n\r\nPay & Benefits\r\n$6/hour base pay (Training period: 90 days at $5.50/hour).\r\nBonuses per lead generated\r\nWork from home – no commute!\r\nPerformance-based salary increases.\n\r\nAbout Atlas Residential\r\nAtlas Residential is a North Carolina-based real estate investment company that started by acquiring off-market properties. Over time, we evolved our mission to help homeowners in financial distress, especially those facing foreclosure. Our team is passionate about helping families stay in their homes and providing them with real solutions.\r\nJoin our growing team & make an impact!",
  "skill_requirements": [
    "Cold Calling",
    "Customer Service",
    "Sales"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:34:13.124540",
      "reason": "Job first discovered"
    }
  ]
}