{
  "job_id": "1422665",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Setter-for-Med-Spa-1422665",
  "scraped_at": "2025-07-15T15:43:05.548196",
  "title": "Setter for Med Spa",
  "type_of_work": "Full Time",
  "salary": "starting 500/600$",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Appointment Setter \r\nWe are a wellness spa, a luxury anti-aging face & body spa located on Manhattan’s Upper East Side. We specialize in non-invasive treatments designed to detoxify, sculpt, and rejuvenate. Our brand is built on integrity, empowerment, and excellence—and we’re rapidly growing.\r\nWe’re seeking a highly motivated, goal-driven Appointment Setter who will be the first point of contact for potential clients. If you're charismatic, organized, and love closing appointments, this is your chance to grow with a premium brand at the forefront of luxury wellness.\r\nDuties::\r\n• Reach out to leads via various social media platforms, text messages, email, etc. \r\n• Qualify leads, build trust, and guide them into booking a consultation or service\r\n• Develop and follow daily scripts and sales prompts while adding a personalized touch\r\n• Nurture warm leads with follow-ups, check-ins, and timely responses\r\n• Maintain lead tracking in a CRM or spreadsheet system\r\n• Hit weekly and monthly KPI goals for booked appointments\r\n• Collaborate with the marketing team to identify high-potential lead sources\r\n• Assist in generating new leads through outreach strategies and creative engagement\r\n• Assisting CEO in special projects \r\nYou Are:\r\n• You love talking to people and have a natural ability to build rapport quickly\r\n• You’re self-motivated, ambitious, and get excited about hitting goals\r\n• You have experience in appointment setting, sales, client outreach, or DMs\r\n• You’re confident using Instagram, text platforms, and tools like Slack or CRM software\r\n• You’re detail-oriented, organized, and always follow up\r\n• You have excellent written communication with a polished tone\r\n• Experience in aesthetics, wellness, or spa industry\r\nMust Have:\r\n• Experience in appointment setting \r\n• Experience in aesthetics, wellness, or spa industry\r\n• Must be actively interested in various spa treatments \r\n• Self-motivated, ambitious, and get excited about hitting goals\n\r\nOther:\r\n--Graduated from a top university, Graduated with honors, Passed licensure exam\r\n--Document and spreadsheet skills, with an ability to become familiar with firm-specific programs and software\r\n--Proficiency in collaboration and delegation of duties, Eager and motivated, Positive attitude, Polite and professional\r\n--Friendly and professional demeanor, Reliable and task-oriented, organized\r\n--Team player, Dedicated and committed, Desire to learn new things\r\n--Willingness to work very early morning or nights\r\n--No other work commitments\n\r\nHow to Apply:\r\nIf you are a proactive, highly organized, and creative individual who thrives in a fast-paced environment, we want to hear from you! Please send your resume, along with a cover letter detailing your relevant experience, to Upgrade to see actual info with the subject line \"Setter (dot) VA Application (dot) First Name (dot) Last Name (dot) Date.”",
  "skill_requirements": [
    "Healthcare",
    "Appointment Setting",
    "Customer Relationship Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:30:54.635835",
      "reason": "Job first discovered"
    }
  ]
}