{
  "job_id": "1422937",
  "url": "https://www.onlinejobs.ph/jobseekers/job/CLIENT-SUCCESS-MANAGERS-1422937",
  "scraped_at": "2025-07-15T14:34:38.363180",
  "title": "CLIENT SUCCESS MANAGERS",
  "type_of_work": "Full Time",
  "salary": "Up to $1200 compensation inc. commissions",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us:\r\nWe are a dynamic, forward-thinking media agency at the cutting edge of digital content creation. Our innovative approach has positioned us as leaders in producing viral content that resonates with audiences across platforms. As we continue to expand our creator network, we're seeking an exceptional Content Quality Manager to ensure our output maintains the impeccable standards our brand is known for.\n\r\nWe have a huge opportunity for a highly organized and assertive Client Success Manager who can effectively manage, coordinate, and quality-assure content creation with multiple creators.\n\r\nThis role goes beyond typical content management—it's an opportunity to define excellence in digital content creation. You'll develop invaluable skills in quality assurance, creator management, and visual storytelling to boost your career.\n\r\nYou'll also receive comprehensive training through access to our exclusive viral content program – a powerful toolkit trusted by industry professionals that reveals the exact strategies for transforming ordinary creators into internet sensations.\n\r\n• Content Quality Assurance: Review all content submitted by creators, ensuring it meets our visual, technical, and brand standards. Provide direct feedback when content requires improvements, and request reshoots as needed.\r\n• Scheduling and Coordination: Organize and maintain filming schedules with multiple creators, clearly communicating expectations and deadlines for each content piece.\r\n• Assertive Communication: Maintain firm, professional communication with creators, confidently explaining quality standards and the need for reshoots when necessary.\r\n• Continuous Follow-Up: Proactively remind and chase creators to meet filming schedules and re-shoot deadlines, ensuring timely content delivery that meets quality requirements.\r\n• Logistics Management: Coordinate resources required for successful shoots, including locations, equipment, and any necessary teaUpgrade to see actual infombers.\r\n• Administrative Support: Keep comprehensive records of all communication, scheduling, and content production activities to ensure smooth, continuous operations.\n\r\nRequirements\n\r\nThis role requires a firm but supportive individual who understands what high-quality content looks like and is comfortable sending content back for reshoots when it does not meet our standards. With creators contacting you around the clock, the role demands dedication, flexibility, and a commitment to excellence in content quality. We are looking for someone with the following traits:\n\r\n• Candidate must have native level English (C1 minimum): Can communicate well with international clients.\r\n• Detail-Oriented and Quality-Focused: Able to spot even the smallest issues in content quality and insist on the highest standards, ensuring all content aligns with our brand.\r\n• Firm and Confident Communicator: Comfortable giving constructive feedback and clearly explaining quality requirements, with the confidence to send content back to creators when necessary.\r\n• Highly Organized: Skilled at managing multiple schedules and projects with strict deadlines and quality requirements.\r\n• Self-Motivated and Dedicated: Demonstrates strong personal accountability, staying accessible and responsive, even outside of traditional working hours.\r\n• Tech-Savvy: Experienced with tools such as Google Suite (Drive, Sheets, Docs) and project management software to organize, track, and review content.\n\r\nCandidate Schedule:\r\nCandidate will be required to work 6 days per week in a fully remote setup.\n\r\nWhat the Company Offers\r\n• Industry leading pay\r\n• Fully remote position with the freedom to work from anywhere\r\n• Clear career growth and the opportunity to become management for top performers.\r\n• Opportunity to shape the quality standards of a growing digital content operation\r\n• Chance to work with diverse, talented creators across multiple projects\r\n• Flexible work environment\n\r\nStart your application using this link:\nUpgrade to see actual info/t/36XQUZmNuvus?position=1c882eUpgrade to see actual infoea751c338b41fd8ec\n\r\nIf you're ready to elevate your career in content management while working with a dynamic team that values excellence, we want to hear from you.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:31:19.533094",
      "reason": "Job first discovered"
    }
  ]
}