{
  "job_id": "1422914",
  "url": "https://www.onlinejobs.ph/jobseekers/job/WordPress-Web-Developer-Experienced-Only-1422914",
  "scraped_at": "2025-07-15T12:23:54.255276",
  "title": "WordPress Web Developer  – Experienced Only",
  "type_of_work": "Part Time",
  "salary": "TBD",
  "hours_per_week": "12",
  "date_updated": "Jul 15, 2025",
  "job_overview": "WordPress Web Developer – Experienced Only\n\r\nWe’re looking for a highly skilled and self-sufficient WordPress Web Developer to join our team. This is a technical, hands-on role — not a \"learn on the job\" opportunity. We've had applicants in the past who underestimated the complexity involved, so let us be clear: you must have real-world experience and be confident handling WordPress development, automation, and integrations independently.\n\r\n???? What You’ll Be Doing\r\n-Website Management\r\n-Maintain and update WordPress core, themes, and plugins.\r\n-Add/modify website content, including product updates.\r\n-Troubleshoot technical issues swiftly to minimize downtime.\r\n-Optimize site performance across devices.\n\r\nAutomation & Tool Integrations\n\r\n-Set up and manage workflow automation (e.g., using Make/Zapier).\r\n-Integrate third-party tools such as Gravity Forms, Slack, Monday, Mailchimp, and HubSpot.\r\n-Hosting & Migrations\r\n-Handle full website migrations, including transitions to AWS or other cloud platforms.\r\n-Set up and manage hosting environments to ensure reliability and speed.\r\n-Security & SEO (Bonus)\n\r\nImplement best practices for website security.\r\n-Perform regular backups and vulnerability checks.\r\n-Familiarity with SEO and tracking tools (Google Analytics, keyword tools) is a plus.\r\n-Continuous Improvement\r\n-Proactively propose and test new features or functionality.\r\n-Maintain version control and staging practices before deploying changes.\n\r\n? What You Must Have\r\n-Extensive WordPress development experience (this is not an entry-level role).\r\n-Proficiency in HTML, CSS, JavaScript, and PHP.\r\n-Strong troubleshooting and debugging skills.\r\n-Experience with AWS or other cloud hosting platforms.\r\n-Familiarity with automation tools like Make, Gravity Forms, Mailchimp, etc.\r\n-Ability to manage multiple priorities independently and efficiently.\r\n-Excellent communication and collaboration skills.\n\r\n? Nice to Have (Bonus Skills)\n\r\n-SEO and web analytics knowledge.\r\n-Experience with e-commerce platforms and payment gateways.\r\n-Familiarity with Slack, Monday, and similar project tools.\n\r\n???? Working Structure & Expectations\r\nThis is a part-time role, paid hourly, and you will be required to track both your hours and productivity using a platform called Traq.\n\r\nIf this arrangement does not suit you, unfortunately, this may not be the right opportunity.\n\r\n???? How to Apply\r\nPlease send:\n\r\nYour resume\n\r\nA cover letter outlining your relevant experience\n\r\nLinks to websites you’ve built or managed\n\r\nApplications missing any of these three items will not be considered.\n\r\nAlso let us know:\n\r\nYour hourly/salary expectations.",
  "skill_requirements": [
    "Web Programming",
    "Wordpress",
    "Web Development"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:29:20.138891",
      "reason": "Job first discovered"
    }
  ]
}