{
  "job_id": "1422372",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Bookkeeper-with-QBO-experience-1422372",
  "scraped_at": "2025-07-15T14:41:59.289577",
  "title": "Bookkeeper with QBO experience",
  "type_of_work": "Full Time",
  "salary": "P40,000 to P50,000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for a detail-oriented Bookkeeper to oversee the organization's financial record-keeping to ensure the business is able to make sound financial decisions. This position will be responsible for producing monthly financial reports, maintaining an adequate system of accounting records, and managing a comprehensive set of controls, budgets, and forecasting to mitigate risks. The Bookkeeper will play a key role in enhancing the accuracy of the company’s reported financial results and ensuring those results comply with generally accepted accounting principles (GAAP) and bookkeeping principles and procedures. This position will report directly to the Finance Manager.\n\r\nThis position is 100% remote.\n\r\nABOUT THE COMPANY\r\nOur mission is to help business owners achieve their personal, professional, and goals through the growth of their businesses. We work in dozens of verticals and provide strategic business guidance through courses, live events, partnerships, and investments. Our core values are the backbone of our business and guide our hiring process: we are inspirational, accountable, transparent, disciplined, aligned, and results-oriented. This company operates nationally and is growing by the day.\n\r\nWondering what it's like to work here? Come check this:\nUpgrade to see actual info/watch?v=PIIv7sYj1Ns\n\r\nOBJECTIVES\r\n• Maintain an accurate and timely record of all financial transactions and issue timely and complete financial statements\r\n• Perform account reconciliation to assert the accuracy of transactions and entries in the accounting system\r\n• Develop a documented system of accounting policies and procedures\r\n• Monitor the accounting operations of subsidiary entities, transaction-processing operations, and policies and procedures\r\n• Develop professionally by remaining aware of new state and federal regulations, participating in educational opportunities, and reading professional publications\r\n• Ensure that all accounts payable are paid timely and all reasonable discounts are taken on invoices\r\n• Ensure that monthly bank and credit card reconciliations are completed\r\n• Ensure that required debt payments (company credit cards, loans, or lines of credit) are paid on a timely basis\r\n• Develop and maintain an orderly accounting filing system (digital)\r\n• Maintain a system of controls over accounting transactions\r\n• Manage the production of the annual budget and forecasts\r\n• Calculate variances from the budget and report significant issues to the ownership\r\n• Calculate and issue financial and operating metrics\r\n• Coordinate the preparation and compilation of year-end reporting and financial statements\r\n• Report and file state sales and use tax\r\n• Reconcile all balance-sheet accounts monthly\r\n• Perform other duties as assigned\n\n\r\nCOMPETENCIES\r\n• Demonstrates solid GAAP and financial reporting, technical skills\r\n• Demonstrates proficiency with QuickBooks, XERO or other accounting software, MS Office Suite, Adobe, Windows, DocuSign, Google Suite\r\n• Proactive approach to problem-solving, and process improvement\r\n• Ability to thrive in a fast-paced environment of change and growth\r\n• Demonstrates knowledge of auditing, accounting, and corporate financing\r\n• Possesses strong written and verbal communication skills, clearly communicating by phone or in person with teaUpgrade to see actual infombers\r\n• Ability to prioritize multiple tasks and responsibilities\r\n• Demonstrates a working knowledge of taxation and corporate structures\r\n• Ability to successfully maintain a positive attitude while working in a team environment with competing priorities\r\n• Possesses outstanding organization and administrative skills\n\r\nEDUCATION AND EXPERIENCE\r\n• Bachelor’s degree in accounting and finance, or equivalent business experience\r\n• Minimum 3 years of progressive experience in bookkeeping\r\n• Experience working with multiple legal entities under a legal umbrella\r\n• Experience with financial reporting requirements\n\r\nPHYSICAL REQUIREMENTS\r\nProlonged periods of sitting at a desk and working on a computer\n\r\nCOMMITMENT TO DIVERSITY\r\nAs an equal opportunity employer committed to meeting the needs of a multigenerational and multicultural workforce Cardone Ventures recognizes that a diverse staff, reflective of our community, is an integral and welcome part of a successful and ethical business. We hire local talent at all levels regardless of race, color, religion, age, national origin, gender, gender identity, sexual orientation, or disability, and actively foster inclusion in all forms both within our company and across interactions with clients, candidates, and partners.\n\r\nIf this position caught your eye, send us your resume! For best consideration, please complete the online application form:\nUpgrade to see actual info/Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}