{
  "job_id": "1422749",
  "url": "https://www.onlinejobs.ph/jobseekers/job/General-Virtual-Assistant-Part-Time-1422749",
  "scraped_at": "2025-07-15T14:30:31.895436",
  "title": "General Virtual Assistant - Part Time",
  "type_of_work": "Part Time",
  "salary": "100 AUD weekly",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We're looking for smart and reliable VAs who can work with our clients. Initially, you'll be working 20 hours a week and the schedule varies from client to client but typically it's Monday to Friday at 8am to 6pm AEST (6am to 4pm Philippines Time).\n\r\nOur clients are in the Health & Fitness Industry so if you have experience in that it's a BIG PLUS!\n\r\nYou'll be assisting our clients with some of the tasks below.\n\r\n- Administrative Work\n\r\n- Lead Generation/Nurture\n\r\n- Social Media Management\n\r\n- Graphic Design & Video Editing Skills\n\r\nWe do not expect you to have all the experience mentioned above. However, we will choose the applicants who has the most relevant experiences that matches with our client's needs.\n\r\nHere are the few specialized positions we are actively looking for. There are more general positions we have.\n\r\n- Social Media Manager , Content Creator with Lead Generation experience. (Majority of our current clients are looking for this)\n\n\r\nPlease be informed that our clients will be hiring you directly. You will be working independently, so you'll need to have a certain degree of confidence in working by yourself and communicating with the client. We need someone who has the following below.\n\r\n- Has relevant experience on all or 3 of the tasks above (Most important)\n\r\n- A Self-Start - Knows when to research first before asking for help.\n\r\n- Can follow instructions thoroughly\n\r\n- Has great attention to details.\n\r\nOn the form, instead of putting your Location put the sum of \"-27 + 15\". Just put the number. This will let us know that you read this job listing thoroughly.\n\nUpgrade to see actual info/general-va-gvaUpgrade to see actual infoInitial Minimum Compensation Package (Compensation depends on your experience & client's budget)\n\r\n- Part Time (20 Hours) is $100 - $200 AUD WEEKLY.\n\r\n(Average of $434.5 - $869 AUD per month)\n\r\n- Full Time (40 Hours) is $200 - $400 AUD WEEKLY.\n\r\n(Average of $869 - $1738 AUD per month)\n\r\nMinimum Computer Specs Requirements\n\r\nCPU - Intel i3 or i5 Processors Gen 9 above (IF AMD, something equivalent)\n\r\nRAM - 8 GB (Preferred 16 GB)",
  "skill_requirements": [
    "Lead Generation",
    "Account Retention",
    "Office and Administration"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:21:07.410148",
      "reason": "Job first discovered"
    }
  ]
}