{
  "job_id": "1422395",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Outreach-Lead-Generation-Specialist-1422395",
  "scraped_at": "2025-07-15T12:21:54.119762",
  "title": "Outreach & Lead Generation Specialist",
  "type_of_work": "Part Time",
  "salary": "$700",
  "hours_per_week": "24",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a small, specialist paid social agency focused on helping beauty and aesthetics brands scale through high-performing campaigns on TikTok and Meta . \n\r\nAs we continue to grow, we’re looking for a part-time outreach and lead generation specialist with a genuine understanding of the beauty space to help us connect with new clients.\n\r\nAbout the Role\n\r\nYour role will centre on outreach to beauty brands, skincare companies, and aesthetics clinics, with the aim of introducing our agency and securing interest in our paid social services. You’ll be working directly with our founder to build a pipeline of qualified leads and arrange initial conversations.\n\r\nThis is a great opportunity for someone who has experience with agency business development, lead generation, or sales – especially within the beauty, lifestyle, or wellness sectors. You’ll need to be confident using tools like LinkedIn Sales Navigator and other prospecting platforms.\n\r\nKey Responsibilities\n\r\n- Research and identify potential clients in the beauty and aesthetics space\r\n- Use LinkedIn Sales Navigator and other prospecting tools (e.g. Apollo, Clay, Hunter, etc.) to build and manage outreach lists\r\n- Craft and send personalised outreach messages via LinkedIn, email, or other channels\r\n- Follow up with leads, nurture conversations, and book discovery calls for the team\r\n- Monitor outreach performance and report on engagement, interest, and meetings booked\r\n-Stay up to date with trends in the beauty and digital marketing industries\n\r\nWhat We’re Looking For\n\r\n- Proven experience in outreach, lead generation, or business development, ideally for a marketing, creative, or digital agency\r\n- Understanding of or interest in the beauty, skincare, and aesthetics industry\r\n- Comfortable using LinkedIn Sales Navigator and prospecting platforms\r\n- Excellent written English and communication skills\r\n- Highly organised and able to work independently\r\n- Results-driven and comfortable working to targets or KPIs\r\n- Available to work three days per week",
  "skill_requirements": [
    "Outbound Sales",
    "Lead Generation"
  ],
  "is_active": true,
  "status_history": []
}