{
  "job_id": "1422891",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Affiliate-Manager-VA-1422891",
  "scraped_at": "2025-07-15T12:27:54.847437",
  "title": "Affiliate Manager VA",
  "type_of_work": "Full Time",
  "salary": "$3.5- $6 per hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role:\r\nWe are seeking a proactive and experienced Affiliate Manager VA to join our growing team. In this role, you’ll be responsible for identifying, building, and managing strategic affiliate partnerships that drive growth. You will work closely with the marketing team to source high-quality partners, lead outreach and negotiations, and oversee the full lifecycle of affiliate campaigns. This is a key position for someone who thrives on relationship-building and wants to make a direct impact in a performance-driven environment.\n\r\nKey Responsibilities:\r\n- Source and evaluate potential affiliate partners aligned with our goals\r\n- Initiate outreach and build strong, professional relationships\r\n- Negotiate and close partnership deals independently\r\n- Launch and manage affiliate campaigns from setup to execution\r\n- Track performance and optimize for ROI\r\n- Provide regular reporting and strategic input to improve results\r\n- Stay current with industry trends, tools, and affiliate traffic sources\n\r\nRequirements:\r\n- Minimum 2 years of experience in affiliate marketing or a similar role\r\n- Familiarity with key affiliate platforms, networks, and traffic sources\r\n- Strong outreach, communication, and negotiation skills\r\n- Ability to independently manage the full affiliate partnership cycle\r\n- Self-motivated, results-oriented, and highly organized\r\n- Comfortable working remotely and with minimal supervision\r\n- Fluent in written and spoken English\n\r\nBonus Points:\r\n- Existing affiliate network or relationships\r\n- Experience launching campaigns in e-commerce, digital services, or SaaS\r\n- Familiarity with affiliate tracking tools and dashboards\r\n- Previous success in building an affiliate program from scratch\n\r\nWhy Join Us:\r\nAt our company, you’ll join a team of driven professionals in a collaborative and growth-oriented environment. We value initiative, strategic thinking, and open communication—giving you the space to bring your experience and ideas to the table. As an Affiliate Manager, you’ll play a key role in developing high-impact partnerships within a performance-focused marketing company. You'll have the opportunity to work on meaningful projects, expand your industry network, and grow your career as part of a team committed to delivering measurable results. Join us and help shape the future of our affiliate program.",
  "skill_requirements": [
    "Affiliate Marketing",
    "Campaign Building",
    "Campaign Optimization"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:32:53.057717",
      "reason": "Job first discovered"
    }
  ]
}