{
  "job_id": "1422267",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422267",
  "scraped_at": "2025-07-14T23:08:48.573444",
  "title": "Instagram Appointment Setter - Virtual Assistant Position",
  "type_of_work": "Full Time",
  "salary": "$5/HR US",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Instagram Appointment Setter - Virtual Assistant Position\r\nCompany Overview\r\nWe are a growing Education business looking for a dedicated and results-driven VA to join our team as an Instagram Appointment Setter. This is a remote position perfect for motivated individuals in the Philippines who want to grow their career in digital marketing and sales.\r\nWe currently employ over 50 VAs and have VAs that have been working with us since we launched 7 years ago. \n\r\nWe’ll provide plenty of growth opportunity to individuals that are go getters.\r\nPosition: Instagram Appointment Setter (Virtual Assistant)\r\nTwo potential schedules:\r\nSchedule 1: 6am to 2 pm EST\r\nSchedule 2: 2pm to 10 pm\r\n Employment Type: Full-time\r\nJob Description\r\nWe are seeking an experienced Virtual Assistant to generate qualified leads and schedule appointments through Instagram outreach. You will be responsible for engaging with potential customers, building relationships, and converting prospects into scheduled appointments for our sales team.\r\nKey Responsibilities\r\nLead Generation: Identify and research potential customers on Instagram using targeting criteria\r\nDirect Outreach: Send personalized direct messages to prospects following proven scripts and strategies\r\nEngagement: Respond to comments, story replies, and engage with followers to build relationships\r\nLead Qualification: Ask qualifying questions to determine prospect fit and interest level\r\nAppointment Setting: Schedule qualified appointments in our calendar system\r\nCRM Management: Update prospect information and interaction history in our CRM\r\nFollow-up: Nurture leads through follow-up messages and content engagement\r\nReporting: Provide daily/weekly reports on outreach activities and appointment metrics\r\nContent Support: Assist with basic Instagram content engagement and community management\r\nRequired Qualifications\r\nExperience: Minimum 1-2 years experience as a Virtual Assistant or in social media marketing\r\nInstagram Expertise: Basic understanding of Instagram platform, features, and best practices\r\nEnglish Proficiency: Excellent written English communication skills (C1 level or higher)\r\nSales Skills: Basic understanding of sales processes and lead qualification\r\nTechnical Requirements:\r\nReliable high-speed internet connection (minimum 25 Mbps)\r\nModern computer/laptop with webcam\r\nQuiet, professional workspace\r\nBackup power source (UPS recommended)\r\nAvailability: Able to work EST\r\nPreferred Qualifications (bonus)\r\nPrevious experience in appointment setting or lead generation\r\nExperience with tools like GoHighLevel, or similar CRM platforms\r\nUnderstanding of sales funnels and lead nurturing processes\r\nExperience in appointment setting\r\nSocial media marketing certifications\r\nApplication Requirements\r\nTo apply, please submit:\r\nUpdated Resume/CV highlighting relevant VA and social media experience\r\nCover Letter explaining why you’d be a good fit\r\nKeyword “purple pineapple” to know you read this\r\nPortfolio/Examples of previous social media outreach or appointment setting work\r\nInternet Speed Test screenshot showing your connection speed\r\nAbout Working With Us\r\nWe are committed to building long-term relationships with our teaUpgrade to see actual infombers. We provide comprehensive training, ongoing support, and opportunities for growth. Our ideal candidate is someone who is proactive, detail-oriented, and excited about helping our business grow through strategic Instagram outreach.",
  "skill_requirements": [
    "Instagram marketing",
    "Appointment Setting",
    "Executive Assistance"
  ]
}