{
  "job_id": "1422895",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Brand-Designer-1422895",
  "scraped_at": "2025-07-15T14:32:21.123514",
  "title": "Senior Brand Designer",
  "type_of_work": "Any",
  "salary": "1000",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "For designers who live and breathe visual consistency, storytelling, and strong brand systems.\n\r\nWe’re searching for a senior-level brand designer to bring our visual identity to life across social media posts, static ads, infographics, carousels, landing page assets, and more. You’ll be responsible for creating on-brand visual content that looks like it belongs in the feed of top-performing wellness and lifestyle brands—think PetLab Co., Dore & Rose, Spacegoods, and Huel.\n\r\nThis is not a junior design role. We’re only looking for designers who understand brand systems and can execute high-quality visuals with precision, even when working from templates or generating AI content.\n\r\n? What You’ll Do:\n\r\n– Design branded static content for social media, ads, carousels, infographics, email banners, and product visuals\r\n– Translate concepts and briefs into clean, conversion-driven visuals using brand colors, fonts, and tone\r\n– Use platforms like Upgrade to see actual info, Canva templates, or custom frameworks for faster execution\r\n– Leverage AI tools (Midjourney, Firefly, DALL·E, ChatGpt etc.) to generate image assets when needed\r\n– Collaborate with our marketing and copy team to bring strong messaging to life visually\r\n– Maintain and evolve visual brand consistency across all touchpoints\n\r\n???? What We’re Looking For:\n\r\n– Proven senior brand designer with a portfolio showing strong branding and visual systems\r\n– Deep understanding of typography, layout, and visual hierarchy in the context of performance design\r\n– Experience designing in styles similar to Huel, Spacegoods, Dore & Rose, and PetLab Co.\r\n– Strong command of tools like Photoshop, Illustrator, Figma, Canva, or similar\r\n– Skilled in using design templates and creative assets libraries efficiently\r\n– Bonus: Familiarity with ads and DTC e-commerce creatives\r\n– Detail-oriented, responsive, and comfortable with remote async work\n\r\n? Please Do Not Apply If:\n\r\n– You’re just starting out or cannot showcase prior branding work\r\n– You don’t have experience working with defined brand guidelines\r\n– You rely on trends but don’t understand the structure behind good design\r\n– You struggle to balance creativity with clarity and conversion\n\r\n???? How We Work:\n\r\n– Fully remote and async-friendly\r\n– Clear briefs, fast feedback loops\r\n– Long-term role with room to grow into creative leadership\n\r\n???? How to Apply:\n\r\nPlease send us:\r\n– A short introduction about yourself\r\n– Your portfolio link (must include work like the references above)\r\n– Your expected monthly salary in USD",
  "skill_requirements": [
    "Graphic Design",
    "Creative Advertising",
    "Branding"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:32:21.003836",
      "reason": "Job first discovered"
    }
  ]
}