{
  "job_id": "1422599",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Animator-Remote-Long-Term-Opportunity-17M-YouTube-Channel-1422599",
  "scraped_at": "2025-07-15T14:39:00.011785",
  "title": "Animator – Remote, Long-Term Opportunity (1.7M+ YouTube Channel)",
  "type_of_work": "Full Time",
  "salary": "Commensurate with experience",
  "hours_per_week": "30",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We're looking for a skilled and passionate Video Animator to join the Med School Insiders YouTube team! This is a long-term, remote role where you'll create high-quality animations for our channel, which boasts over 1.7 million subscribers.\n\r\nYour Core Responsibilities:\n\r\n- Bring scripts and voiceovers to life through compelling animations.\r\n- Develop three unique thumbnail options for each video.\r\n- Collaborate with writers, producers, and social media managers.\r\n- Ensure top-tier animation quality and meet consistent deadlines.\n\r\nWhat We Need From You:\n\r\n- Proficiency in animation and video editing (Final Cut Pro or Adobe Suite).\r\n- Experience with Powtoon and basic Photoshop (for thumbnails).\r\n- Strong attention to detail, organization, and reliability.\r\n- Excellent communication skills.\r\n- A high-performance computer (4K capable) and high-speed internet.\n\r\nWhy This Role Stands Out:\n\r\n- Be part of a fast-moving, high-impact YouTube team.\r\n- Opportunity for long-term growth and professional development.\r\n- Contribute to meaningful educational content that reaches millions.\n\r\nIf you're passionate about animation, eager to make a significant impact, and ready to be part of a fast-moving team, we'd love to see your work! Apply now and show us why you're the perfect fit.\n\r\nAPPLY NOW: forms. gle/ fyNaEEfxcwberJwf6 (remove the spaces)",
  "skill_requirements": [
    "After Effects",
    "Motion Graphics",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:19:06.234537",
      "reason": "Job first discovered"
    }
  ]
}