{
  "job_id": "1422322",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Virtual-Assistant-Bookkeeping-Spreadsheet-Support-1422322",
  "scraped_at": "2025-07-15T12:23:35.656761",
  "title": "Remote Virtual Assistant (Bookkeeping & Spreadsheet Support)",
  "type_of_work": "Full Time",
  "salary": "$800-$1000 USD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re seeking a highly detail-oriented and reliable Virtual Assistant to join our growing global team. This full-time remote role is ideal for someone with a background in bookkeeping or accounting, who thrives in a spreadsheet-heavy, process-driven environment.\n\r\nIf you love organizing numbers, updating systems, and keeping everything running smoothly behind the scenes—this role is for you.\n\r\nKey Responsibilities\r\n- Update numbers and financial records in QuickBooks Desktop and QuickBooks Online\r\n- Maintain and update various tracking spreadsheets (Google Sheets/Excel)\r\n- Assist with payroll preparation and ensure accuracy\r\n- Support invoicing, billing, and reconciliation tasks\r\n- Organize data for reporting and internal review\r\n- Communicate with teaUpgrade to see actual infombers through Slack, email, and occasional Microsoft Teams calls\n\r\nSoftware Tools\r\n- QuickBooks (both desktop and online)\r\n- Google sheets\r\n- Slack, email, MS teams\n\r\nRequirements\r\n- 2+ years of experience in bookkeeping or accounting roles\r\n- Strong working knowledge of spreadsheets (formulas, data entry, organization)\r\n- Excellent written English skills (fluency required)\r\n- Own computer with a stable internet connection\r\n- Second monitor highly recommended for efficiency\r\n- Strong attention to detail, organizational skills, and ability to self-manage tasks and deadlines\n\r\nHours and Availability\r\n- Full-time (40 hours/week)\r\n- Must be available during standard U.S. Eastern Time (EST) business hours\r\n- Remote work from anywhere is welcome—as long as you're punctual, responsive, and committed during EST hours\n\r\nWhy Join Us?\r\nWe are a supportive and fast-moving team that values clear communication and trust. You'll have the chance to make a real impact and grow in your role over time. We’re looking for someone who takes pride in accurate work and loves organizing behind the scenes.",
  "skill_requirements": [
    "Bookkeeping",
    "Data Entry",
    "Attention to Detail"
  ],
  "is_active": true,
  "status_history": []
}