{
  "job_id": "1422420",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Appointment-Setter-1422420",
  "scraped_at": "2025-07-15T15:29:12.320995",
  "title": "Appointment Setter",
  "type_of_work": "Full Time",
  "salary": "$6/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Title: Virtual Assistant for Lead Generation, Sales, and Marketing\n\r\nCompany: Joga Soccer Academy\n\r\nLocation: Remote\n\r\nPosition Type: Full-time (Open to Part Time)\n\r\nSalary: Competitive, based on experience ($800-$1200 USD/month)\n\r\nAbout Us:\r\nAt Joga Soccer Academy, we’re on a mission to help youth soccer players build confidence and sharpen their skills through a proven training system—creating a foundation for success both on and off the field. Inspired by the spirit of Joga Bonito—“to play beautifully”—we celebrate the creativity, passion, and discipline that makes the game transformative.\n\r\nWe’re proud to be the #1 company in the U.S. for player development, and we’re looking for a motivated Appointment Setter who shares our vision and values to help us connect with even more families ready to invest in their player's growth.\n\r\nJob Description:\r\nAs an Appointment Setter, you’ll be the first point of contact with families interested in our programs. Your role is to reach out, qualify their interest, and schedule consultations with our coaching team. You’ll work remotely and independently, backed by a team that lives our core values: team first, client-centric, integrity, ownership, and passion.\n\r\nKey Responsibilities:\r\n- Reach out to leads via phone (RingCentral), email, and CRM follow-ups\r\n- Qualify prospects using a script and discovery framework\r\n- Schedule consultations using integrated calendar tools\r\n- Keep our CRM (HubSpot) and tracking sheets (Google Sheets) accurate and up to date\r\n- Coordinate with our coaching and admin teams in Notion\r\n- Follow up with no-shows and warm leads to ensure continuity\r\n - Report on outreach and appointment metrics weekly\n\r\nWho We Are Looking For:\r\n- Self-motivated with a winning, team-first attitude\r\n- A strong communicator with excellent English speaking and writing skills\r\n- Organized and detail-oriented—you follow through and own your results\r\n- Comfortable making outbound calls and working with sales tools\r\n- Passionate about helping young athletes and families\r\n- Previous experience in appointment setting or customer outreach preferred\r\n- Familiarity with tools like HubSpot, RingCentral, Google Sheets, ConvertKit, Notion, Wix, and Stripe is a plus\n\r\nTools You'll Use\r\n- CRM & Email: HubSpot, ConvertKit\r\n- Phone/VoIP: RingCentral\r\n- Project Management: Notion\r\n- Reporting: Google Sheets\r\n- Web & Payments: Wix, Stripe\n\r\nCompensation & Growth\r\nBase Pay: $6/hour\r\nCommission: Earn bonuses for each qualified, attended appointment\r\nGrowth Path: High performers have opportunities to grow into roles in sales, client success, or operations\n\r\nHow to Apply:\r\nIf you're ready to take on this exciting opportunity and contribute to our growing team, please submit your resume along with a cover letter detailing your relevant experience and why you'd be a great fit for this role. We look forward to hearing from you!",
  "skill_requirements": [
    "English Speaking",
    "Communication",
    "Organization"
  ],
  "is_active": true,
  "status_history": []
}