{
  "job_id": "1422651",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Project-Manager-Superstar-Only-1422651",
  "scraped_at": "2025-07-15T15:40:15.611530",
  "title": "Senior Project Manager *Superstar Only*",
  "type_of_work": "Full Time",
  "salary": "PHP 65, 000 to PHP 95, 000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a proactive and detail-oriented professional with a proven track record in project management?\n\r\nCan you effectively oversee complex projects, ensuring timely delivery and adherence to budgets, even in high-pressure situations?\n\r\nWe're seeking a Project Manager capable of handling multifaceted tasks seamlessly, demonstrating exceptional problem-solving skills and a commitment to continuous improvement.\n\r\nIf you're driven by delivering excellence and eager to take on new challenges, we encourage you to apply.\n\r\nABOUT US\n\r\nWe are a fast-growing holistic beauty company seeking the brightest, most talented minds to join our remote team. More details will be shared during the interview, but you'll have the opportunity to work with one of the fastest-growing holistic beauty creators, boasting over 2,500,000 followers.\n\n\r\nJOB QUALIFICATIONS:\n\r\n- Demonstrated outstanding achievements, such as earning Latin Honors (Summa Cum Laude, Magna Cum Laude, Cum Laude), receiving various excellence awards (e.g., \"Employee of the Year\"), and showcasing rapid career advancement in previous roles.\n\r\n- Minimum of 2 years of experience working as a Project Manager.\n\r\n- A Bachelor's degree in Business Management, Project Management, or a related field is preferred but not required.\n\r\n- Excellent communication skills, both oral and written, characterized by professionalism in tone and manner, clarity in conveying messages, and active listening.\n\r\n- Strong attention to detail with proven accuracy and precision.\n\r\n- Effective task prioritization and time management.\n\r\n- Successful track record in project planning, execution, and delivery.\n\r\n- Proficient problem-solving and decision-making skills, demonstrating sound judgment.\n\r\n- Adaptable and flexible in dynamic environments, handling challenges with ease.\n\n\r\nJOB RESPONSIBILITIES INCLUDE:\n\r\n- Define project scope, goals, and deliverables in collaboration with stakeholders.\n\r\n- Coordinate internal and external resources to ensure timely execution of project tasks.\n\r\n- Monitor project progress, identify risks, and implement mitigation strategies.\n\r\n- Communicate regularly with stakeholders, providing project updates and addressing concerns.\n\r\n- Ensure all projects are delivered on time, within scope, and budget.\n\r\n- Manage project documentation, including reports and change requests.\n\r\n- Identify and resolve project-related issues and challenges as they arise, exercising sound judgment and problem-solving skills.\n\r\n- Manage project schedules efficiently, prioritizing tasks and activities to maximize productivity and optimize time usage.\n\n\r\nREQUIREMENTS FOR EFFECTIVE REMOTE WORK:\n\r\n- Reliable Computer/Laptop\n\r\n- High-Speed Internet Connection (+backup)\n\r\n- Conducive Work Environment\n\n\r\nWORKING SCHEDULE:\n\r\n- Full-time Employment Opportunity\n\n\r\nBENEFITS:\n\r\n- Competitive Salary\n\r\n- Training and Development Opportunities\n\r\n- Opportunity to contribute to a rapidly expanding company dedicated to promoting holistic beauty\n\r\n- Great potential for career advancement into various leadership positions\n\r\nIf you believe you meet our qualifications and requirements, we encourage you to apply now and become a valuable part of our rapidly expanding company.\n\r\nPlease click the link below, review the questions carefully, and share the required information.\n Upgrade to see actual info",
  "skill_requirements": [
    "Project Management",
    "Attention to Detail",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:27:22.738014",
      "reason": "Job first discovered"
    }
  ]
}