{
  "job_id": "1422728",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Short-Form-Video-Editor-ASAP-1422728",
  "scraped_at": "2025-07-15T15:41:53.154131",
  "title": "Short-Form Video Editor (ASAP)",
  "type_of_work": "Full Time",
  "salary": "$400USD/month estimate. Paid per video.",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "IMMEDIATE START – Short-Form Video Editor (Talking-Head Content)\n\r\nWe’re looking for a fast, detail-oriented editor to help with rough cuts and polished edits for short-form talking-head content (Reels, TikToks, Shorts).\n\r\nReference Styles:\nUpgrade to see actual info==\nUpgrade to see actual info\nUpgrade to see actual info\n\r\nYour role:\r\nCut raw footage and remove filler (um’s, ah’s, stutters, repeated phrases)\r\nAdd simple text, sound effects, overlays, and light transitions as needed\r\nColor grading\r\nFollow pacing, flow, and brand-specific guidelines to keep content engaging\r\nDeliver high-quality edits with fast turnaround (1–2 days max)\r\nNote: Additional resources will be provided (eg. some premiere projects will already have the core cut assembled. music provided, text templates etc.)\n\r\nRequirements:\r\nProficient in Premiere Pro (After Effects is a plus)\r\nStrong sense of pacing, rhythm, and visual storytelling\r\nDesign-centric approach to fonts, layout, and brand consistency\r\nClear communicator – fluent in English for English-related video context jokes, proactive with updates and feedback on Whatsapp\r\nMust love the craft of editing and care about the final product\n\r\nBonus if:\r\nYou use a MacBook\r\nYou have a background in graphic design or branding\n\r\nPlease message with your related portfolio of work and a quick summary of your editing experience.\n\r\nAbout Duke Phan Studio\r\nWe’re a video editing agency working with creators and brands. We specialise in powerful, storytelling-driven content with a sharp eye for keeping everything tailored and on-brand for our clients.\n\nUpgrade to see actual info",
  "skill_requirements": [
    "After Effects",
    "Illustrator",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:28:11.596743",
      "reason": "Job first discovered"
    }
  ]
}