{
  "job_id": "1422056",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-for-Marketing-Media-Company-1422056",
  "scraped_at": "2025-07-14T23:08:55.672440",
  "title": "Virtual Assistant for Marketing Media Company",
  "type_of_work": "Any",
  "salary": "$800",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hello,\n\r\nWe are looking for a VA to do a variety of different tasks. We are a brand creating content about digital marketing. Also, we run some digital product stores.\n\r\nWe are working on building a huge media brand in a marketing space, so we are looking for someone who would be excited to be a part of that.\n\r\nWe are looking for someone who is pretty self-led. We might give you some very detail instructions for some tasks, but for other tasks we might just tell you what we want and we will want you to be able to go out there and figure it out yourself how to do it.\n\r\nYou would do a variety of different bigger and smaller tasks and when you are not doing that you would be given some bigger writing projects, creating guides on certain topics and creating social media content. So, good writing and research skills are a must. This position can be beneficial for you not just to earn money but also to learn a lot of different aspects of online business along the way, as you will be doing in-depth research and creating guides on topics within these fields.\n\r\nThere will be a lot of simple tasks but also there will be some more creative tasks like doing research and implementing how we can accomplish a certain task. We are looking for someone who has a good level of English and good internet as there will be a lot of images and video file uploading.\n\r\nWe would like to have virtual meetings with you from time to time.\n\r\nHere are some example tasks you will need to do:\n\r\n• Creating 'How to' guides in Notion\n\r\n• Figuring out how to use ChatGPT for certain tasks\n\r\n• Finding well-performing blog posts on a certain topic\n\r\n• Find companies/blogs/influencers for a specific niche and emailing them\n\r\n• Editing text images with Canva (You only need to change text and pictures, it can be learned in 5 minutes)\n\r\n• Compressing and uploading Images to Wordpress\n\r\n• Creating spreadsheets of businesses emailed and date of emailing\n\r\n• Doing simple set ups of Wordpress websites/email softwares (do not worry there will be step by step tutorials)\n\r\n• Answer certain emails with pre-written responses. Some emails might need some extra non pre-written answers\n\r\n• Completing SEO parts for blog posts on Wordpress back-end\n\r\n• Finding necessary pictures for Instagram and scheduling them out using our provided tools\n\r\n• Keyword research for articles\n\r\n• Editing Wordpress website\n\r\n• Adding email automations\n\r\n• Creating Lead Magnets\n\r\nThese are just some example tasks, but we can need a lot of small or bigger things for day-to-day tasks.\n\r\nWhen applying please tell me any relevant experience you have and if you know how to use some other softwares(Wordpress; convertkit; capcut, Google analytics…)\n\r\nBenefits:\n\r\n• Flexible work hours\n\r\n• Setting your own schedule\n\r\n• Expanding your knowledge on digital marketing & online business\n\r\n• Bonuses for good performance\n\r\n• Instructions to learn new skills\n\r\n• Open to your creative suggestions\n\r\nTo apply please fill in the form that you will find in the question section.\n\r\nYou will be asked to be able to do at least 1 hour of work every day in case there are some urgent small things or it is necessary for feedback to move faster. But in general, we will try to assign you a lot of work at once, so you can work on a schedule that suits you the best.\n\r\nWe ask everyone we work with to use a time tracking software, so we can have all of the information how much time we spend on each project/task within one place. There will also be a lot of uploading and downloading of big video files. Since we don't know your internet speed, and we don't want to discriminate you based on that. We would ask you to download/upload the files while doing other tasks,\n\r\nWhen working we will ask you to submit weekly reports of what has been done, so we can keep up with the things that are happening. (we will provide a template for this)\n\r\nTo apply please fill in this form: Upgrade to see actual info\n\r\nIf you pass the initial state, we will ask you to do a tiny test task and have a call with us.",
  "skill_requirements": [
    "Project Management",
    "Research",
    "Virtual Assistant"
  ]
}