{
  "job_id": "1422633",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Expert-Wordpress-Web-Developer-1422633",
  "scraped_at": "2025-07-15T15:48:52.571076",
  "title": "Expert Wordpress / Web Developer",
  "type_of_work": "Full Time",
  "salary": "40000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Who are We:\n\r\nStar Digital Marketing is a digital agency with a head office in Melbourne, Australia. Serving clients across a diverse range of industries and niches. From small businesses such as mom-and-pop shops to large-scale e-commerce machines, as well as trade companies including electricians, plumbers, and beyond, we cater to a wide array of clients. Our client base ensures that no two projects are alike, presenting unique challenges and opportunities for innovation.\n\r\nWe seek a highly skilled and proactive  WordPress Developer to join us in delivering top-tier solutions to our clients. As a WordPress Developer, you will be at the forefront of our development efforts, responsible for architecting, developing, and maintaining high-performance WordPress websites and applications. We are seeking a candidate who possesses exceptional technical expertise and demonstrates a strong aptitude for critical thinking and problem-solving. The ideal candidate thrives in a fast-paced environment, where they will encounter a wide array of challenges and opportunities for innovation. \n\r\nKey Responsibilities:\n\r\n• Collaborate with our design and development teams to translate client requirements into robust WordPress solutions.\r\n• Develop custom themes, plugins, and integrations to enhance WordPress websites' functionality and user experience.\r\n• Perform ongoing maintenance and optimisation tasks to ensure WordPress sites' stability, security, and performance.\r\n• Troubleshoot and resolve technical issues related to WordPress, PHP, JavaScript, WHM, DNS, and other relevant technologies.\r\n• Conduct thorough testing to identify and address any bugs or compatibility issues across different browsers and devices.\r\n• Provide technical guidance and mentorship to junior developers, fostering a collaborative and supportive team environment.\n\r\nRequirements:\n\r\n• Minimum of 2 years of experience working as a WordPress Developer, with a strong portfolio showcasing your past projects and achievements.\r\n• Proficiency in PHP, JavaScript, jQuery, CSS, and MySQL, with a deep understanding of WordPress architecture and best practices.\r\n• Extensive experience with popular WordPress plugins, themes, and frameworks, and the ability to customise them as needed.\r\n• Strong knowledge of web hosting technologies, including WHM, DNS management, and server configurations.\r\n• Demonstrated expertise in diagnosing and resolving malware infections and security vulnerabilities in WordPress sites.\r\n• Excellent problem-solving skills and the ability to approach challenges creatively and resourcefully.\r\n• Exceptional communication and teamwork skills, with the ability to effectively collaborate with cross-functional teams and communicate technical concepts to non-technical stakeholders.\r\n• Proven ability to work efficiently under pressure and manage multiple projects while maintaining high quality and attention to detail.",
  "skill_requirements": [
    "SEO",
    "PHP",
    "Wordpress"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:27:48.783809",
      "reason": "Job first discovered"
    }
  ]
}