{
  "job_id": "1422488",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Project-Manager-1422488",
  "scraped_at": "2025-07-15T12:27:31.816282",
  "title": "Project Manager",
  "type_of_work": "Part Time",
  "salary": "$350/month",
  "hours_per_week": "30",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us:\n\r\nWe are a start-up international community dedicated to teaching Kabbalistic astrology in a practical, spiritual, and accessible way. We offer courses in multiple languages and work with students from all over the world. Our mission is to deliver high-impact programs and services that empower our communities and clients. We're looking for a proactive and detail-oriented Project Manager to support our team in streamlining operations, improving communication, and ensuring projects are delivered on time and within scope.\n\r\nJob Summary:\r\nAs our Project Manager, you’ll be responsible for planning, executing, and finalizing projects across various departments. You will work closely with our leadership team (including the Admin & Operations Manager and Social Media Manager) to ensure deliverables are met, teaUpgrade to see actual infombers stay aligned, and timelines are respected. You’ll also coordinate between stakeholders, track progress, and implement tools and systems that help us scale.\n\r\nKey Responsibilities:\r\nDevelop and manage project timelines, milestones, and deliverables\r\nCoordinate tasks among cross-functional teams (marketing, design, social media, admin, etc.)\r\nMonitor team productivity and performance, identifying risks or blockers early and prompting the corresponding teaUpgrade to see actual infomber promptly.\r\nMaintain project documentation, reports, and dashboards using tools like Upgrade to see actual info, spreadsheets, or others\r\nCommunicate regularly with stakeholders and provide progress updates\r\nTrack resources and deliverables where applicable\r\nSupport process optimization and documentation\r\nIdentify gaps and propose solutions for workflow efficiency\r\nConduct post-project reviews and create process improvements based on lessons learned\n\r\nQualifications:\r\n1+ years of experience in project management, operations, or a similar role\r\nExcellent organizational, multitasking, and time management skills\r\nStrong communication skills (written and verbal)\r\nExperience using project management tools (e.g., ClickUp, Asana, Upgrade to see actual info, Airtable)\r\nAbility to manage multiple projects with overlapping deadlines\r\nExperience working with remote and cross-functional teams\r\nDetail-oriented, solutions-driven, and tech-savvy\n\r\nPreferred But Not Required:\r\nExperience in astrology, education, or creative industries\r\nFamiliarity with tools like Canva, Hubspot, Tilda, Xero\r\nBackground in administrative support\r\nA proactive and assertive attitude with a passion for continuous learning and growth\n\r\nWhy Join Us?\r\nWork closely with a supportive and visionary leadership team\r\nRemote-first culture and flexible work environment\r\nOpportunities to grow into a leadership role\r\nBe part of a mission-driven organization that values impact, integrity, and collaboration\n\r\nPlease fill out the following form so we can review your application efficiently:\nUpgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:18:07.070668",
      "reason": "Job first discovered"
    }
  ]
}