{
  "job_id": "1422630",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Google-merchant-1422630",
  "scraped_at": "2025-07-15T14:28:26.403765",
  "title": "Google merchant",
  "type_of_work": "Any",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re The Cultivator, an Australian-based agency scaling local and high-ticket service businesses across Australia, the US, and beyond.\r\nWe’re looking for a Google Merchant Specialist who knows how to keep feeds clean, accounts compliant, and campaigns profitable. If you're confident managing Google Merchant Center for eCommerce or lead-gen campaigns, we want to hear from you.\n\r\nYour Day-to-Day Will Look Like This:\r\n• Set up and manage Google Merchant Center accounts\r\n• Ensure all products and listings meet Google’s policies\r\n• Troubleshoot disapprovals, errors, or feed issues\r\n• Collaborate with our media buyers to ensure product ads are optimized for performance\r\n• Regularly update product data, attributes, and pricing info\r\n• Monitor account health and performance metrics\r\n• Stay up to date on new Merchant Center features and compliance rules\n\r\nWhat We’re Looking For:\r\n• Proven experience managing Google Merchant Center\r\n• Knowledge of feed creation (manual or through apps like DataFeedWatch, GMC API, etc.)\r\n• Strong attention to detail, especially when it comes to policy compliance\r\n• Familiarity with Shopify or WooCommerce is a bonus\r\n• Bonus points if you’ve worked on both product-based and service-based accounts\n\r\nWhy Work With Us:\r\n? Full-time remote role\r\n? Fast-moving and supportive team\r\n? Opportunity to work on high-growth brands\r\n? Filipino-led backend team who will support you\r\n? Interview can be conducted in Tagalog  we’re here to make you comfortable!\n\r\nIf you are interested to apply, please use this link, it will allow you to upload your CV and book an interview call with our team: thecultivator.co/applynow\r\n(Please select the option for \"Google Merchant\" when asked for your preferred role.)\n\r\nWe look forward to working with you!",
  "skill_requirements": [
    "Google Ads",
    "Shopify",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:30:00.366130",
      "reason": "Job first discovered"
    }
  ]
}