{
  "job_id": "1422582",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Strategic-Operations-Associate-1422582",
  "scraped_at": "2025-07-15T12:24:05.842657",
  "title": "Strategic Operations Associate",
  "type_of_work": "Full Time",
  "salary": "17500 PHP",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Strategic Operations Associate\r\nLocation: Remote | Full-Time | Salary + Large Bonus\n\r\nWe're looking for a Strategic Operations Associate to join our team and take ownership of data, automation, and operational efficiency across our commercial real estate and business brokerage companies.\n\r\nThis is a salary + large bonus position, with room for growth as you take on more responsibilities and help shape the future of our operations.\n\r\nWhat You’ll Do:\n\r\nOrganize, clean, and structure internal and external data used by our sales and operations teams.\n\r\nOversee and manage our full tech stack (CRM, project management tools, AI automation systems).\n\r\nSpearhead AI automation initiatives across all departments to boost efficiency and consistency.\n\r\nResearch new market data, support with deal underwriting (training available), and assist in building sales packages.\n\r\nMust-Have Skills — Please do not apply unless you meet all three:\n\r\nAdvanced Excel skills – ability to use pivot tables, nested formulas, VBA/macros, and handle large data sets with ease.\n\r\nAI automation + coding (advanced) – experience with tools like Zapier, n8n, Make, and/or coding in Python/JavaScript to build custom automations or AI solutions.\n\r\nSalesforce (intermediate) – comfort mapping/importing/exporting data, managing fields, and keeping records clean and structured.\n\r\nCompensation:\n\r\nCompetitive base salary\n\r\nSubstantial bonus potential tied to performance and project success",
  "skill_requirements": [
    "Salesforce",
    "Microsoft Excel",
    "Web Programming"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:23:30.544082",
      "reason": "Job first discovered"
    }
  ]
}