{
  "job_id": "1422310",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422310",
  "scraped_at": "2025-07-14T23:09:25.115255",
  "title": "Google & Meta Ads Specialist (Full-Time – Remote)",
  "type_of_work": "Full Time",
  "salary": "$800-$1200",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re Hiring: Google & Meta Ads Specialist (Full-Time – Remote)\r\nPreferred Work Hours: Monday to Friday, 9:00 PM – 6:00 AM Philippine Time (to match 8:00 AM – 5:00 PM U.S. Central Time).\r\nWe’re flexible with the schedule, but overlap during these hours is strongly preferred.\n\r\nDIB Automotive Group is looking for an experienced digital ads specialist to manage our Google and Meta (Facebook/Instagram) advertising campaigns. This is a full-time, long-term opportunity with a company that operates multiple auto service and car wash brands in Houston, Texas.\n\r\n?\n\r\nAbout Us:\r\nWe run several locations under names like Yes Auto Fix, Kingwood Tire & Auto, Master Certified Collision, Space Spa, and more. Our goal is simple: bring in real customers through efficient, well-managed ad campaigns.\nUpgrade to see actual info\n\r\n?\n\r\nWhat You’ll Be Doing:\r\n • Set up and manage Google Search, Display, and Local Service Ads\r\n • Run Meta Ads campaigns, including retargeting and lookalike audiences\r\n • Write strong ad copy and assist with basic creative direction (image or video)\r\n • Track and improve ad performance using key metrics like CTR, cost per lead, and ROI\r\n • Work with tracking tools like Meta Pixel and Google Analytics\r\n • Provide regular updates on campaign results\r\n • Stay current with changes in ad platforms and apply best practices\n\r\n?\n\r\nWhat We’re Looking For:\r\n • At least 4 years of experience running both Google and Meta Ads\r\n • Proven success generating leads for service-based or local businesses\r\n • Strong skills in audience targeting, A/B testing, and conversion tracking\r\n • Experience with Google Ads Manager, Meta Business Suite, and reporting dashboards\r\n • Good English communication skills\r\n • Worked with auto service shops or U.S. local businesses\n\r\n?\n\r\nWhat You Can Expect From Us:\r\n • Long-term, stable work with a growing U.S.-based company\r\n • Straightforward communication and clear goals\r\n • Supportive team that respects your time and skills\r\n • Opportunity to grow in your role and take ownership of ad strategy\n\r\nReply with  “AUTOFIX” in your subject line or your first message.",
  "skill_requirements": [
    "Google Analytics",
    "Google Ads",
    "Meta Business Suite"
  ]
}