{
  "job_id": "1422494",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Part-Time-Script-Writer-Facebook-Marketing-Assistant-1422494",
  "scraped_at": "2025-07-15T14:36:24.317518",
  "title": "Part-Time Script Writer & Facebook Marketing Assistant",
  "type_of_work": "Part Time",
  "salary": "200USD",
  "hours_per_week": "10",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Overview\r\nWe are hiring a part-time teaUpgrade to see actual infomber who excels at emotionally-driven marketing and persuasive script writing. The ideal candidate understands how to communicate with clarity and impact, tapping into the emotions and motivations of potential buyers. You will be responsible for creating compelling marketing scripts, managing Facebook ad campaigns, and reviewing performance data to guide future content strategy.\n\r\nCore Responsibilities\r\nScript Writing (Primary Focus – Approximately 60% of the Role):\r\nThis will be your most important task. You will be responsible for writing persuasive, emotionally Upgrade to see actual info scripts designed for Facebook video advertisements. Your work will involve creating short-form copy that speaks directly to customer pain points, while clearly articulating the value and benefits of our products. The goal is to write in a simple, relatable tone that helps guide customers from curiosity to conversion. You will also collaborate with the team to brainstorm new creative angles, messaging strategies, and ad variations. Every piece you write should align with our brand voice and be grounded in effective sales psychology.\n \nFacebook Ad Posting and Management (Approximately 25% of the Role):\r\nYou will be posting ads using Facebook Ads Manager or Facebook Marketplace. This includes crafting strong headlines, descriptions, and calls to action while selecting the appropriate media formats. Staying organized while handling multiple ad sets or creative versions is essential. While prior experience with Facebook’s ad tools is helpful, we’re happy to train someone with the right mindset and eagerness to learn.\n\r\nData Review and Optimization (Approximately 15% of the Role):\r\nYou will be responsible for tracking performance metrics such as click-through rates, conversion rates, and cost per result. Based on this data, you’ll help identify which ad scripts and angles are performing best. You’ll also assist in establishing feedback loops so we can iterate effectively, and you’ll keep clear, organized records of what is working to help guide future creative decisions.\n\r\nRequired Skills and Qualifications\r\nYou must have excellent English writing and grammar skills, with a strong grasp of persuasive communication. A solid understanding of marketing strategy, especially emotional selling and consumer psychology, is key. The ideal candidate is organized, detail-oriented, and comfortable tracking the performance of different creative variations. Familiarity with Facebook Ads Manager or Marketplace is important, though a willingness to learn is acceptable. Being self-managed and reliable in your communication is essential for success in this role.\n\r\nPreferred (Not Required)\r\nIt would be beneficial if you have experience writing for consumer products or eCommerce. Prior work with short-form ad scripts, creative hooks, or captions will be viewed favorably. Familiarity with simple spreadsheet tools or basic reporting dashboards is helpful, and knowledge of design platforms like Canva or basic video editing software is a plus.\n\r\nWeekly Commitment\r\nThis is a part-time role with an estimated commitment of 10 hours per week. You can set your own hours as long as deliverables are met on time. Weekly check-ins will be scheduled as needed via email or short video calls. We prioritize consistency, results, and communication over fixed schedules.",
  "skill_requirements": [
    "Performance Marketing",
    "Creative Writing",
    "Facebook marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:29:31.614174",
      "reason": "Job first discovered"
    }
  ]
}