{
  "job_id": "1422673",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Real-Estate-Cold-Caller-Only-Want-Experienced-1422673",
  "scraped_at": "2025-07-15T15:35:36.604159",
  "title": "Real Estate Cold Caller-Only Want Experienced",
  "type_of_work": "Full Time",
  "salary": "$480 plus $250 commission per closed deal",
  "hours_per_week": "30",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Experienced Real Estate Cold Caller (Remote, U.S. Hours)\r\nCompany: Blue Crab Home Buyers Job Type: \r\nPart-Time to Full-Time | Remote Compensation: $4/hour + minimum $250 commission per closed deal\n\r\nJob Description:\n\r\nBlue Crab Home Buyers is actively hiring an experienced and driven Real Estate Cold Caller to join our acquisitions team. This remote, full-time role requires availability during standard U.S. business hours. The ideal candidate must have at least 3 years of proven experience in real estate wholesaling and consistently generate 2–3 qualified leads daily, using Calltools and tracking work hours via Clockify.\n\r\nKey Responsibilities:\n\r\nConduct outbound cold calls to property owners using Calltools and provided scripts.\n\r\nIdentify and pre-qualify motivated seller leads.\n\r\nEvaluate property values and pull accurate comps.\n\r\nConsistently achieve or exceed daily and weekly performance metrics (calls and leads).\n\r\nTrack daily tasks and work hours accurately using Clockify.\n\r\nRequirements:\n\r\nMinimum 3 years of real estate wholesaling experience (mandatory).\n\r\nComprehensive knowledge of the wholesaling process: comping, skip tracing, and making offers.\n\r\nProven record of generating 2–3 qualified leads per day.\n\r\nFluent English with excellent verbal communication skills.\n\r\nHighly motivated, results-oriented, and self-driven.\n\r\nAbility to work independently in a quiet, remote environment with reliable internet.\n\r\nWhat We Provide:\n\r\nCompetitive base pay ($4/hour) with a minimum $250 commission per closed deal.\n\r\nAll essential tools and software, including Calltools and Clockify.\n\r\nAccess to scripts, CRM systems, and targeted lead lists.\n\r\nOpportunities for long-term growth and consistent deal flow.\n\r\nHow to Apply:\n\r\nPlease email the following items to Upgrade to see actual info\n\r\nUpdated resume\n\r\nA brief (1–2 minute) voice recording introducing yourself and detailing your cold calling/wholesaling experience\n\r\nSummary of your real estate lead generation achievements\n\r\nNote: This role is strictly for experienced candidates; no training will be provided. Only serious applicants with documented results will be considered.",
  "skill_requirements": [
    "Acquisition",
    "Cold Calling",
    "Outbound Calls"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:36:19.850944",
      "reason": "Job first discovered"
    }
  ]
}