{
  "job_id": "1422347",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422347",
  "scraped_at": "2025-07-14T23:06:28.844199",
  "title": "E-Commerce Specialist – Shopify & Marketplace Optimization (Contract)",
  "type_of_work": "Part Time",
  "salary": "500",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "???? Job Description:\r\nOverview:\r\nHUM?N is seeking a detail-oriented and tech-savvy E-Commerce Specialist to manage and optimize the backend of our multi-brand online store. This role is ideal for someone with strong Shopify experience, a passion for clean user experiences, and the ability to implement agile updates across platforms.\n\r\nYou’ll be responsible for day-to-day site improvements, product uploads, quality checks, landing page changes, and overall platform upkeep — ensuring the site performs efficiently across Shopify, Amazon, Walmart, and TikTok Shop.\n\r\n???? Responsibilities:\r\n???? Shopify Management\r\nUpload new products (copy, images, variants, SEO, and tags)\n\r\nPerform QA on all product and collection pages before launch\n\r\nBuild and update landing pages using existing page builders (e.g., PageFly, GemPages, etc.)\n\r\nApply homepage updates (banners, copy, sales)\n\r\nManage navigation, filters, search tags, and 404s\n\r\nAssist with mobile optimization and speed audits\n\r\n????? Marketplace Coordination\r\nAssist with feed syncing across Amazon, Walmart, and TikTok Shop\n\r\nEnsure accurate product info and inventory sync on all platforms\n\r\nUpdate marketplace listings when SKUs change\n\r\n?? Technical & UX Improvements\r\nImplement small customizations (sections, layout changes, image swaps)\n\r\nCoordinate with AI Specialist for site personalization features\n\r\nCollaborate with the Creative Director for merchandising decisions\n\r\n????? Site Issue Tracking & Trello Management\r\nLog bugs or issues in Trello with proper status and labels\n\r\nPrioritize updates based on urgency and impact\n\r\nWork with the Warehouse Ops team to resolve product data issues\n\r\n? Qualifications:\r\n2+ years managing Shopify stores (product uploads, themes, apps)\n\r\nBasic understanding of HTML/CSS (no dev work, but confident in structure)\n\r\nFamiliarity with marketplaces (Amazon, Walmart, TikTok Shop)\n\r\nExperience with Shopify apps (loyalty, upsell, reviews, landing page builders)\n\r\nOrganized, responsive, and comfortable using tools like Trello and Slack\n\r\nBonus: Past experience with Klaviyo, Rebuy, or personalization tools\n\r\n???? Location: Remote (Must be responsive during business hours EST)\r\n???? Start Date: ASAP",
  "skill_requirements": [
    "Amazon",
    "Shopify"
  ]
}