{
  "job_id": "1422594",
  "url": "https://www.onlinejobs.ph/jobseekers/job/WordPress-Designer-Social-Post-Designer-1422594",
  "scraped_at": "2025-07-15T15:43:03.241818",
  "title": "WordPress Designer / Social Post Designer",
  "type_of_work": "Full Time",
  "salary": "up to 60,000 PHP/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Company: \r\npracticeedge is an Australian-based digital marketing agency focused on helping businesses achieve outstanding results and growth. We offer a range of services, including web design, graphic design, SEO, Google Ads, and more, with a commitment to delivering the promise. Join our dynamic, creative team that encourages ambition and results. \n\r\nJob Description: \r\nWe are looking for a WordPress Designer/Social Post Designer who will be responsible for maintaining consistent brand identity across our client websites and social media posts. This is a remote role, and the ideal candidate should be self-motivated, organised, and have a strong sense of design integrity. \n\r\nResponsibilities: \n\r\nMaintain the design integrity of existing WordPress websites, ensuring consistency sitewide. \n\r\nAddition of pages and updating of content on websites for SEO campaigns, with a critical eye for consistency with other pages. \n\r\nDesign and creation of Google Ads landing pages for maximum conversions. \n\r\nDesign social media posts using Canva or other tools that align with brand guidelines. \n\r\nAudit client websites for design consistency from page to page. \n\r\nCollaborate with the team to ensure all projects meet deadlines and quality standards. \n\r\nCommunicate regularly with the team to address project needs and provide updates. \n\r\nRequirements: \n\r\nCompetent and confident in WordPress, with experience using page builders such as Elementor, Divi, Avada, WP Bakery and other design tools. \n\r\nStrong attention to detail in ensuring design consistency across all pages. \n\r\nProficiency in Canva or similar software for social media post design. \n\r\nExcellent communication skills; able to work well in a remote environment and collaborate with the team when needed. \n\r\nAbility to manage multiple projects simultaneously while maintaining design standards. \n\r\nSelf-motivated, organised, and proactive in managing your workload. \n\r\nTo apply, please submit: \n\r\nA cover letter and introductory video outlining why you believe you are a great fit for the role. Applications without a video will not be considered. \n\r\nYour updated resume.",
  "skill_requirements": [
    "Graphic Design",
    "Wordpress"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:26:43.647872",
      "reason": "Job first discovered"
    }
  ]
}