{
  "job_id": "1422653",
  "url": "https://www.onlinejobs.ph/jobseekers/job/TURO-VIRTUAL-ASSISTANTCO-HOST-1422653",
  "scraped_at": "2025-07-15T14:32:26.350416",
  "title": "TURO VIRTUAL ASSISTANT/CO-HOST",
  "type_of_work": "Full Time",
  "salary": "$750",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Responsible for communicating with guests for all booked trips in the Turo app and assisting the team with the state of the car and the overall trip of the guests.\n\r\nThe work activities of the Turo VA is divided into three main functional areas:\n\r\n1. Communicating With Guests\r\nMake sure their pick up and drop off location is known and secured\r\nVerify the guests’ drivers license\r\nInforming the guests of the pick up details of the vehicle\r\nReplying to the guests questions and responses\r\nInforming the guests of drop off details of the vehicle\r\nCalling the guests for any important matters \r\nReceiving calls from guests and assisting them with their needs about the car\n\r\n2. Team Activities\r\nInforming the team when the vehicle is returned\r\nInforming the team of any new or cancelled bookings\r\nChecking for damages after the car has been returned\r\nReminding the team of any things that needs attention\n\r\n3. Clerical Activities:\r\nUpdating the google sheets \r\nContacting Turo for any issues.\r\nCreating the schedule of bookings for the next day.\n\r\nThis is a position with a 12-hour shift from 8 AM to 9 PM, seven days a week. (Los Angeles PST Time zone) - you have to be present from 8 AM to 9 PM PST and respond to guest messages promptly and professionally within a 5-minute timeframe, ensuring a high level of customer satisfaction.\n\n\r\n==== Pre-Application Task – REQUIRED BEFORE APPLYING\n\r\nTo be considered for this position, please complete the task below:\n\r\nTask:\r\nPlease find and send 3 quotes for printing 500 business cards from local printing companies in or near Glendale, California.\n\r\nYour submission should include:\r\n1. Company name and website (if available)\r\n2. Price for 500 business cards\r\n3. Turnaround time\r\n4. Pick-up location or if they offer delivery\r\n5. Any notable notes or options (e.g. glossy/matte finish, same-day pickup, design help, etc.)\n\r\nPlease present the quotes in a clear, organized format. \r\nYou can paste them directly into your application or send a Google Doc link.\n\r\nThis task helps us assess:\r\n=Your ability to follow instructions\r\n=Attention to detail\r\n=Local research skills\r\n=Clear and professional communication\n\r\nApplicants who do not complete this task will not be considered! \r\nThank you",
  "skill_requirements": [
    "Short Term Rentals",
    "Car Insurance",
    "Claims Processing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:28:39.346129",
      "reason": "Job first discovered"
    }
  ]
}