{
  "job_id": "1422008",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422008",
  "scraped_at": "2025-07-14T23:09:31.379658",
  "title": "Junior Media Buyer: YT & Google Exp [E-commerce | Remote, PH Only]",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "44",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Schedule: Full-time | 2:00 PM – 10:00 PM PH Time | Sunday to Friday\r\nLocation: Philippines only (100% remote)\n\r\nAbout the Role\r\nWe are looking for a Junior Media Buyer with experience in Google Ads and YouTube Ads to join our fast-growing e-commerce brand. You will play a key role in launching and optimizing campaigns targeting the US market, collaborating closely with our creative team and reporting directly to the CEO (a senior media buyer). This is a long-term, full-time position with clear systems, growth paths, and performance bonuses. You will work with our Creative Team for needed Assets. You get to join us on our company vacation this year, all-expense paid!\n\r\nWhat You'll Do\r\n- Launch and manage Google and YouTube ad campaigns\r\n- Optimize campaigns based on real-time performance data\r\n- Collaborate with designers, video editors, and copywriters to request and test creative assets\r\n- Deliver clear end-of-day reports with campaign updates and next steps\r\n- Follow internal SOPs and naming conventions precisely\r\n- Report directly to the CEO and improve continuously based on structured feedback\n\r\nMust-Have Qualifications\r\n- At least 1 year of experience managing YouTube Ads or Google Ads for e-commerce\r\n- Hands-on experience targeting the US market\r\n- Strong understanding of campaign setup, budget allocation, and performance metrics\r\n- Experience working with at least $1,000/month ad spend\r\n- Familiar with ad account structure, optimization techniques, and basic tracking\r\n- Strong analytical and critical thinking skills\r\n- Ability to follow detailed instructions and improve with feedback\r\n- Good English (written and spoken)\r\n- Based in the Philippines and available during required working hours\n\r\nTools We Use\r\n- Google Ads, YouTube Ads Manager, Google Analytics, Tag Manager\r\n- Slack, ClickUp, Notion\r\n- Google Sheets for reporting (Bonus if you’ve used Looker Studio, Triple Whale, or attribution tools)\n\r\nWhat We Offer\r\n- Generous bonuses based on campaign performance\r\n- Supportive team culture with strong feedback systems\r\n- Work-from-home setup, long-term role\r\n- Clear promotion path to Mid and Senior Media Buyer\n\r\nHow to Apply : Use this link Upgrade to see actual info\n\n\r\nApply only if you meet the qualifications and are available full-time. \r\nWe’re looking for someone hungry to grow, ready to follow process, and able to deliver strong campaign results in a fast-paced environment.",
  "skill_requirements": [
    "Media Buying"
  ]
}