{
  "job_id": "1422477",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Virtual-Assistant-Client-Experience-AI-Operations-Support-1422477",
  "scraped_at": "2025-07-15T14:24:53.867967",
  "title": "Remote Virtual Assistant – Client Experience & AI Operations Support",
  "type_of_work": "Part Time",
  "salary": "$455/month",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Milk + Honey Travels:\r\nWe’re a boutique luxury travel design studio that curates intentional, personalized trips for travelers seeking transformative experiences. We don’t just plan logistics—we help our clients connect deeply with the places they visit. Our small, passionate team is known for creativity, care, and high standards. We're looking for a proactive teaUpgrade to see actual infomber who thrives behind the scenes and finds satisfaction in bringing order to moving parts.\n\r\nAbout This Role:\r\nWe’re hiring a detail-oriented Virtual Assistant to support our client experience workflows and internal systems—with a growing emphasis on AI-based innovation. This role is non-client-facing and supports the Client Experience Manager and Owner behind the scenes.\r\nIn the first phase, the focus will be on learning the business, assisting with immediate admin tasks, and contributing to AI and systems support. Over time, the role will expand into operational coordination and strategic support.\n\r\nResponsibilities:\r\nPhase 1: Client Experience & AI/Systems Support (Primary Focus in Onboarding)\r\nClient Experience Support:\r\nFormat and upload hotel, dining, and spa confirmations to client travel documents in Travefy\r\nBuild hotel voucher documents and welcome letters from templates\r\nDraft pre-trip emails using saved prompts and formats (to be reviewed/sent by team)\r\nTrack and prepare thank-you and referral gifts\r\nInput commissions and invoices in ClientBase and tracking spreadsheets\r\nAssist with final itinerary prep: directions, contacts, confirmations, formatting\n\r\nAI & Systems Coordination:\r\nTest AI tools (e.g., ChatGPT, Claude) within current workflows (email drafting, formatting, task management)\r\nDocument findings with simple SOPs, checklists, or Loom videos\r\nBuild and maintain a prompt and template library for internal use\r\nIdentify repetitive tasks and propose automation or streamlining opportunities\r\nSupport implementation and maintenance of task management tools (e.g., Asana)\r\nCreate and manage task templates for recurring workflows\r\nTrack deadlines, flag delays, and provide task visibility to the team\r\nProvide weekly summaries of AI tool tests or improvements\n\r\nInbox Management (Temporary):\r\nMonitor Director of Operation's inbox during maternity leave (3 months)\r\nFlag and label internal admin emails, invoices, and updates\r\nForward or summarize relevant items for other teaUpgrade to see actual infombers\r\nProvide weekly inbox summary (no external replies)\n\r\nPhase 2: Owner & Operations Support (Gradual Onboarding)\n\r\nOrganize and maintain newsletter and content templates with Client Experience Manager\r\nAssist in scheduling content via Meta Business Suite (final posts by team) \r\nFormat and prep monthly newsletters using Flodesk (final send by team)\r\nSupport task organization, tracking, and project visibility in Asana\r\nAnalyze engagement and performance of content\r\nMaintain an internal calendar or document tracking travel, project, and content dates (overall business view)\r\nShare Monday/Friday internal task briefs for Owner to support weekly visibility\n\r\nThis Role Is For You If…\r\nYou’re organized, resourceful, and love optimizing systems\r\nYou work well independently and value clarity and precision\r\nYou’re curious about AI tools and excited to experiment\r\nYou’re a strong communicator and thrive in a remote team setting\n\r\nRequirements:\r\nFluent written and spoken English\r\nExperience as a Virtual Assistant, Admin, or Ops Support\r\nFamiliarity with tools like Google Workspace, Meta Business Suite, Asana, and CRM systems\r\nFamiliarity with AI tools (e.g., ChatGPT, Claude) and a strong desire to explore how these tools can be used extensively in business workflows\r\nWillingness to learn Travefy, ClientBase\n\r\nPotential for Growth:\r\nThis role can grow into a long-term part-time position focused on internal operations and AI integration—becoming a key system streamliner and innovation partner for the team.\n\r\nEstimated Weekly Breakdown:\n\r\nClient Experience Support (5–7 hrs/week)\r\nFormatting confirmations, vouchers, and emails\r\nData entry in ClientBase, Excel\r\nGifting logistics\r\nItinerary formatting (non-decision making)\r\nFlodesk newsletter prep\n\r\nAI & Systems Coordination (3–5 hrs/week)\r\nTesting prompts/tools\r\nBuilding prompt library\r\nSOP documentation\r\nAsana template setup and maintenance\r\nWeekly internal briefs\n\r\nInbox Management (Temporary) (1–2 hrs/week)\r\nMonitoring and flagging messages\r\nWeekly inbox summary\n\r\nContract Length: 3 months to start (with potential to extend)\r\nReports To: Client Experience Manager (day-to-day), Owner (AI projects)",
  "skill_requirements": [
    "Project Management",
    "ChatGPT",
    "Documentation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:28:56.749862",
      "reason": "Job first discovered"
    }
  ]
}