{
  "job_id": "1422499",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketplace-Operations-Manager-E-commerce-1422499",
  "scraped_at": "2025-07-15T15:28:40.493053",
  "title": "Marketplace Operations Manager (E-commerce)",
  "type_of_work": "Part Time",
  "salary": "N/A",
  "hours_per_week": "16",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Join a fast-growing Dutch e-commerce company and take the lead in marketplace operations and process automation!\n\r\nWe’re Onebird, an ambitious e-commerce brand with strong sales on marketplaces like Upgrade to see actual info and more to come. We’re expanding our team in the Philippines and looking for an experienced Marketplace Operations Manager to manage and optimize our daily operations—and eventually grow into a leadership role.\n\r\nWhat You’ll Do\r\n- Take over operational tasks from the founder and become the go-to person for marketplace operations\r\n- Manage and optimize logistics, fulfillment, and supply chain processes\r\n- Analyze data, perform financial checks, and ensure accurate reporting\r\n- Spot opportunities for process automation and implement improvements\r\n- Oversee data entry and product listing quality\r\n- Communicate with external partners (logistics, platforms, suppliers)\r\n-Lead and coordinate future teaUpgrade to see actual infombers as we grow\n\r\nWho We’re Looking For\r\n- At least a few years of experience in e-commerce operations or marketplace management\r\n- Solid understanding of supply chain and fulfillment processes\r\n- Strong skills in Excel / Google Sheets and working with data\r\n- Proactive, independent, and detail-oriented\r\n- Excellent English communication skills (written & spoken)\r\n- Able to analyze processes, spot inefficiencies, and create solutions\r\n- Comfortable taking ownership and leading projects\r\n- Background in process automation or SOP building\r\n- Team management experience\n\r\nBonus if you have:\r\n- Experience with European marketplaces (e.g. Upgrade to see actual info, Amazon NL)\n\r\nWhat We Offer\r\n- 100% Remote Work\r\n- Flexible hours - Starting with 16 hours and move fast to 40 hours full time.\r\n- Opportunity to grow into a strategic leadership role (e.g. full time COO)\r\n- Direct collaboration with the founder and a small, agile team\r\n- Dynamic e-commerce environment with room for your ideas\r\n- Competitive compensation\n\r\nReady to take charge and become the backbone of our e-commerce operations?\n\r\nApply now and tell us:\n\r\n- Your experience managing marketplaces and operations\r\n- Your biggest achievement in e-commerce so far\r\n- Why you’re the Marketplace Operations Manager we’re looking for\n\r\nWe can’t wait to meet you!",
  "skill_requirements": [
    "Leadership",
    "Operation Management",
    "Supply Chain Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:21:59.815093",
      "reason": "Job first discovered"
    }
  ]
}