{
  "job_id": "1422032",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Direct-Response-Video-Editor-Creative-Strategist-E-Com-Supplements-1422032",
  "scraped_at": "2025-07-15T09:29:11.161459",
  "title": "Direct Response Video Editor / Creative Strategist (E-Com & Supplements)",
  "type_of_work": "Part Time",
  "salary": "$500-$1000/Month",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for a highly skilled Video Editor & Creative Strategist with a direct response mindset to help us craft high-converting ad creatives for our fast-growing e-commerce brand in the supplement / wellness niche.\n\r\nIf you’re someone who lives and breathes performance marketing, understands how to stop the scroll, maximize hold rate, and drive conversions, this role is for you.\n\r\nThis is not a job for cinematic editors or motion graphic-heavy creatives - we’re looking for someone who understands minimalistic, clean, psychology-backed creative that performs on platforms like Meta, TikTok, YouTube Shorts, and beyond.\n\r\nWhat You’ll Be Doing:\r\n- Taking raw footage (UGC, voiceovers, testimonials, etc.) and editing into direct response video ads\n\r\n- Creating short-form videos, product demos, educational reels, and VSLs\n\r\n- Writing or advising on script angles, hook frameworks, and cut structures to optimize watch-through and CTR\n\r\n- Collaborating with our team to analyze ad performance and make creative iterations based on data and psychology\n\r\n- Crafting content that aligns with our brand tone: clean, feminine, modern, and conversion-focused\n\r\nMust-Have Experience:\r\n- Proven track record of editing high-performing e-com ads (please show examples!)\n\r\n- Experience with supplement, skincare, wellness, or health brands is a major plus\n\r\n- Deep understanding of direct response principles, scroll-stopping hooks, offer presentation, and marketing psychology\n\r\n- Familiarity with short-form and VSL ad formats\n\r\n- Mastery of editing tools like Adobe Premiere Pro, Final Cut Pro, or CapCut\n\r\n- Ability to work fast, hit deadlines, and handle feedback professionally\n\r\nBonus If You:\r\n- Have copywriting or creative strategy experience\n\r\n- Are familiar with voiceover AI tools, stock UGC assembly, or AI UGC workflow\n\r\n- Understand the importance of the first 3 seconds and can optimize for platform-specific nuances",
  "skill_requirements": [
    "Social Media Content Creation",
    "Graphic Design",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": []
}