{
  "job_id": "1422898",
  "url": "https://www.onlinejobs.ph/jobseekers/job/SMS-Virtual-Assistant-Real-Estate-Land-Wholesaling-Closify-Offers-Inc-1422898",
  "scraped_at": "2025-07-15T14:31:24.457753",
  "title": "SMS Virtual Assistant – Real Estate (Land Wholesaling) | Closify Offers Inc.",
  "type_of_work": "Full Time",
  "salary": "$900",
  "hours_per_week": "36",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you quick, professional, and confident with written communication? Do you have excellent English and want to work with a U.S. real estate investment company that's growing fast?\n\r\nClosify Offers Inc. is hiring a reliable SMS Virtual Assistant to join our land acquisition team. You'll be handling text conversations with property owners, screening potential leads, and setting appointments — all using our proven systems and templates.\n\r\nThis is a long-term opportunity with weekly pay, performance bonuses, and growth potential.\n\r\n???? What You'll Be Doing:\r\nManage inbound and outbound SMS campaigns to landowners in the U.S.\n\r\nUse scripts and templates to qualify seller leads\n\r\nRespond quickly, professionally, and naturally in written English\n\r\nTag and organize leads based on their responses\n\r\nSet follow-up tasks and notify teaUpgrade to see actual infombers of hot leads\n\r\nCommunicate daily with the team via chat/Zoom\n\r\n???? Compensation:\r\n$4.00/hour\n\r\n36 hours+ a week\n\r\n$5 bonus per qualified lead\n\r\n0.5% commission on deals that close from your leads\n\r\nPaid weekly (via Wise or PayPal)\n\r\n? What We’re Looking For:\r\nExcellent written English (grammar, tone, spelling)\n\r\nExperience in SMS campaigns, chat support, or real estate preferred\n\r\nAbility to follow instructions, scripts, and tag/track leads properly\n\r\nFast learner, detail-oriented, and responsive\n\r\nStable internet connection and full-time availability during U.S. daytime hours (EST preferred)\n\r\nReal estate or wholesaling knowledge is a plus, but not required\n\r\n???? How to Apply (Read Carefully):\r\nOnly applicants who follow ALL instructions will be considered.\n\r\nStart your message with the keyword: “Text Titan”\n\r\nInclude a voice or video recording using Vocaroo, Loom, or any link\n\r\nIntroduce yourself\n\r\nShare why you're a good fit for the role\n\r\n?? No resume or long message needed — just the keyword + recording.\n\r\nIf we like what we hear, you’ll receive our official application form and next steps.\n\r\nWe’re looking for A-players who want to grow. If you're consistent, coachable, and ready to lock in a full-time, long-term role — apply now!",
  "skill_requirements": [
    "ISA Real Estate",
    "English Speaking",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:31:34.099703",
      "reason": "Job first discovered"
    }
  ]
}