{
  "job_id": "1422751",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Digital-Marketing-Specialist-1422751",
  "scraped_at": "2025-07-15T12:22:12.930724",
  "title": "Digital Marketing Specialist",
  "type_of_work": "Any",
  "salary": "$150-$300/mo",
  "hours_per_week": "7",
  "date_updated": "Jul 15, 2025",
  "job_overview": "???? Overview\r\nWe are a fast-growing company seeking a creative, resourceful, and tech-savvy Digital Marketing Assistant to join our team. This role is ideal for someone who thrives in a fast-paced environment, is experienced in using AI tools for marketing productivity, and is passionate about driving brand visibility and engagement across various platforms.\n\r\n???? What We’re Looking For\r\nProven digital marketing experience (2+ years preferred)\n\r\nProficiency with AI tools such as ChatGPT, Jasper, Copy.ai, Midjourney, or others for content creation and automation\n\r\nStrong graphic design ability using Canva\n\r\nExcellent written and spoken English communication skills\n\r\nOrganized, proactive, and able to work independently\n\r\nFamiliarity with social media engagement best practices and email marketing tools (like Mailchimp, Klaviyo, or similar)\n\r\n???? Key Responsibilities\r\n???? Email Marketing (Kanva or Similar Tools)\r\nPlan, source, and create email marketing campaigns aligned with our brand goals\n\r\nWrite engaging and conversion-optimized email copy\n\r\nManage contact lists and segment audiences for better targeting\n\r\n???? Social Media Management\r\nDesign and implement a monthly content calendar\n\r\nCreate and schedule posts on Facebook, Instagram, and LinkedIn\n\r\nEngage with followers, respond to comments/messages\n\r\nConduct outreach and engagement activities to increase visibility and followers\n\r\n???? Canva Design & Marketing Collateral\r\nUse Canva to create visually appealing marketing materials, including flyers, banners, social graphics, and digital ads\n\r\nMaintain brand consistency across all visuals\n\r\n????? Administrative and Remarketing Tasks\r\nResearch and collect customer contact information from existing databases and external sources\n\r\nSupport remarketing efforts with organized contact tracking\n\r\nAssist with analytics and reporting to improve campaign performance\n\r\n?? Tools You Should Know (or Be Willing to Learn Quickly)\r\nCanva\n\r\nChatGPT, Copy.ai, or other AI writing tools\n\r\nMailchimp, Klaviyo, or similar email platforms\n\r\nMeta Business Suite, LinkedIn, Instagram\n\r\nGoogle Sheets / Excel\n\r\nTrello or similar project management tools\n\r\n???? Why Join Us?\r\nWork with a supportive and innovative team\n\r\nOpportunities to grow in AI-driven marketing strategies\n\r\nLong-term position with performance-based raises and bonuses\n\r\nFlexibility and independence – your ideas are valued!\n\r\n???? How to Apply\r\nPlease send:\n\r\nYour updated resume\n\r\nA short cover letter explaining why you're a great fit\n\r\nSamples of your work (email campaigns, social media posts, Canva graphics, or AI-generated content)\n\r\nYour OnlineJobs.ph profile link\n\r\nWe’re excited to work with someone creative, self-directed, and ready to grow with our company. If you love marketing and are skilled at using technology to streamline your workflow, we want to hear from you!",
  "skill_requirements": [
    "Google Ads",
    "Advertising Management",
    "Digital Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:22:16.135127",
      "reason": "Job first discovered"
    }
  ]
}