{
  "job_id": "1422348",
  "url": "https://www.onlinejobs.ph/jobseekers/job/QA-Specialist-with-ABA-Healthcare-Experience-1422348",
  "scraped_at": "2025-07-14T23:08:28.490095",
  "title": "QA Specialist with ABA Healthcare Experience",
  "type_of_work": "Any",
  "salary": "DOE",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About BlinkHire\n\r\nBlinkHire is a recruitment startup on a mission to connect exceptional talent with leading global organizations. We leverage data-driven workflows and smart automation to deliver faster, higher-quality hiring solutions.\n\r\nRole Overview\n\r\nWe’re looking for a proactive Quality Assurance to help maintain the accuracy, compliance, and quality of our clients’ ABA clinical documentation. You’ll work under the QA Manager to monitor session notes, run AI-powered audits, and support clinical program reviews across platforms like Rethink Behavioral Health, Central Reach, Brellium, and Noteguard AI.\n\r\nKey Responsibilities\n\r\nDocumentation Monitoring\r\nReview and track session-note submissions in Rethink BH & Central Reach\r\nFlag and follow up on late, missing, or incomplete notes\r\nEnsure corrections meet QA guidelines\n\r\nAI Audit Support:\n\r\nRun audits in Brellium & Noteguard AI\r\nHighlight recurring or critical issues (grammar, SOAP format, clinical content)\r\nSummarize findings for the QA Manager\n\r\nClinical QA Assistance:\n\r\nAssist with spot-checks of skill-acquisition and behavior-reduction programs\r\nTrack supervision compliance and learning-tree updates\r\nSupport new QA initiatives and maintain QA dashboards\r\nCollaboration & Reporting:\r\nCoordinate follow-ups, reminders, and coaching sessions\r\nHelp compile weekly/monthly QA reports and metrics\n\r\nNice to have: \n\r\n1+ year in ABA, behavioral-health, or medical documentation\r\nHands-on with Rethink BH, Central Reach, Brellium, or Noteguard AI \r\nExcellent attention to detail and written/verbal English\n\r\nCore Skills\r\nClinical Documentation Review – Proven ability to audit and validate ABA session notes.\r\nAI-Powered QA Tools – Experience running and interpreting Brellium or Noteguard AI audits.\r\nCross-Functional Collaboration – Effective communicator with BCBAs, RBTs, and QA teams.\n\r\nHow to Apply:\n\r\nSubmit your resume, a brief cover note highlighting your ABA QA experience, and any sample checklists or audit summaries you’ve created. \r\nWe look forward to reviewing your application.",
  "skill_requirements": [
    "Software QA Testing",
    "Functional Testing",
    "Bug Tracking"
  ]
}