{
  "job_id": "1422105",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Graphic-Design-Assistant-1422105",
  "scraped_at": "2025-07-15T12:09:45.406133",
  "title": "Graphic Design Assistant",
  "type_of_work": "Part Time",
  "salary": "$4-$6 USD per hour",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us\r\nWe are Majority, a fast-growing British audio brand specialising in innovative, affordable soundbars, radios, CD players, and HiFi systems. With a passion for great sound and sustainable design, our products are enjoyed by customers around the world. As we continue to expand our global presence, we’re looking for a skilled and reliable Virtual Assistant Graphic Designer to support our creative and e-commerce teams.\n\r\nAbout the Role\r\nThis is an exciting opportunity for a versatile designer who can confidently handle a range of creative tasks — from product packaging and manuals to digital content for Amazon and beyond.\n\r\nKey Responsibilities\n\r\nDesign product giftboxes and packaging artwork using Adobe Illustrator\n\r\nEdit and update listing images for online platforms\n\r\nCreate promotional materials such as flyers, leaflets, and banners\n\r\nPrepare visually engaging PowerPoint presentations\n\r\nEdit and update product manuals, ensuring clarity, consistency, and brand alignment\n\r\nSupport Amazon content management, including:\n\r\nUploading bulk images and A+ Content via Seller Central\n\r\nRunning A/B tests on product listings\n\r\nEnsuring visuals meet Amazon’s specifications and brand standards\n\r\nEnsure all creative output adheres to brand guidelines and quality standards\n\r\nProvide general design and admin support to the wider team\n\r\nRequirements\n\r\nProven experience in graphic design (portfolio required)\n\r\nProficiency in Adobe Illustrator, Photoshop, Canva, and PowerPoint\n\r\nWorking knowledge of Adobe Premiere Pro for basic video edits (e.g. product promos or social clips)\n\r\nStrong attention to detail, especially when working with text-heavy documents like manuals\n\r\nFamiliarity with Amazon Seller Central, including A+ Content creation, bulk uploads, and listing optimisation\n\r\nExcellent eye for layout, colour, and typography\n\r\nAbility to work independently and manage multiple remote tasks\n\r\nStrong communication and organisational skills\n\r\nDesirable\n\r\nExperience editing or designing user manuals or technical documents\n\r\nFamiliarity with consumer electronics or the audio industry\n\r\nKnowledge of print production processes\n\r\nTo Apply\r\nPlease send your CV, portfolio (with examples of relevant work), and a short introduction outlining your experience and availability.",
  "skill_requirements": [
    "Illustrator",
    "Graphic Design",
    "Organization"
  ],
  "is_active": true,
  "status_history": []
}