{
  "job_id": "1422675",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Content-Assistant-for-Masculine-Instagram-Brand-Video-Editing-Canva-Insta360-1422675",
  "scraped_at": "2025-07-15T12:33:03.001188",
  "title": "Content Assistant for Masculine Instagram Brand (Video Editing + Canva + Insta360)",
  "type_of_work": "Part Time",
  "salary": "20k-30k php/month depending on experience",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re building a powerful, anonymous Instagram brand focused on masculinity, fitness, discipline, and real transformation.\r\nThe brand features real-life footage, curated visuals, original quotes, and voiceovers — all designed to inspire high-performing men.\n\r\nI’m looking for a reliable, detail-oriented content assistant to:\r\n • Take raw footage (Insta360 + iPhone) and turn it into polished content\r\n • Add subtitles, transitions, and overlays using tools like CapCut and Canva\r\n • Apply my visual brand consistently (e.g., logo overlay, first-frame optimization)\r\n • Organize media and prepare a daily posting cadence (1 9-grid post + 3–5 story or reel posts/day)\r\n • Optionally assist with basic carousel formatting and caption layout (text provided)\n\r\nImportant Requirements:\r\n • Must understand Instagram formats (Reels, Carousels, Highlights, etc.)\r\n • Must know how to create scroll-stopping first frames\r\n • Familiar with Insta360 footage workflows and editing\r\n • Able to blur or anonymize faces when needed to preserve privacy (critical)\r\n • Bonus if you can help maintain consistency across platforms (e.g., X/Twitter)\n\r\nTools You’ll Use:\r\n • Canva\r\n • CapCut or Adobe Premiere\r\n • Instagram (posting + prep for approval)\r\n • Google Drive / Dropbox (media exchange)\r\n • Optional: InShot, VN, Descript (your choice, if efficient)\n\r\nYou Might Be a Great Fit If…\r\n • You care about fitness, mindset, personal growth, or masculine self-discipline\r\n • You’ve edited for faceless brands, influencers, or YouTubers before\r\n • You’re fast, organized, and prefer clear communication with minimal drama\r\n • You want long-term, meaningful remote work with a consistent rhythm\n\r\nWork Details:\r\n • Part-Time: ~15-20 hours/week (could grow over time)\r\n • Flexible hours, but 2–3 hours overlap with Singapore time is preferred\r\n • Pay: 20,000–30,000 PHP/month depending on experience\r\n • Start Date: Immediately\n\r\nHow to Apply:\n\r\nSend:\r\n 1. Your 2 best Instagram-style edits\r\n 2. Please send a short video (1–2 minutes) explaining why you’re the best person to help build the Wingman brand — and how your skills and mindset align with what we’ve shared.\r\n 3. Tell me your favorite editing tool and why.",
  "skill_requirements": [
    "Social Media Management",
    "Social Media Video Editing",
    "Canva"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:29:05.782566",
      "reason": "Job first discovered"
    }
  ]
}