{
  "job_id": "1422373",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Reverse-Recruiter-Needed-Apply-to-100-Toronto-Hybrid-Part-Time-Jobs-Peer-Support-Case-Manager-1002-Weeks-1422373",
  "scraped_at": "2025-07-15T15:29:45.754004",
  "title": "Reverse Recruiter Needed: Apply to 100 Toronto Hybrid Part-Time Jobs (Peer Support, Case Manager, $100/2 Weeks)",
  "type_of_work": "Gig",
  "salary": "100",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "I am seeking a proactive and tech-savvy reverse recruiter to help me secure interviews for part-time, hybrid roles in Toronto, ON. Your main task will be to apply to 100 relevant jobs on my behalf within two weeks, focusing on roles such as:\n\r\n    Peer Support Worker - Upgrade to see actual info\r\n    Case Manager - Upgrade to see actual info\r\n    Client Care Coordinator -Upgrade to see actual info\r\n    Similar part-time, casual, and hybrid positions,\n\r\nWhy I Need Your Support:\r\nDue to health reasons, my available hours for job searching and applying are very limited (between 3am EST and 2pm EST the next day). I am fully capable of handling the application process myself, but my current schedule and health constraints make it difficult to submit as many applications as I would like. I am looking for a reliable partner to help me maximize my job search efforts and ensure I don’t miss out on great opportunities.\n\r\nWhat You’ll Do:\r\n    Use your access to LinkedIn Recruiter and other job search tools to find and apply to suitable jobs.\r\n    Leverage bulk application bots or websites to maximize efficiency.\r\n    Connect with Toronto-based staffing agencies and recruiters to expand opportunities.\r\n    Tailor each application using my provided CV and LinkedIn profile.\r\n    Track all applications in a shared spreadsheet (company, job title, date, status).\n\r\nRequirements:\r\n    Proven experience as a reverse recruiter or job search assistant.\r\n    Background in HR, recruitment, or talent acquisition preferred.\r\n    Access to LinkedIn Recruiter and other relevant tools.\r\n    Technical skills to automate or bulk-apply to jobs.\r\n    Knowledge of Toronto’s job market and staffing agencies.\r\n    Strong communication and organizational skills.\n\r\nCompensation:\r\n$100 USD for 100 applications submitted within two weeks.\n\r\nTo Apply:\r\nPlease share your relevant experience, your approach to this project, and any success stories. If you have connections with Toronto staffing agencies or experience with bulk job applications, highlight this in your proposal.",
  "skill_requirements": [
    "Recruiting",
    "Candidate Sourcing",
    "Robotic Process Automation"
  ],
  "is_active": true,
  "status_history": []
}