{
  "job_id": "1422463",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Apprentice-Recruiter-to-the-CEO-12001800-Base-Bonuses-Remote-Full-Time-US-Hours-1422463",
  "scraped_at": "2025-07-15T14:25:46.906489",
  "title": "Apprentice Recruiter to the CEO | $1,200–$1,800 Base + Bonuses | Remote (Full-Time | U.S. Hours)",
  "type_of_work": "Full Time",
  "salary": "$1,200–$1,800 USD",
  "hours_per_week": "50",
  "date_updated": "Jul 14, 2025",
  "job_overview": "The Most Accelerated Recruiting Career in the Philippines\r\nThis isn’t a VA role or administrative support gig. This is a chance to work directly with the CEO of one of the top executive search firms in U.S. construction — and grow into a recruiter who drives real revenue, builds trusted relationships, and earns serious upside. You’ll start by mastering candidate sourcing, writing, and scheduling, and then evolve into a placement-ready recruiter with bonus potential on every hire.\r\nIf you’re the kind of person who thrives in fast-paced, performance-first environments and has the grit to become a top recruiter, this is your shot.\r\n________________________________________\r\nAbout The Birmingham Group - In business since 1967 with a national reputation in construction executive search - Led by Brian Binke, former #1 billing owner at MRINetwork (800+ offices globally) - We place high-level construction pros (PMs, Superintendents, Executives) at top-ranked firms - Our mission: build dream teams and give our recruiters the tools to become six-figure producers\r\n________________________________________\r\nWhat You’ll Do: - Source, qualify, and engage U.S.-based construction professionals - Make outbound calls and messages (scripts and systems provided) - Write clear candidate profiles and manage CRM (PCRecruiter) - Schedule interviews, set appointments, and coordinate communication - Support our sequencing campaigns, prep docs, and resume creation - Participate in daily pipeline rhythm and track metrics\r\n________________________________________\r\nCompensation: - Base Salary: $1,200–$1,800/month USD (depending on experience) - Bonuses: $20–$25 for every first interview (SO1) + $250–$500 per placement - Full training, scripts, tools (Jasper, Fireflies, Calendly, Rezi, RingCentral) - Potential to scale into a six-figure U.S. recruiter or become a team leader - Long-term: Partnership and leadership track for top producers\r\n________________________________________\r\nWho You Are: - Fluent in spoken/written English with strong outbound phone presence - Experience in recruiting, phone sales, appointment setting, or executive search preferred - Hungry, organized, and willing to work 50–60 hours/week - Not afraid of outbound calls or pressure - Goal-oriented and eager to learn from top recruiters\r\n________________________________________\r\nApply If You’re Ready To: - Outwork and outperform the average - Join a firm with real legacy and future upside - Build a career, not just take a job - Earn what you’re worth by learning how to deliver real value to clients\r\n________________________________________\r\nHow to Apply: - Send your resume (PDF or Google Doc) - Include a short note on why you want to be mentored by a U.S. recruiting leader - Bonus: Add a Loom or Vocaroo voice note (your presence matters)\r\nThis is your shot to go from apprentice to six-figure producer. We’ll give you the tools — but only you can bring the hustle.",
  "skill_requirements": [
    "Outbound Sales",
    "US recruiting",
    "Talent Acquisition"
  ],
  "is_active": true,
  "status_history": []
}