{
  "job_id": "1422313",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Podcast-Editor-with-Copywriting-Background-Remote-Part-Time-1422313",
  "scraped_at": "2025-07-15T12:22:16.294685",
  "title": "Podcast Editor (with Copywriting Background) - Remote | Part-Time",
  "type_of_work": "Any",
  "salary": "500",
  "hours_per_week": "28",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Our client is a mission-driven entrepreneur producing high-quality thought leadership content in the wellness, business, and leadership space. They're looking for a Podcast Editor (with Copywriting Background) to join their creative team and help bring meaningful stories and expert conversations to life across platforms.\n\r\nThis part-time, remote role is perfect for someone with strong writing instincts, podcast/audio editing experience, and a keen eye for content that resonates, especially across LinkedIn, Instagram, and newsletters. If you're someone who knows how to work with raw audio, pull out key insights, and repurpose them into powerful content, we want to hear from you.\n\r\nPerks & Benefits:\r\n- Paid in USD (bi-monthly payouts: 15th & 30th)\r\n- Part-time hours (4 hours/day, adhering to EST) with potential to grow\r\n- Observance of Philippine Regular Holidays (paid)?\r\n- 100% remote work from anywhere\r\n- Work closely with a founder on content that inspires and educates\r\n- Be part of a growing team focused on high-impact storytelling\n\r\nWhat You'll Do:\r\n1. Copywriting & Content Creation (A bonus if you could do this!)\r\n- Draft LinkedIn posts, email newsletters, show notes, and blog-style recaps\r\n- Write in the client's voice using content from videos, interviews, and podcasts\r\n- Repurpose content into micro-form posts and social-ready captions\r\n- Edit transcripts and longform content for clarity, tone, and flow\r\n- Support light research, scripting, or content outline planning\n\r\n2. Podcast Editing & Multimedia Support\r\n- Edit longform podcast episodes (audio + video) for clarity and pacing\r\n- Add intros, outros, transitions, and branded elements\r\n- Create 15-60 second social media clips (Reels/Shorts) using interview content\r\n- Design YouTube thumbnails and coordinate basic publishing steps\r\n- Upload episodes to podcast platforms and manage release timelines\n\r\nWho You Are:\r\n- 2+ years of experience in copywriting, podcast/audio editing, or content repurposing\r\n- Strong English writing skills, you can simplify complex ideas and write in someone else's voice\r\n- Confident editing with tools like Descript, Audacity, CapCut, GarageBand, or similar\r\n- Experience with LinkedIn writing, podcast publishing, and repurposing video clips for social\r\n- Detail-oriented, deadline-driven, and able to work with minimal supervision\r\n- Familiarity with tools like Google Drive, Notion, and basic design platforms (e.g., Canva)\r\n- Bonus: Experience in thought leadership, wellness, coaching, or startup brands\n\r\nHow to Apply:\r\n- Send your resume\r\n- 1-2 minute Loom video introducing yourself and sharing your experience with copywriting or podcast production\r\n- Portfolio links to audio projects, newsletters, or written content you've edited or created\n\r\nThis role is for someone who's both creative and consistent, someone who can help shape content in a way that's clear, meaningful, and aligned with the founder's voice and values.",
  "skill_requirements": [
    "Copywriting",
    "Video Editing"
  ],
  "is_active": true,
  "status_history": []
}