{
  "job_id": "1422955",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Short-Form-Video-Editor-1422955",
  "scraped_at": "2025-07-15T15:44:50.115968",
  "title": "Short Form Video Editor",
  "type_of_work": "Gig",
  "salary": "13000",
  "hours_per_week": "10",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a creative video editor who understands how to get views on TikTok, Reels, and YouTube Shorts?\n\r\nAt PocketCreative, we’re a premier short form agency in Singapore that have generated over 2 Billion views for our partners and now we’re looking for more motivated and driven editors to join our team. This means consistent projects being handled to you month after month — without spending hours trying to find clients or pitch their services. This role is ideal for editors who love creating fast-paced, engaging short-form videos and know how to get attention online.\n\r\nIf you're interested, fill up this form and we will reach out to you!\nUpgrade to see actual info\n\r\nWhat You’ll Be Doing\r\nEditing short-form content (15–90 seconds) for TikTok, Instagram Reels, and YouTube Shorts\r\nApplying viral editing principles (training provided)\r\nFollowing structured briefs to reduce unnecessary revisions\r\nImproving over time!\n\r\nWhat We Provide\r\nAccess to creative campaigns from creators and businesses\r\nClear, structured briefs with timelines and deliverables\r\nA no-cost training library focused on viral video editing and distribution\r\nA supportive editor community — not a gig marketplace\r\nOpportunities to build a strong portfolio\n\r\nRequirements\r\nFluent in English: Must be able to communicate effectively in English, both written and spoken.\r\nKnowledge of AI Tools: Basic familiarity with AI-based tools or plugins that can improve workflow efficiency (e.g., for transcription, subtitling, noise removal, etc.).\r\nEditing Tools: Proficient in CapCut, Premiere Pro, Final Cut, or other editing tools\r\nFamiliar with talking head videos: trends, pacing, and hooks that work on TikTok, Reels, and Shorts\r\nFamiliarity with Modern Styles & Animations: Should be aware of current trends in talking head video edits, including dynamic text, punch-ins, motion graphics, and engaging transitions.\r\nReliable, self-motivated, and can work within deadlines\r\nBonus: You’ve edited for creators or brands before\n\r\nCompensation\r\nThis is a freelance, consistent monthly project role.  Compensation is based on project scope and deliverables, with rates that reward content performance. Payment terms are transparent and direct — no platform cuts or listing fees.\n\r\nHow to Apply\r\nIf you're interested, fill up this form and we will reach out to you!\nUpgrade to see actual info",
  "skill_requirements": [
    "Video Editing",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:35:37.226118",
      "reason": "Job first discovered"
    }
  ]
}