{
  "job_id": "1422222",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Creative-Graphic-Designer-with-Social-Media-Skills-1422222",
  "scraped_at": "2025-07-14T23:06:57.764828",
  "title": "Creative Graphic Designer (with Social Media Skills)",
  "type_of_work": "Any",
  "salary": "$6-$7/hr",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us:\r\nHey there! We’re Avarah’s Ink, and we create custom wall art that celebrates the things you love most—your pets, your people, your life. Think gorgeous portraits of pets and humans that make every wall a little happier.\n\r\nWe’re growing, and we’re on the hunt for a creative graphic designer who also has a flair for social media. If you love design and don’t mind chatting it up with customers online or posting cool stuff to IG, Facebook, Pinterest, YouTube, and TikTok—we’d love to meet you.\n\r\nRole Overview:\r\nWe’re looking for someone who can:\r\n? Design images for Facebook, Instagram, Pinterest, TikTok, and YouTube thumbnails\r\n? Create eye-catching ad creatives\r\n? Manage our social media channels\r\n? Interact with customers who reach out through social media\n\r\n What We’re Looking For:\r\n???? Creative mind with strong graphic design skills\r\n???? Experience with common design tools (Photoshop, Canva, Illustrator,  etc.)\r\n???? Social media management experience is a PLUS, but not required\r\n???? Proactive, adaptable, ready to try new ideas\n\r\nWhy Join Us?\r\n? We’re passionate about what we do\r\n???? We’re kind and supportive\r\n???? We cultivate a strong, collaborative team environment\r\n???? We have other companies too—so if you’re amazing and want extra hours, we’re happy to refer you for even more work\n\r\nHow to Apply:\r\nShoot us an email at Upgrade to see actual info with:\r\n? Your Updated Resume\r\n? Your Portfolio (website, Google Drive folder, anything that shows your work!)\n\r\nWe can’t wait to hear from you! ????????????",
  "skill_requirements": [
    "Graphic Design"
  ]
}