{
  "job_id": "1422828",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sound-Engineer-1422828",
  "scraped_at": "2025-07-15T14:28:48.009798",
  "title": "Sound Engineer",
  "type_of_work": "Part Time",
  "salary": "250",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are looking for a talented Sound Engineer / Sound Designer to join our team and elevate our projects with outstanding audio experiences.\n\r\nJob Summary:\r\nAs our in-house Sound Engineer / Sound Designer, you will be responsible for creating, recording, and mixing audio tracks to enhance the overall quality and impact of our video content. Your expertise will help in crafting soundscapes that resonate with viewers and support the studio's vision and objectives.\n\n\r\nKey Responsibilities:\n\r\n- Develop and implement sound designs that complement visual content and enhance viewer engagement.\r\n- Record, edit, mix, and master audio tracks for a diverse range of video projects.\r\n- Collaborate with production teams to ensure audio quality and consistency across all content.\r\n- Manage audio resources, including sound libraries and audio equipment.\r\n- Stay updated with industry trends and advancements in sound technology.\r\n- Provide creative audio solutions under tight deadlines.\n\n\r\nRequirements:\r\n- Proven experience as a Sound Engineer or Sound Designer, preferably within a digital or video production environment.\r\n- Strong portfolio showcasing your skills in audio editing, mixing, and sound design.\r\n- Proficiency with digital audio workstations (DAWs) like Pro Tools, Ableton Live, Logic Pro, or similar.\r\n- Excellent understanding of sound dynamics and music mixing.\r\n- Ability to work collaboratively in a team-oriented environment.\r\n- Strong communication skills and attention to detail.\r\n- Bachelor’s degree in Audio Engineering, Music Production, or related field is preferred [OPTIONAL]\n\r\nWhat We Offer:\r\n- Competitive salary.\r\n- Opportunities for professional growth and creative freedom.\r\n- A dynamic and supportive work environment.\n\r\nHow to Apply:\r\nPlease INBOX US your resume, cover letter, OR a link to your portfolio demonstrating relevant audio projects if you are interested.",
  "skill_requirements": [
    "Audio Editing",
    "Sound Design",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:39:20.676985",
      "reason": "Job first discovered"
    }
  ]
}