{
  "job_id": "1422919",
  "url": "https://www.onlinejobs.ph/jobseekers/job/E-Commerce-Senior-Bookkeeper-Xero-Specialist-US-Hours-up-to-2300-Full-Time-Remote-1422919",
  "scraped_at": "2025-07-15T12:25:19.024596",
  "title": "E-Commerce Senior Bookkeeper / Xero Specialist (US Hours, up to $2,300, Full-Time, Remote)",
  "type_of_work": "Full Time",
  "salary": "Up to $2,300",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Drive financial clarity and control across multi-marketplace operations in a fast-growing e-commerce brand.\n\r\nLitcessory is an established e-commerce brand that powers smarter Philips Hue setups across Amazon, Walmart, Shopify, and more. We’re looking for a sharp, Xero-savvy accountant who thrives on owning the numbers end-to-end—importing multi-marketplace sales, closing the books, and surfacing insights that drive better decisions. If you love clean processes, able to work independently, dig into variances to determine casues and take appropriate action, we’d like to meet you.\n\n\r\nKEY RESPONSIBILITIES:\n\r\n•Establish, document, and implement accounting company processes and SOPs, including tasks for importing sales, paying employees, tracking sales, etc.\r\n•Confidently maintain chart of accounts and financial statements in Xero independently.\r\n•Track inventory sales and COGS on a SKU level basis using Xero's inventory system.\r\n•Reconcile inventory against 3rd party reports and understand reasons for variances.\r\n•Ensure bills are raised and paid on time, validating all vendor payments.\r\n•Accurately record tracking categories for reliable management reporting.\r\n•Timely and accurately file monthly sales tax and VAT returns.\r\n•Import and reconcile bank transactions and statements.\r\n•Maintain an on-time monthly close calendar and prepare year-end financials in coordination with the tax preparer.\r\n•Review financial results and advise management on areas of improvement.\r\n•Manage cash flow reporting and payroll.\r\n•Engage in process improvements and other integrations with Xero.\r\n•Maintain regulatory US/EU VAT and sales tax filings using the tools we have in place\r\n•Budgeting/forecasting & KPI dashboards – partner with management on cash-flow projections.\n\n\r\nREQUIREMENTS:\n\r\n•Educational Background: A bachelor’s degree in accounting, finance, or a closely related field.\n\r\n•Certification: CPA, CMA, or equivalent credential preferred (shows ownership & rigor).\n\r\n•Experience: At least 3 years of accounting experience, with a minimum of 2 years focused on e-commerce accounting. Experience with Amazon marketplace is a plus.\n\r\n•Software Proficiency: Expert level proficiency in Xero and Excel/Google Sheets.\n\r\n•Regulatory Knowledge: Experience with US and EU accounting regulations and filings, including knowledge of regulatory US/EU VAT and sales tax filings.\n\r\n•Independence and Problem Solving: Ability to work independently, investigate variances, reconcile multi-source data, and present root-cause findings.\n\r\n•Ownership & accountability: Track record of running the full close cycle with minimal oversight.\n\r\n•Detail orientation / quality control: Demonstrated low-error work; includes establishing internal checks.\n\r\n•Eagerness to Learn and Adapt: Must be eager to learn, adapt, and grow with our constantly evolving company.\n\r\n•Data Manipulation Skills: Comfortable with manual data manipulation for importing into Xero.\n\r\n•Exclusivity: This is a full-time position requiring exclusive commitment to our company.\n\r\n•Adaptability in Process Documentation: Adept at creating, documenting, and implementing accounting processes.\n\r\n•Availability: Must be available to work 40 hours a week, within an 8-hour block between 6 AM - 6 PM Eastern Time, Monday - Friday.\n\r\n•Communication: Clear, proactive status reporting in English—both written and live.\n\n\r\nHOW TO APPLY:\r\nGo to the website below and complete the information to start the application process.\n\r\ntinyurl.com/litcessoryxerobookkeeper                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:33:32.596845",
      "reason": "Job first discovered"
    }
  ]
}