{
  "job_id": "1422211",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Elite-Kajabi-Course-Creator-Real-Estate-Investing-1422211",
  "scraped_at": "2025-07-15T13:41:26.146065",
  "title": "Elite Kajabi Course Creator (Real Estate Investing)",
  "type_of_work": "Any",
  "salary": "$400-$600 USD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Elite Kajabi Course Creator (Real Estate Investing) \r\n(Curriculum Writing, Instructional Design, and LMS Expertise)– Philippines-based | Top Talent\r\n________________________________________\r\nJob Type: Freelance / Project-Based\r\n Duration: ~3–6 months (Initial project, long-term potential)\r\n Availability: Part-time with flexibility (must overlap at least 4 hours/day during U.S. EST business hours)\r\n Budget: Competitive fixed-price or hourly rate (negotiable, premium for elite experience)\r\n________________________________________\r\n Who We Are\r\nI’m a seasoned U.S.-based real estate investor with over 22 years of experience. I’m launching a flagship online course titled “Fix and Flip Like a PRO: 8 Steps to Real Estate Wealth” on Kajabi, as part of a fast-growing education brand that includes a podcast, YouTube channel, webinars, and premium content.\r\nWe aim to deliver a world-class online education experience that helps aspiring real estate investors, agents, flippers, and entrepreneurs gain financial freedom and generational wealth through real estate investing. We're looking for a truly elite Kajabi Course Creator from the Philippines who can bring exceptional curriculum design, instructional clarity, engaging content, and beautiful course assets to life.\r\n________________________________________\r\n Your Mission\r\nAs our elite course creator, you will strategically develop, structure, and build a complete, high-converting online course on Kajabi. You’ll leverage your deep understanding of digital marketing, curriculum design, and real estate education to craft transformative learning experiences that attract, engage, and retain students.\r\nThis is not just a “job” — you’ll be central to our brand's success and positively impact thousands of aspiring investors.\r\n________________________________________\r\n Your Core Responsibilities\r\n1. Instructional Design & Curriculum Creation:\r\n• Develop a clear, compelling course structure aligned with our 8-step PROPULSE™ real estate investing framework.\r\n• Organize 8 modules (~4–5 lessons per module) for high student retention and engagement.\r\n• Create lesson outlines, objectives, learner milestones, and assessment methods (quizzes, assignments).\r\n• Craft easy-to-follow scripts, lesson texts, and downloadable materials for video-based modules.\r\n2. Kajabi Course Setup & Technical Management:\r\n• Expertly set up and customize the entire course in Kajabi (product structure, lesson uploads, quizzes, certificates, automations).\r\n• Build beautiful, Website pages and conversion-focused sales pages, checkout pages, and student dashboards on Kajabi.\r\n• Integrate email sequences and sales funnels directly within Kajabi for seamless user journeys.\r\n3. Content Production & Media Assets:\r\n• Design visually appealing slide decks in Canva, aligning closely with our brand style.\r\n• Create professional student workbooks, cheat sheets, checklists, and templates.\r\n• Prepare short-form content from course materials for social media, YouTube shorts, or promotional posts.\r\n• Edit and refine video/audio content or coordinate closely with video editors as needed.\r\n4. SEO & Marketing Optimization:\r\n• Optimize all course pages, video titles, descriptions, and course materials for maximum search visibility (SEO).\r\n• Strategically select keywords, write compelling meta descriptions, and structure lessons for discoverability.\r\n5. Automation & Integration:\r\n• Implement Kajabi automations for seamless student onboarding, engagement, and upsell flows.\r\n• Integrate Kajabi with tools like ActiveCampaign, Zapier, ConvertKit, or webinar platforms as needed.\r\n________________________________________\r\n You’re the Perfect Candidate If:\r\n• You have 3–5+ years of experience creating premium online courses, preferably in real estate, finance, entrepreneurship, or related niches.\r\n• You’re a Kajabi expert (course creation, pipelines, automations, page builder, memberships) and know it inside and out.\r\n• You have experience writing compelling curriculum content, scripts, and workbooks in fluent, flawless English.\r\n• You have strong design skills (Canva, Adobe Suite) and are comfortable creating beautiful course assets.\r\n• You understand instructional design principles for adult learners, course retention, and completion.\r\n• You have experience in funnel building, email marketing (Kajabi, ActiveCampaign, ConvertKit), and webinar integrations.\r\n• You are tech-savvy, detail-oriented, extremely organized, and highly proactive—solving problems independently and creatively.\r\n• You’re able to overlap at least 4+ hours per day during U.S. business hours (EST).\r\n• You’re motivated by excellence, learning, and making an impact.\r\n• You have a proven track record building and launching profitable online courses with real measurable results.\r\n________________________________________\r\n What’s in It for You?\r\n• Competitive, premium compensation aligned with your elite skillset\r\n• Long-term growth opportunities beyond the initial course (potential ongoing role as our in-house course strategist)\r\n• Flexible, remote work (from anywhere in the Philippines)\r\n• Collaborative, respectful, professional environment where your insights matter\r\n• Work directly with a high-profile U.S. entrepreneur to grow your skills and career\r\n• Be part of something purposeful, impactful, and transformative for thousands of aspiring investors globally\r\n________________________________________\r\n To Apply (Must Include):\r\n1. Start your reply with the phrase “Elite Course Creator PRO” (to ensure you’ve read this thoroughly).\r\n2. Provide your resume or a clear summary of your relevant Kajabi, course design, and real estate education experience.\r\n3. Include a portfolio or links to 2–3 online courses you personally built or significantly contributed to. Clearly state your role in each.\r\n4. Confirm your availability (hours/week), current time zone, and flexibility during U.S. EST business hours.\r\n5. State your desired monthly compensation or hourly rate (in USD).\r\n6. (Optional, highly encouraged): Attach a brief (1–2 min) video introducing yourself and your experience—this helps us prioritize you.\r\n________________________________________\r\n Next Steps:\r\nAfter reviewing your application, we’ll schedule a video interview with selected candidates. Shortlisted candidates may be asked to complete a brief paid trial task (e.g., creating a short module outline) to ensure alignment.\r\nThis is a rare opportunity to step into an exciting brand with ambitious goals, significant growth potential, and genuine purpose. If you’re an elite Kajabi course creator in the Philippines and this role excites you, we’d love to hear from you immediately!\r\n________________________________________\r\nApply now!\r\nI’m looking forward to partnering closely with you as we launch a groundbreaking real estate investing education platform.\r\nWarm Regards,\r\nPRO Enterprises",
  "skill_requirements": [
    "Marketing Automation",
    "Kajabi",
    "E-learning"
  ],
  "is_active": true,
  "status_history": []
}