{
  "job_id": "1422260",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Public-Relations-Assistant-1422260",
  "scraped_at": "2025-07-15T14:34:32.474675",
  "title": "Public Relations Assistant",
  "type_of_work": "Full Time",
  "salary": "$500",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking a motivated and dynamic Public Relations Assistant to join our growing team. This is an exciting opportunity for individuals who are passionate about communications and eager to gain hands-on experience in the field of public relations. As a Public Relations Assistant, you will play a vital role in supporting our PR initiatives, enhancing our brand image, and communicating our message effectively to the public.\n\r\nKey Responsibilities\n\r\nAssist in drafting press releases, media kits, and other PR materials\r\nSupport the organization and execution of promotional events and campaigns\r\nMaintain and update media contact lists and databases\r\nMonitor media coverage and track PR metrics\r\nAssist with social media content creation and engagement\r\nConduct research to support PR strategies and initiatives\n\n\r\nSkills, Knowledge, and Expertise\n\r\nStrong English written and verbal communication skills\r\nProficiency in Microsoft Office Suite and social media platforms\r\nAbility to work collaboratively in a team-oriented environment\r\nOrganizational skills with a strong attention to detail\r\nA willingness to learn and grow with a new company\r\nPrior experience in public relations or communications is a plus\r\nTalent and entertainment experience are a plus\n\n\r\nBenefits\n\r\nOpportunities for career growth and development.\r\nA dynamic and collaborative work environment.\n\n\r\nAbout Lewis Line Public Relations:\n\r\nLewis Line Public Relations is a full-service PR agency based in Los Angeles. The firm specializes in elevating bold talent and transformative brands through culturally informed media strategies, compelling storytelling, and innovative campaigns. Lewis Line PR bridges traditional media savvy with next-generation creativity to deliver authentic, impactful results across entertainment, lifestyle, fashion, and social impact sectors.",
  "skill_requirements": [
    "Creative Writing",
    "Public Relation",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:35:35.219478",
      "reason": "Job first discovered"
    }
  ]
}