{
  "job_id": "1422964",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AI-Video-Art-Editing-Branding-Storytelling-1422964",
  "scraped_at": "2025-07-15T12:32:19.268988",
  "title": "AI Video Art & Editing (Branding & Storytelling)",
  "type_of_work": "Any",
  "salary": "650",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re a forward-thinking nano studio on a mission to blend technology, creativity, and storytelling through the power of AI. Our work spans visual innovation, brand development, and next-gen content—crafted with intention, powered by AI.\n\r\nWe’re looking for an AI Video Editor who understands not just how to cut a video—but how to build a brand story.\n\r\nWho You Are:\r\nA video editor with a passion for visual storytelling, brand identity, and narrative.\r\nYou have hands-on experience using AI video platforms like:\r\n- Midjourney\r\n- Kling 2.0\r\n- VEO 3\r\n- Runway ML\r\n- Pika\r\n- Sora (if available)\r\n- Kaiber / Animoto / Descript\r\n- CapCut + templates / transitions optimized for reels, shorts, and TikToks\n\r\nOr any other tool that lets you accelerate creativity through AI\n\r\nYou stay current with trends in motion design, AI art, and digital storytelling.\n\r\nYou can interpret rough ideas and craft them into compelling micro-content that makes people care.\n\r\nYou understand the difference between editing for engagement vs editing for expression—and know how to do both.\n\r\nYour Role:\r\nEdit short-form and long-form content (reels, promos, sizzle reels, digital shorts).\n\r\nCollaborate with our creatives and strategist to visually express the brand voice.\n\r\nUse AI tools to experiment and evolve our visual language.\n\r\nHelp document the story of our nano studio—its origin, its process, its ethos.\n\r\nContribute ideas proactively on how we can push the boundaries of AI x creativity.\n\r\nNice to Have:\r\nLight motion design or prompt-based animation experience\n\r\nFamiliarity with Midjourney, Stable Diffusion, DALL·E, or other AI art platforms\n\r\nBranding instincts—understanding how every frame speaks to the audience\n\r\nA small personal portfolio of AI-driven or conceptual edits\n\r\nWhat You’ll Gain:\r\nCreative freedom and the chance to shape something from the ground up\r\nA collaborative team with a deep respect for experimentation and bold ideas\r\nLong-term potential as our content grows into a full storytelling ecosystem\n\r\nReady to help tell the story of something different?\n\r\nSend us:\r\n- A quick intro video (we like casual and human)\r\n- Links to your best AI-edited content or experimental reels\r\n- Tools you love working with\n\r\nLet’s build the brand together—frame by frame, story by story.\n\r\n>> Include \"AI NANO\" in your application title or you will not be contacted",
  "skill_requirements": [
    "Content Creation",
    "Video Content Creation",
    "Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:24:44.755439",
      "reason": "Job first discovered"
    }
  ]
}