{
  "job_id": "1422567",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Cabinet-Drafter-2020-Design-Software-1422567",
  "scraped_at": "2025-07-15T14:31:26.806558",
  "title": "Cabinet Drafter - 2020 Design Software",
  "type_of_work": "Any",
  "salary": "$5-$7",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking a skilled Remote Cabinet Drafter.\n\r\nIf you possess the qualifications, please apply using the form provided below.\n Upgrade to see actual info\n\n\n\n\n\r\n This position offers the flexibility of remote work while contributing to high-quality kitchen and cabinet design projects. Our client specializes in custom cabinetry for residential and commercial spaces, serving customers nationwide.\n\r\nKey Responsibilities\r\nDesign Development: Create detailed cabinet layouts and production drawings from architectural plans using 2020 Design software\n\r\nTechnical Documentation: Generate comprehensive specifications, cut lists, and material requirements\n\r\nProject Coordination: Collaborate with project managers, designers, and production teams to ensure seamless workflow\n\r\nQuality Assurance: Review drawings for accuracy, compliance with building codes, and manufacturing feasibility\n\r\nClient Support: Assist with design revisions and technical questions throughout project lifecycle\n\r\nTimeline Management: Meet project deadlines while maintaining high-quality standards\n\r\nRequired Qualifications\r\nTechnical Skills\r\nProficiency in 2020 Design software (minimum 2 years experience)\n\r\nExperience with cabinet manufacturing processes and construction methods\n\r\nAbility to read and interpret architectural drawings and blueprints\n\r\nKnowledge of wood species, hardware, and cabinet construction techniques\n\r\nAdditional Software (Preferred)\r\nCabinet Vision\n\r\nAutoCAD\n\r\nChief Architect\n\r\nSketchUp\n\r\nExperience & Education\r\nMinimum 2 years computer-aided drafting experience in millwork or cabinet industry\n\r\nHigh school diploma or GED required (technical school/college preferred)\n\r\nPrevious remote work experience preferred",
  "skill_requirements": [
    "Auto Cad",
    "Drafting",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:27:15.279820",
      "reason": "Job first discovered"
    }
  ]
}