{
  "job_id": "1422245",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Pre-Closer-for-SimpliTitle-Minimum-12-Months-Experience-Required-1422245",
  "scraped_at": "2025-07-15T15:37:17.553644",
  "title": "Remote Pre-Closer for SimpliTitle– Minimum 12 Months Experience Required",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Position: Pre-Closer\r\nType: Full-Time, Remote\r\nExperience Required: At least 12 months in a title company or real estate closing environment\r\nLocation: Remote - strong English preferred.\r\nAbout Us:\r\nJoin a fast-growing, fully remote title company dedicated to delivering streamlined, tech-forward closing services. We work across multiple states with a strong emphasis on efficiency, customer service, and compliance.\n\r\nJob Description:\r\nAs a Pre-Closer, you will play a key role in preparing real estate transactions for closing. You will be responsible for collecting and reviewing documentation, opening title files, coordinating with clients and lenders, and ensuring all title and escrow requirements are met ahead of closing.\n\r\nKey Responsibilities:\r\nOpen and process new title orders\r\nCollect, review, and organize contract and loan documents\r\nOrder payoffs, HOA estoppels, municipal lien searches, and other due diligence\r\nCoordinate with buyers, sellers, lenders, and agents\r\nReview title commitments and identify clearance items\r\nPrepare pre-closing packages and maintain communication throughout the closing process\r\nEnsure files meet compliance and underwriting standards\n\r\nQualifications:\r\nMinimum 1 year (12 months) of experience as a pre-closer or equivalent in a title or escrow company\r\nStrong understanding of title commitments and settlement procedures\r\nExcellent written and verbal communication skills\r\nHighly organized, tech-savvy, and comfortable in a fast-paced remote environment\r\nExperience with Qualia, Slack.\n\r\nTools & Benefits:\r\n100% Remote work\r\nModern tech stack for efficient workflow\r\nCollaborative and supportive team culture\r\nOpportunity to grow within the company\n\r\nApply Now:\r\nSend your resume and a brief cover letter. Only qualified candidates will be contacted",
  "skill_requirements": [
    "Title Escrow",
    "Loan Processing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:29:09.774574",
      "reason": "Job first discovered"
    }
  ]
}