{
  "job_id": "1422492",
  "url": "https://www.onlinejobs.ph/jobseekers/job/HIRING-ASAP-Shopify-Store-Builder-1422492",
  "scraped_at": "2025-07-15T14:34:04.435960",
  "title": "HIRING ASAP!!! Shopify Store Builder",
  "type_of_work": "Any",
  "salary": "€4.7/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re on the lookout for a Shopify Store Builder to build storefronts, import products, design engaging pages, and ensure compliance with Google’s e-commerce standards.\n\n\r\nThe Challenge:\r\nWe are seeking a highly skilled Shopify Store Builder to join our growing team. This role is ideal for someone with significant hands-on experience building, designing, and optimizing Shopify stores from scratch. You will be responsible for setting up storefronts, importing products, designing pages, ensuring store compliance, and occasionally using tools like Canva and AI for design and custom coding support.\n\n\r\nEarly Success Milestones for this role:\r\nSignificantly faster approval and resolution times for Shopify stores, ensuring quicker store launches and efficient issue fixing.\n\n\r\nYour Team When You Join Us:\r\nAs a Shopify Store Builder, you’ll be part of our Growth Expansion team, focused on launching high-quality Shopify stores that are optimized for conversions and ready for scaling. You'll collaborate closely with our Growth Expansion Manager and other specialists to ensure each store meets both internal standards and external requirements (like Google Merchant Center approval).\n\r\nWe would love to hear from you if…\r\nYou have 4+ years of experience building Shopify stores from scratch or through complete redesigns\r\nYou have a strong understanding of Shopify themes, Liquid, and page builders\r\nYou have a familiarity with product importing and store configuration\r\nYou have a knowledge of e-commerce best practices, especially Google compliance\r\nYou have basic Canva skills for creating product and store visuals\r\nYou have attention to detail and a strong design sense\r\nYou have the ability to work independently and deliver high-quality results\r\nYou are comfortable using AI tools to support minor coding or design tasks\n\n\r\nIf you are interested, please apply directly to our job posting: Upgrade to see actual info\n\r\nKINDLY REFRAIN FROM SENDING MESSAGES THROUGH ONLINEJOBS.PH. APPLICATIONS THAT DO NOT FOLLOW THE SPECIFIED INSTRUCTIONS WILL NOT BE CONSIDERED.",
  "skill_requirements": [
    "Shopify",
    "Canva"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:22:18.032049",
      "reason": "Job first discovered"
    }
  ]
}