{
  "job_id": "1422656",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Photoshop-Editor-for-Pet-Photographer-1422656",
  "scraped_at": "2025-07-15T15:40:48.930433",
  "title": "Photoshop Editor for Pet Photographer",
  "type_of_work": "Gig",
  "salary": "$3-8 per hour",
  "hours_per_week": "8",
  "date_updated": "Jul 15, 2025",
  "job_overview": "I’m a Pet Photographer in search of a photoshop editor to add to our team! Job may eventually lead to virtual assistant duties (thus, more hours) in the future, if interested. \n\n\r\nEditing may include, but not be limited to:\n\r\n- Leash and people removal\r\n- Combining multiple pets into one image\r\n- Detailed clean up of the images, such as cleaning eye stains, removing fur from clothing, etc\r\n- Fixing/adjusting shadows, highlights, etc\n\r\nImages will be shared via Dropbox.\n\r\n!!! Paid training WILL be provided so you know the style and detail I'm looking for in my finished images, but applicants with a working knowledge of Photoshop will be prioritized. \n\n\r\nWhat I’m NOT looking for:\n\r\nX If you are disorganized or have difficulty with deadlines and structure, please do not apply.\r\nX You are not strong in communicating in English, please do not apply.\r\nX If you have an unreliable internet source, please do not apply.\n\n\r\nWhat I AM looking for:\n\r\n+ Dedicated, loyal, on-time, organized, hits deadlines, quick learner\r\n+ Detail oriented a MUST\r\n+ STRONG in written English (verbal English proficiency could increase the amount of work in time)\n\n\r\nEvery month is slightly different based on when I have bookings, but on average I would say I have about 5-10 hrs/week worth of work to offer. This will be greater in the beginning while we get started and work through training. Some weeks it could be more, and some weeks less.\n\r\nIf you end up being a great fit and show a high level of commitment, as my business grows, so will the tasks I have to offer you and the position could potentially change to part time or full time if you're interested in virtual assistant duties!\n\r\nIf this sounds like you, reply to this job post with the following at the TOP of your message: your favorite breed of dog, let me know if you have a strong internet connection, your experience level with Photoshop and an inspirational quote that makes you happy :)\n\r\nPawsitively,\r\nMarie\n\r\np.s. ONLY apply via the OnlineJobs.Ph website. Any direct emails or social media communication will result in immediate disqualification.",
  "skill_requirements": [
    "Photoshop",
    "Photo Editing",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:25:01.594303",
      "reason": "Job first discovered"
    }
  ]
}