{
  "job_id": "1422871",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Strategic-Administrator-1422871",
  "scraped_at": "2025-07-15T14:37:53.343807",
  "title": "Strategic Administrator",
  "type_of_work": "Full Time",
  "salary": "1000-1500 AUD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Purpose of the Role\r\nThe Strategic Administrator exists to drive clarity, structure, and seamless execution across communication and coordination functions. This role ensures the strategic rhythm of the organisation stays aligned with our mission of empowering 25,000 students annually by 2030.\n\r\nWith a focus on precision, responsiveness, and continuous improvement, the Strategic Administrator supports leadership and project Upgrade to see actual infontum by managing email systems, meetings, projects, and essential administrative functions. This role is critical in translating strategic intent into operational action—ensuring nothing falls through the cracks and everything moves forward with intention and impact\n\r\nCore Responsibilities\r\n1. Email Management\n\r\nMaintain clear inboxes using structured systems (flag, file, follow-up).\n\r\nPrioritise, delegate, and escalate emails as needed for effective response.\n\r\nDraft replies and summaries for leadership when appropriate.\n\r\n2. Project & Task Management\n\r\nMaintain project and task boards (e.g., ClickUp, Asana, Trello).\n\r\nAssign tasks, track progress, and follow up on deliverables.\n\r\nCreate simple, repeatable processes for task flow and team visibility.\n\r\n3. Communication – Phone Calls\n\r\nMake and answer calls on behalf of leadership.\n\r\nCapture and summarise key information from conversations.\n\r\nFollow through with actions, notes, or scheduling from calls.\n\r\n4. Meeting Coordination & Documentation\n\r\nPlan and confirUpgrade to see actual infoetings, sending reminders and agendas.\n\r\nTake clear, action-oriented minutes.\n\r\nTrack and follow up on meeting actions across teams.\n\r\n5. General Administration\n\r\nPrepare documents, templates, and presentations aligned with brand tone.\n\r\nManage digital filing systems and data hygiene.\n\r\nSupport scheduling, form submissions, and other day-to-day operations.\n\r\nSuccess in This Role Looks Like\r\nZero email chaos – priority items are flagged and responded to promptly.\n\r\nProjects stay on track – you know what’s next, who’s doing it, and when it’s due.\n\r\nLeaders stay focused – you're their behind-the-scenes partner keeping things moving.\n\r\nMeetings turn into action – not just talk.\n\r\nEverything is simple, repeatable, and efficient.\n\r\nWho You Are\r\nProactive and organised with an eye for structure.\n\r\nConfident communicator who thrives on clarity and follow-through.\n\r\nTech-savvy and comfortable with digital tools and systems.\n\r\nValues-driven: integrity, initiative, and no-fuss service.\n\r\nLoves being the steady force that keeps the ship sailing smoothly.\n\n\r\nIf you would like to be considered please ensure you include a 2 Minute Video telling us a little bit about yourself and why you woudl like to work for Onsitetraining Australia.\n\r\nApplications that do not provide this 2 Minute video will not be reviewed.",
  "skill_requirements": [
    "Project Management",
    "Sop Writing",
    "Email Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:32:47.043725",
      "reason": "Job first discovered"
    }
  ]
}