{
  "job_id": "1422173",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-English-1422173",
  "scraped_at": "2025-07-15T12:35:38.374879",
  "title": "Virtual Assistant (English)",
  "type_of_work": "Full Time",
  "salary": "$700",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Post: Virtual Assistant for Rem Kings Real Estate MediaPosition: Virtual Assistant  \n\r\nCompany: Rem Kings Real Estate Media  \n\r\nEmployment Type: Full-Time About Us:  \n\r\nRem Kings Real Estate Media is dedicated to providing exceptional media services tailored for real estate agents. We pride ourselves on delivering high-quality content that helps our clients stand out in a competitive market.\n\r\nJob Description:  \r\nWe are seeking a dedicated and skilled Virtual Assistant to join our team. The ideal candidate will possess expert-level proficiency in English and be committed to prioritizing this role as their main career focus. Your responsibilities will include:\n\r\n-Handling phone calls and booking appointments efficiently\r\n-Maintaining prompt communication with clients and teaUpgrade to see actual infombers\r\n-Writing and responding to emails in a professional manner\r\n-Managing messages through Instagram and Facebook\r\n-Delegating tasks by effectively communicating client needs to other teaUpgrade to see actual infombers\n\r\nRequirements:\n\r\n-Expert level of speaking and understanding English\r\n-Proven experience in handling phone calls and scheduling appointments\r\n-Strong written communication skills for emails and social media\r\n-Ability to respond promptly and professionally to client inquiries\r\n-Experience in delegating tasks and managing team communications\r\n-Availability for a full-time position, with commitment to making this role a priority\n\r\nApplication Task:  \r\nTo apply, please submit your resume along with a video of yourself reciting the following script:\n\r\nScript for Video Submission: \n\r\n\"Hello, my name is [Your Name]. Thank you for calling Rem Kings Real Estate Media, where we specialize in providing top-notch media services for real estate agents. How can I assist you today?”\n\r\nWe look forward to hearing from you and potentially welcoming you to our dynamic team!",
  "skill_requirements": [
    "Appointment Setting",
    "English",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": []
}