{
  "job_id": "1422407",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Link-Building-Specialist-1422407",
  "scraped_at": "2025-07-15T12:25:04.214463",
  "title": "Full-Time Link Building Specialist",
  "type_of_work": "Full Time",
  "salary": "450",
  "hours_per_week": "28",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Sunrise Recovery is looking for a highly skilled and experienced Link Builder to join our team full-time, Monday through Friday. This is a remote position with long-term potential, and we are only seeking candidates who can bring real results and a proven record of performance in SEO and digital outreach.\n\r\nThe ideal candidate will have a deep understanding of white-hat link building strategies and know how to secure high-authority, niche-relevant backlinks through ethical, manual outreach. You must be able to research opportunities, build relationships, and land placements that directly improve rankings and traffic. Your main focus will be to support our growing online presence in the addiction recovery and healthcare industry, working closely with our content team to amplify our most important service pages and blog posts.\n\r\nWe are especially focused on improving our authority and visibility in search engines and AI-powered platforms. That means your role will be essential in helping us align with modern SEO standards, E-E-A-T requirements, and building domain strength in competitive markets like Indiana, Florida, and California. Experience with tools such as Ahrefs, SEMrush, or BuzzStream is a plus, but what matters most is your ability to execute outreach consistently and professionally.\n\r\nThis is a full-time role for someone who’s ready to take ownership, work smart, and help us grow. You’ll be joining a mission-driven brand that combines digital marketing with real impact in people’s lives. Pay is competitive and based on experience, with performance-based growth potential.\n\r\nIf you're a real link-building professional with past results to show, please reach out with your experience, sample work, and results",
  "skill_requirements": [
    "Local SEO",
    "Backlinks Management",
    "Link Building"
  ],
  "is_active": true,
  "status_history": []
}