{
  "job_id": "1422592",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Technical-SEO-WordPressWeb-Developer-1422592",
  "scraped_at": "2025-07-15T12:32:24.475209",
  "title": "Technical SEO WordPress/Web Developer",
  "type_of_work": "Any",
  "salary": "up to 60,000 PHP/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "practiceedge is an Australian-based digital marketing agency focused on helping businesses achieve outstanding results and growth. We offer a range of services, including web design, graphic design, SEO, Google Ads, and more, with a commitment to delivering the promise. Join our dynamic, creative team that encourages ambition and results. \n\r\nThe Job: \n\r\nWe’re looking for a Technical SEO WordPress/Web Developer with a strong understanding of SEO. As part of our growing team, you will be responsible for maintaining technical excellence across multiple client websites, ensuring high performance and optimal search engine rankings. \n\r\nKey Responsibilities: \n\r\nManage the technical SEO aspects of client websites \n\r\nMaintain and improve website technical health, with most websites using Wordpress and page builders such as Elementor, Divi, Avada, and WP Bakery. \n\r\nUtilise tools such as Ahrefs and Screaming Frog for SEO technical audits and fixes. \n\r\nImplement fixes and page speed optimisation \n\r\nAdditional tasks may include, but are not limited to, Google Tag Manager setup and integration, creating and implementing website schema markup, troubleshooting etc. \n\r\nEssential Skills and Experience: \n\r\nProficient in WordPress, including popular page builders (Elementor, Divi, Avada, WP Bakery). \n\r\nHTML and PHP familiarity will be required at times.  \n\r\nExperienced with SEO tools like Ahrefs and Screaming Frog. \n\r\nA good understanding of SEO best practices, experienced, with a strong focus on technical SEO. \n\r\nExperience in improving website page speed and technical SEO. \n\r\nExcellent written and spoken English communication skills. \n\r\nIdeal Candidate: \n\r\nFamiliar with best practices in page speed improvements. \n\r\nKnowledge of Google Tag Manager and website schema markup. \n\r\nA self-motivated and organised individual with the ability to work independently in a remote environment. \n\r\nStrong communication skills, with the ability to collaborate effectively with teaUpgrade to see actual infombers and clients. \n\r\nTo apply, please submit: \n\r\nA cover letter and introductory video outlining why you believe you are a great fit for the role. Applications without a video will not be considered. \n\r\nYour updated resume.",
  "skill_requirements": [
    "SEO",
    "Wordpress"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:22:54.255623",
      "reason": "Job first discovered"
    }
  ]
}