{
  "job_id": "1422472",
  "url": "https://www.onlinejobs.ph/jobseekers/job/GHL-Expert-1422472",
  "scraped_at": "2025-07-15T14:43:03.630254",
  "title": "GHL Expert",
  "type_of_work": "Part Time",
  "salary": "$150-$250",
  "hours_per_week": "5",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Virtual Assistant – CRM & Automation Specialist (Go High Level + Zapier)\r\nPart-Time | Remote | $6/hour | 5 hrs/week\n\r\nAbout Us:\r\nWe’re a small, purpose-driven chiropractic office that’s growing fast—and we’re ready to modernize how we connect with and support our patients. We’re in the early stages of implementing a CRM system and need a tech-savvy, self-starting Virtual Assistant to lead the charge with Go High Level. If you're a systems thinker with a passion for automation and client journey design, we want to work with you!\n\r\nRole Overview:\r\nThis role is laser-focused on setting up, optimizing, and automating our CRM using Go High Level. You will be responsible for helping us build out the backend—from pipelines to forms, from funnels to follow-ups—and ensuring everything integrates smoothly with our existing tools (Google tools). You’ll need to work independently, guide us through what we don’t know, and help create a CRM that feels like an extension of our heart-led practice.\n\r\nKey Responsibilities:\r\nSet up and customize our Go High Level account from scratch (or reconfigure current setup)\n\r\nBuild automations, workflows, tags, pipelines, calendars, email/SMS templates, and nurture sequences\n\r\nCreate simple sales funnels and lead forms for our website and events\n\r\nIntegrate with Zapier and Google tools (Drive, Sheets, Forms, Calendar)\n\r\nRecommend and implement best practices for patient lead capture, onboarding, and retention\n\r\nProvide weekly updates and communicate clearly about next steps, challenges, and suggestions\n\r\nTroubleshoot and problem-solve independently, but loop us in for key decisions\n\r\nIdeal Candidate/Requirements:\r\n3+ years of hands-on experience with Go High Level \n\r\nProven experience building funnels, automations, and landing pages in Go High Level\n\r\nProficient with Zapier and Google Workspace integrations\n\r\nProactive, resourceful, and solution-oriented\n\r\nComfortable guiding clients who aren’t tech experts\n\r\nStrong written and verbal communication skills\n\r\nStrong initiative and leadership mindset—able to lead without needing step-by-step instructions\n\r\nBonus: Experience working with health, wellness, or coaching businesses\n\n\r\nDetails:\r\n5 hours per week\n\r\n$6 USD/hour (paid biweekly via Wise)\n\r\nFlexible schedule, but must overlap at least 1 hour/week with EST for check-ins\n\r\nInitial contract for 1–3 months with potential to grow based on performance\n\r\nHow to Apply:\r\nPlease send the following:\r\nA cover letter or portfolio clearly stating your years of Go High Level experience\n\r\nLinks to any live Go High Level landing pages or funnels you have personally built\n\r\nYour current availability and time zone\n\r\nConfirmation that you’re comfortable with the hourly rate and weekly hours\n\r\n*Candidates who submit all requested materials and demonstrate clear, relevant experience will be prioritized for interviews.A portfolio or description of a Go High Level setup you’ve done (screenshots or Loom welcome!)\n\n\r\nWhat It’s Like to Work With Us:\r\nYou’ll be working directly with the doctors in a highly supportive, collaborative environment. We’re kind, driven, and focused on serving our patients well—but we’re also learning as we go. We’ll trust you to lead this part of our business and will give you the freedom to make it excellent.",
  "skill_requirements": [
    "Google Forms",
    "GoHighLevel",
    "Zapier"
  ],
  "is_active": true,
  "status_history": []
}