{
  "job_id": "1422869",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Operations-Manager-Systems-SOPs-and-RPA-Coordination-1422869",
  "scraped_at": "2025-07-15T14:26:07.011757",
  "title": "Full-Time Operations Manager – Systems, SOPs, and RPA Coordination",
  "type_of_work": "Any",
  "salary": "1000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Description:\n\r\nWe're looking for a smart, proactive, and switched-on Operations Manager to join our fast-growing team full-time. You’ll be responsible for streamlining and scaling internal operations, building out SOPs, managing workflow tools, and coordinating with RPA developers to automate manual processes wherever possible.\n\r\nWhat we do:\n\r\nOur goal is to automate as much of our delivery and admin as possible using a blend of SOPs, remote assistants, and RPA workflows.\n\r\nYour responsibilities:\n\r\n- Build and document SOPs for key business functions\r\n- Identify inefficiencies and work with RPA developers to see if things can be automated\r\n- Project manage internal process improvements\r\n- Coordinate with RPA developers (e.g. for tasks like Google Workspace account creation, DNS setup, data entry, etc.)\r\n- Collaborate with virtual assistants to implement processes\r\n- Set up and optimise task/project management tools\n\r\nYou must have:\n\r\n- Proven experience in operations or project management (agency or SaaS experience is a bonus)\r\n- Ability to create clear SOPs and manage remote teams\r\n- Familiarity with RPA or experience working with RPA developers\r\n- Comfortable with tools like Google Workspace, Zapier, Make, Asana, etc.\r\n- Highly organised, reliable, and solutions-focused\n\r\nNice to have:\n\r\n- Knowledge of DNS, email deliverability, Google Workspace admin\r\n -Experience in a startup or fast-paced remote environment\r\n- Understanding of SaaS, onboarding workflows, or marketing automations",
  "skill_requirements": [
    "Bpo Operations Management",
    "Robotic Process Automation",
    "Operation Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:35:26.964019",
      "reason": "Job first discovered"
    }
  ]
}