{
  "job_id": "1422150",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Virtual-Assistant-MS-Office-Admin-Support-1422150",
  "scraped_at": "2025-07-15T12:27:42.883416",
  "title": "Executive Virtual Assistant – MS Office + Admin Support",
  "type_of_work": "Part Time",
  "salary": "$120 - $240+ per month",
  "hours_per_week": "10",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hi there! \n\r\nI’m looking for a hard-working, trustworthy, and detail-obsessed Virtual Assistant to join my team and help bring my growing business to the next level. This is a long-term opportunity for someone who is ready to commit, grow with us, and show up every day ready to work with excellence.\n\r\nWe move quickly, care deeply about quality, and value people who take ownership of their work. My team is small but mighty, and I treat my VAs with real respect—we’re in this together. All of my teaUpgrade to see actual infombers have stayed with me for years, and I’d love for you to be one of them. I am building something new and looking for new partners to build with me.\n\r\nOutcome:\r\nCreate stunning, professional Microsoft PowerPoint presentations and provide ongoing executive support to ensure that our operations run smoothly and efficiently—so I can focus on serving clients and growing the company.\n\r\nResponsibilities:\r\n• Build and format PowerPoint slide decks with clean, high-end visual design\r\n• Build and maintain branded templates, icon libraries, and slide formats\r\n• Manage my calendar, meetings, and task follow-ups\r\n• Provide administrative support: document prep, research, inbox triage\r\n• Organize files and update project folders in OneDrive/SharePoint\r\n• Support in creating SOPs and internal templates for team use\n\r\nYou’ll Be a Great Fit If:\r\n• You’re an expert in Microsoft Office (PowerPoint, Outlook, Word, Excel)\r\n• You have excellent formatting skills and care deeply about presentation quality\r\n• You love creating structure and clarity for others\r\n• You’re incredibly reliable and take pride in delivering great work on time\r\n• You thrive with clear expectations, love a good checklist, and move fast\r\n• You want to be part of a long-term team, not just take on freelance gigs\r\n• Experience using AI tools like ChatGPT to improve productivity is a big plus\n\r\nWhat’s In It for You:\r\n• Competitive pay\r\n• Respect, flexibility, and growth opportunities\r\n• Stable, long-term work where you’re appreciated\r\n• A boss who values your time and talents\r\n• Plenty of exciting and varied work ahead!\n\r\nHow to Apply:\r\nFill out the application form here: Upgrade to see actual info \n\r\nYou’ll be asked to submit:\r\n• A resume\r\n• A short 2–3 minute video introducing yourself\r\n• Your Facebook Messenger User ID\r\n• An inspirational quote that makes you smile \r\n• When asked “What is your favorite breakfast food?” put the response: facebook\n\r\nLet’s build something great together.\r\n— Aaron",
  "skill_requirements": [
    "Microsoft Excel",
    "Microsoft Power Point",
    "Microsoft Outlook"
  ],
  "is_active": true,
  "status_history": []
}