{
  "job_id": "1422225",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Creative-Video-Editorgraphic-designer-plus-AI-generation-1422225",
  "scraped_at": "2025-07-15T13:31:55.531954",
  "title": "Creative Video Editor/graphic designer – (plus AI generation)",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Are you a creative visual storyteller with a strong eye for detail and a passion for short-form video and digital innovation?\n\r\nDharma Bums is looking for a Graphic Design Assistant who excels at video editing and is excited about the creative potential of AI-generated visuals in fashion.\n\r\nWe’re a purpose-driven Australian activewear brand dedicated to mindful movement, sustainable production, and ethical fashion. As we expand globally, we’re growing our creative team with people who share our values and love what they do.\n\r\nWhat You’ll Be Doing\r\nYou’ll support our design and marketing teams in creating compelling content across video, digital design, and AI visuals. The main focus of this role is short-form video editing and AI-driven creative work.\n\r\n- Video Editing (Primary Focus)\r\n- Edit short-form content (10–30 seconds) for Instagram Reels, TikTok, social ads, and web\r\n- Work with studio shoot footage, campaign content, and UGC\r\n- Apply colour correction, sound/music, and motion transitions\r\n- Create clean, high-quality edits with dynamic pacing that aligns with our brand identity\r\n- AI Visual Content Creation (Key Area of Growth)\r\n- Use AI tools such as Midjourney, DALL·E, or Runway to generate campaign-style visuals\r\n- Produce lifestyle or product-based imagery that fits our brand aesthetic\r\n- This is optional but encouraged—training will be provided for the right candidate\r\n- Additional Creative Support (Occasionally)\r\n- Design static graphics like website banners, social media assets, or event visuals\r\n- Assist with photo editing and retouching for eCommerce or campaigns\r\n- Contribute to campaign rollouts and marketing content development\n\r\nWhat We’re Looking For:\r\n- Experience with Adobe Premiere Pro and Photoshop (Illustrator is a bonus)\r\n- Solid understanding of visual storytelling, video pacing, and content creation for social media\r\n- Strong interest or some experience with AI image generation tools\r\n- A good level of written and spoken English to communicate effectively with our team\r\n- A strong eye for fashion aesthetics and digital branding\r\n- Ability to manage tasks independently, take feedback constructively, and meet deadlines\r\n- Alignment with Dharma Bums' sustainable and ethical values\n\r\nWhy Work With Dharma Bums:\r\n- Join a conscious fashion brand making a real impact\r\n- Work in a creative, collaborative, and forward-thinking environment\r\n- Remote flexibility and the opportunity to grow in a modern creative role\r\n- Gain experience in AI design, digital fashion, and global brand storytelling\r\n- Be part of a tight-knit team that values innovation, authenticity, and sustainability\n\r\nHow to Apply\r\nTo apply, send your CV and portfolio (including examples of video editing and/or AI visuals) to:\n\nUpgrade to see actual info\r\nSubject line: Graphic Design Assistant Application – [Your Name]\n\r\nShortlisted applicants will be invited to complete a creative task to demonstrate their skills.",
  "skill_requirements": [
    "Photoshop",
    "Video Editing",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": []
}