{
  "job_id": "1422257",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Media-Buyer-Ad-Specialist-1422257",
  "scraped_at": "2025-07-14T23:12:14.770968",
  "title": "Media Buyer - Ad Specialist",
  "type_of_work": "Full Time",
  "salary": "2000/m",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "ECL Marketing is a fast-growing performance-based agency helping auto detailers, ceramic coating specialists, and dealerships scale with Facebook Ads, Google Ads, and AI automation systems. We guarantee our clients 75+ leads/month or we work for free — which means our media buyers are a critical part of our success.\n\r\nWe’re looking for a highly skilled, proactive, and results-driven media buyer who also has experience editing video ads. You’ll be handling Meta & Google Ads from strategy to publishing and optimization, making sure our clients get results (low CPLs, high conversions, and strong ROAS).\n\r\n?\n\r\nYour Role\r\n • Launch, monitor, and optimize Meta and Google Ad campaigns\r\n • Edit short-form video ads (B-roll + voiceover provided)\r\n • Research creative trends in the auto detailing industry\r\n • Create, test, and scale winning creatives and ad copy\r\n • Analyze ad performance and make data-backed decisions\r\n • Manage UTM tracking, events, and pixel setup\r\n • Collaborate with our internal Slack team and follow SOPs\r\n • Maintain client performance across multiple accounts\n\r\n?\n\r\nRequirements\r\n • 2+ years running Meta Ads (Facebook/Instagram)\r\n • 1+ year managing Google Ads campaigns\r\n • Strong video editing skills (CapCut, Adobe Premiere, etc.)\r\n • Proven track record of low CPL campaigns and high ROAS\r\n • Strategic thinker – can adapt creatives based on data\r\n • Familiarity with tracking, retargeting, lookalike audiences, custom audiences\r\n • Fluent in English (verbal and written)\r\n • Must be available for 40 hours/week (during Pacific Standard Timezone) \r\n • Must follow directions, SOPs, and communicate inside Slack\r\n • Must have a reliable internet connection and working computer\n\r\nNice To Have (Not Required)\r\n • Experience in the auto detailing or local service niches\r\n • Familiarity with GoHighLevel, Meta, Google, Capcut\r\n • Can write ad copy and test multiple hooks and CTAs\r\n • Past experience in an agency setting\n\r\nWhy Join ECL?\r\n • Work with a performance-based team that actually delivers results\r\n • Access to SOPs, training, and proven systems\r\n • Consistent hours and long-term growth opportunity\r\n • Competitive compensation with performance incentives\r\n • Work on real client accounts — not just test projects\n\r\nHow To Apply\n\r\nPlease submit the following:\r\n 1. A short intro video explaining your experience\r\n 2. Portfolio or screenshots of ad campaigns you’ve worked on\r\n 3. Edited short-form video ads you’ve created\r\n 4. Resume and your OnlineJobs.ph profile link\r\n 5. Expected hourly rate (in PHP)",
  "skill_requirements": [
    "Google Ads",
    "Facebook Ads",
    "Media Buying"
  ]
}