{
  "job_id": "1422823",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Ecommerce-DTC-Video-Editor-1422823",
  "scraped_at": "2025-07-15T14:37:18.983799",
  "title": "Ecommerce DTC Video Editor",
  "type_of_work": "Part Time",
  "salary": "$400-2,000",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Looking for a creative and long-term video editor to produce high-quality creatives for our ecommerce brand. Focus on storytelling, pacing, and the style will range from organic UGC-style to more direct VSL-style editing.\n\r\n???? Key Responsibilities\r\n? Edit UGC & raw footage into engaging, high-converting direct response ads\r\n? Applying platform-native editing styles: fast-paced cuts, captions, and strong hooks\r\n? Collaborating with the creative team to iterate based on ad performance\n\r\n? Requirements\r\nExperience & Skills:\r\n? 1+ year editing videos for performance marketing\r\n? Portfolio of UGC-style or native platform video ads\r\n? Understanding of direct response principles: hooks, retention tactics, CTAs\r\n? Comfortable following briefs while contributing your own creative input\n\r\nSoftware Proficiency:\r\n? Strong in CapCut, Adobe Premiere Pro, or equivalent\r\n? Ability to edit efficiently and meet tight turnaround times\r\n? Familiarity with AI-driven tools (e.g., ElevenLabs, HeyGen, Kling) to streamline voiceovers & avatars\n\r\nBonus Experience (Preferred But Not Required):\r\n? Familiarity with VSL-style videos or longer-form ads\r\n? Understanding of creative testing, ad iterations, and using performance to guide iterations\n\r\n???? Pay Structure & Workload\r\nThis role will start as part-time, with an hourly workload based on available projects (typically 15–25 hours/week). If we’re a good fit and you deliver consistent, high-quality work, we’ll offer growth into a full-time position (40+ hours/week) with weekly deliverables, steady income, and higher bonuses.\n\r\nCompensation:\r\n? Up to $12/hour full-time based on experience & efficiency\r\nPerformance bonuses:\r\n? $50-150 bonus for ads that hit $1k-10k ad spend at 2.0+ ROAS\n\r\n???? How to Apply\r\nIf you're a performance-minded editor who knows how to make conversion-driven content, we'd love to work with you.\r\nTo apply:\r\n? Share your portfolio or link to relevant work\r\n? Include your expected salary for part-time (15-25 hours/week) & full-time (40+ hours/week)\r\n? List software & tools you’re proficient in\n\r\n? Important: Include the phrase “Almond” in your application so we know you read everything!",
  "skill_requirements": [
    "Video Editing",
    "CapCut"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:29:02.944146",
      "reason": "Job first discovered"
    }
  ]
}