{
  "job_id": "1422679",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Store-Builder-Virtual-Assistants-1422679",
  "scraped_at": "2025-07-15T15:35:33.949678",
  "title": "Shopify Store Builder Virtual Assistants",
  "type_of_work": "Full Time",
  "salary": "$800/mo",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking highly skilled Shopify Store Builder Virtual Assistants to join our growing team. This role is ideal for someone with significant hands-on experience building, designing, and optimizing Shopify stores from scratch. You will be responsible for setting up storefronts, importing products, designing pages, ensuring store compliance, and occasionally using tools like Canva and AI for design and custom coding support.\n\r\nYour Team When You Join Us\r\nAs a Shopify Store Builder, you’ll be part of our Growth Expansion team, focused on launching high-quality Shopify stores that are optimized for conversions and ready for scaling. You'll collaborate closely with our Growth Expansion Manager and other specialists to ensure each store meets both internal standards and external requirements (like Google Merchant Center approval).\n\r\nWe would love to hear from you if…\r\n- You have 4+ years of experience building Shopify stores from scratch or through complete redesigns\r\n- You have a strong understanding of Shopify themes, Liquid, and page builders\r\n- You have a familiarity with product importing and store configuration\r\n- You have a knowledge of e-commerce best practices, especially Google compliance\r\n- You have basic Canva skills for creating product and store visuals\r\n- You have attention to detail and a strong design sense\r\n- You have the ability to work independently and deliver high-quality results\r\n- You are comfortable using AI tools to support minor coding or design tasks\n\r\nCouple of the notes about the role\r\n- This is not a salaried position. This is an Independent Contractor role.\r\n- You must be able to commit at least 8 hours per day, 40 hours per week.\r\n- We require everybody in the team to use Hubstaff (Upgrade to see actual info) to track hours worked.\n\r\nCompensation - EUR 4.7 ($5) per hour\n\r\nInterview process: initial screening > Test Gorilla assessment > HR interview > trial task > offer\n\r\nTo apply, please email your resume and cover letter detailing your similar experience to Upgrade to see actual info",
  "skill_requirements": [
    "Shopify"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:26:54.432370",
      "reason": "Job first discovered"
    }
  ]
}