{
  "job_id": "1422711",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-SupportScheduling-Assistant-1422711",
  "scraped_at": "2025-07-15T12:27:24.606514",
  "title": "Customer Support/Scheduling Assistant",
  "type_of_work": "Full Time",
  "salary": "$300 - $500 CAD",
  "hours_per_week": "35",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Virtual Assistant – Customer Support & Scheduling for a Cleaning Company in Canada (Remote)\r\nWe're a fast-growing residential and commercial cleaning company based in Edmonton, Alberta, and we’re looking for a highly organized and professional Virtual Assistant to join our team.\n\r\nResponsibilities Include:\r\n- Customer Support & Scheduling\r\n- Responding to client inquiries through phone, text, email, and social media\r\n- Scheduling cleaning appointments, reschedules, and cancellations\r\n- Sending confirmations and reminders to clients\r\n- Communicating with cleaning staff to coordinate job assignments and updates\r\n- Maintaining daily cleaning calendar and ensuring all jobs are properly staffed\n\r\nClient Communication\r\n- Providing friendly, timely, and professional customer service\r\n- Following up with past clients for feedback or rebooking\r\n- Responding to inquiries from our website, Instagram, Facebook, and Google Business profile\n\r\nVirtual Assistant Tasks\r\n- Managing inboxes and calendars\r\n- Entering job and client details into our CRM or booking software\r\n- Assisting with light admin tasks or other team follow-ups\n\r\nRequired Skills/Tools\r\n- Excellent spoken and written English\r\n- Experience in customer service, scheduling, or administrative roles\r\n- Strong organizational and time management skills\r\n- Comfortable with tools like Google Calendar, Gmail, Excel, or CRM software\n\r\nBonus: Familiarity with cleaning industry or field service software (like Jobber, BookingKoala))\n\r\nPosition Details:\r\n- Remote (work from anywhere)\r\n- Full-time availability (workload is on average 1-5 calls/texts per day)\r\n- Must be available during business hours (Mountain Time)\r\n-$300 - $500 CAD\n\r\nPlease note that this is a newly established company, and as such, the current workload is quite minimal. There may be days when no tasks are required at all. While the position is listed as full-time, the volume of work does not currently reflect a traditional full-time role, and the compensation has been adjusted accordingly.\n\r\nThis role is intended to transition my day-to-day responsibilities so I can focus more on business development. Typical daily tasks include communicating with 1–5 clients via text (and occasionally by phone), using pre-written scripts that can be copied and pasted.\n\r\nPlease share your resume, relevant experience, and a short video or voice note introduction (optional but appreciated). We’re looking for someone reliable, proactive, and friendly—who can grow with us as the company expands.",
  "skill_requirements": [
    "Customer Support",
    "Communication",
    "Scheduling"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:36:18.485994",
      "reason": "Job first discovered"
    }
  ]
}