{
  "job_id": "1422256",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Canva-Template-Designer-1422256",
  "scraped_at": "2025-07-15T13:43:58.357866",
  "title": "Canva Template Designer",
  "type_of_work": "Part Time",
  "salary": "$450",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "I'm looking for a talented and detail-oriented Canva template designer to join my team.\n\r\nThe primary responsibility will be to design printables templates such as planners, worksheets, checklists, activity pages, etc. for my Printables and More Club business. The printables are for both adults and children.\n\r\nPrintables and More Club is a membership that helps business owners harness the power of printables for growing their lists, building their stores, and creating multiple streams of revenue. I also have a Shopify shop where I sell commercial use printables.\n\r\nEvery month, our members get 15 Canva template printables that they can sell or give away.\n\r\nI'm looking for someone with a strong sense of creativity, an eye for design, and the ability to create unique templates in various styles. The person will be responsible for designing monthly templates that meet our subscribers' needs, following specific design directions, and meeting deadlines.\n\r\nWe give the designer links to products that are somewhat similar to what we want, but these should be used for inspiration only. The style and design should be unique.\n\r\nIf you would like to see the types of printables we make for the Printables and More Club, feel free to check out the shop at Upgrade to see actual info.\n\r\nIn your application, please tell me what your favorite Canva feature is and include a link to your portfolio showing templates you've created.\n\r\nIdeal candidate will have:\r\n-Conversational English skills\r\n-Your own computer\r\n-Good internet connection\r\n-Quiet workspace",
  "skill_requirements": [
    "Graphic Design",
    "Canva"
  ],
  "is_active": true,
  "status_history": []
}