{
  "job_id": "1422406",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Lister-Dropshipping-Long-term-Position-1422406",
  "scraped_at": "2025-07-15T15:29:19.179012",
  "title": "Shopify Lister – Dropshipping (Long-term Position)",
  "type_of_work": "Any",
  "salary": "$3-5 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Dear,\r\nFor our dropshipping business, we aim to reach new heights this year. To achieve this, we are looking for an experienced and highly skilled Shopify Lister with a strong background in Shopify dropshipping to join our new team. \n\r\nThis is a long-term position.A thorough understanding of the entire process and strong communication skills are essential. To demonstrate that you have read this job posting carefully, please start your application with the word \"Shopify\" before introducing yourself.\n\r\nBelow, you will find details about the responsibilities and the required experience for this role.\n\r\nApplication Questions:\r\nIf you are interested in this position, please answer the following questions in your response:\r\nDo you have experience working with Shopify?\r\nDo you have experience preparing products for advertising?\r\nDo you have experience with Trello, Upgrade to see actual info and Notion?\r\nHave you used Upgrade to see actual info for communication?\r\nAre you available for 6-8 hours per day, 5-6 days a week?\n\r\nRequirements:\r\nAs a Shopify Lister, you must have:\r\nExperience with Shopify (must-have)\r\nStrong communication skills (must-have)\r\nExperience with tools like Adspy, Ecomhunt (preferred)\r\nPrevious experience in product research (preferred)\r\nExperience with workflow tools like Trello, Upgrade to see actual info, Notion(must-have)\r\nExperience with communication platforms like Upgrade to see actual info (must-have)\n\r\nIf you do not meet these requirements, please do not apply.\n\r\nResponsibilities:\r\nPreparing products for launch on our social media platforms (Atleast 5 per day)\r\nCommunicating and coordinating with teaUpgrade to see actual infombers involved in the process\r\nMonitoring progress and ensuring there are no delays\r\nUpdating Google Sheets with product details and following given instructions\n\n\n\r\nWhat We Offer:\r\nClear workflow instructions for every step of the process\r\nCareer growth opportunities within the team\r\nVideo training / a whole notion document to support your onboarding and development\n\r\nIf you believe you are the right fit for this role and can contribute to our company, please respond to this post.\r\nBest regards,\r\nMichèle",
  "skill_requirements": [
    "Shopify",
    "Communication",
    "Product Listing"
  ],
  "is_active": true,
  "status_history": []
}