{
  "job_id": "1422645",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Brand-Research-Strategy-Analyst-Brand-Direct-Division-1422645",
  "scraped_at": "2025-07-15T14:25:48.861318",
  "title": "Brand Research & Strategy Analyst (Brand Direct Division)",
  "type_of_work": "Full Time",
  "salary": "1,200 USD/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us:\r\nWe are a fast-scaling marketplace partners business dedicated to building long-term, value-driven partnerships with brands across major marketplaces. We help brands grow by improving their listing quality, distribution control, and marketplace performance through our Brand Direct initiative.\n\r\nAs we continue expanding, we are looking for a highly detail-oriented and strategic teaUpgrade to see actual infomber to join us in a vital role focused on analyzing brands before meetings, identifying strengths and weaknesses, and preparing deep insights that support our outreach and partnership process.\n\r\nRole Summary:\r\nAs a Brand Research & Strategy Analyst, you will be responsible for preparing comprehensive pre-call brand analyses, helping us make informed decisions and present ourselves professionally to potential partners. You will evaluate brands’ marketplace performance, listing quality, distribution consistency, and overall presence across platforms like Amazon, Walmart, and more. You will work closely with our outreach and leadership teams to ensure every brand call is driven by insights and backed with data.\n\r\nResponsibilities:\r\n- Conduct full pre-call research on brands that respond positively to our outreach\r\n- Use tools like SmartScout, Keepa, and LinkedIn to gather performance insights\r\n- Evaluate product listings, advertising activity, and distribution gaps\r\n- Identify opportunities for improvement in listings, brand control, and channel expansion\r\n- Document listing weaknesses (e.g. missing A+ content, poor titles, lack of ad support)\r\n- Assess marketplace presence across Amazon, Walmart, and other DTC platforms\r\n- Research decision-makers and note any relevant company background\r\n- Create clear, organized brand analysis reports in our Google Sheets framework\r\n- Maintain an updated log of your research and track follow-up tasks\r\n- Work with the brand outreach team to align value propositions before every call\r\n- Continuously improve the internal brand scorecard and analysis framework\r\n- Provide summaries that help guide the tone, content, and focus of our partnership discussions\n\r\nYou’re a great fit if you:\r\n- Are extremely detail-oriented and love organizing data\r\n- Have excellent research skills and know how to draw conclusions from limited public data\r\n- Are familiar with Amazon or other marketplace platforms (SmartScout, Keepa, Helium10 is a plus)\r\n- Can write in clear, professional English\r\n- Are naturally curious and solution-oriented\r\n- Can work with minimal supervision and take initiative\r\n- Understand how to think strategically about brand performance\r\n- Are comfortable using Google Sheets and productivity tools like Notion, Slack, or HubSpot\n\r\nWhy Join Us?\r\n- Work directly with a fast-growing founder-led company\r\n- Opportunity to grow into a leadership role within Brand Strategy or Brand Partnerships\r\n- Supportive team culture with room for creative input\r\n- Performance-based growth opportunities\r\n- Long-term commitment with stability and respect\n\r\nTo Apply:\r\nPlease send us the following:\r\n- Resume\r\n- Enter Brand Direct When Applying",
  "skill_requirements": [
    "Amazon",
    "Seller Central",
    "Brand Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:30:45.788503",
      "reason": "Job first discovered"
    }
  ]
}