{
  "job_id": "1422266",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-Real-Estate-1422266",
  "scraped_at": "2025-07-15T12:27:49.983564",
  "title": "Virtual Assistant (Real Estate)",
  "type_of_work": "Full Time",
  "salary": "$980–$1,345 CAD/month",
  "hours_per_week": "8",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Virtual Assistant (Real Estate) – Work from Home | Philippines-Based\r\n Support a Top Realtor in Canada | Full-Time | Long-Term Role\n\r\nAre you a highly organized and proactive Virtual Assistant with experience in real estate support? Do you thrive in fast-paced environments, love working with systems, and take pride in staying ahead of the curve?\n\r\nOne of Canada’s top-performing Realtors is looking for a smart, driven, and detail-oriented Virtual Assistant based in the Philippines to join her remote team and play a critical role in managing daily operations.\n\r\n**Bonus: The Realtor is also Filipino and speaks the same language—making communication smooth and helping you feel right at home within the team.\n\r\nResponsibilities:\r\nClient Relationship Management:\r\n- Manage and update CRM with new leads, follow-ups, and client notes\r\n- Contact warm and cold leads via email, text, or phone\r\n- Track lead activity and follow-up cycles\n\r\nCommunication & Inquiries:\r\n- Handle initial client inquiries with professionalism and care\r\n- Email management – organize inbox, flag priority messages, and draft replies\n\r\nScheduling & Organization:\r\n- Manage and maintain the Realtor’s calendar and appointments\r\n- Coordinate showings, client calls, and teaUpgrade to see actual infoetings\r\n- Send reminders and ensure nothing falls through the cracks\n\r\nMarketing & Admin Support:\r\n- Assist in posting or scheduling content on social media (FB/IG)\r\n- Help with listing coordination (e.g., gather property info, input into MLS or listing systems)\r\n- Prepare simple reports or lead summaries weekly\r\n- Creating designs in Canva (templates will be provided)\n\r\nRequirements:\r\n- 2+ years experience as a Virtual Assistant (real estate VA experience strongly preferred)\r\n- Strong English communication skills (verbal & written)\r\n- Familiar with tools like CRM software (KVCore), Google Workspace, Google Calendar and/or Calendly\r\n- Highly organized, detail-oriented, and responsive\r\n- Comfortable working under pressure and prioritizing multiple tasks\r\n- Tech-savvy and quick to learn new systems\n\r\nWorking Hours:\r\n- Full-time, long-term role\r\n- Must be available to work Canadian business hours (PST)\n\r\nWhat We’re Looking For:\r\n- Someone who’s resourceful, reliable, and takes initiative\r\n- A fast learner who can thrive in a high-energy, fast-moving real estate environment\r\n- A self-starter who doesn’t wait to be told what to do next\n\r\nCompensation & Perks:\r\n- Competitive monthly rate (commensurate with experience)\r\n- Year-End Bonus\r\n- Paid time off after 6 months\r\n- Opportunity to work closely with a top-tier, high-volume Realtor\r\n- Stable, long-term remote work with room for growth\n\r\nHow to Apply:\r\nPlease send your:\r\n1. Updated resume\r\n2. Please record a 3-minute (max) video introducing yourself and answering the following questions. \r\n   Video Questions:\r\n   1. Tell us about yourself\r\n      - Briefly introduce your background, experience as a Virtual Assistant, and what you're passionate about in your work.\n\r\n    2. Why are you interested in supporting a top-performing realtor?\r\n      - Share what excites you about the real estate industry, and what draws you to this specific opportunity.\n\r\n    3. What experience do you have with real estate tasks or supporting sales professionals?\r\n      - Mention any real estate-specific tools you’ve used (e.g. MLS, CRM platforms, scheduling software, listing sites, etc.), or tasks   you’ve handled like client communications, calendar management, listing coordination, etc.\n\r\n    4. How do you stay organized and manage competing priorities?\r\n    - Give a concrete example of a time when you successfully juggled multiple responsibilities.\n\r\n    5. How would you handle a high-pressure situation or an urgent task from your client?\r\n    - Share a relevant previous experience and how you were able to handle the situation\n\r\n4. Just to make sure you’re paying attention, when you apply, use this email subject line: “Super VA for Kate – [Your Full Name]”   (Yes, we’re watching)\r\nSend your application to: Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:33:09.103170",
      "reason": "Job first discovered"
    }
  ]
}