{
  "job_id": "1422059",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-1422059",
  "scraped_at": "2025-07-14T23:09:48.536938",
  "title": "Sales - OnlineJobs.ph",
  "type_of_work": "Full Time",
  "salary": "1000/3500",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Sales Professional Wanted: Off Leash K9 Training (Dog Training Company)\n\r\nAre you a highly skilled sales professional with a proven track record of exceptional sales skills?\n\r\nOff Leash K9 Training, a successful and rapidly growing dog training company is seeking a dedicated Sales Professional to take over our sales operations and drive continued growth.\n\r\nIn this role, you will be responsible for managingUpgrade to see actual infoleads per month, with the primary goal of closing our premium training packages, which typically range from $3,500 to $5,500. We are looking for an individual who embodies professionalism, possesses exceptional communication skills, and has a deep understanding of the sales process.\n\r\nKey Qualifications We're Looking For:\n\r\nExceptional English Fluency: You must be a 100% fluent English speaker with minimal to no noticeable accent.\n\r\nSales Specialization: This is not a general customer service role; we require an individual who is a sales specialist with a strong focus on closing high-value deals.\n\r\nProfessional Sales Training: Formal sales training is a must. We are looking for someone who understands and implements structured sales methodologies.\n\r\nExtensive Sales Experience: A minimum of 5+ years of professional sales experience is required, preferably in a role with a focus on high-ticket items or services.\n\r\nVerifiable Sales History: We require data demonstrating your sales performance, including closing ratios and historical sales achievements.\n\r\nVoice Recordings: To assess your fluency and communication style, please provide voice recordings of yourself.\n\r\nSales Recordings (Preferred): If available, recordings of actual sales calls would be highly beneficial to showcase your sales techniques and effectiveness.\n\r\nDog knowledge: You must at least own a dog and understand the very basics of dog behavior and be familiar with various common dog breeds. You do NOT need to know how to train a dog.\n\r\nThis is an exciting opportunity for a results-oriented individual to join a thriving company and make a significant impact. If you are a sales pro who thrives on closing deals and wants to be part of a team that transforms the lives of dogs and their owners, we encourage you to apply.\n\r\nThis is a commission-based Job with potential to earn up to 3500.00 a Month.\n\r\nWe are only hiring individual professionals. Agency-type applicants WILL NOT BE CONSIDERED.\n\r\nTo apply, include “OLK9 SALES” in the subject line of your application to confirm that you’ve read the entire job description and can follow instructions with attention to detail.",
  "skill_requirements": [
    "Inbound Sales",
    "Communication",
    "Sales"
  ]
}