{
  "job_id": "1422708",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Commercial-countertop-estimator-1422708",
  "scraped_at": "2025-07-15T12:30:22.558589",
  "title": "Commercial countertop estimator",
  "type_of_work": "Full Time",
  "salary": "1200",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Summary:\r\nWe are looking for a detail-oriented and experienced Offshore Commercial Bid Estimator to assist in creating precise bids for commercial fabrication projects. The ideal candidate will have expertise in reading architectural plans, calculating material requirements, and estimating costs for specialty edges, cutouts, and custom labor. This remote role requires strong analytical skills, proficiency in industry-standard software, and the ability to work independently to deliver timely and accurate estimates.\r\nKey Responsibilities:\r\n•  Interpret Architectural Plans: Accurately read and analyze architectural drawings, blueprints, and specifications to identify fabrication requirements for commercial projects (e.g., countertops, cladding, or custom installations).\r\n•  Material Estimation: Determine the types and quantities of materials needed (e.g., granite, quartz, marble, or other surfaces) based on project specifications, including calculating square footage for each material.\r\n•  Specialty Edge and Cutout Calculations: Estimate linear footage for specialty edges (e.g., ogee, bullnose) and quantify cutouts (e.g., for sinks, fixtures, or custom features).\r\n•  Custom Labor Assessment: Identify and estimate labor requirements for custom fabrication tasks, including complex cuts, polishing, or unique installations, ensuring accurate cost projections.\r\n•  Cost Estimation: Prepare detailed cost estimates for materials, labor, and additional expenses (e.g., shipping, installation), ensuring bids are competitive and profitable.\r\n•  Collaborate Remotely: Work closely with the shop owner and team via email, video calls, or project management tools to clarify project details and ensure bid accuracy.\r\n•  Documentation: Maintain organized records of estimates, calculations, and supporting documents using tools like QuickBooks Online or Excel for seamless integration with our accounting processes.\r\n•  Stay Updated: Keep abreast of material costs, industry trends, and fabrication techniques to ensure bids reflect current market conditions.\r\nQualifications:\r\n•  Experience: Minimum of 2–3 years of experience in construction estimation, fabrication, or a related field, with a focus on commercial projects. Experience in stone fabrication or similar industries is highly preferred.\r\n•  Technical Skills:\r\n •  Proficient in reading and interpreting architectural plans and blueprints.\r\n •  Strong ability to calculate square footage, linear footage, and material quantities accurately.\r\n •  Familiarity with estimation software (e.g., PlanSwift, Bluebeam, or similar) and proficiency in Microsoft Excel or Google Sheets.\r\n •  Knowledge of QuickBooks Online is a plus for integrating estimates with financial tracking.\r\n•  Industry Knowledge: Understanding of fabrication materials (e.g., natural stone, engineered stone) and processes, including specialty edges, cutouts, and custom labor requirements.\r\n•  Analytical Skills: Exceptional attention to detail and ability to perform precise calculations to ensure accurate and competitive bids.\r\n•  Communication: Strong written and verbal communication skills in English to collaborate effectively with the U.S.-based team remotely.\r\n•  Time Management: Ability to work independently, meet deadlines, and handle multiple bid requests in a fast-paced environment.",
  "skill_requirements": [
    "Costing",
    "Estimate"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:36:16.667282",
      "reason": "Job first discovered"
    }
  ]
}