{
  "job_id": "1422511",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Graphic-Designer-1422511",
  "scraped_at": "2025-07-15T15:35:29.002615",
  "title": "Graphic Designer",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Responsibilities\r\nResponsible for creating and designing visual concepts that communicate complex information to our clients. You will work closely with our engineering team to develop and produce high-quality graphics, charts, renderings and figures that support our projects.\r\nDesign, develop and produce digital and print materials; Key projects include, but are not limited to identity standards, logos, newsletter, email marketing, trade show graphics, signage, event flyers, social media images, postcards and brochures\r\nEnsure consistency and maintain company's identity, brand integrity, and communication style across all creative efforts\r\nCreate content calendar\r\nCreate Blog posts\r\nDeliver forward-thinking, innovative creative solutions that also preserve the brand's overall look and feel\r\nRecreating, reformatting, and resizing existing advertisements and related campaign collateral\r\nDeveloping templates for company-wide use for flyers, newsletters, email marketing, etc.\r\nPerform ad hoc requests, projects, and special assignments from senior management\r\nDesign and layout engaging digital assets to be used on websites, social media, partner sites and platforms\r\nGraphic design on all media\r\nImage retouching\r\nIllustration skills\r\nCreative mindset to convert product features into visual design\r\nEditing and video/motion/animation/3D a plus\r\nKeen sense of successful design for Amazon and other marketplace programs (ebay, shopify, etc.)\n\n\r\nQualifications:\n\r\nExperience using Gmail, Google Calendar, Google Sheets, Google Docs and Good Slides.\r\nBachelor’s degree with a minimum of 5 years of specific experience in graphic design\r\nExperienced in brand guide development: mood boards, colorways, fonts, image do's/dont's, etc\r\nExpertise in Adobe Creative Cloud suite, including Photoshop, Illustrator, InDesign, and other industry-leading design tools.\r\nIntimate experience with contemporary design software and AI tools, such as Firefly, Mid Journey, Dream Studio, DALLE 2, etc.\r\nAbility to manage multiple projects and people simultaneously.\r\nPositive, problem solving attitude.\r\nTeam-oriented, ability to bring people together and organize/plan events.\r\nSkilled using Figma, Sketch and Invision is a plus                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:28:57.578129",
      "reason": "Job first discovered"
    }
  ]
}