{
  "job_id": "1422071",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422071",
  "scraped_at": "2025-07-14T23:09:02.571434",
  "title": "AI Workflow & Automation Specialist",
  "type_of_work": "Full Time",
  "salary": "$1,000–$1,500 USD/month",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Offshore Launch:\n\r\nOffshore Launch is on a mission to transform how small businesses scale.\n\r\nWe partner with service-based entrepreneurs to unlock growth through world-class offshore talent. Our remote teaUpgrade to see actual infombers—affectionately called Launchers—aren’t just assistants. They’re operators, problem-solvers, and culture-carriers who power companies behind the scenes.\n\r\nWe’re a people-first, excellence-driven agency that believes in stewardship: leaving every person and business better than we found them.\n\n\n\r\nWhy Join Offshore Launch?\n\r\nBe part of a purpose-driven team serving mission-led entrepreneurs.\r\nThrive in a remote, high-trust environment focused on ownership and growth.\r\nReceive competitive benefits, including HMO, PTO, paid development, and leadership pathways.\r\nJoin a values-based culture grounded in integrity, curiosity, and service.\n\n\r\nAbout the Role\n\r\nWe’re looking for a self-directed builder — someone who sees a messy, manual process and instinctively reaches for a faster, smarter way to solve it. As our AI Workflow & Automation Specialist, you’ll be responsible for designing, building, and maintaining internal and client-facing automations using low-code and no-code tools like Make, Zapier, GPT, Perplexity, OpenPipe, and more.\n\r\nYou’ll be at the frontier of how AI meets service delivery: helping us turn insight into execution, faster than ever before.\n\r\nThis isn’t a role for a traditional software engineer. You don’t need to know how to code — but you do need to know how to think. If you’re resourceful, relentless, and love figuring out how to make tools work together in ways they weren’t originally meant to, you’ll thrive here.\n\n\n\r\nWhat You’ll Do\n\r\nBuild AI-powered workflows using tools like Make, Zapier, OpenPipe, LangChain, GPT, and mor\r\nAutomate recurring internal processes to improve speed, visibility, and accuracy\r\nDevelop external-facing automations to help our clients scale faster and serve better\r\nBuild internal dashboards or toolkits that give visibility into data, status, or success metrics\r\nRapidly prototype, test, and refine new ideas — and document what works\r\nStay ahead of what’s possible in AI tooling and bring those ideas to life inside our systems\r\nCollaborate with our founder and operations team to turn insights into action — fast\n\n\r\nWhat We’re Looking For\n\r\nLoves building — You’ve created workflows or automations for yourself, your team, or your clients.\r\nLow-code native — You’ve used tools like Zapier, Make, Notion, Airtable, or similar — and you’re quick to learn others.\r\nAI fluent — You’ve played with GPT, Perplexity, Claude, or OpenAI’s APIs. You understand how to use LLMs in workflows.\r\nFast problem solver — You figure things out with limited instruction. You ask sharp questions. You ship.\r\nStructured thinker — You can visualize systems, break down logic, and explain your thinking clearly.\r\nDetail-oriented — You test your workflows. You spot edge cases. You clean up what you build.\r\nBonus: Experience building tools or automations for operations, staffing, or client service teams.\r\nExcellent written and spoken English — You must be able to document processes clearly, communicate ideas with precision, and participate in fast-paced discussions.\n\n\r\nCompensation & Benefits:\r\n- Competitive monthly compensation\r\n- Starts at $1,000–$1,500 USD/month, with potential to grow to $1,800–$2,000+ for top performers who demonstrate speed, ownership, and strong execution\r\n- Annual bonus equivalent to one month salary \r\n- Performance-based bonuses\r\n- Comprehensive HMO policy, including dependents (depending on location and local policy availability)\r\n- Annual continuing education budget to support professional development\n\n\r\nTo apply:  Upgrade to see actual info",
  "skill_requirements": [
    "Email Marketing"
  ]
}