{
  "job_id": "1422710",
  "url": "https://www.onlinejobs.ph/jobseekers/job/UXUI-Designer-to-create-Clickable-Prototypes-1422710",
  "scraped_at": "2025-07-15T12:32:32.173623",
  "title": "UX/UI Designer to create Clickable Prototypes",
  "type_of_work": "Any",
  "salary": "$6-$12 per hour",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "This is an exciting opportunity to partner with our Catholic group coaching company in a UI/UX capacity.\n\r\nAbout Our Company\r\nWe are a faith-based coaching organization dedicated to helping individuals grow in their spiritual journey and personal development through the lens of Catholic teachings. Our mission is to provide guidance, community, and resources that help people deepen their relationship with God while achieving their personal and professional goals.\n\r\nProject Overview\r\nWe're seeking a UX/UI designer to join our mission-driven team. We need someone who can build a elegantly simple prototype. This role offers the opportunity to make a meaningful impact by being at the beginning stages shaping a start-ups future. \n\r\nYour role: Become the artist of the company that leads the user to their magic Upgrade to see actual infont on the app. \n\r\nWhat We're Looking For\r\n1. High-Fidelity Feature Grabs that highlights key functionality so users and stakeholders instantly grasp product value. Commonly used on SaaS landing pages to zoom in on specific features. Example (Realm - scroll to \"Main Features\" section of landing page). \r\n2. User Personas that builds a shared understanding of the core user and their goals. A Living, breathing document to communicate to future teaUpgrade to see actual infombers, investors etc. \r\n3. User Flow: In-Class Experience that covers everything a user can do during a meeting e.g., listening, raising hand, and sending messages. Core to the product’s unique value proposition.  \r\n4. 1-Page UX Documentation that captures rationale behind design decisions—can be useful for investor conversations and aligning future collaborators. \r\n5. Clickable Prototype of In-Class User Flow that demonstrates a key slice of the user experience for pitching, feedback, or early testing. \r\n6. Figma design file   \n\r\nWhat We Offer\r\nCollaborative partnership with a mission-driven organization\r\nOpportunity to contribute to meaningful work that impacts lives\r\nFair compensation for quality work\r\nFlexibility in timeline and communication\r\nClear brand direction and messaging guidelines\r\nSupportive team environment rooted in Catholic values\n\r\nNext Steps\r\nIf this opportunity resonates with you and aligns with your values and expertise, I would love to discuss the project further.\n\r\nPlease respond with:\r\n1. Links to previous example Clickable Prototype\r\n2. A video introduction giving me:\r\na) the background to one of the clickable prototypes, your method and the steps leading up to the results/lesson. how long did it take you? Mistakes?\r\nb) Your methodology/approach for a clickable prototype for a catholic therapy company\n\r\nIf it's a good fit, we can set up a time to talk and I'll share our brand guidelines with you. \n\r\nBlessings,\r\nJoe",
  "skill_requirements": [
    "Figma",
    "UI UX Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:46:42.938676",
      "reason": "Job first discovered"
    }
  ]
}