{
  "job_id": "1422666",
  "url": "https://www.onlinejobs.ph/jobseekers/job/GoHighLevel-Specialist-1422666",
  "scraped_at": "2025-07-15T12:24:14.886080",
  "title": "GoHighLevel Specialist",
  "type_of_work": "Full Time",
  "salary": "$1800 AUD",
  "hours_per_week": "38",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re looking for a highly skilled Virtual Assistant who is an expert in GoHighLevel to help us transition from a sub-account to a full agency account and build out automations, client funnels, AI agents, and integrations.\n\r\nYou’ll play a key role in setting up our white-labeled GoHighLevel agency platform and helping our clients get fully onboarded with automated systems. This is a hands-on, implementation-heavy role, perfect for someone who’s already familiar with the GoHighLevel ecosystem and enjoys building systems that scale.\n\r\nKey Responsibilities\r\nTransition & Setup\r\n- Migrate our current sub-account into a fully functioning GoHighLevel agency account.\r\n- Assist in white-label setup, including branding, domains, and system configurations.\r\n- Recreate or transfer all necessary assets (workflows, automations, pipelines, websites, calendars, triggers) from sub-account to agency templates.\n\r\nAutomation & Workflow Development\r\n-Build and customize automations, workflows, email/SMS campaigns, and funnel sequences for internal use and client accounts.\r\n- Implement AI agents (AI chat & SMS bots) inside client funnels and campaigns.\r\n- Set up calendar booking systems, pipelines, and nurturing sequences.\n\r\nClient Account Implementation\r\n- Set up new client sub-accounts within GoHighLevel.\r\n- Upload contact lists, set up custom fields, and configure tagging and segmentation.\r\n- Assist in building or cloning funnel pages and websites for client campaigns.\r\n- Apply templates to client accounts and ensure full configuration.\n\r\nIntegration Management\r\n- Set up Zapier integrations between GoHighLevel and other platforms (e.g., CRM, email platforms, form tools).\r\n- Troubleshoot and test integrations to ensure smooth data flow and automation logic.\n\r\nOngoing Support & QA\r\n- Test and QA all automations and funnels before deployment.\r\n- Provide documentation or Loom video walkthroughs as needed.\r\n- Support any GoHighLevel-related tasks required by the operations or marketing teams.\n\r\nRequirements\r\n- Proven experience with GoHighLevel (minimum 1 year), including building workflows, automations, and funnels.\r\n- Experience setting up and managing agency-level GoHighLevel accounts is mandatory.\r\n- Knowledge of Zapier and setting up integrations across tools and systems.\r\n- Strong understanding of sales funnels, lead generation workflows, and contact management.\r\n- Experience with AI agents or chat/SMS automation\r\n- Tech-savvy, fast learner, and highly organized.\r\n- Excellent communication skills and fluent English.\n\r\nBonus Points If You Have\r\n- Experience with copywriting or building conversion-optimized funnels.\r\n- Understanding of sales pipelines for service-based businesses.\r\n- Skills in website design within GoHighLevel or using third-party builders.\r\n- Experience working with home service or local businesses.\n\r\nHow to Apply- Please include:\r\n- A short video introduction or Loom (optional but encouraged)\r\n- Links to GoHighLevel workflows or systems you’ve built\r\n- Brief summary of your GoHighLevel experience\r\n- Your availability and hourly rate",
  "skill_requirements": [
    "Marketing Automation",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:28:35.830260",
      "reason": "Job first discovered"
    }
  ]
}