{
  "job_id": "1422015",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Growth-Assistant-Needed-Help-Build-a-7-Figure-Agency-Part-Time-Fully-Remote-1422015",
  "scraped_at": "2025-07-14T23:07:40.830878",
  "title": "Growth Assistant Needed – Help Build a 7-Figure Agency (Part-Time, Fully Remote)",
  "type_of_work": "Part Time",
  "salary": "$400 - 800",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Position: Growth Assistant (Part-Time)\r\nLocation: Remote\r\nSchedule: Mon–Fri, 6:00 AM to 11:00 AM PST (4 hrs/day)\r\nStart Date: ASAP\n\r\nWho We Are\r\nWe’re Square 1 Group — a systems-driven marketing agency that helps service providers scale using real business infrastructure, not just “hacks and hustle.” Our team is small but elite. Everyone here is a builder, not a babysitter. If you need hand-holding, this ain’t it.\n\r\nWe’re growing fast and looking for a Growth Assistant who can keep up.\n\r\nWhat You’ll Be Doing\r\nMonitor and manage emails (Gmail)\r\nPrepare meeting notes and summaries\r\nManage recurring tasks and sprints in Asana\r\nCoordinate simple outreach tasks (email, Instagram, Facebook, Youtube)\r\nCreate and maintain simple SOPs\r\nPost prewritten content to platforms (YouTube, IG, blog)\r\nHelp manage lead tracking and reporting (Google Sheets)\r\nAssist with light hiring and screening processes\n\r\nWhat We’re Looking For\r\nOrganized and proactive — you don’t wait to be told what’s next\r\nComfortable using modern tools (Google Drive, Loom, Slack, Asana)\r\nSolid written communication skills in English\r\nAble to handle time-sensitive tasks with urgency\r\nTech-savvy with a bias toward figuring things out\r\nComfortable with systems, checklists, and taking ownership\n\r\nImportant Notes\r\nThis is a part-time, hourly role with the potential to grow into a full-time role for the right person\r\nTime is tracked using Time Doctor — manual time entries are not allowed\n\r\nTo Apply:\r\nSend an email to Upgrade to see actual info with the subject line:\r\n with the subject line: “I’m Your Growth Assistant [YOUR NAME] - Mango”\n\r\nPlease include\r\n1. Your CV\r\n2. Your MBTI personality type from Upgrade to see actual info (e.g., INFJ, ESTP)\r\n3. Answer the following in a Loom video:\r\nWhy do you want this role?\r\nWhat’s one system or tool you’ve used to make your work more efficient?\r\nDescribe a time when you messed up — how did you fix it?",
  "skill_requirements": [
    "Personal Assistant",
    "Executive Assistance",
    "Virtual Assistant"
  ]
}