{
  "job_id": "1422223",
  "url": "https://www.onlinejobs.ph/jobseekers/job/ASC-Coordinator-Remote-Full-Time-46hr-EST-Hours-1422223",
  "scraped_at": "2025-07-15T13:47:33.695615",
  "title": "ASC Coordinator – Remote | Full-Time | $4–$6/hr | EST Hours",
  "type_of_work": "Full Time",
  "salary": "$4-$6/hour",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are a physician-led specialty clinic looking for an experienced ASC Coordinator to join our remote team.\n\r\nThe ideal candidate must have hands-on experience handling prior authorizations and eligibility verification for outpatient procedures. Experience in specialties such as pain management, interventional procedures, or vascular care is highly preferred.\n\r\nResponsibilities:\r\nManage and obtain prior authorizations for outpatient procedures\r\nVerify insurance eligibility and benefits accurately and promptly\r\nCoordinate closely with surgery centers, providers, and patients to ensure timely scheduling\r\nWork with clinical, billing, and front desk teams to streamline workflow\r\nTrack and follow up on pending authorizations to avoid delays\n\r\nRequirements:\r\nMinimum 1 year of experience with ASC or outpatient procedure coordination\r\nDeep understanding of insurance requirements, authorization processes, and CPT codes\r\nFamiliarity with EMR systems (ECW experience is a plus)\r\nStrong attention to detail and ability to work independently\r\nExcellent written and verbal English communication skills\n\r\nSchedule & Pay:\r\nFull-time, 40 hours/week\r\nUS Eastern Time (EST) schedule\n\r\n$4–$6/hour, depending on experience and performance\n\r\nHow to Apply:\r\nSubmit your updated resume to Upgrade to see actual info\r\nInclude a short voice recording introducing yourself and describing your experience with prior authorizations for outpatient procedures",
  "skill_requirements": [
    "Attention to Detail",
    "Prior Authorization",
    "Team Collaboration"
  ],
  "is_active": true,
  "status_history": []
}