{
  "job_id": "1422233",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-for-UK-Construction-Company-Social-Media-Admin-Recruitment-1422233",
  "scraped_at": "2025-07-15T12:34:17.926032",
  "title": "Virtual Assistant for UK Construction Company (Social Media + Admin + Recruitment)",
  "type_of_work": "Part Time",
  "salary": "250",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Description\n\r\nWe are a UK-based construction company looking for a reliable and creative Virtual Assistant to support our daily business tasks — especially with social media, content creation, light admin work, and client communication.\n\r\nYou will help grow our online presence, save time for our team, and keep everything running smoothly behind the scenes.\r\nFull training is provided — we will teach you everything you need.\n\r\n?\n\r\nYour responsibilities will include:\n\r\nSocial Media Management (Instagram, Facebook & TikTok)\r\n • Create & schedule 2 daily posts (before/after photos, project updates)\r\n • Post 1 video daily (TikTok or Instagram Reels)\r\n • Write captions, use hashtags, and keep content clean and engaging\n\r\n Video Editing\r\n • Edit short clips with tools like CapCut, Canva, or InShot\r\n • Add transitions, text, subtitles or music when needed\n\r\n Blog Writing\r\n • Write 2–3 short blog posts per week for our website\r\n • Topics include painting tips, renovation advice, tools, materials, etc.\r\n • Blog content should be simple, helpful, and SEO-friendly\n\r\n Basic Recruitment Support\r\n • Post job ads (e.g. on Indeed, Facebook groups)\r\n • Search for subcontractors or day-rate workers\r\n • Collect basic details into a spreadsheet: name, rate, skills, location\n\r\nClient Follow-Up & Social Media Messages\r\n • Respond to client messages and comments on Instagram, Facebook, and TikTok\r\n • Use friendly, professional replies (we will provide examples)\r\n • Say things like “We’re happy to help with anything you need!”\r\n • Make sure no messages go unanswered and that clients feel taken care of",
  "skill_requirements": [
    "Copywriting",
    "Social Media Management",
    "Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:34:51.314516",
      "reason": "Job first discovered"
    }
  ]
}