{
  "job_id": "1422147",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Recruiter-Talent-Acquisition-Specialist-1422147",
  "scraped_at": "2025-07-15T12:28:27.507677",
  "title": "Senior Recruiter - Talent Acquisition Specialist",
  "type_of_work": "Gig",
  "salary": "$9-$13 hourly",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Title: Senior Recruiter - Talent Acquisition Specialist (Digital Marketing & Technical Roles)\r\nLocation: Philippines (Required) – Remote\r\nWorking Hours: Must be available for communication daily until at least 11:00 AM ET\r\nCompensation: $8 – $12 USD per hour (based on experience and quality)\r\nEmployment Type: Independent Contractor, On-Demand\r\nStart Date: Immediate\r\nExpected Commitment: Near full-time availability during current high-demand phase, with flexibility to scale hours as hiring needs fluctuate\r\nDuration: Long-term relationship\n\r\nAbout JRA\r\nJunk Removal Authority (JRA) is a US-based digital marketing agency specializing in websites, local SEO, and paid ad campaigns for the junk removal and waste management industry. Our team builds high-performance marketing sites, executes highly targeted SEO and Google Ads strategies, and delivers industry-specific expertise with a focus on measurable results.\n\r\nRole Overview\r\nWe’re seeking a Philippines-based, proactive, detail-oriented contract recruiter to help us hire exceptional candidates across marketing, operations, and technical roles. The ideal candidate will be experienced in outbound recruiting, skilled at sourcing passive candidates, and able to assess both skillset and culture fit through structured interviews and AI-augmented evaluation methods.\n\r\nThis recruiter must also be capable of recording interviews and providing clear, concise summaries of candidate strengths, weaknesses, communication style, and fit for the role.\n\r\nThis is an on-demand role with current high activity, so we’re looking for someone ready to jump in and contribute immediately.\n\r\nKey Responsibilities\r\nManage full-cycle recruiting: write job descriptions, source candidates, conduct screening interviews, and help with onboarding\r\nProactively reach out to candidates using LinkedIn, OnlineJobs.ph, job boards, and other platforms\r\nFocus on outbound recruiting—identifying and attracting passive talent (including those already employed)\r\nRecord candidate interviews and submit summaries that outline key strengths and concerns\r\nCoordinate hiring processes with team leads and leadership\r\nTrack applicants using spreadsheets, Asana, ClickUp, or similar systems\r\nUse AI tools to enhance sourcing, evaluation, and communication workflows\r\nRequired Skills & Qualifications\r\nMust be based in the Philippines\r\n3+ years of experience recruiting in marketing, tech, or digital agency environments\r\nStrong knowledge of digital marketing roles: SEO, Google Ads, WordPress, Account Management, etc.\r\nExperience recruiting candidates in the Philippines, Latin America, and the United States\r\nProven success in outbound recruiting and engaging passive candidates\r\nExcellent written and verbal English skills\r\nExperience with tools like Asana, ClickUp, LinkedIn, and applicant tracking systems\r\nFamiliarity with using AI tools to extend recruiting capabilities (sourcing, screening, communication)\r\nHighly organized and self-managed, with reliable follow-through\r\nAbility to adapt to changing needs and manage multiple open roles concurrently\r\nWhat We Offer\r\nFlexible working hours (outside of daily check-ins before 11am ET)\r\nCompetitive hourly pay based on skill and performance\r\nLong-term, stable contract with variable work volume depending on hiring needs\r\nOpportunity to work with a growing U.S.-based digital agency in a high-impact recruiting role\r\nHow to Apply\r\nTo apply, please send:\n\r\nYour resume\r\nA brief summary of roles you’ve filled and the regions you’ve recruited in\r\nYour hourly rate expectations\r\nYour availability (including your earliest start date)\r\nA detailed description of your outbound recruiting process, including:\r\nPlatforms you use\r\nHow you source passive candidates\r\nAny AI tools or systems that help you work efficiently\r\n???? Note: Applications without a clear explanation of outbound recruiting strategy will not be considered.",
  "skill_requirements": [
    "Candidate Sourcing",
    "Talent Acquisition",
    "Candidate Screening"
  ],
  "is_active": true,
  "status_history": []
}