{
  "job_id": "1422028",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Marketing-Manager-1422028",
  "scraped_at": "2025-07-14T23:09:26.531233",
  "title": "Social Media Marketing Manager",
  "type_of_work": "Full Time",
  "salary": "$6 - $7 / Hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "???? We're Hiring: Marketing Manager\n\r\nAre you a strategic marketer with a creative edge and a passion for digital innovation? We're looking for a Marketing Manager with extensive knowledge and hands-on experience in Marketing and Digital Marketing to lead and grow our brand presence across digital platforms.\n\r\nIf you're driven by results, thrive in fast-paced environments, and know how to turn insights into action — this role is for you.\n\r\n???? What You’ll Do:\n\r\n? Strategy & Planning\n\r\nDevelop and implement comprehensive digital and social media strategies aligned with business objectives.\r\nSet SMART goals (Specific, Measurable, Attainable, Realistic, Time-bound) on a quarterly and annual basis.\r\nConduct market research to understand audience behavior, trends, and platform opportunities.\r\nIdentify trending content formats, hashtags, and digital tools to enhance reach and engagement.\r\nRegularly audit current strategies, run A/B testing, and stay updated with the latest in digital marketing.\n\r\n? Content Creation & Campaign Management\n\r\nLead the planning and execution of high-performing content across multiple platforms.\r\nCollaborate with writers, designers, and internal teams to ensure cohesive brand messaging.\r\nOversee the creation of engaging visuals, posts, reels, videos, and stories.\r\nEnsure brand consistency, copyright compliance, and content optimization.\n\r\n? Community Engagement & Customer Interaction\n\r\nActively manage and engage with online communities across platforms.\r\nRespond to messages, inquiries, and comments in a timely and professional manner.\r\nMonitor and manage brand reputation, including spam prevention and crisis communication.\n\r\n? Paid Advertising & Growth Strategy\n\r\nPlan and manage targeted ad campaigns across platforms like Facebook, Instagram, Google, and more.\r\nConduct A/B testing, audience targeting, and ROI analysis to continuously optimize performance.\r\nTrack competitor activity and implement strategies to gain a competitive edge.\n\r\n? Analytics & Performance Tracking\n\r\nMonitor key performance metrics across all marketing channels.\r\nGenerate reports to assess success and areas for improvement.\r\nUse insights to adjust strategies and ensure campaigns deliver measurable results.\r\nAnalyze website traffic and user behavior to recommend enhancements.\n\r\n???? Job Requirements:\n\r\nExtensive knowledge and hands-on experience in Marketing and Digital Marketing (minimum 3–5 years preferred)\r\nStrong understanding of social media platforms, SEO/SEM, content strategy, and digital trends\r\nProven track record of managing successful paid advertising campaigns and community growth\r\nExperience with analytics tools such as Google Analytics, Meta Business Suite, and Ad Manager\r\nExcellent copywriting and communication skills\r\nProficient with design tools (e.g., Canva, Adobe Creative Suite)\r\nFamiliarity with AI tools and automation in marketing is a strong advantage\r\nStrong organizational and time management skills\r\nAbility to work independently and collaboratively in a team environment\n\r\n???? Benefits:\n\r\nPaid Time Off (PTO) - (Upon Reaching 6 Months)\r\nHoliday Pay - (Upon Reaching 6 Months)\r\nOngoing training and opportunities for professional development\r\nSupportive, innovative, and collaborative work culture\r\nOpportunity to lead and shape the company’s marketing direction                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": []
}