{
  "job_id": "1422982",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AI-Video-Editor-YouTube-Automation-Specialist-Faceless-AI-Generated-Content-1422982",
  "scraped_at": "2025-07-15T12:26:54.805461",
  "title": "AI Video Editor & YouTube Automation Specialist (Faceless & AI-Generated Content)",
  "type_of_work": "Any",
  "salary": "Negotiable",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re a fast-growing content agency building faceless YouTube channels and AI-powered media assets across YouTube, Amazon, and short-form platforms. We are looking for a creative, tech-savvy, and highly organized Video Editor + YouTube Manager who can take full ownership of the content pipeline—from AI video creation to scheduling and publishing across multiple platforms.\n\r\nYour Responsibilities\r\n- Take AI-generated scripts and turn them into engaging faceless videos using tools like RunwayML, Pika, Veo, CapCut, or similar.\r\n- Add voiceovers using ElevenLabs (or other AI TTS tools), add captions, visuals, stock footage, sound, and background music.\r\n- Edit both long-form content and YouTube Shorts.\r\n- Create and upload thumbnails (manual or AI-assisted).\r\n- Schedule and post content across YouTube, Instagram, TikTok, and other relevant platforms.\r\n- Automate parts of the workflow using tools like N8N, Zapier, or build your own AI agent to streamline repetitive tasks.\r\n- Optimize videos for YouTube SEO (titles, descriptions, hashtags, etc.).\r\n- Act as a channel manager—own the entire video lifecycle from idea to publishing.\n\r\nRequirements\r\n- Proven experience editing videos using AI tools like RunwayML, Pika Labs, CapCut, Veo, etc.\r\n- Strong understanding of faceless/automated YouTube content.\r\n- Comfortable working with AI voice and visual generation tools.\r\n- Familiar with YouTube Studio, posting schedules, content calendars, etc.\r\n- Ability to use or learn automation platforms (Zapier, N8N) to optimize and scale content delivery.\r\n- Excellent attention to detail and ability to follow English instructions.\n\r\nBonus Points\r\n- Experience building or using custom AI agents or bots to automate tasks.\r\n- Background in YouTube SEO or data-driven content optimization.\r\n- Thumbnail design or familiarity with tools like Canva, Photoshop, or Midjourney.\r\n- Experience managing multiple channels or clients.\n\r\nHow to Apply\r\nSend us:\r\n- 2 sample videos you’ve created using AI tools (include what tools you used).\r\n- A brief description of your workflow—especially if you’ve automated any parts of it.\r\n- Your resume/CV or portfolio link.\r\n- Your expected rate (hourly or per project basis).\r\n- Optional: Any automations or AI bots you’ve built (links, screenshots, code, etc.).\n\r\nThis role can evolve into a long-term position as our lead video automation specialist and channel manager. If you're someone who thrives at the intersection of creativity, automation, and YouTube growth, we’d love to hear from you.\n\r\nPlease complete the form:Upgrade to see actual info",
  "skill_requirements": [
    "Social Media Management",
    "Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:33:29.474449",
      "reason": "Job first discovered"
    }
  ]
}