{
  "job_id": "1422020",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-PH-Automotive-Dispatch-CRM-Parts-Labor-Research-Up-to-1000mo-1422020",
  "scraped_at": "2025-07-15T09:22:53.080107",
  "title": "???? Virtual Assistant (PH) – Automotive Dispatch, CRM, Parts & Labor Research – Up to $1,000/mo",
  "type_of_work": "Full Time",
  "salary": "$500–$1,000/mo (depending on performance)",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Attention to detail please\r\nDescription:\r\nWe are a fast-growing mobile mechanic company in the U.S. looking for a Virtual Assistant from the Philippines to help manage the entire backend of operations — from dispatching jobs to adding customers to our CRM, looking up parts, quoting labor times, and staying on top of daily tasks.\n\r\nYou must be confident, organized, and capable of running day-to-day backend processes with minimal oversight. If you can think like a manager, move fast, and solve problems, this is a serious long-term opportunity with up to $1,000/month in pay.\n\r\n???? THIS IS A SERIOUS POSITION\r\nTo apply, you must record yourself reading the script below and send the voice message via text to: ????Upgrade to see actual info????? SCRIPT TO READ (SEND AUDIO TOUpgrade to see actual info):\r\n\"Hi, my name is [Your Name] and I'm applying for the Virtual Assistant position with Mr. Mobile Mechanic. I have experience using ChatGPT, researching labor hours, and finding parts for different makes and models. I’m confident I can dispatch jobs, follow up with customers, and support the team. I’m reliable, quick to learn, and ready to help the business grow. Thank you for considering me.\"\n\r\nYour Core Responsibilities:\r\n? Dispatch mechanics to customer jobs via text/phone\r\n? Use ChatGPT and online tools to look up accurate labor times\r\n? Look up parts prices on RockAuto, AutoZone, Advance Auto, etc.\r\n? Build quotes combining parts + labor\r\n? Add new customers, quotes, and jobs into CRM (GoHighLevel or similar)\r\n? Track and update jobs in Google Sheets",
  "skill_requirements": [
    "Administrative Management",
    "Project Management",
    "Research"
  ],
  "is_active": true,
  "status_history": []
}