{
  "job_id": "1422742",
  "url": "https://www.onlinejobs.ph/jobseekers/job/VALORANT-YOUTUBER-EDITOR-1422742",
  "scraped_at": "2025-07-15T14:34:18.735160",
  "title": "VALORANT YOUTUBER EDITOR",
  "type_of_work": "Full Time",
  "salary": "39,000 php",
  "hours_per_week": "50",
  "date_updated": "Jul 15, 2025",
  "job_overview": "BEFORE YOU APPLY\r\nNO BASIC EDITING \r\n1. have fast efficiency on rotobrush/masking editing\r\n2. Do not apply if you have only basic editing/ and your portfolio is only tiktok shorts with ugc\r\n3. MUST PLAY VALORANT and understand the game fully to edit it\n\r\nAbout Us\n\r\nMaking a big splash in the valorant gaming scene to bring something fresh into the scene in terms of long form/short form\n\r\n- Key Responsibilities\n\r\n1. Gaming Montages & Highlights\r\n- edit valorant videos with perfect pacing, dramatic cuts, and spot-on Music Choice & audio sync. (Synced Shots , Synced & Smooth Transitions ,Build ups , masking/ transitions\r\n-Long-Form Gaming Content : Daily Produced Long Form Videos (this will test your ability to maintain Video Quality Consistency over time and the ability to meet deadlines)\n\n\r\n- Motion Graphics & Text Effects\n\r\n- Use Adobe Premiere Pro & After Effects to add motion tracked text , subtitles , create animations to visualize a script instead of adding boring B-roll footage.\r\n-[Choose gamer-appropriate fonts, set text anchor points perfectly, and animate text with smooth, professional transitions.\n\r\n- Gamer Instinct & Culture\n\r\n- plays games and has Gaming knowledge , and is able to research a game and understand it to cater to the niche of the client\r\n- Stay on top of the latest releases,, streamers, youtubers , content creators, and viral gaming trends—and weave relevant references into your edits.\n\r\n- Technical Polish\n\r\n* Apply natural, consistent color grades that enhance game visuals without over-saturating.\r\n* Balance audio levels: crisp game sound effects, clear commentary, and background music that matches the footage.\n\r\n- Collaboration & Delivery\n\r\nWork closely with me to see actual info: incorporate feedback, iterate quickly, and hit every deadline under pressure.\n\r\n- Qualifications / Requirements\n\r\n* Software Mastery: At least 3 years’ professional experience in **Adobe Premiere Pro** & **After Effects**.\r\n* Gaming Passion: You live and breathe games—able to anticipate what our audience wants to see next.\r\n* Detail-Oriented: Flawless typography, pixel-perfect text layers, and seamless motion graphic setups.\r\n* Deadline-Driven: Thrive in a fast-paced environment; deliver every project on time (or early).\r\n* Strong Communicator: Fluent in English (reading, writing, speaking) and responsive on Upgrade to see actual info during agreed hours.\r\n* Growth Mindset: Always learning new techniques, plugins, and trends to level up your craft.\r\n* Portfolio Required: Share reels or links showcasing your best gaming edits and montages. Shortlisted candidates will complete a paid trial.\r\n- Content Ownership: All work is company-owned; editors will not be credited on published videos.\n\r\n- What We Offer\n\r\n* 36,591.10 Philippine peso or 650 usd\r\n* Full-time remote schedule aligned with Philippine time zones (exact hours set upon hire).\r\n- Career advancement: Clear path to Senior Editor, Team Lead, or percentage profit owning per video\r\n* Community: Collaborate with a supportive international team of fellow gaming editors on Upgrade to see actual info.\n\r\n- How to Apply\n\r\nIf you’re a detail-obsessed gaming editor who never misses a beat and always chasing perfection , apply now with:\n\r\n1. Your resume/CV\r\n2. Links to your gaming montage reels or highlight edits & other types of edits\r\n3. A brief note on your favorite recent game and why it excites you\n\n\n\r\nQualified candidates will be invited to a short interview (Upgrade to see actual info) to further get to know the applicant and if passed to the next stage , complete a paid trial assignment. If you believe you have what it takes then we are eager to hear from you.\n\r\nUnlock your full potential",
  "skill_requirements": [
    "Social Media Video Editing",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:32:15.149251",
      "reason": "Job first discovered"
    }
  ]
}