{
  "job_id": "1422314",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422314",
  "scraped_at": "2025-07-14T23:08:56.338364",
  "title": "NOW HIRING: Full-Time Operations Manager",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for a highly organized and self-driven Operations Manager to help support,  run and grow a fast-paced service-based business. You’ll work directly with the owner to learn the full scope of the company and eventually train and manage new staff as we continue to scale. You must be confident managing a team, communicating throughout the day, and staying ahead of deadlines.\n\r\nYou’ll work closely with the owner to learn all aspects of the business and eventually train and manage new staff as the company continues to grow.\n\r\n?? This is a dedicated role — you must not be working with other companies or clients.\n\r\n???? Key Responsibilities:\r\n • Oversee daily team tasks and workflows\r\n • Delegate tasks, set priorities, and hold team accountable\r\n • Work directly with the owner to master systems, services, and team dynamics\r\n • Be prepared to train new teaUpgrade to see actual infombers as the business scales\r\n • Manage social media posting schedules & scout new content ideas\r\n • Respond to client inquiries and help with lead generation\r\n • Organize and update SOPs and training materials\r\n • Handle admin and customer service tasks as needed\r\n • Maintain strong daily communication with the business owner\n\r\n? Requirements:\r\n • Experience managing remote teams\r\n • Excellent written and spoken English (C1 fluency or higher)\r\n • Comfortable with systems, processes, and delegation\r\n • Must be available 8 hours/day, Monday–Friday, Some Weekends may be required. \r\n • Highly communicative, proactive, and organized\r\n • Not currently working with any other company\r\n • Tech-savvy, familiar with tools like GHL, Canva, or Zapier (preferred)\r\n • Open to learning new systems and taking initiative\n\r\nBenefits Available After 90 Days\n\r\nTo Apply: (Must Use 8 Points)\n\r\nUse the subject line: Your First Name (OpMeIn)\n\r\n 1. A short intro about your experience\r\n 2. Why you’re a good fit for this role\r\n 3. Your current availability and confirmation you’re not working elsewhere\r\n        4.    Date you are available to start\r\nApplicants who do not follow the above instructions will be automatically disqualified.",
  "skill_requirements": [
    "Marketing Analytics",
    "Office and Administration",
    "Operation Management"
  ]
}