{
  "job_id": "1422944",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Graphic-Designer-eCommerce-1422944",
  "scraped_at": "2025-07-15T14:31:00.618474",
  "title": "Graphic Designer (eCommerce)",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "This fast-growing marketing services company is on a mission to help B2B brands deliver high-performing campaigns through thoughtful design and automation. Their team combines creativity, technical expertise, and data to drive engagement, loyalty, and revenue for clients across industries.\n\r\nThey’re now expanding their creative team and looking for a Graphic Designer who can craft compelling visuals and support brand storytelling across multiple channels. If you're a detail-oriented designer who thrives in a fast-paced, collaborative environment — this role is for you.\n\r\nPerks and Benefits\n\r\n- Paid in USD with bi-monthly payouts (15th and 30th)\r\n- Up to 14 days paid time off annually (starting Day 1)\r\n- Paid time off for Philippine Regular Holidays (if applicable)\r\n- 100 percent remote – work from anywhere (Hybrid or in-office setup also possible)\r\n- Company-issued equipment and software support (if working onsite)\n\r\nWhat You’ll Do\n\r\n- Design flyers, catalogs, sell sheets, and other sales collateral materials for regional and national brands – always adhering to brand guidelines\r\n- Create engaging content for reseller platforms like Amazon – including infographics, image variations, and brand store visuals\r\n- Organize and manage creative assets to outsource and oversee deliverables such as renderings and videos\r\n- Collaborate with internal and external teams – including cross-functional partners and clients\r\n- Follow internal procedures and safety policies – using all designated tools and systems appropriately\n\r\nWhat We’re Looking For\n\r\n- Bachelor’s degree in Graphic Design, Marketing, or a related field\r\n- 3+ years of experience in design/marketing – or an exceptional portfolio that speaks for itself\r\n- High proficiency in Adobe Creative Cloud and Microsoft Office tools\r\n- Excellent communication and collaboration skills\r\n- Strong organizational skills and ability to juggle multiple projects under tight deadlines\r\n- Creative, flexible, and resilient – with a team-first attitude and a great sense of humor\r\n- Self-starter who takes ownership and drives projects forward independently\n\r\nBonus Points For\n\r\n- Experience with video rendering or oversight of outsourced creative deliverables\r\n- Familiarity with Amazon brand store requirements and design optimization for eCommerce platforms\r\n- Passion for branding and consistency across large-scale campaigns\n\r\nHow to Apply\n\r\nPlease submit the following:\r\n- Your resume\r\n- Your design portfolio – including relevant sales collateral and platform content\r\n- A 1–2 minute Loom video introducing yourself\r\n- Any case studies or performance metrics from past campaigns (if available)",
  "skill_requirements": [
    "Photoshop",
    "Graphic Design",
    "Ecommerce"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:40:37.224779",
      "reason": "Job first discovered"
    }
  ]
}