{
  "job_id": "1422117",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422117",
  "scraped_at": "2025-07-14T23:07:33.247253",
  "title": "HR Assistant",
  "type_of_work": "Full Time",
  "salary": "1000",
  "hours_per_week": "30",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Remote HR Assistant\n\n\r\nAbout Connected Health Care\r\nConnected Health Care is a top-rated U.S.-based healthcare staffing firm specializing in placing clinicians and allied professionals across the country. As we continue to grow, we are seeking a highly organized and proactive HR Assistant to work directly with our HR Manager in supporting our internal people operations.\n\n\r\nWhat You’ll Do\n\r\nYou’ll help keep our HR department organized, responsive, and effective by assisting with a wide range of day-to-day administrative responsibilities.\n\r\nKey Responsibilities:\n\r\nAssist the HR Manager with a variety of daily admin tasks and team communications\r\nMaintain and update internal HR documents, SOPs, and shared resources\r\nOrganize and track HR-related projects, deadlines, and recurring processes\r\nCoordinate calendar appointments, meetings, and reminders\r\nPerform light inbox management (e.g., flagging emails, drafting responses)\r\nHelp prepare HR memos, internal announcements, and onboarding materials\r\nUpdate and organize employee data in HR tools and spreadsheets\r\nConduct light research on HR vendors, policies, and best practices\r\nCreate simple reports or summaries from internal documentation as needed\r\nAssist with preparing presentations, checklists, and training templates\r\nMaintain confidentiality and discretion when handling sensitive information\n\r\nWho You Are\n\r\n1–2+ years of experience in HR support, admin assistance, or operations\r\nStrong written and spoken English communication\r\nDetail-oriented, responsive, and reliable\r\nProficiency with Microsoft Excel and experience using HRIS platforms (e.g., Rippling, Paycom, ADP)Familiar with (or quick to learn) HR systems and admin workflows\r\nPrevious Staffing Experience is a plus!\r\nSelf-starter with excellent follow-through and time management\r\nAble to work full-time during U.S. business hours (CST preferred)",
  "skill_requirements": [
    "Administrative Management",
    "HR Management",
    "Microsoft Excel"
  ]
}