{
  "job_id": "1422576",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Were-Hiring-Customer-Support-Specialist-at-NOVA-Agency-1422576",
  "scraped_at": "2025-07-15T14:31:57.192499",
  "title": "We're Hiring: Customer Support Specialist at NOVA Agency",
  "type_of_work": "Full Time",
  "salary": "$500-$700",
  "hours_per_week": "25",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Location: Remote\r\nPosition Type: Part-time to Full-time\r\nStart Date: ASAP\n\r\nAbout Us\n\r\nAt NOVA Agency, we provide exclusive access to high-level Meta, Google, and TikTok ad accounts that come with no spend limits and no risk of bans. Our clients include eCommerce brands, agencies, and media buyers who rely on us for smooth, uninterrupted advertising – and we make sure they get exactly that.\n\r\nWe’re looking for a motivated, detail-oriented, and responsive individual to join our team as a Customer Support Specialist. Please write the word Juice in your message sent to us. You’ll be the first point of contact for our clients and play a key role in helping them succeed with their ad accounts.\n\r\nWhat You’ll Do\n\r\nProvide fast, clear, and friendly support\r\nHelp clients with ad account questions, top-up instructions, and general guidance\r\nCoordinate with the internal team to resolve account-related issues quickly\r\nKeep communication structured and ensure no client is left waiting\r\nMaintain accurate client data and offer a smooth, professional experience\n\r\nRequirements\n\r\nFluent in English – both written and spoken\r\nStrong understanding of Meta advertising (Pro)\r\nHighly responsive, organised, and solution-driven\r\nAble to manage multiple conversations at once without losing quality\r\nQuick learner with a proactive mindset\r\nAble to work independently and take ownership of tasks\n\r\nWhat We Offer\n\r\n100% remote flexibility\r\nA professional but informal work culture\r\nClear growth opportunities within the company\r\nA supportive team that values speed, ownership, and trust\n\r\nWant to Join Us?\n\r\nSend us a message with your CV and a short intro about who you are and why you’re a fit for the role.\r\nWe’re excited to meet our next teaUpgrade to see actual infomber.\r\nNOVA Agency",
  "skill_requirements": [
    "Facebook Ads",
    "Customer Support"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:23:50.650931",
      "reason": "Job first discovered"
    }
  ]
}