{
  "job_id": "1422625",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Etsy-Rockstar-For-PoD-1422625",
  "scraped_at": "2025-07-15T12:23:16.282015",
  "title": "Etsy Rockstar For PoD",
  "type_of_work": "Part Time",
  "salary": "4.00 Hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Hey there! I am kicking off a fantastic new project and looking for a talented individual to jump in and help me make some serious waves. This is a quick-turnaround, 1-month opportunity to contribute to something really special.\n\r\nBut here's the best part: this isn't just a one-off gig! If you're a great fit, we see this as the beginning of a long-term partnership. We're offering a percentage of every sale – meaning the harder you work and the more successful the project, the more you earn!\n\r\nWe're looking for someone who's a Self-Starter, Intuitively Creative,  High Energy, Passionate, Honest, and ready to share in the rewards. Think you're the one? Send in your resume!\"\n\r\nYour Mission: Fuel Our Store's Growth!\n\r\nAs a key member of our team, you'll be the driving force behind expanding our product catalog and maximizing our reach. You'll be responsible for identifying hot new trends, bringing those ideas to life with stunning mockups, and crafting compelling product descriptions that capture attention.\n\r\nYou'll also play a vital role in ensuring our listings are easily discoverable by selecting the perfect tags and keywords, marketing on social platforms, and making sure everything looks fantastic! Essentially, you'll be instrumental in scaling our store to new heights.\n\n\n\r\nWe're looking for someone with:\n\r\n- A knack for visual design & creative artistic eye.\r\n- Proven experience creating successful product listings on Etsy.\r\n- Laser-like attention to detail – no detail is too small!\r\n- Exceptional writing skills to create engaging and persuasive copy.\r\n- A solid understanding of SEO principles to boost visibility.\r\n- Familiarity with the world of print-on-demand products.\r\n- And as we grow, other duties as assigned.\n\n\r\nDo you love Etsy/ecommerce and have a talent for crafting product listings that truly shine? We're looking for a creative partner to help us grow our store, and we'd be thrilled to hear from you!\n\n\n\r\nTo APPLY help us get to know you, please share:\n\r\nA few examples of your best Etsy listings and resume:  let your work speak for itself!\r\nA little bit of Aloha!: - include a fun clip art image to show your spirit!\r\nYour unique vision: Tell us why you are the perfect person to help us take our store to the next level. What makes you stand out?\n\r\n3 HOURS per day, Upgrade to see actual info HR ( subject to change in the first month, depending on your production and sales)\n\r\nAbout me: My Name is Maile, and I live in beautiful Hawaii, proudly embracing my Filipino heritage, and juggling a full-time job with the joys and challenges of family life. As a devoted 'Foster Fail Mom' to five amazing pups, I clearly have my hand full.  I am passionate about living your best life and genuinely dedicated to helping others do the same.  Are you the next person to join this team!?                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:25:49.540320",
      "reason": "Job first discovered"
    }
  ]
}