{
  "job_id": "1422515",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AI-Agent-Developer-n8n-makecom-for-Retail-Operations-1422515",
  "scraped_at": "2025-07-15T15:34:43.364721",
  "title": "AI Agent Developer (n8n, make.com) for Retail Operations",
  "type_of_work": "Full Time",
  "salary": "USD $2000-3000 per month",
  "hours_per_week": "50",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Build AI Systems That Power Modern Retail Operations\r\nWe’re a team of experienced retail founders and engineers building AI-powered systems that automate the complex, manual workflows holding retailers back from scaling efficiently. These are not chatbots, but intelligent agents that take real action: from fulfilment triage and order tracking to supplier coordination, return claims processing, and syncing data across platforms.\n\r\nWe’re already working with retailers across Australia, North America, and the UK - helping operations teams reduce manual workload, improve speed and accuracy, and scale without headcount. The value is clear and the demand is growing.\n\r\nAs founders, we’ve built retail businesses that have generated cumulatively over $500 million in revenue globally. We know the operational pain points from the inside - and we’re building AI systems to solve them at scale.\r\nWe’re looking for a capable and resourceful AI Agent Developer to help us continue delivering real impact.\n\r\nWhat You’ll Do\r\nYou’ll be responsible for designing, building, and refining intelligent AI agents that are deployed in real production environments with retailers. These agents aren’t experiments - they’re core to our clients’ day-to-day operations.\n\r\nYour responsibilities will include:\r\n- Building LLM-powered agents from OpenAI, Claude, and other AI model providers.\n\r\n- Designing automation workflows that connect to platforms like Shopify, Netsuite, Gorgias, Zendesk, and warehousing systems.\n\r\n- Automating browser-based workflows by intelligently navigating supplier or courier portals to retrieve or update data\n\r\n- Applying prompt engineering, retrieval techniques, and fine-tuning methods to improve accuracy and reliability\n\r\n- Translating messy operational problems into structured, scalable automation flows\n\r\n- Collaborating with the team to problem-solve edge cases, test new approaches, and continuously improve the product\n\r\nThis is a hands-on, fast-paced role where you’ll often be figuring things out for the first time. You’ll help shape what good looks like in a brand-new category of operational AI.\n\n\r\nTools You’ll Likely Work With\r\nYou don’t need to have used every tool, but you should be confident working across systems and learning new ones quickly. You’ll likely work with:\n\r\n- LLM APIs like those from OpenAI and Anthropic\n\r\n- Automation tools like n8n, Make, or code-based orchestrators\n\r\n- APIs and backend services (REST, GraphQL)\n\r\n- Platforms that Retail businesses use, such as Shopify, Netsuite, Zendesk, Gorgias, and warehousing systems.\n\r\n- Browser automation tools to interact with web-based portals\n\r\n- Python or JavaScript (preferred but not mandatory), and AWS for deployment and hosting\n\n\r\nWhat We’re Looking For\r\n- 2+ years building AI, automation, or systems integration projects\n\r\n- Familiarity with structured LLM interaction formats - such as OpenAI function calling or Model Context Protocol (MCP) (preferred but not mandatory)\n\r\n- Strong experience working with APIs, writing logic flows, and structuring data\n\r\n- Familiarity with prompt engineering and fine-tuning techniques\n\r\n- Comfortable breaking down ambiguous business problems into executable workflows\n\r\n- Clear communicator with practical judgment - able to explain decisions and trade-offs\n\r\n- Portfolio of past AI or automation work strongly preferred\n\r\n- Experience working for an eCommerce or Retail business (preferred but not mandatory)\n\n\r\nExample Work You Might Do Here\r\n- Build a fulfilment triage agent that reads dispatch reports, detects anomalies, and routes flagged orders for intervention\n\r\n- Deploy an agent that reads supplier-issued purchase orders and invoices, interprets their contents, and follows up for shipment updates via email or portal\n\r\n- Design an agent that processes customer return and damage claims, including interpreting form entries, reviewing attached photos, and applying internal decision rules\n\r\n- Build a browser automation workflow that logs into courier portals, checks for tracking updates, and syncs them to internal systems\n\n\r\nRole and Benefits\r\n- Location: Remote (Philippines or Vietnam based preferred)\n\r\n- Schedule: Full-time, async-friendly\n\r\n- Team: Work directly with founders and fellow technical teaUpgrade to see actual infombers\n\n\r\nCompensation & Opportunity:\n\r\n- Monthly salary: $2,000–$3,000 USD, depending on experience\n\r\n- Work directly with founders who have built and scaled multiple global retail businesses\n\r\n- Be part of a product that’s already delivering value to paying customers across Australia, North America, and the UK\n\r\n- Help shape a new category of applied AI for retail operations - this is early-stage, high-impact work\n\r\n- Gain deep exposure to how modern eCommerce, logistics, and ERP systems operate behind the scenes\n\r\n- Flexible, remote-first role with high autonomy and fast feedback loops\n\r\n- Opportunity to grow with the business as we scale our customer base and product offering\n\n\r\nHow to Apply\r\nPlease send:\r\n- A short note about why this role interests you\n\r\n- Links or explanations to past work (AI agents, automation flows, or system integrations you’ve built)\n\r\n- Your GitHub, portfolio site, or CV\n\r\nPlease No Agency applications. We are looking for individuals to join our team, not looking to contract an agency\n\r\nWe’re building executional AI systems that work behind the scenes to keep modern retail running smoothly. If you’re excited to be part of a team shaping how operations teams scale in the AI era, we’d love to meet you.",
  "skill_requirements": [
    "Javascript",
    "Python",
    "Robotic Process Automation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:26:12.085645",
      "reason": "Job first discovered"
    }
  ]
}