{
  "job_id": "1422601",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-Competition-Top-10-Advance-1422601",
  "scraped_at": "2025-07-15T12:25:37.678163",
  "title": "Virtual Assistant Competition – Top 10 Advance!",
  "type_of_work": "Full Time",
  "salary": "$3 - $8 / HR",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Virtual Assistant Competition – Top 10 Advance!\r\nReady to compete for a paid VA role with instant feedback on our live dashboard? Apply now—no experience needed!\n\r\nJob Description\r\nReady for a challenge? Join our Virtual Assistant Hiring Competition and show us what you’ve got!\n\r\nWe’re searching for motivated, organized individuals to support our real estate investment business. No prior experience is required—if you’re proactive, willing to learn, and love a little friendly competition, you could be exactly who we’re looking for.\n\r\nWhat makes our process different?\n\r\nIt’s a competition! You’ll complete a quick skills and logic challenge. \n\r\nInstant results: See your score and live ranking on our public leaderboard the Upgrade to see actual infont you submit.\n\r\nTop 10 applicants will be invited to a project-based interview.\n\r\nResponsibilities (if selected):\n\r\n- Gather and organize property lists from county sites\r\n- Track business metrics and update our CRM\r\n- Assist with transaction coordination and document review\r\n- Tag and label expenses in Excel or QuickBooks (or learn on the job)\r\n- Support general admin tasks (calendar, emails, scheduling)\n\r\nWhat we’re looking for:\n\r\n- Independent, problem-solving mindset\r\n- Attention to detail and organization\r\n- Strong communication skills (written and spoken English)\r\n- Excel or data skills are a plus—but not required!\r\n-Willingness to learn new tools and processes\n\r\nHow to Apply:\r\nClick the link below, complete the competition form, and see your results right away.\r\nTop 10 scorers will move on to the next round with a paid project task!\n\nUpgrade to see actual info\n\r\nJump in, have fun, and compete for your spot on our elite team. Good luck—we can’t wait to see how you do!",
  "skill_requirements": [
    "Microsoft Excel",
    "English",
    "Problem Solving"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:35:25.510209",
      "reason": "Job first discovered"
    }
  ]
}