{
  "job_id": "1422508",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Airbnb-Property-Research-Assistant-1422508",
  "scraped_at": "2025-07-15T12:35:34.994467",
  "title": "Airbnb Property Research Assistant",
  "type_of_work": "Part Time",
  "salary": "Usd $252/mo",
  "hours_per_week": "21",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for a detail-oriented and reliable Virtual Assistant to help identify profitable rental properties for Airbnb arbitrage. Your role will be to search for rental apartments, evaluate their short-term rental profitability using a provided tool or website, and contact landlords of only the most promising properties.\n\r\nResponsibilities:\r\nSearch Upgrade to see actual info for rental apartments in assigned cities/regions.\n\r\nEvaluate each property’s Airbnb potential using a specific website tool (we’ll provide training).\n\r\nDetermine if the property meets profitability criteria.\n\r\nSkip unqualified properties.\n\r\nFor qualified properties, send a message to the landlord using a provided template.\n\r\nLog each qualified property and message sent in a shared spreadsheet.\n\r\nRequirements:\r\nBasic understanding of Airbnb and rental property concepts (we’ll train you).\n\r\nReliable internet access and computer.\n\r\nAttention to detail and ability to follow step-by-step instructions.\n\r\nComfortable using Zillow and online evaluation tools.\n\r\nGood English writing and communication skills.\n\r\nPreferred (but not required):\r\nPrevious experience with Airbnb or real estate research.\n\r\nExperience with Google Sheets or Excel.\n\r\nCompensation:\r\nPay per hour or per qualified lead (negotiable based on experience).\n\r\nFlexible schedule — work from anywhere.\n\r\nPreferably 7 days a week, 3 hours per day.",
  "skill_requirements": [
    "Communication",
    "Data analysis",
    "Research"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:29:31.041149",
      "reason": "Job first discovered"
    }
  ]
}