{
  "job_id": "1422445",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Go-High-Level-Expert-Assistant-1422445",
  "scraped_at": "2025-07-15T14:32:42.763558",
  "title": "Go-High Level Expert / Assistant",
  "type_of_work": "Full Time",
  "salary": "700",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for an experienced Go High Level (GHL) expert to join our fast-growing marketing team. You’ll be responsible for setting up and maintaining client accounts, building automations, launching campaigns, and supporting general marketing tasks across multiple clients. This is a hands-on role perfect for someone who knows GHL inside out and thrives in a fast-paced, client-focused environment.\n\r\n-Responsibilities:\n\r\nSet up and manage Go High Level sub-accounts for new clients\r\nBuild and optimize automation workflows (SMS, email, pipelines, triggers, etc.)\r\nCreate and launch marketing campaigns using GHL tools\r\nIntegrate GHL with third-party tools and CRMs as needed\r\nTroubleshoot GHL issues and ensure smooth operation across client accounts\r\nMaintain and document SOPs for recurring tasks and client onboarding\r\nAssist in building funnels, forms, calendars, and appointment workflows\r\nSupport general marketing tech tasks and help improve backend efficiency\n\r\n-Requirements:\n\r\nProven expertise with Go High Level (this is non-negotiable)\r\nDeep understanding of GHL features: automations, campaigns, triggers, pipelines, forms, calendars, etc.\r\nExperience working with marketing agencies or multiple client accounts\r\nAbility to manage tasks, communicate updates, and meet deadlines\r\nFluent in English with clear written and verbal communication\r\nTech-savvy and comfortable solving automation and integration challenges\n\r\n-Bonus Points:\r\nExperience with Twilio, Mailgun, Stripe, Zapier, or n8n integrations\r\nFamiliarity with lead-gen campaigns, funnels, and performance tracking\r\nGraphic design or copywriting skills for marketing campaigns\r\nAbility to suggest improvements or new automations proactively",
  "skill_requirements": [
    "Marketing",
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": []
}