{
  "job_id": "1422339",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-VA-Intake-Scheduling-Specialist-Excellent-English-Required-1422339",
  "scraped_at": "2025-07-15T12:35:59.376983",
  "title": "Customer Service VA – Intake & Scheduling Specialist (Excellent English Required)",
  "type_of_work": "Full Time",
  "salary": "$950 per month",
  "hours_per_week": "45",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are looking for a full-time Customer Service Virtual Assistant to join our growing admin team at a busy U.S.-based mental health counseling center.\n\r\nYour primary responsibilities will be:\r\n • Answering live phone calls, emails, and website inquiries from new and existing clients\r\n • Converting new leads into clients using a standard intake process\r\n • Scheduling or rescheduling appointments\r\n • Providing tech support for clients attending telehealth sessions\r\n • Relaying client messages to therapists and staff\r\n • Coordinating with outside providers (e.g. handling release forms, documentation)\r\n • Communicating in real time with other teaUpgrade to see actual infombers via messaging tools\n\r\nYou must have excellent spoken and written English and be available to work during U.S. Central Time business hours. You’ll be working on a fixed, rotating shift schedule of 5 days/week (Monday–Thursday with alternating day/evening shifts, and Saturdays). You’ll be off on Fridays.\n\r\nWe use RingCentral, TheraNest, Keap, Google Drive, and PandaDoc—training will be provided, but you should be comfortable learning and navigating new systems.\n\r\nTo apply:\r\nPlease make the subject line of your application:\r\nCustomer Service VA – Intake & Scheduling Specialist – [Your Name Here]\n\r\nAlso, when you apply, use 7 Apply Points. This helps us know you’ve read the post carefully and are serious about this opportunity.\n\r\nWe look forward to hearing from you!",
  "skill_requirements": [
    "Phone Support",
    "English Speaking",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": []
}