{
  "job_id": "1422587",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Growth-Marketing-Manager-BOUTIQUE-FASHION-BRANDS-1422587",
  "scraped_at": "2025-07-15T12:31:26.177221",
  "title": "Growth Marketing Manager - BOUTIQUE FASHION BRANDS",
  "type_of_work": "Full Time",
  "salary": "$1,500–$2,000 USD/month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for a experienced hands-on Marketing manager who can manage end-to-end marketing strategy and execution for our brands. This is not just an ad buyer role—it’s for someone who can think strategically, manage paid media, and also execute daily marketing tasks like content posting, reporting, and growth experiments.\n\r\nKey Responsibilities:\n\r\nPaid Media & Growth Marketing\n\r\n* Manage and optimise paid ads across Meta (FB/IG), Google Ads, TikTok, and Pinterest\r\n* Create, test, and scale ad campaigns with a focus on ROAS and new customer acquisition\r\n* Handle media buying, audience building, retargeting, and funnel tweaks\r\n* Monitor daily performance, adjust budgets and creative as needed\n\r\nOrganic & Content Marketing\n\r\n* Help to increase engagement and may include post on Instagram, TikTok, Pinterest, and Facebook (feed, stories, reels, UGC, etc.) Phone, VPN and simcard will be provided.\r\n* Research and suggest content ideas based off trends that align with brand tone and current campaigns.\r\n* Schedule posts, Blogs, help to organise events and engage with the community\r\n* Plan content calendars alongside product drops and marketing goals\n\r\nMarketing Strategy & Planning\n\r\n* Develop monthly and quarterly marketing plans and growth strategies\r\n* Analyse data to recommend optimisations across channels\r\n* Identify new marketing opportunities (influencer outreach, collabs, community-building, etc.)\r\n* Help plan product launches, promotions, and email campaigns\r\n*Klaviyo EDM plan, strategy, implementation and data monitoring across multiple countries.\r\n*Liase with graphic designer to create, launch and send EDMs via Klaviyo\n\r\nReporting & Analytics\n\r\n* Track KPIs (ROAS, CAC, engagement, traffic, conversions)\r\n* Build weekly & monthly performance reports with insights and next steps\n\r\nIdeal Skillset:\n\r\n* Paid ads management across Meta, Google, TikTok, Pinterest\r\n* Social media management and content coordination\r\n* Growth mindset—loves testing, tweaking, and scaling ideas\r\n* Good with Canva/basic graphics and chat GPT\r\n* Strong in data analysis and ad reporting\r\n* Knowledge of Shopify, Klaviyo, and marketing funnels\r\n* Self-driven, organised, and proactive—someone who can own the marketing department.\n\r\nHours & Pay:\n\r\nFull-Time Remote (40 hrs/week)\r\n* Flexible timezone preferred but must have some overlap with Australia (AEST)\r\n* Salary: $1,500–$2,500 USD/month depending on experience \n\r\nThere will be a trial period.\n\r\nWhy Work With Us?\n\r\nWe’re a creative, ethical, and fast-moving brand. This role is perfect for someone who wants real responsibility and the freedom to make an impact—not just run ads, but actually grow a brand.\n\nUpgrade to see actual info",
  "skill_requirements": [
    "Marketing",
    "Performance Marketing",
    "Klaviyo"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:29:40.361334",
      "reason": "Job first discovered"
    }
  ]
}