{
  "job_id": "1422265",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422265",
  "scraped_at": "2025-07-14T23:06:45.037389",
  "title": "Project Marketing Manager (Needs to be available in Central Time hours)",
  "type_of_work": "Full Time",
  "salary": "$800/mo",
  "hours_per_week": "60",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Project Marketing Manager (Needs to be available in Central Time hours)\r\nWe’re on the hunt for a Marketing Project Manager with a strategic mindset, a love for details, and a proven track record of bringing creative marketing projects to life. If you thrive in fast-paced environments, are obsessed with timelines and clarity, and can gracefully lead cross-functional teams, we’d love to hear from you!\n\r\nAbout the Role:\r\nYou’ll manage the end-to-end execution of marketing campaigns,from concept to launch with a focus on maintaining Upgrade to see actual infontum and ensuring nothing slips through the cracks. Your work will help shape how our brand shows up across digital, email, social, and content initiatives.\n\r\nWhat You’ll Do:\r\nCollaborate with the planning, coordination, and execution of marketing projects across multiple channels.\n\r\nServe as the glue between designers, copywriters, media buyers, and strategists\n\r\nBuild and manage timelines, workflows, and deliverables to ensure on-time execution\n\r\nMaintain project documentation, status reports, and communication with internal and external marketing agencies.\n\r\nProactively identify roadblocks and course-correct quickly\n\r\nKeep teaUpgrade to see actual infombers aligned and accountable throughout the process\n\r\nMust be a self- starter and knows how to take initiatives to projects.\n\n\r\nWhat We’re Looking For:\n\r\n3–5 years of experience in a marketing project management role, ideally in a consumer or eCommerce setting\n\r\nExceptional organizational and communication skills\n\r\nHands-on experience managing creative production (ads, emails, landing pages, social content, etc.)\n\r\nFamiliarity with tools ClickUp (required)\n\r\nApply here: \nUpgrade to see actual info",
  "skill_requirements": [
    "Marketing Management",
    "Project Management"
  ]
}