{
  "job_id": "1422596",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Specialist-Short-Form-Focus-1422596",
  "scraped_at": "2025-07-15T15:40:51.318708",
  "title": "Social Media Specialist (Short-Form Focus)",
  "type_of_work": "Any",
  "salary": "Commensurate with experience",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a social media strategist with deep expertise in short-form video and a sharp eye for detail? We’re looking for a Social Media Specialist to own and grow our short-form content presence across TikTok, Instagram (Reels, Stories, and Feed), and YouTube Shorts.\n\r\nYou’ll collaborate closely with our internal team that specializes in long-form YouTube content—transforming their work into compelling, native-first short-form videos and image-based posts. You’ll also create visual assets and coordinate with our designer for campaign and ad creatives. This is a high-autonomy, full-time role with room to make a big impact across three rapidly growing brands:\n\r\n- Med School Insiders\r\n- Kevin Jubbal, M.D.\r\n- Jubbal & Cars\n\r\n---\n\r\nKey Responsibilities\n\r\n- Lead strategy and execution for short-form content across Instagram (Reels, Stories, Feed), TikTok, and YouTube Shorts\r\n- Use platform analytics and performance data to drive strategic decisions and optimize content for growth\r\n- Identify compelling Upgrade to see actual infonts from long-form YouTube videos and guide editors to repurpose them into engaging short-form clips\r\n- Create image-based content (carousels, quote posts, etc.) using Canva\r\n- Perform basic photo editing for social posts and thumbnails\r\n- Coordinate with our designer on ad creatives and visual brand campaigns\r\n- Schedule content using Later and maintain a consistent posting calendar\r\n- Maintain a high standard of detail and quality across all platforms—no spelling or formatting errors\r\n- Engage with and manage online communities, including course-related Facebook Groups and Upgrade to see actual info spaces\r\n- Collaborate cross-functionally on promotional efforts involving blogs, newsletters, and affiliate campaigns\r\n- Stay informed on social trends, platform algorithm changes, and emerging formats\n\r\n---\n\r\nRequirements\n\r\n- 3+ years of experience as a Social Media Specialist or in a similar professional social media role\r\n- Proven success managing and growing Instagram (including Reels and Stories), TikTok, and YouTube Shorts\r\n- Strong grasp of short-form video content strategy and audience behavior\r\n- Excellent writing, grammar, and communication skills with meticulous attention to detail\r\n- Proficiency with Later, Canva, and other relevant content planning tools\r\n- Ability to work independently while coordinating with a team of editors, designers, and content leads\r\n- Bonus: Interest in education, medicine, personal development, or automotive content\n\r\n---\n\r\nFull-Time | Remote | Flexible Hours + PTO\n\r\nThis is a full-time, salaried role (40+ hours/week) with flexible working hours and paid time off. We operate in a fast-paced, creative environment where ownership and high standards are valued.\n\r\nTo apply, fill out the form here: forms. gle/ xG7cDx9oeP6VSRra9 (remove spaces)",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:22:09.586717",
      "reason": "Job first discovered"
    }
  ]
}