{
  "job_id": "1422144",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-FBA-Product-Research-VA-Online-Arbitrage-Wholesale-1422144",
  "scraped_at": "2025-07-15T12:33:14.002664",
  "title": "Amazon FBA Product Research VA – Online Arbitrage & Wholesale",
  "type_of_work": "Part Time",
  "salary": "13,000 PHP/month",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hi there! \n\r\nI run a growing Amazon FBA business and I’m looking for a reliable, detail-oriented Virtual Assistant to help with product research for Online Arbitrage and Wholesale. This is a long-term opportunity for the right person.\n\r\nYou’ll be responsible for finding low-cost, high-profit products from reliable sources that meet specific criteria. All products must be ungated (no application or approval required to sell), with low competition and a solid sales history.\n\r\nIf you’ve done this kind of work before and love finding winning products, I’d love to work with you!\n\r\nWhat You’ll Do:\r\nDaily product research for Online Arbitrage and Wholesale\n\r\nFind ungated products (no need to apply to sell)\n\r\nSource from trusted online retailers or wholesale suppliers\n\r\nLook for low-cost products (under $30) with high ROI\n\r\nAnalyse products using tools like Keepa, SAS, Amazon Revenue Calculator, etc.\n\r\nPrepare clean and organized spreadsheets with full product details:\n\r\nASIN, Product Title, Buy Cost, Sell Price, ROI, Profit\n\r\nSource Link\n\r\nGating Status\n\r\nAvoid products with IP complaints or high return risk\n\r\nWhat You Need to Have:\r\nExperience with Amazon FBA product research (Online Arbitrage and/or Wholesale)\n\r\nKnowledge of Keepa, SellerAmp SAS, and basic Amazon profit calculations\n\r\nAbility to find products that can be sold without brand or category approval\n\r\nAttention to detail and ability to follow criteria strictly\n\r\nGood written English and communication skills\n\r\nStrong internet connection and reliable computer\n\r\nBonus if You Have:\r\nExperience with Tactical Arbitrage or OAXray\n\r\nWholesale supplier sourcing experience\n\r\nFamiliarity with IP Alert tools or brand restrictions\n\r\nWhat I Offer:\r\nLong-term, stable work with room to grow\n\r\nPerformance bonuses for successful product finds\n\r\nFlexible hours\n\r\nFriendly, supportive working relationship\n\r\nHow to Apply:\r\nPlease send me the following:\n\r\nA short intro about your experience with Amazon FBA and product research\n\r\nList of tools you’ve used (Keepa, SAS, etc.)\n\r\nA sample spreadsheet or report of previous product research you’ve done\n\r\nConfirmation that you can find ungated products suitable for selling on Amazon\n\r\nI look forward to working with someone who’s passionate, focused, and ready to grow with my business. If that’s you — let’s talk!",
  "skill_requirements": [
    "Product Analysis",
    "Product Research",
    "Product Listing"
  ],
  "is_active": true,
  "status_history": []
}