{
  "job_id": "1422501",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Strategy-Analytics-Specialist-for-GHL-SaaS-1422501",
  "scraped_at": "2025-07-15T12:26:16.485869",
  "title": "Marketing Strategy & Analytics Specialist for GHL SaaS",
  "type_of_work": "Part Time",
  "salary": "300",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Join our growing SaaS team as the strategic marketing brain behind our lead generation and conversion optimization!\n\r\nAbout Us\n\r\nWe provide Beyond the Salon CRM - a GoHighLevel-powered platform for beauty professionals. We help salon owners, permanent makeup artists, and beauty businesses scale through automation and streamlined operations.\n\r\nThe Role\n\r\nPart-time position (10-15 hours/week) as Marketing Strategy & Analytics Specialist. \n\r\nYou'll be the analytical force behind our lead generation and conversion optimization, working primarily within GoHighLevel as our central marketing command center.\n\r\nYou'll work WITH our GHL specialist who handles technical construction while you focus on strategy, optimization, and performance analysis.\n\r\nKey Responsibilities\n\r\nAnalyze campaign performance and identify optimization opportunities\r\nDesign A/B testing strategies for ads, landing pages, and email sequences\r\nOptimize conversion rates across the complete customer journey\r\nTrack performance using GoHighLevel analytics plus external tools\r\nCreate performance reports with actionable optimization recommendations\r\nMonitor campaigns, pipelines, and automations within GoHighLevel\r\nProvide strategic direction to technical GHL specialist for improvements\n\r\nRequired Qualifications\n\r\n2+ years performance marketing strategy and optimization experience\n\r\nWorking knowledge of GoHighLevel - can navigate, analyze, and optimize within platform\n\r\nConversion rate optimization expertise with proven improvement track record\n\r\nAdvanced analytics skills with Google Analytics, Facebook Pixel, conversion tracking\n\r\nB2B SaaS marketing experience preferred\n\r\nAdvanced Excel/Google Sheets for data analysis and reporting\n\r\nWhat We Offer\n\r\nPerformance Bonuses: Monthly bonuses based on conversion rate improvements\r\nCommission Opportunities: Performance-based incentives tied to lead quality and customer acquisition\r\nGrowth Potential: Opportunity to expand to full-time as business scales\r\nPart-time remote: Flexible scheduling with some US business hours overlap\n\r\nHow to Apply\n\r\nSubject Line: \"Ready to Optimize Beauty SaaS Conversions\"\n\r\nInclude:\n\r\nExperience Summary: Your performance marketing and optimization background\r\nGoHighLevel Knowledge: Your experience level with GHL platform\r\nResults Examples: Specific conversion rate improvements you've achieved\r\nAvailability: Your preferred working hours and schedule\n\r\nEnd your application with: \"Data-driven strategy drives results!\"",
  "skill_requirements": [
    "Marketing Analytics",
    "Campaign Building",
    "Social Media Engagement"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:20:36.639190",
      "reason": "Job first discovered"
    }
  ]
}