{
  "job_id": "1422010",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Bookkeeping-Manager-1422010",
  "scraped_at": "2025-07-14T23:07:30.919315",
  "title": "Bookkeeping Manager",
  "type_of_work": "Part Time",
  "salary": "$540/month",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Bookkeeping Manager - Help Us Build and Grow!\n\r\nAre you a proactive, detail-loving bookkeeper who enjoys clean books, clear processes, and building systems that scale?\r\nIf so, we’d love to have you join Kearia White, CPA, LLC as our Bookkeeping Manager.\n\r\nAbout Us\n\r\nAt Kearia White, CPA, LLC, we are a growing virtual firm that supports private practice owners with year-round tax, bookkeeping, and advisory services. We value clear communication, timely work, and systems that support both our clients and our team. Joining us means working in a flexible, remote-first environment where growth and excellence are the standard.\n\r\nPosition Details\n\r\nTitle: Bookkeeping Manager\r\nType: Part-time (15-20 hours/week to start), with the opportunity to grow into full-time\r\nReports to: CEO\r\nWork Environment: 100% virtual: work from anywhere with reliable internet. Flexible hours with clear expectations.\n\r\nPerks:\r\n-Flexible work hours\r\n-Help shape systems, SOPs, and team structure\r\n-Collaborative, respectful culture\r\n-Supportive of working parents and balanced schedules\n\r\nKey Responsibilities:\r\n-Manage monthly bookkeeping for a portfolio of clients, including private practice business owners\r\n-Oversee account reconciliations, categorization, and monthly financial reports\r\n-Perform and oversee cleanup projects as needed to ensure books are accurate and complete\r\n-Assist with sales tax filings and stay informed on general sales tax rules applicable to client industries\r\n-Create and improve SOPs, workflows, and pipelines in TaxDome\r\n-Onboard, train, and help hire future bookkeeping teaUpgrade to see actual infombers as the firm grows\r\n-Ensure accuracy, timeliness, and a client-ready product\r\n-Communicate with clients clearly and professionally regarding bookkeeping questions or missing items\r\n-Attend internal teaUpgrade to see actual infoetings at least twice per week and participate in a virtual quarterly retreat with the management team\n\r\nNote: You may be performing the day-to-day bookkeeping tasks yourself for the first couple of months until we hire additional teaUpgrade to see actual infombers to support this role.\n\r\nRequirements:\r\n-Bachelor’s degree in Accounting\r\n-3+ years of bookkeeping experience, including managing multiple client accounts\r\n-Advanced knowledge of QuickBooks Online\r\n-Strong understanding of cash vs accrual accounting\r\n-Strong organizational and time management skills\r\n-Bookkeeping Management experience \r\n-Excellent written and verbal communication\r\n-Tech-savvy and able to adapt and learn multiple new software (TaxDome, QuickBooks Online, and Google Workspace)\r\n-A team player who is eager to learn, improve processes, and contribute to a growing firm. \r\n-Comfortable working independently and managing deadlines in a virtual setting\r\n-Must have your own laptop, reliable internet, webcam, and headset\n\r\nNice to Have:\r\n-Experience working with private practice owners (therapists, wellness professionals, etc.)\r\n-Familiarity with TaxDome\r\n-Experience developing and managing SOPs or internal workflows\n\r\nTo Apply: \nEmail your resume to Upgrade to see actual info with the subject line “Books & Balance” so we know you read the full description.\n\r\nIf we think you are a good fit, we will follow up with an email outlining the next steps by Friday, July 25th.\n\r\nWhat to Expect\r\nOur hiring process includes the following steps:\r\n-Resume Review – We will review all submitted resumes to identify strong initial matches.\r\n-Application Form – Selected candidates will be invited to complete a detailed application to learn more about your background and experience.\r\n-Skills Test – Candidates who move forward will complete a short skills-based test to assess job-related abilities.\r\n-First Interview (with Executive Assistant) – You will meet with our Executive Assistant for an initial conversation about your experience, availability, and fit for the role.\r\n-Final Interview (with CEO) – Final candidates will have a one-on-one interview with the firm owner to go deeper into your technical skills and alignment with the firm’s vision.\n\r\nWe will keep you updated throughout the process. If you do not hear back from us within 2-3 business days of submitting your resume, we have dUpgrade to see actual info not to move forward. \n\r\nWe are excited to meet someone who’s ready to grow with us and help bring calm and clarity to our clients’ books.",
  "skill_requirements": [
    "Accounting",
    "Quickbooks",
    "Bookkeeping"
  ]
}