{
  "job_id": "1422543",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Manager-1422543",
  "scraped_at": "2025-07-15T12:22:32.112130",
  "title": "Marketing Manager",
  "type_of_work": "Full Time",
  "salary": "50,000.00",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "This is a remote position.\n\r\nAbout Us:\n\r\nWe are a fast-growing company that provides recruitment and operational support services for startup companies around the world, mainly in the US. We specialize in helping clients hire top-tier remote Filipino talents by streamlining the hiring process and supporting long-term team success. As we continue to grow, we are looking for a proactive, reliable, and results-driven Marketing Manager to lead our marketing efforts and help drive measurable business growth.\n\r\nAbout the Role:\n\r\nAs our Marketing Manager, you will be responsible for developing and executing marketing strategies focused on generating high-quality leads that convert into clients. You will lead the marketing team and collaborate with sales, recruitment, and operations to ensure alignment and consistency in messaging, outreach, and brand positioning. This role requires someone with strong initiative, creativity, and proven experience in digital marketing—ideally within the staffing or outsourcing industry.\n\r\nResponsibilities include:\n\r\nLeading and managing the marketing team to ensure all efforts align with company goals\n\r\nDeveloping and executing lead generation strategies targeting staffing agencies and startups\n\r\nDriving SEO optimization to increase website traffic and search engine rankings\n\r\nOverseeing blog content, newsletters, and other written materials to engage and educate potential clients\n\r\nManaging email marketing campaigns using platforms like GoHighLevel (GHL)\n\r\nCreating and executing social media strategies to build awareness and drive traffic\n\r\nOptimizing website performance to improve user experience and conversion rates\n\r\nUsing tools like SEMrush, GHL, and Google Analytics to monitor campaign performance and make data-driven decisions\n\r\nCollaborating with sales, recruitment, and operations to ensure consistent branding and messaging across all channels\n\r\nIdentifying new marketing channels and growth opportunities\n\n\r\nWe’re looking for someone who:\n\r\nIs highly proactive, reliable, and committed to delivering results\n\r\nHas a strong background in digital marketing, especially in the staffing  or outsourcing space\n\r\nUnderstands how to generate leads and convert them into sales through effective marketing\n\r\nHas 1 to 3+ years of experience in a marketing leadership role\n\r\nHas hands-on experience with SEO tools (like SEMrush), CRM/automation platforms (like GHL), and social media management\n\r\nHas strong communication and content creation skills\n\r\nCan manage multiple projects and meet deadlines with minimal supervision\n\r\nUnderstands the unique challenges and opportunities of remote staffing, especially in the Filipino talent market\n\r\nIf you’re looking for a role where you can take ownership, lead a team, and make a real impact—this could be the perfect fit.\n\r\nUnderstands the unique dynamics of the remote staffing market, particularly in positioning Filipino talent as a high-value solution for international teams\n\r\nWhat We Offer:\r\nA collaborative and growth-focused remote environment\n\n\r\nOpportunity to work at the intersection of global staffing and digital marketing\n\n\r\nAutonomy to innovate and lead\n\r\nCompetitive compensation and performance bonuses\n\r\nHMO\n\r\nPTO\n\n\r\nFor faster processing of application, please submit your application here: \n\nUpgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:35:34.014043",
      "reason": "Job first discovered"
    }
  ]
}