{
  "job_id": "1422641",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Automation-Strategist-Specialist-1422641",
  "scraped_at": "2025-07-15T15:28:46.800848",
  "title": "Marketing Automation Strategist / Specialist",
  "type_of_work": "Full Time",
  "salary": "PHP 75,000 to PHP 110,000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us\n\r\nCareAbout began with a simple idea over a cup of coffee in Highett, Melbourne in 2014. Our mission is to make a difference by helping Australians find the best care solutions for their loved ones. Since assisting our first customer in 2017, we have helped over 140,000 Australians, empowering them with clear information and compassionate service.\n\r\nOur Purpose\r\n- Make a difference\r\n- Empower people through clear information\r\n- Provide services that improve lives\r\n- Source exceptional-quality home-care providers\r\n- Simplify complex government jargon\r\n- Operate with love and compassion\n\r\nOur Values\r\n- Champion positivity\r\n- Be accountable\r\n- We are one team\r\n- Courage counts\r\n- Strive to be your best\r\n- Embrace the adventure\n\r\nWho We Are Looking For\r\nAn automation obsessive who lives for customer journeys, segmentation logic, and data-driven optimisation. You won’t be writing copy or designing templates, that’s handled by our creative team. Instead, you’ll architect and maintain every automated touchpoint, ensuring each message lands in the right inbox at precisely the right Upgrade to see actual infont and moves the needle on engagement and revenue. You’re as comfortable mapping complex behavioural flows as you are diving into dashboards to spot a dip in click-through rates.\n\r\nKey Responsibilities\n\r\nJourney Architecture - Build, audit, and refine 17 + multi-channel journeys (email, SMS, onsite pop-ups) to match lifecycle stages and strategic goals.\n\r\nSegmentation & Targeting - Create sophisticated, rule-based segments using demographic, behavioural, and transactional data from Salesforce and other sources.\n\r\nCross-Functional Orchestration - Brief copywriters and designers on timing, context, and variant needs; QA content once inserted.\n\r\nPlatform Mastery - Own the automation layer across Ortto (primary) plus legacy or parallel tools (Klaviyo, HubSpot, Mailchimp, Campaign Monitor, Salesforce Marketing Cloud).\n\r\nData Integrity & Integrations - Ensure bi-directional syncs, field mappings, and triggers between Salesforce and marketing platforms stay accurate and fast.\n\r\nPerformance Analytics - Track open rates, clicks, conversions, time-to-engage, and unsubscribe trends; surface insights; run weekly health checks.\n\r\nTesting & Optimisation Design A/B and multivariate tests (timing, frequency, logic) and implement winner deployment protocols.\n\r\nStrategic Alignment - Translate high-level lifecycle strategy into detailed flow diagrams, documented logic, and prioritised backlogs.\n\r\nContinuous Improvement - Proactively propose new journeys, sunset under-performing ones, and recommend data or tooling enhancements.\n\r\nKey Competencies & Attributes\n\r\nSystems Thinker – sees the entire customer lifecycle, not isolated campaigns.\r\nData-Driven – instincts backed by SQL/BI fluency and comfort in Google Sheets or Tableau.\r\nAutomation Toolbelt – advanced user of at least two tools from Klaviyo, HubSpot, Mailchimp, Campaign Monitor, Salesforce Marketing Cloud; able to learn Ortto fast.\r\nStakeholder Translator – turns marketing goals into technical requirements and vice versa.\r\nDetail Hawk – catches broken merge tags, faulty logic branches, and deliverability red flags before they happen.\r\nContinuous Learner – tracks deliverability best practice, privacy regulations, and new platform features.\r\nSharp Communicator - takes initiative to drive collaborative communication whenever needed. \n\r\nExperience & Qualifications\n\r\nEssential\r\n3 + years in marketing automation or lifecycle marketing roles.\r\nDemonstrated ownership of complex, multi-step customer journeys (ideally 10 k + contacts).\r\nProven results in improving key metrics (open rate, CTR, retention, revenue per send).\r\nHands-on integration work with Salesforce (Campaigns, Leads, Contacts, Opportunities).\r\nComfortable briefing creative, then QA-ing final assets inside the automation platform.\n\r\nHighly Advantageous\r\nPrior work in aged-care, health, insurance, or another high-compliance sector.\r\nExperience migrating journeys between platforms or standing up a new CDP/ESP.\r\nBasic HTML/CSS for troubleshooting templates.\n\r\nDesirable\r\nBachelor’s degree in marketing, data science, or related field.\r\nCertifications: HubSpot Marketing Software, Klaviyo Product, Salesforce Administrator, etc.\n\r\nHow to Apply\r\nReady to architect journeys that make a real difference in people’s lives? Apply with your CV and a short case study of a lifecycle flow you built or optimised, show us the logic, the metrics, and the outcome.",
  "skill_requirements": [
    "Email Marketing",
    "Marketing Automation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:34:08.272440",
      "reason": "Job first discovered"
    }
  ]
}