{
  "job_id": "1422031",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Set-Appointments-Earn-Big-Join-Our-Winning-Team-1422031",
  "scraped_at": "2025-07-15T09:33:17.647076",
  "title": "Set Appointments, Earn Big – Join Our Winning Team!",
  "type_of_work": "Full Time",
  "salary": "36,000-60,000 PHP/Month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "APPLY HERE: Upgrade to see actual info/f9aaPs/kd86oiarhx/index\n\r\nAre you tired of campaign-based work that ends every few months or maybe after 1 year?\r\n•Would you like to work at a company with advancement opportunities where you can spend your whole career?\r\n•Do you want to work at a supportive company with a friendly, family culture?\r\n•Do you want to be able to work overtime (but not have it required)?\r\n•Do you want to work for a company where Filipinos are not considered to be outsiders?\r\n•Do you want to work somewhere with no danger they ever ask you to work in person?\n\r\nThen this is your opportunity.\n\r\nWe build beautiful websites for small businesses across the United States and Canada. Our amazing team of 110 associates has produced incredible results:\n\r\nWe have grown 30%+ each year for the last 8 years.\n\r\nWe have over 2,000 5-star reviews.\n\r\n100% of our managers and team leads started in entry-level positions with our company.\n\r\nAPPLY HERE: Upgrade to see actual info/f9aaPs/kd86oiarhx/index\n\r\nJob Description:\r\nYou will make outbound calls to small business owners using a dialing platform.\r\nYou will offer our website services to potential clients.\r\nYou may answer inbound calls from potential clients, scheduling them for appointments to speak to a web designer.\n\r\nWhat we offer:\r\nBase pay Php 6,350 per week plus night differential (=Php 7,000/wk.)\r\nWeekly incentive pay\r\nMonthly attendance bonus\r\nMonthly technology allowance\r\nPay is received every Friday\r\nVery stable work\r\nPermanent position (not just a contract)\r\nOvertime is always available (but not required)\r\nAbility to work from home\r\nRespectful, encouraging work culture\r\nOpportunity to grow with the company\n\r\nAPPLY HERE: Upgrade to see actual info/f9aaPs/kd86oiarhx/index\n\r\nWe are looking for friendly, professional people with strong English language skills to join our team. We are looking for:\r\nExcellent English language skills, both verbal and written\r\nExperience with appointment setting OR equivalent outbound calling experience\r\nAbility to work from home (Must have good internet access, a computer, and a headset.)\r\nA history of great teamwork\r\nStrong customer-handling skills\r\nAble to work during USA business hours from 7:45 a.m. to 4:00 p.m. Eastern Standard Time with overtime (7:45 p.m. to 4 a.m. Manila Time) Monday through Friday, along with an optional OT that runs through 5:00 a.m. Eastern Standard Time.\n\r\nThis is a permanent work-from-home position. Our workflow is extremely stable.\n\r\nWe are a Christian-led business. You will hear a lot about our faith when you work here. We have adopted 8 orphanages in the Philippines with 164 orphans. None of these kids has a birthday that someone on our staff isn't there to celebrate. We reimburse Financial Peace classes, and some employees meet for a Bible study on the clock. You won't have to participate in any of this, but you can. You don't have to be a Christian to work here.\n\r\nAPPLY HERE: Upgrade to see actual info/f9aaPs/kd86oiarhx/index",
  "skill_requirements": [
    "Cold Calling",
    "Active Listening",
    "Appointment Setting"
  ],
  "is_active": true,
  "status_history": []
}