{
  "job_id": "1422238",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Expert-Bookkeeper-AU-Experience-Xero-Specialist-1422238",
  "scraped_at": "2025-07-15T13:35:19.627211",
  "title": "Expert Bookkeeper (AU Experience | Xero Specialist",
  "type_of_work": "Part Time",
  "salary": "TWD",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re Hiring!\n\r\nAre you an experienced and detail-oriented Bookkeeper who understands the Australian financial landscape? We’re looking for someone with at least 3 years of experience working with Australian clients using Xero, who is committed to accuracy, timeliness, and proactive communication.\n\r\nYou’ll play a key role in maintaining financial integrity for our clients and ensuring compliance with Australian tax laws.\n\r\nKey Responsibilities:\n\r\n- Maintain accurate and up-to-date financial records using Xero\r\n- Ensure 100?curacy in bank and credit card reconciliations\r\n- Process accounts payable and receivable\r\n- Monitor invoice collection cycles and maintain < 30 days\r\n- Prepare and lodge BAS, IAS, and superannuation obligations — 100% on time\r\n- Process payroll accurately and on schedule, compliant with Australian labor laws\r\n- Reconcile GST, PAYG, and other statutory liabilities\r\n- Generate monthly financial reports and cash flow statements by the 5th business day\r\n- Liaise with Australian accountants or tax agents\r\n- Respond to finance-related queries within 24 hours\r\n- Assist in budgeting, forecasting, and audit preparation\r\n- Maintain confidentiality and ensure data integrity\r\n- Identify and implement improvements in systems and processes\n\r\nIdeal Candidate Profile:\r\n- Minimum 3 years of bookkeeping experience with Australian clients\r\n- Proficient in Xero (certification preferred)\r\n- Strong understanding of Australian tax laws, BAS, GST, and payroll\r\n- Highly accurate and detail-focused\r\n- Excellent time management and organizational skills\r\n- Strong verbal and written communication skills\r\n- Takes full ownership of tasks and delivers without the need for micromanagement\r\n- Comfortable working remotely with minimal supervision\r\n- Has a strong sense of integrity, responsibility, and confidentiality\r\n- Proactively communicates with internal and external stakeholders\r\n- Constantly seeks ways to improve systems and financial processes\r\n- Understands both the big picture and the small details\r\n- Treats the client’s business as their own — trustworthy and dependable\n\r\nTools You’ll Be Using:\n\r\nXero\n\r\nGoHighLevel (GHL)\n\r\nAirwallex\n\r\nGoogle Workspace (G Suite)\n\r\nWhat We Offer:\r\n- Long-term full-time role\r\n- Stable work environment with a supportive team\r\n- Opportunity to grow professionally and contribute meaningfully\r\n- Remote work flexibility\n\r\nHow to Apply:\r\nPlease send a link to your resume to apply and a short cover letter highlighting your experience with Australian clients and Xero. Candidates who meet the criteria will be contacted for a skills assessment and interview. :)",
  "skill_requirements": [
    "Xero"
  ],
  "is_active": true,
  "status_history": []
}