{
  "job_id": "1422207",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-for-Short-Term-Rentals-1422207",
  "scraped_at": "2025-07-15T13:36:49.903237",
  "title": "Virtual Assistant for Short Term Rentals",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Virtual Assistant for Luxury Short-Term Rental Company \n\r\nWe are looking for a dedicated, detail-oriented, and customer-focused Virtual Assistant to join our luxury short-term rental company. This remote role will involve supporting daily operations, communicating with guests, and ensuring a smooth and high-quality experience for our clients.\n\r\nKey Responsibilities:\n\r\n    Customer Service Calls: Answer and manage guest inquiries or issues via phone when necessary, ensuring guests have a seamless experience.\n\r\n    Guest Messaging & Support: Respond to guest messages on Airbnb, VRBO, and Upgrade to see actual info in a professional and timely manner.\n\r\n    Issue Resolution: Handle any problems that arise during guest stays, such as check-in issues, maintenance requests, or concerns, ensuring immediate resolution and guest satisfaction.\n\r\n    Coordination & Communication: Work closely with cleaners, maintenance teams, and other staff to resolve issues and ensure high standards are maintained.\n\r\n    Problem-Solving: Think quickly and find effective solutions to unexpected situations to maintain a smooth guest experience.\n\r\n    Guest Check-In & Check-Out: Guide guests through check-ins and check-outs, ensuring they have all necessary information for a hassle-free stay.\n\r\nQualifications:\n\r\n    MUST HAVE Experience in customer service, hospitality, or property management is highly preferred.\n\r\n    Fluent in English: Strong written and verbal communication skills are a must.\n\r\n    Tech-Savvy: Comfortable using short-term rental platforms (Airbnb, VRBO, Upgrade to see actual info) and other communication tools.\n\r\n    Customer Service Focused: A passion for delivering excellent customer service and going the extra mile for guest satisfaction.\n\r\n    Quick Thinker: Ability to multitask and handle multiple guest interactions at once, ensuring timely and accurate responses.\n\r\n    Independent & Efficient: Ability to work autonomously and manage your time effectively.\n\r\n    Teramind Usage: You will be required to use Teramind for monitoring work activity to ensure productivity and efficiency.\n\r\nSchedule & Availability:\n\r\n    This is a remote position, but availability to handle urgent issues is required.\n\r\n    Must be available to work during set hours, including weekends and evenings, as guest issues can arise at any time.\n\r\n    Competitive pay based on experience.\n\r\nIf you are motivated, reliable, and have a passion for excellent customer service, we would love to have you on our team!                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}