{
  "job_id": "1422405",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Part-Time-SEOWebsite-Onboarding-Assistant-400-USmonth-1422405",
  "scraped_at": "2025-07-15T12:34:14.976013",
  "title": "Part-Time SEO/Website Onboarding Assistant - $400 US/month",
  "type_of_work": "Part Time",
  "salary": "$400 US/mo",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re looking for someone with strong local SEO experience, a solid understanding of DNS and getting websites live, and excellent English communication skills to help manage the early stage of client onboarding.\n\r\n--TO APPLY--\r\n1. Please take this screening quiz first: Upgrade to see actual info\n\r\n2. Then send us an email with a video/audio recording of WHY you'd be a good fit along with your resume.\n\r\n--What This Role Offers--\n\r\n$400/month USD (paid reliably every month - even if workload is light)\n\r\nPart-time for now (typically 10–20 hrs/week, sometimes less)\n\r\nGreat opportunity to grow into a long-term, full-time role\n\r\nWork from anywhere - just be available during 9 AM – 5 PM CST\n\r\nNo micromanagement - just stay organized and get things done\n\r\n--Your Core Responsibilities--\n\r\nOnce a client signs on, you take over onboarding\n\r\nAssist clients in getting their new website live - quickly and confidently\n\r\nMost clients use GoDaddy, Namecheap, or Dreamhost (Sometimes they give you login access; other times you’ll guide them)\n\r\nYou should be comfortable managing A Records, nameservers, etc.\n\r\nCoordinate with our web designer to fix or adjust anything needed\n\r\nHelp collect Google Business Profile (GBP) access and assist with setup\n\r\nKeep all progress organized in ClickUp\n\r\nOnce the site is live and GBP is ready, pass the client to our CSM\n\r\n--Who This Is For--\n\r\nYou have hands-on local SEO experience (especially with service businesses)\n\r\nYou understand how to structure service pages and local landing pages\n\r\nYou know how to get websites live fast - without needing to be handheld\n\r\nYou’re organized, proactive, and naturally follow up until things are done\n\r\nYou speak and write fluent English - and you’re comfortable messaging or calling clients when needed\n\r\nYou’re happy working behind the scenes - but not afraid to step up when needed\n\r\nThis is a low-stress, high-impact role - and the perfect opportunity for someone who wants consistent income, meaningful work, and the potential to grow with a tight-knit team.\n\r\n--TO APPLY--\r\n1. Please take this screening quiz first: Upgrade to see actual info\n\r\n2. Then send us an email with a video/audio recording of WHY you'd be a good fit along with your resume.",
  "skill_requirements": [
    "Local SEO",
    "English Speaking",
    "DNS Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:33:50.556141",
      "reason": "Job first discovered"
    }
  ]
}