{
  "job_id": "1422959",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Real-Estate-Operations-Manager-1422959",
  "scraped_at": "2025-07-15T15:44:29.901556",
  "title": "Real Estate Operations Manager",
  "type_of_work": "Full Time",
  "salary": "$6-9 per Hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you the organized, motivated, and dependable right hand every leadership team dreams of? Treu Group Real Estate is searching for an experienced Operations Manager/Executive Assistant who thrives in a fast-paced real estate environment and is ready to make a real impact—remotely.\n\r\nReal Estate Experience is a MUST!\n\r\nWhat You’ll Do:\n\r\nHandle all administrative duties and support the CEO and team\r\nAnticipate needs and proactively solve problems for the team and our clients\r\nManage listings and transactions from start to finish with accuracy and care\r\nOversee and optimize our CRM and lead management processes\r\nEnsure every client and team experience exceeds expectations\r\nFollow established SOPs to the letter—consistency and quality are key\r\nCommunicate clearly and professionally with clients, vendors, and the team\r\nLead by example with integrity, reliability, and positive energy\n\r\nWhat We’re Looking For:\r\nPrior real estate administrative, transaction, or listing management experience\r\nExcellent English verbal and written communication skills (critical!)\r\nProven ability to follow SOPs and directions precisely\r\nSelf-starter with a history of stability, dependability, and motivation to do great work\r\nStrong problem-solving skills and attention to detail\r\nTech-savvy with CRM and lead management experience (real estate CRMs a plus)\r\nReliable work area, high-speed internet, and a quiet environment for calls\n\r\nAble to work 8:30 am–5:30 pm Eastern Time, Monday–Friday\r\nPay Range: $6–$9 per hour to start, with growth opportunities for top performers.\r\nReady to join a supportive, high-integrity team that values your expertise?\n\r\nApply now by completing our application: Application Form\nUpgrade to see actual info\n\r\nPlease review the hourly rate before applying. We’re looking for someone committed to excellence and eager to grow with us!",
  "skill_requirements": [
    "CRM",
    "Office and Administration",
    "Leadership"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:24:08.202307",
      "reason": "Job first discovered"
    }
  ]
}