{
  "job_id": "1422976",
  "url": "https://www.onlinejobs.ph/jobseekers/job/VSL-Video-Editor-Content-Scraper-1422976",
  "scraped_at": "2025-07-15T15:31:50.925762",
  "title": "VSL Video Editor + Content Scraper",
  "type_of_work": "Part Time",
  "salary": "$500",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re looking for a highly skilled Video Editor with proven experience in creating high-converting Video Sales Letters (VSLs). You’ll be responsible for editing engaging VSLs based on provided scripts and sourcing all the necessary content (stock footage, images, clips, etc.) from the internet to bring the videos to life.\n\r\nThis is a long-term, role for someone who understands direct-response marketing and knows how to make VSLs that capture attention and drive action.\n\r\nResponsibilities:\r\n- Edit professional, high-quality VSL videos from provided scripts.\r\n- Search and source relevant content (stock videos, B-roll, images, sound effects, and background music) that fits the tone and style of each VSL.\n\r\nRequirements:\r\n- Proven experience editing VSLs (portfolio required).\r\n- Skilled in sourcing content from online platforms.\r\n- Deliver projects on time.\r\n- At least 1,5 years of experience\r\n- Good English comprehension (since scripts and communication will be in English).\n\r\nNice to Have (but not required):\r\n- Experience working with eCommerce or health/supplement brands.\r\n- Knowledge of copyright-safe content sourcing.\n\r\nSalary:\r\n- Competitive and negotiable based on experience.\n\r\nHow to Apply - Please send the following:\r\n1. Your updated resume.\r\n2. A link to your portfolio showing VSLs or similar projects you’ve edited.\r\n3. Your expected hourly salary\r\n4. A short message on why you think you’re the perfect fit for this role.\n\r\nPlease start your message with the words “VSLs will scale” so I know you read everything.\n\r\nWe’re excited to find someone who’s passionate about creating impactful VSLs and wants to grow with our brand.",
  "skill_requirements": [
    "Video Editing",
    "Audio Editing",
    "Media Buying"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:25:45.873605",
      "reason": "Job first discovered"
    }
  ]
}