{
  "job_id": "1422024",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422024",
  "scraped_at": "2025-07-14T23:05:33.700587",
  "title": "Creative Specialist (Digitial Marketing)",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Creative Specialist (Digitial Marketing)\r\nFull-Time | Remote | Unchained Growth\n\r\nUnchained Growth is a new digital marketing agency focused on helping service companies generate leads. We are growing pretty fast and require someone to plan the creatives, strategize and ensure work is done on time. We are looking for someone to grow with us, so if you are open to learning, fast paced environment, this will be a place for you.\n\r\nWe’re not looking for just another content marketer.\r\nWe’re looking for a creative generalist — someone who can see through noise, vet creatives like a sniper, and ensure that every visual, copy, and idea we ship is both on-brand and converts.\n\r\nIf you're part strategist, part copywriter, part creative critic — this is for you.\n\r\n What You'll Actually Do\r\nVet and approve creative assets (images, videos, ad copy, carousels, organic posts) from graphic designers & video editors\n\r\nPlan and maintain a content calendar based on marketing priorities, offers, and business goals\n\r\nWrite or edit ad copy and post captions to make sure they sell, resonate, and stay on-brand\n\r\nCollaborate with the founder to ensure content reflects our strategy, voice, and evolving style\n\r\nConstantly research trends, hooks, swipe files, and industry best practices — you’ll always be a step ahead\n\r\nEnsure everything we publish aligns with our value proposition, positioning, and creative standards\n\r\nUnderstand how our funnels and offers fit together, and make sure the content supports each stage of the customer journey\n\r\nOccasionally build or oversee builds in GoHighLevel (GHL) — landing pages, automations, workflows\n\r\n Who We're Looking For\r\nYou’ve worked as a copywriter or in a content/creative role before (or have equivalent freelance experience)\n\r\nYou're obsessed with marketing psychology, social media trends, and content frameworks\n\r\nYou’re fast and adaptable — you don’t get overwhelmed when strategies shift or priorities change\n\r\nYou love building systems and processes, and keeping projects organized\n\r\nYou’re comfortable giving feedback to designers and editors — and making the final call\n\r\nYou’ve planned or worked on funnels before — and understand where creative fits in a sales process\n\r\nYou’ve used GoHighLevel or similar tools for campaigns, landing pages, or workflows\n\r\nYou learn ridiculously fast and care deeply about improving the quality of creative output\n\r\n Bonus Points If You:\r\nHave experience in direct-response copy, paid ads, or conversion-driven creative\n\r\nHave managed a content calendar before or built one from scratch\n\r\nAlready follow creators or companies that are crushing it in the content space (and know why)\n\r\n What Success Looks Like\r\nEvery creative we ship is tight, purposeful, and high-converting\n\r\nThe team is clear on what to make and how to improve fast\n\r\nContent planning is no longer a bottleneck — it’s a machine\n\r\nThe founder spends less time reviewing and more time scaling\n\r\nLocation\r\nRemote — as long as you can work and communicate effectively with our team (timezone flexibility is a plus).\n\r\nHow to Apply (People who don't follow will be disqualified)\r\nSend us:\n\r\nA short written intro or Loom telling us why you’d be great and why you will enjoy\n\r\nSamples of content or copy you’ve worked on\n\r\nOne creator or brand you think is doing content really well — and why\n\r\nResume",
  "skill_requirements": [
    "Article Writing",
    "Social Media Content Creation",
    "Digital Marketing"
  ]
}