{
  "job_id": "1422705",
  "url": "https://www.onlinejobs.ph/jobseekers/job/UIUX-Designer-for-B2B-SaaS-application-1422705",
  "scraped_at": "2025-07-15T12:29:01.517049",
  "title": "UI/UX Designer for B2B SaaS application",
  "type_of_work": "Gig",
  "salary": "$15/hr",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "**Note: Any direct contact outside the onlinejobs platform (WhatsApp, email, LinkedIn, phone, etc.) will be ignored.**\n\r\nWe are looking for an experienced UI/UX Designer to redesign 5-7 key screens of our existing B2B SaaS order management dashboard. You'll be transforming a data-heavy business application into an intuitive interface that reduces cognitive load and improves workflow efficiency for our business users.\n\r\nOur application is an order management system with built-in automation that helps businesses manage orders from sales through customer service and logistics. This role requires understanding complex business processes and translating them into clean, user-friendly interfaces.\n\r\nWhat You'll Be Doing:\r\n- Redesigning 5 critical dashboard screens to improve user workflow\r\n- Creating intuitive navigation for complex data-heavy interfaces  \r\n- Designing for both desktop and mobile platforms\r\n- Solving UX challenges around order management and business automation tools\r\n- Delivering wireframes, high-fidelity designs, and interactive prototypes\n\r\nRequirements:\r\n* Experience: Minimum 3+ years designing B2B SaaS applications\r\n* Tools: Expert proficiency in Figma\r\n* UX Skills: Proven ability to understand complex business workflows and create intuitive user journeys for data-heavy applications\r\n* Portfolio: Must include B2B SaaS case studies showing your design process, not just final designs\r\n* Language: Native/Fluent English speaker\r\n* Industry Experience Previous work with order management, CRM, or similar business tools preferred\n\r\nTo Apply, Please Provide:\r\n**Start your proposal with \"DESIGN READY\" to show you've read the full requirements.**\n\r\n* Portfolio Examples: 2-3 examples of B2B SaaS app designs you have created, with case studies showing your process\r\n* Process Explanation: Brief description of your approach to designing complex data-heavy interfaces\r\n* Availability Confirm your availability for the next 2-3 weeks\r\n* Relevant Experience: 1-2 sentences about your experience with order management systems or similar business applications\n\r\n**Note:** Applications without relevant B2B SaaS portfolio examples will not be considered.\n\r\nProcess:\r\n* Initial Interview\r\n* Review of the existing application\r\n* Provide quote estimate for completing the work",
  "skill_requirements": [
    "UI UX Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:33:00.472948",
      "reason": "Job first discovered"
    }
  ]
}