{
  "job_id": "1422258",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Content-Writer-Website-Service-Pages-Location-Pages-1422258",
  "scraped_at": "2025-07-15T12:26:23.703482",
  "title": "Content Writer – Website Service Pages & Location Pages",
  "type_of_work": "Full Time",
  "salary": "$800+",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Overview\r\nWe’re hiring a content writer who specializes in service page and geo-location page writing. These pages appear on client websites and directly impact how well we rank in search. This is not a blog writing job — you’ll be writing structured, keyword-targeted content designed to convert.\n\r\nIn addition to service and location pages, you’ll write key web pages like home and about content that support SEO and brand clarity.\n\r\nResponsibilities\r\nWrite and format service pages for ABA therapy providers and similar clients\r\nBuild out location pages that reflect service coverage across multiple cities/states\r\nTranslate client offerings into persuasive, SEO-informed content\r\nRefine and adapt AI-generated drafts for tone, accuracy, and usefulness\r\nCollaborate with the SEO and design team on layout, CTAs, and linking\r\nParticipate in weekly teaUpgrade to see actual infoetings and give progress updates\r\nManage your workload to meet clear publishing deadlines\n\n\r\nWhat We’re Looking For\r\nExperience writing for service businesses (healthcare/therapy background ideal)\r\nKnowledge of on-page SEO best practices (keyword placement, headers, CTA integration)\r\nStructured and strategic thinking — this is content meant to rank and convert\r\nAbility to follow brand tone and speak to different audiences\r\nComfortable working within a process, revising based on feedback\n\r\nTools & Workflow\r\nWe use Google Docs, Upgrade to see actual info, Slack, and Loom for most team communications and task tracking\r\nYou’ll receive assignments via Upgrade to see actual info, with clear deadlines and word count expectations\r\nAI support (e.g., ChatGPT) may be provided to help with drafts, but all content must be polished, original, and aligned with our tone\r\nYou’ll be trained on our internal SOPs, including formatting, keyword integration, linking strategies, and publishing steps\r\nAll content must be submitted through our internal QA checklist before review.\n\r\nSuccess in This Role Looks Like…\r\nYou consistently hit weekly writing targets (3–5 pieces, depending on type and length)\r\nYou maintain a low revision rate by following briefs closely and self-editing thoroughly\r\nYou’re responsive during PH working hours and communicate clearly if you’re stuck or need help\r\nYou demonstrate improvement over time in writing speed, accuracy, and strategic keyword use\r\nYou accept feedback well and apply it to future drafts without repeating the same issues\n\r\nApplication Requirement:\r\nAlong with your resume, please submit a 200–300 word writing sample answering the question:\r\n“What is ABA Therapy?”\r\nYour response must include three different tones, each written in 60–100 words:\r\nProfessional/Formal Tone\r\n– Explain what ABA therapy is using factual, objective language. Include data, definitions, and evidence-based information as you would in an educational or clinical context.\r\nWarm/Heartfelt Tone\r\n– Describe ABA therapy in a compassionate, personal way. Speak to families or caregivers, focusing on connection, hope, and the human impact of therapy.\r\nPromotional/Sales-Oriented Tone\r\n– Present ABA therapy in a persuasive way, as if you're encouraging a parent to enroll their child. Highlight benefits and outcomes, and use clear, engaging language.\r\nEach tone should clearly reflect a shift in voice, audience, and intent.",
  "skill_requirements": [
    "Copywriting",
    "Communication"
  ],
  "is_active": true,
  "status_history": []
}