{
  "job_id": "1422744",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Level-1-Support-Analyst-1422744",
  "scraped_at": "2025-07-15T12:21:46.687511",
  "title": "Virtual Level 1 Support Analyst",
  "type_of_work": "Full Time",
  "salary": "35000-50000 PHP per month",
  "hours_per_week": "38",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us\n\r\nAt Schnitz, we are passionate about bringing people together over delicious, fresh, hand-crafted schnitzels. With over 80 stores across Australia, we’re on a mission to make healthy, feel-good food that tastes great and makes people happy.\r\nYou can check us out here:  Upgrade to see actual info/?srsltid=AfmBOoqJ222g9_qcc79-wDHM6sZJsGVDN1Ua6F7MoWmz48OdgaDVQu_f\n\r\nWe are now looking for two Virtual Level 1 Support Analysts to join our growing team and help us deliver exceptional IT support to our franchisees and internal teams.\n\r\nThe Role\n\r\nAs a Virtual Level 1 Support Analyst, you’ll be the first point of contact for our franchisees and staff, providing friendly and efficient technical support. You’ll handle inquiries via phone, email, and our ticketing system, helping to keep our POS systems, networks, and back-of-house applications running smoothly.\n\r\nYou’ll also assist the IT Team with administrative tasks and ensure we deliver consistent, high-quality IT service across our network.\n\r\nThis is a remote role supporting Australian hours, so flexibility to work rotational shifts (including weekends and public holidays) is essential.\n\r\nKey Responsibilities\r\nProvide Level 1 technical support for:\r\n*POS systems\r\n*Internet and Wi-Fi networks\r\n*Back-of-house applications\r\n*Troubleshoot and resolve hardware, software, and network issues remotely.\r\n*Monitor systems to proactively identify and address potential issues.\r\n*Install, configure, and maintain software across the Schnitz network.\r\n*Escalate complex problems to senior IT staff when needed.\r\n*Maintain accurate records of iUpgrade to see actual info, resolutions, and processes.\r\n*Provide user training and guidance to hospitality staff when required.\r\n*Support data security and compliance with IT policies and local regulations.\r\n*Collaborate with the on-site IT team to ensure seamless service delivery.\n\r\nAbout You\r\nExperience in remote IT support or service desk roles (preferred).\r\nFamiliarity with remote support tools (e.g. TeamViewer) and restaurant/QSR systems (advantageous).\r\nSolid understanding of Windows/Mac OS, networking basics, and cloud-based tools.\r\nExcellent English communication skills, both written and verbal.\r\nA customer-focused, solution-oriented mindset.\r\nFlexible to work rotational shifts, including weekends and public holidays.\n\r\nWhy Join Us?\n\r\nBe part of a growing, supportive team in a national brand.\n\r\nWork remotely and support a business that’s all about great food and happy people.\n\r\nOpportunity to grow your IT skills in a fast-paced hospitality environment.\n\r\nReady to apply?\n\r\nIf you’re passionate about IT support and think this role is for you, please click the link below to apply.\nUpgrade to see actual info\n\r\nPlease note: we will not be responding on this platform, so please apply through the link above. Shortlisted candidates will be contacted.\n\r\nKind Regards,\n\r\nThe Schnitz Team",
  "skill_requirements": [
    "Technical Support",
    "IT",
    "Networking"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:27:15.088917",
      "reason": "Job first discovered"
    }
  ]
}