{
  "job_id": "1422400",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Product-lister-1422400",
  "scraped_at": "2025-07-15T15:30:14.673153",
  "title": "Shopify Product lister",
  "type_of_work": "Part Time",
  "salary": "$330 up till $650 per month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Our e-commerce company is hiring! We are looking for a full-time E-Commerce Lister to join our team, someone with a thorough understanding of Shopify. You will make sure that our product listings are optimized for conversions and the descriptions are appealing to website visitors. If you have experience with listing fashion products in the ''dropshipping'' industry - you could be the right fit! \r\nRead further below.\n\r\nWhat does a Product lister do?\r\nA Product lister is mainly responsible for listing new products on the Shopify store. This may involve writing content to describe listings, product photography, measurements,dimensions,sizes, and SEO. This may also involve helping to improve older listings to maximize sales. Marketing skills are required!\n\n\r\nResponsibilities and Duties\r\n- Creating new product listings on our Shopify store.\r\n- Writing content to describe products, adding and editing images, GIFs, re-direct links,\r\n- Accurately compare the products with the ones from our supplier.\r\n- Improving old product listings with updated descriptions and images.\r\n- Reviewing marketing materials, websites and presentations to ensure compliance with the regulations of the advertising platforms.\n\n\r\nQualifications and Skills\r\n- Marketing oriented. Marketing is your genuine interest and you love shopping online.\r\n- Technically savvy. You love all things related to technical details. You are quick to learn and are known for your technical capabilities.\r\n- Have a high attention to detail. When it comes to details, nothing gets past you.. and we mean nothing! So much so that we want you to include \"the devil is in the details\" as the answer to the first question when you submit your application. Seriously.\r\nPassion for process and systems. You love structure, order, and workflows. You naturally build out process flows in everything you do.\r\n- Thrives in a fast paced environment. You get excited working at a fast pace and have a proven track record of flawless execution. You have a strong ability to multi-task and stay organized.\r\nYou do what you say. You are passionate about delivering results and you always finish what you start. You take pride in being able to keep your word.\r\n- Excellent verbal and written communication skills in English.\n\r\nProduct lister experience requirements\r\nPreferably you have a couple of years experience in this field, and have worked for other drop shipping companies that ship products from Asia. You must understand how paid advertising works, in the sense that you know how sending traffic to an online store should lead to conversions.\n\r\nSalary Expectations\r\nYou will start as Trainee Support Representative, where you will be working on the side of the company owner, 1 to 3 hrs per day.\r\nWe always start with a 2-week trial. After that, we'll have an evaluation to see if both parties would like to proceed to work together.\n\r\nBenefits\r\n- Get to work in a young company with lots of ambitions.\r\n- Work fully remote.\r\n- Get paid every week, instead of once per month (13 times per year).\r\n- Upgrade your knowledge and skills in the fastest growing industry: digital marketing.\r\n- If you are the right fit, you can grow within our company and potentially in working hours/salary. You will get personal training from the owner who has years of experience in logistics, customer service, management and E-Commerce in general.\n\r\nIf you can commit to and live with the following principles, then you are the type of person who will be successful and help our company thrive. If you feel this level of engagement is not right for you or that you're not willing or able to participate with us at this level, we are not a good fit for you. Our expectation is that you will take the steps necessary to do what you say you are going to do and be accountable for your actions. In other words, live 'Above the line'. Please include the word \"Blue\" in your application to show that you've read and understood this commitment.\n\r\nAre you looking for a new adventure? Make sure you apply today!\n\r\nKind regards,\n\r\nJeremy Vos",
  "skill_requirements": [
    "Marketing",
    "Shopify",
    "Product Listing"
  ],
  "is_active": true,
  "status_history": []
}