{
  "job_id": "1422778",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Assistant-1422778",
  "scraped_at": "2025-07-15T15:30:54.578241",
  "title": "Marketing Assistant",
  "type_of_work": "Part Time",
  "salary": "$700",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking a highly skilled and detail-obsessed Marketing Assistant to support a leading professional services firm with a strong focus on high-quality, polished content. This role requires expertise in video editing, copywriting, and graphic design/branding, ideally with experience supporting law firms or other professional services clients.\n\r\nThe ideal candidate will have exceptional attention to detail. You must take pride in delivering flawless work that aligns with strict brand guidelines and reflects a premium, professional image.\n\r\nResponsibilities:\r\nCreate and edit high-quality video content for social media, websites, and other digital platforms.\r\nDevelop strong, persuasive, and engaging copy for various channels (social posts, video scripts, email campaigns, website content).\r\nDesign visually compelling graphics and branding materials in line with brand guidelines.\r\nCollaborate with the marketing and leadership teams to conceptualize, plan, and execute content strategies.\r\nEnsure brand consistency across all content and design outputs.\r\nManage content calendars, schedules, and deadlines with a proactive, organized approach.\r\nConduct in-depth proofreading and quality checks on all deliverables to ensure precision and accuracy.\r\nStay up to date with design trends, social media best practices, and industry developments.\r\nSupport ongoing content strategy improvements and provide creative ideas to elevate brand presence.\r\nMaintain and manage a digital asset library (videos, images, design files, copy).\r\nAssist with WordPress website updates and content management\r\nCreate and manage email marketing campaigns\r\nSupport broader marketing strategy planning and execution\n\r\nRequirements:\n\r\nMinimum 3–5 years of experience in video editing, copywriting, and graphic design for professional services businesses.\r\nExceptional attention to detail - you must deliver near-perfect work every time.\r\nProven ability to manage multiple projects simultaneously and meet tight deadlines.\r\nStrong portfolio showcasing high-quality video edits, copywriting samples, and design work.\r\nAdvanced skills in Adobe Creative Suite (Premiere Pro, After Effects, Photoshop, Illustrator, InDesign) and other relevant tools.\r\nExperience with WordPress, including content updates and basic design adjustments\r\nExperience in email marketing, including platform setup, campaign building, and reporting\r\nAbility to contribute to marketing strategy development and collaborate on high-level planning\r\nExcellent written and verbal English communication skills.\r\nHighly organized, self-sufficient, and proactive.\r\nComfortable working directly with perfectionist clients and adapting quickly to feedback.\r\nExperience working with law firms or professional services clients (highly desirable).\r\nStrong understanding of brand strategy and how to convey brand voice and visual identity.\n\r\nSoftware to Be Used:\n\r\n Adobe Creative Suite or your preferred editing software\r\n Your preferred project management system for content management. \r\n All social media platforms. \n\r\nTime zone: AEST\n\r\nWorking Hours: 4 hours per day / 20 hours per week",
  "skill_requirements": [
    "Copywriting",
    "Graphic Design",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T05:37:17.620576",
      "reason": "Job first discovered"
    }
  ]
}