{
  "job_id": "1422317",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Short-Form-Video-Editor-Adobe-Premiere-1422317",
  "scraped_at": "2025-07-15T14:41:48.679745",
  "title": "Short-Form Video Editor [Adobe Premiere]",
  "type_of_work": "Full Time",
  "salary": "$1000-$1500/month based on experience & deliverables",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "DO NOT SEND YOUR PORTFOLIO LINK.\r\nDO NOT APPLY WITHOUT READING THE INSTRUCTIONS BELOW.\n\r\nInterviews will be scheduled based on those that follow directions best. Read description and make sure you fit the qualifications before applying. Simple TEST EDIT for 30 second reel will be required.\n\r\nThe Video Editor is responsible for editing short videos tailored for various social media platforms, keeping project management tools up-to-date, and staying on top of social media trends. The Video Editor will be a critical part of the creative team, ensuring high-quality, engaging, and timely video content.\n\r\nReports directly to: CEO\n\r\n**ROLES, RESPONSIBILITIES, EXPECTATIONS**\r\n1. Editing Short-Form Videos for Social Media\n\r\nResponsibilities:\r\n- Edit and finalize short-form video content for social media channels such as Instagram Reels, TikTok, and Facebook suited to each brand style, color, etc.\r\n- Work closely with the CEO/Creative Director and Content Team to ensure the videos align with the brand voice and style.\n\r\nSMART Expectations:\r\n- Specific: Edit videos in line with topic and brand, creative direction, incorporating feedback efficiently.\r\n- Measurable: Complete each edit within a 2-3 hour timeframe start, looking to 4-6 edits /daily after month 1.\r\n- Attainable: Have access to the necessary software and tools for video editing.\r\n- Realistic: Be capable of handling multiple edits per week based on workflow. 10+ videos to start, 20+videos by month 2.\r\n- Timely: Deliver each edit on or before the agreed-upon deadline.\n\r\n2. Keeping Project Management Up-to-date\n\r\nResponsibilities:\r\n- Regularly update project management tools with the status of ongoing projects.\r\n- Communicate effectively with the Creative Director and team regarding project timelines and deliverables.\n\r\nSMART Expectations:\r\n- Specific: Use project management software to track and update the status of each assignment.\r\n- Measurable: Update the project status immediately upon completion of milestones or any changes.\r\n- Attainable: Coordinate with teaUpgrade to see actual infombers to ensure everyone is aligned.\r\n- Realistic: Make real-time updates achievable within the current workflow.\r\n- Timely: Project statuses should be updated at least once a day.\n\r\n3. Keeping Up with Social Media Trends\n\r\nResponsibilities:\r\n- Continuously research and keep up-to-date on the latest social media video trends.\r\n- Implement trend insights into video edits to increase engagement and reach.\n\r\nSMART Expectations:\r\n- Specific: Identify new trends relevant to our industry and target audience.\r\n- Measurable: Monitor performance metrics to see the impact of implemented trends.\r\n- Attainable: Allocate time each week for trend research.\r\n- Realistic: Actively seek out trends but balance it with existing project responsibilities.\r\n- Timely: Report trends to the Creative Director and team on a weekly basis.\n\r\nINTERNAL MEETING CADENCE\n\r\n- 1x week editor training\r\n- Monthly teaUpgrade to see actual infoetings\n\r\nBy adhering to these responsibilities and expectations, the Video Editor will significantly contribute to the effectiveness and quality of our content, thus serving our brand's mission and goals effectively.\n\r\n***************INSTRUCTIONS TO APPLY:*****************\n\r\nREPLY WITH ANSWERS TO THESE 6 QUESTIONS:\n\r\n1. What video editing software are you most proficient in (e.g., Adobe Premiere Pro, Final Cut Pro, DaVinci Resolve)? Can you briefly explain your experience level with each?\r\n2. What do you look for when identifying hooks, value adds and call to actions?\r\n3. Describe your process for understanding a brand's specific style guidelines and incorporating them into your edits.\r\n4. Have you ever edited interview footage into multiple, engaging short-form content pieces? If so, can you walk me through your approach?\r\n5. What is your turnaround time for revisions? Can you describe your workflow for meeting tight deadlines while maintaining video quality?\r\n6. What intrigues you about this role as its been outlined above?\n\r\nSEND 3 (ONLY 3) SAMPLE VIDEOS OF YOURS that best match this style: Upgrade to see actual info/reel/C8-oj1bvOGu/?igsh=MzRlODBiNWFlZA==\n\r\nLOOKING TO MIMIC THIS CAPTION STYLE SPECIFICALLY.\r\nNOT INTERESTED IN A LOT OF OVERLAYS OR GRAPHICS THAT ARE DISTRACTING, WANT TO FOCUS ON THE CLIENT AND THEIR VALUE THROUGH THEIR WORDS.\n\r\nI look forward to reviewing your application.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Instagram marketing",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": []
}