{
  "job_id": "1422884",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Part-time-Medical-Virtual-Assistant-1422884",
  "scraped_at": "2025-07-15T14:36:57.526490",
  "title": "Part-time Medical Virtual Assistant",
  "type_of_work": "Part Time",
  "salary": "$800-$1,000",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Medical Virtual Assistant\r\nPosition type: Part-time\r\nWork hours: 11:00 AM – 4:00 PM Eastern Time\r\nWork days: Monday - Friday\r\nSalary: $5 - $6 per hour, depending on experience\n\r\nAbout Us:\n\r\nWe are committed to helping patients achieve optimal wellness, including specialized treatments such as wave therapy. We are looking for a motivated and skilled Medical Virtual Assistant who can support our practice by enhancing patient communication, managing administrative functions, and contributing to community outreach.\n\r\nKey Responsibilities:\r\n• Call back old leads and educate them about Medicare-covered services.\r\n• Make outbound cold calls to patients, clinics, and community directors.\r\n• Schedule, confirm, and manage patient appointments.\r\n• Maintain and update patient records using AdvanceMD EMR.\r\n• Process claims, verify insurance, and support billing tasks.\r\n• Coordinate with care providers and discuss sensitive health topics professionally.\r\n• Manage email, text communication, newsletters, and social media accounts.\r\n• Organize reports, spreadsheets, and track tasks using Google Sheets.\n\r\nBasic Qualifications:\r\n• Experience in the medical field or healthcare setting\r\n• Strong communication skills with minimal accent\r\n• Comfortable handling objections and explaining medical services clearly\r\n• Familiarity with AdvanceMD and Google Suite tools\r\n• Confident, energetic, and passionate about patient support\r\n• Sales experience is a plus, especially in B2C or clinical settings\r\n• Fluent English speaker with a professional and patient-friendly tone\r\n• Self-motivated and experienced in handling sensitive topics\r\n• Energetic, passionate, and able to promote wellness-focused services\r\n• Able to work independently and adapt in a remote setting\n\r\nTechnical Requirements:\r\n• Device: Reliable laptop or desktop computer.\r\n• Internet: High-speed connection (minimum 10 Mbps).\r\n• Audio: Noise-canceling headset.\r\n• Video: Webcam for virtual meetings.\r\n• Workspace: Quiet, professional environment.\n\r\nFor interested applicants, please attach the link to your resume and send it to me with the subject line: IRVING",
  "skill_requirements": [
    "Cold Calling",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:39:24.416855",
      "reason": "Job first discovered"
    }
  ]
}