{
  "job_id": "1422240",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-QuickBooks-Online-Bookkeeper-1422240",
  "scraped_at": "2025-07-15T13:36:14.923751",
  "title": "Remote QuickBooks Online Bookkeeper",
  "type_of_work": "Full Time",
  "salary": "700",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us:\r\nDynasty Accounting is a dynamic accounting firm specializing in providing comprehensive financial services to small and medium-sized businesses. We pride ourselves on our commitment to accuracy, efficiency, and personalized service tailored to our clients' needs. As we continue to expand our operations, we are seeking a dedicated and experienced QuickBooks Online Bookkeeper to join our team remotely.\n\r\n*PLEASE NOTE THAT IF YOU ARE NOT AN ACCOUNTANT AND HAVE NOT WORKED WITH AN ACCOUNTING FIRM IN THE PAST, YOUR APPLICATION WILL AUTOMATICALLY BE REJECTED*\n\n\r\nJob Description:\r\nWe are currently seeking a detail-oriented and proficient QuickBooks Online Bookkeeper to join our remote team. The ideal candidate will be responsible for managing the day-to-day financial transactions of our clients, ensuring accuracy, and maintaining up-to-date records using QuickBooks Online.\n\r\nResponsibilities:\r\n- Manage and reconcile bank accounts, credit cards, and other financial accounts for multiple clients.\r\n- Process accounts payable and accounts receivable transactions accurately and efficiently.\r\n- Prepare monthly financial reports, including profit and loss statements, balance sheets, and cash flow statements.\r\n- Demonstrate knowledge of business tax forms and the ability to accurately interpret and enter relevant financial data.\r\n- Communicate regularly with clients to address inquiries, provide financial updates, and offer support as needed.\r\n- Collaborate effectively with teaUpgrade to see actual infombers to ensure seamless delivery of accounting services.\n\r\nRequirements:\r\n- Bachelor’s degree in Accounting is required.\r\n- Minimum of 2 years of hands-on experience using QuickBooks Online.\r\n- Must have prior experience working with an accounting firm.\r\n- Proven experience working as a bookkeeper or in a similar role, preferably with QuickBooks Online.\r\n- Proficiency in QuickBooks Online and strong understanding of accounting principles and practices.\r\n- Excellent attention to detail and organizational skills, with the ability to manage multiple tasks efficiently.\r\n- Strong communication skills and ability to interact professionally with clients and teaUpgrade to see actual infombers.\r\n- Reliable internet connection and ability to work independently in a remote environment.\n\r\nAdditional Requirements:\r\n- Familiarity with an accounting firm's processes and procedures.\r\n- Ability to adapt to changing priorities and work well under pressure.\r\n- Commitment to maintaining confidentiality and integrity in handling sensitive financial information.\n\r\nBenefits:\r\n- Flexible remote work environment.\r\n- Competitive compensation based on experience.\r\n- Opportunity to work with a growing accounting firm and gain valuable experience in the field.\r\n- Potential for career advancement and professional development opportunities.\n\r\nHow to Apply:\r\nIf you meet the requirements and are interested in joining our team as a Remote QuickBooks Online Bookkeeper, please submit your resume and a brief cover letter outlining your qualifications and relevant experience to Upgrade to see actual info and be sure to cc Upgrade to see actual info as well. \n\r\nWe look forward to hearing from you!",
  "skill_requirements": [
    "Accounting",
    "Quickbooks",
    "Bookkeeping"
  ],
  "is_active": true,
  "status_history": []
}