{
  "job_id": "1422063",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Customer-Service-Dispatch-Coordinator-Full-Time-PH-Based-1422063",
  "scraped_at": "2025-07-15T12:25:47.474343",
  "title": "Remote Customer Service & Dispatch Coordinator (Full-Time, PH-Based)",
  "type_of_work": "Full Time",
  "salary": "$700/mo",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Join a fast-paced residential electrical company where your customer service skills help drive operational success and homeowner satisfaction!\n\r\nInnovate Electric is a fast-growing residential electrical company based in St. Louis, Missouri. We’re looking for a full-time Customer Service & Dispatch Coordinator based in the Philippines to join our virtual team. If you’re a great communicator, detail-oriented, and ready to grow with a supportive team, we’d love to hear from you.\n\r\nAs the first point of contact for our customers, your mission is to provide 5-star service, schedule jobs accurately, support field operations, and assist in lead generation and internal coordination.\n\r\nResponsibilities:\n\r\n* Answer inbound phone calls professionally and warmly\r\n* Schedule service appointments in our CRM (Housecall Pro)\r\n* Dispatch electricians to job sites based on schedule and location\r\n* Conduct targeted outbound calls to generate leads and follow up with past customers\r\n* Resolve customer concerns with patience, professionalism, and care\r\n* Post content on Facebook to increase brand awareness and engagement\r\n* Coordinate with our accounting/bookkeeping team to help maintain accurate records\r\n* Follow up with customers after jobs to ensure a 5-star experience\n\r\nRequired Qualifications:\n\r\n* Based in the Philippines, with a strong internet connection and quiet home office setup\r\n* Fluent in English with excellent verbal and written communication skills\r\n* Proven experience in customer service, dispatch, or scheduling in a home services company\r\n* Experience using Google Workspace (Gmail, Google Sheets, Docs)\r\n* Experience with CRM or scheduling platforms like Housecall Pro or ServiceTitan is a plus\r\n* Tech-savvy, organized, and able to learn new systems quickly\r\n* Calm under pressure and able to multitask efficiently\n\r\nWhy Join Us:\r\n* Competitive pay\r\n* Long-term full-time position with growth opportunities\r\n* Supportive, respectful team culture\r\n* Training provided\r\n* Meaningful role that directly helps families and communities\n\r\nHow to Apply:?Please send your application along with written answers to the following questions:\r\n1. Do you have experience working at a home services company? If so, what did you do and how would that translate to this role?\r\n2. What is one area you're working to improve, and how are you addressing it?\r\n3. Tell us about a time you turned an unhappy customer into a satisfied one—what did you do?\n\r\nIf you're passionate about delivering top-tier service and want to help shape our customer experience, we invite you to apply.",
  "skill_requirements": [
    "Customer Service",
    "Administrative Support",
    "Appointment Setting"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:33:43.647077",
      "reason": "Job first discovered"
    }
  ]
}