{
  "job_id": "1422324",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Rockstar-ISA-to-call-Brides-to-Book-Bridal-Gown-Appointments-1422324",
  "scraped_at": "2025-07-15T14:35:00.548107",
  "title": "Rockstar ISA to call Brides to Book Bridal Gown Appointments",
  "type_of_work": "Full Time",
  "salary": "$1,250 to $1,400 per month",
  "hours_per_week": "43",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About the ISA Role\r\nAs a FEMALE  ISA , you'll spend your workday speaking directly with brides-to-be who’ve shown interest in visiting our partner bridal boutiques. Your mission? Build rapport, answer questions, qualify their needs, and secure appointments for their bridal gown fittings.\n\r\nYou'll be the friendly, reassuring voice guiding them through this important part of their wedding planning journey—making them feel valued, heard, and cared for.\n\r\nWhat You'll Do\r\nMake outbound calls to brides who submitted inquiries online\n\r\nBuild genuine, warm connections in every conversation\n\r\nQualify leads by understanding their needs, style, budget, and timeline\n\r\nGuide brides through the booking process and schedule their appointments\n\r\nAccurately update lead details and appointment info in our CRM\n\r\nMaintain daily call reporting and attend training sessions as needed\n\r\nWho We're Looking For\r\nExcellent spoken and written English\n\r\nConfident, friendly phone presence with outstanding soft skills\n\r\nExperience making calls to online leads (preferred)\n\r\nFamiliarity with CRM systems (Go High Level is a plus)\n\r\nPatience, empathy, and the ability to keep conversations positive and relaxed\n\r\nTechnical Requirements\r\nStable internet connection (minimum 20 Mbps upload/download)\n\r\nQuality microphone and headset\n\r\nMinimum 8GB RAM computer\n\r\nPerks of the Role\r\nPaid, comprehensive training\n\r\nStable, long-term opportunity\n\r\nSupportive, friendly team environment\n\r\nWork from home\n\r\nWhat to Expect\r\nComprehensive paid training: 8 hours/day for two weeks\n\r\nStart at 5 hours/day for the first 4 weeks post-training\n\r\nGrow to 8 hours/day in a stable, long-term role with room to develop\n\r\nWork aligned to US time zones (Eastern or Pacific Time)\n\r\nSome Saturday availability required (not every Saturday)\n\r\nHow to Apply\r\nInclude a voice recording or short video introduction with your application (this is required)\n\r\nTo confirm you read the full post, please include the number 67 in your message",
  "skill_requirements": [
    "Inbound Sales",
    "Cold Calling",
    "ISA Real Estate"
  ],
  "is_active": true,
  "status_history": []
}