{
  "job_id": "1422235",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Payment-Posting-Specialist-1422235",
  "scraped_at": "2025-07-15T12:28:15.594688",
  "title": "Payment Posting Specialist",
  "type_of_work": "Full Time",
  "salary": "TBA",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "(Work from Home – Pacific Time Hours | Full-Time | 2 Openings)\r\nOverview\r\nWe are hiring two experienced Payment Posters to join our remote team supporting a healthcare organization based in California. This full-time position is ideal for professionals with a strong background in U.S. medical billing and payment posting, particularly within platforms like CollaborateMD.\r\nThe role requires working graveyard hours (Pacific Time zone) and offers a stable, long-term opportunity for reliable and detail-oriented individuals.\r\nKey Responsibilities\r\nPost payments accurately in CollaborateMD (CMD) for all assigned facilities.\r\nReview EOBs and insurance reason codes to determine correct application of payments.\r\nApply patient responsibilities appropriately and set correct claim statuses for routing back to the A/R team as needed.\r\nAssign statuses such as:\r\nPolicy Terminated at Insurance – reason code 200\r\nDenied at Insurance – unclear denial or general denial codes (e.g., 197, 204)\r\nRecoupment Requested at Insurance – payment reversal or overpayment letters\r\nAdd detailed and accurate notes in CMD and Salesforce, including patient details and denial explanations.\r\nManually apply payments received via email (checks or credit cards).\r\nCheck shared folders and payer portals (e.g., Zelis, ECHO) for additional payments not received via ERA.\r\nRespond to payment-related inquiries from facilities in a timely and professional manner.\r\nRun routine reports:\r\nPending Payments – locate and manually apply missing payments\r\nSpot Check Reports – verify applied payments and review for unusual patient responsibilities or overpayments\r\nSupport team communication by flagging recoupment or denial trends and unusual payer behavior.\n\r\nQualifications\r\nMinimum 2–3 years of hands-on experience with U.S. medical payment posting.\r\nProficiency with CollaborateMD or a similar billing system.\r\nAbility to interpret EOBs, payer correspondence, and denial codes accurately.\r\nExcellent attention to detail, with consistent documentation and note-taking.\r\nConfident working independently, while being communicative and reliable within a remote team\r\nStrong English reading comprehension and written communication skills.\n\r\nTechnical Requirements\r\nMust have a reliable internet connection with minimum speeds of 50 Mbps download / 50 Mbps upload.\r\nMust have backup internet and power options in place to ensure consistent attendance and performance.\r\nAbility to join scheduled ZooUpgrade to see actual infoetings, communicate via Slack, and follow email-based workflows.\n\r\nWork Schedule & Setup\r\nFull-Time: 40 hours per week\r\nSchedule: Must be available during Pacific Time (U.S. graveyard hours)\r\nLocation: Remote – Philippines (work from home)\r\nMust have a quiet, secure workspace with reliable hardware for handling confidential healthcare data.\r\nBonus Skills (Nice to Have)\r\nExperience using Salesforce to manage VOB or payment notes.\r\nFamiliarity with ERA setup, payer portal troubleshooting, and U.S. insurance workflows.\n\r\nTo Apply\r\nPlease fill out this preliminary application to indicate your interest in the role. After review, anyone that is qualified will receive a 2nd application that is more job specific. We look forward to reviewing your submission. Fill out that form here: Upgrade to see actual info \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}