{
  "job_id": "1422598",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Automotive-Video-Editor-for-YouTube-Channel-Remote-Long-Term-Opportunity-1422598",
  "scraped_at": "2025-07-15T15:41:06.052546",
  "title": "Automotive Video Editor for YouTube Channel (Remote, Long-Term Opportunity)",
  "type_of_work": "Full Time",
  "salary": "Commensurate with experience",
  "hours_per_week": "30",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking a skilled and passionate Video Editor to join our team in a key remote, long-term role. This position is ideal for someone who loves cars and has proven experience creating dynamic video content for both YouTube and popular short-form platforms (Instagram Reels, TikTok).\n\r\nKey Responsibilities:\n\r\n- Edit high-quality POV car review videos for YouTube.\r\n- Develop engaging short-form content optimized for Instagram Reels and TikTok.\r\n- Collaborate with content creators and social media managers.\r\n-Manage workload efficiently to meet deadlines (approx. 30 hours/week).\n\r\nWe're Looking For:\n\r\n- Proficiency in Final Cut Pro or Adobe Premiere Pro.\r\n- Strong skills in color correction, grading, and Photoshop (for thumbnails).\r\n- Highly detail-oriented, organized, and reliable.\r\n- Excellent communicator with a track record of hitting deadlines.\r\n- Ability to work independently and solve problems creatively.\r\n- Fast, reliable computer (4K editing capable) and high-speed internet.\n\r\nYour Workflow:\r\nYou'll receive raw footage (GoPro POV, iPhone B-roll, audio), edit a polished YouTube draft with 3 thumbnail concepts, manage feedback, and then reformat clips with captions for short-form platforms. Final publishing is handled internally.\n\r\nWhy Join Us?\n\r\n- Be part of a growing, fast-paced automotive YouTube channel.\r\n- Opportunity for creative freedom with exciting car content.\r\n- Long-term growth and career advancement potential.\n\r\nAre you ready to shift your career into high gear? We're eager to see your portfolio and learn how your passion for cars and editing can drive our content forward!\n\r\nAPPLY NOW: forms .gle/ DSmT1TWNNCZe2ZxS7 (remove the spaces)",
  "skill_requirements": [
    "Photoshop",
    "Adobe Premiere Pro"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:34:09.634473",
      "reason": "Job first discovered"
    }
  ]
}