{
  "job_id": "1422083",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-for-Tiktok-Meta-organic-paid-ads-1422083",
  "scraped_at": "2025-07-14T23:09:56.687910",
  "title": "Video Editor for Tiktok & Meta (organic & paid ads)",
  "type_of_work": "Full Time",
  "salary": "800-1200",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "???? About Us\r\nWe're two rapidly growing DTC brands with a global audience — one selling the world’s most mysterious honey (Real Mad Honey), and one offering premium wellness supplements (Pure Nature Goods). Our content is bold, fast-paced, satirical, and made to perform. We don’t just want nice videos. We want jaw-dropping ones.\n\r\n???? What We’re Looking For\r\nWe’re searching for a world-class video editor who understands both the creative and performance sides of content. You’ll be editing videos for ads, social media (mostly TikTok/Instagram Reels), landing pages, product showcases, and more — always with a sharp sense of brand, humor, and conversion power.\n\r\nYou’ll be collaborating closely with our:\n\r\n???? Performance Marketer – to understand what works\n\r\n???? Content Manager – for delivery timelines and creative briefs\n\r\n???? Creative Director – to bring big ideas to life and make them look amazing\n\r\n????? Your Responsibilities\r\nEdit 2–4 short-form videos per day (or batch accordingly)\n\r\nImplement creative briefs and storyboards with your own artistic flair\n\r\nAdd dynamic subtitles, sound effects, animations, and transitions that wow\n\r\nMatch the tone and pace of our brand (bold, witty, curious, premium)\n\r\nTrack which creatives perform best and why — then double down\n\r\nMaintain a high quality of delivery under deadlines\n\r\nOrganize files clearly for efficient collaboration\n\r\nCollaborate daily via Slack, Trello and Atria. \n\r\n???? Must-Haves\r\nExcellent video editing skills \n\r\nA portfolio with strong ad-style or storytelling edits\n\r\nExperience editing UGC, ads, and performance-driven videos\n\r\nHigh attention to detail — especially pacing, subtitles, and visual rhythm\n\r\nUnderstanding of how hooks and story arcs work in video marketing\n\r\nStrong English communication skills\n\r\nReliable Wi-Fi and self-management\n\r\nA love for creative experimentation and thinking in Upgrade to see actual infos\n\r\n???? Bonus Points\r\nExperience working with wellness, supplements, or DTC brands\n\r\nMotion graphics and animation experience\n\r\nCopywriting or scripting instincts\n\r\nPast winners: if you’ve edited a high-performing ad, we want to see it\n\r\n???? Our Goal for You\r\nWe don’t just want someone to follow instructions — we want someone who contributes ideas, pushes the creative boundaries, and becomes the reason people click, watch, and buy.\n\r\nThis is not a “drag and drop” editing job — this is for editors who get the psychology of performance marketing and want to be proud of their work.\n\r\n?? How to Apply\r\nSend us your portfolio or links to recent work (ads, reels, UGC, etc.)\n\r\nBriefly explain: Why do you think your editing style fits our brand?\n\r\nTell us your editing software of choice\n\r\nInclude the word \"WOWHONEY\" in your subject line so we know you read this.\n\r\nCan’t wait to see your magic!\r\nLet’s make something people can’t scroll past. ????????",
  "skill_requirements": [
    "Social Media Content Creation",
    "Video Content Creation",
    "Video Editing"
  ]
}