{
  "job_id": "1422686",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Odoo-ERP-Specialist-Needed-for-Manufacturing-Implementation-1422686",
  "scraped_at": "2025-07-15T15:37:36.644202",
  "title": "Odoo ERP Specialist Needed for Manufacturing Implementation",
  "type_of_work": "Part Time",
  "salary": "500/month",
  "hours_per_week": "10",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a growing pizza manufacturing company based in Australia, looking for an experienced Odoo ERP professional to support and manage our production and operations modules. Our company operates a fast-paced production line and requires a specialist who can streamline processes, improve system accuracy, and support cross-functional teams.\n\r\nKey Responsibilities:\r\n• Manage and optimise Odoo modules including:\r\n• Manufacturing\r\n• Purchasing\r\n• Inventory\r\n• PLM (Product Lifecycle Management)\r\n• Maintenance\r\n• Repairs\r\n• Collaborate closely with our Accounts/Finance Team and Product Manager to ensure accurate data flow between production, procurement, and financial reporting.\r\n• Assist with system configurations, troubleshooting, workflow improvements, and user training.\r\n• Identify and implement best practices to improve manufacturing and operational efficiency.\r\n• Maintain documentation of processes and configurations for internal reference.\n\r\nRequirements:\r\n• Proven, hands-on experience with Odoo ERP (particularly Manufacturing, Inventory, PLM, Maintenance, and Repairs modules).\r\n• Strong understanding of supply chain, production workflows, and inventory management.\r\n• Ability to work collaboratively with finance/accounting and operational teams.\r\n• Experience in the food manufacturing sector (highly preferred but not essential).\r\n• Strong problem-solving skills, proactive approach, and attention to detail.\r\n• Fluent in English, able to communicate effectively with Australian-based teams.\n\r\nPosition Details:\r\n• Initial engagement: Part-time (2 to 3 hours per day).\r\n• Potential transition: Full-time (up to 40 hours/week) based on performance and business needs.\r\n• Trial period: 8 weeks. This trial will assess technical capabilities, communication, and cultural fit.\r\n• Location: Remote, but applicants must be available during Australian business hours for collaboration as needed.\n\r\nWhy Join Us?\r\n• Be part of a fast-growing, innovative food manufacturing business.\r\n• Work directly with leadership and play a key role in shaping operational systems.\r\n• Long-term opportunity for committed professionals.\n\r\nHow to Apply:\r\nPlease include:\r\n• A brief cover letter highlighting your Odoo experience (especially in manufacturing).\r\n• Relevant case studies or project examples.\r\n• Your availability during Australian hours.",
  "skill_requirements": [
    "Odoo",
    "Odoo Website Builder",
    "SAP ERP"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:34:07.764695",
      "reason": "Job first discovered"
    }
  ]
}