{
  "job_id": "1422392",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Marketing-and-Patient-Support-Assistant-1422392",
  "scraped_at": "2025-07-14T23:07:49.084079",
  "title": "Virtual Marketing and Patient Support Assistant",
  "type_of_work": "Full Time",
  "salary": "110",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "About Us:\r\nWe are a physiotherapy clinic based in Ontario, Canada, specializing in hypermobility, movement dysfunction, and chronic pain. We receive direct referrals from physicians and educate our community through engaging digital content and evidence-based care. Our clinic maintains high standards of patient privacy and professional communication, both online and offline.\r\nRole Summary\r\nWe are seeking a proactive and creative virtual assistant to support lead generation, patient scheduling, and multimedia marketing. You will help manage social platforms, guide leads toward bookings or newsletter sign-ups, and create visually appealing digital content for blogs, emails, and social channels. This is a patient-facing and content-support role requiring professionalism, attention to detail, and a willingness to learn new tools.\n\r\nKey Responsibilities\n\r\n?? Content Creation & Digital Marketing:\r\nCreate and schedule posts across TikTok, Instagram, Facebook, YouTube, and X\r\nConvert static content into engaging visual formats for posts, reels, or slideshows\n\n\r\nConduct keyword research to support blog SEO and video visibility\n\n\r\nSupport blog design: format posts with graphs, tables, visuals, and summaries\n\n\r\nUse Canva (or similar tools) to design graphics for newsletters and posts\n\n\r\nConduct keyword research for SEO and content planning\n\n\r\nHelp execute email campaigns using platforms like Mailchimp, Omnisend, or Beehiiv\n\n\r\nFollow and help build Standard Operating Procedures (SOPs) for repeatable content and communication workflows\r\n?? Lead Generation & Client Communication:\r\nAnswer incoming phone calls to assist with questions, bookings, or rescheduling\n\n\r\nRespond to social media leads (TikTok, Instagram, Facebook, YouTube, X) and direct them to our website for booking or newsletter subscription\n\n\r\nManage patient bookings using software like Noterro\n\n\r\nReach out to referred patients to book initial sessions\n\n\r\nRe-engage patients who dropped off or are due for reassessments\n\n\r\nTrack follow-up communication using CRM tools\n\n\r\nCoordinate appointment reminders and updates\r\nAsk satisfied patients for Google reviews or written testimonials\n\n\r\n?? Administrative Support:\r\nOversee account receivables, including tracking outstanding payments and sending reminders\n\n\r\nTrack patient journeys, email follow-ups, and engagement metrics\n\n\r\nOrganize digital content libraries and SOPs\n\n\r\nCoordinate social posts with content calendars and campaign goals\n\n\r\nRequired Skills\r\nExcellent spoken and written English\n\n\r\nExperience in virtual assistant, customer service, or healthcare support roles\n\n\r\nProficient with tools like Canva, Google Workspace, and scheduling platforms\n\n\r\nStrong attention to detail, organized, and reliable\n\n\r\nComfortable learning and using platforms like Noterro, Mailchimp, Omnisend, and Beehiiv\r\nDesign skills for voiceover videos, slideshows, or blog visuals\n\n\r\nSEO basics and content formatting knowledge\n\n\r\nExperience using Meta Business Suite, Buffer, Later, or other scheduling tools\n\n\n\r\nUnderstanding of and commitment to patient confidentiality, including compliance with PIPEDA and PHIPA privacy laws\n\n\r\nBonus (Assets, Not Required):\r\nPrior work in healthcare, physio, or wellness industries\n\n\r\nExperience editing videos or slides with voiceovers (CapCut, Canva, or similar)\n\n\r\nUnderstanding of patient journey marketing and email funnels\n\n\r\nKnowledge of SEO, keyword research, and blog formatting best practices\n\n\r\nWork Terms\r\nHours: 40 hours/week \r\nLocation: Remote\r\nPay: USD $110/week\r\nStart Date: July 21, 2025\r\nTo Apply:\r\nSend a brief message or video introducing yourself. Include:\r\nExperience with social media, blog formatting, and healthcare clients (if any)\r\nTools you’ve used\r\nYour weekly availability\r\nDesired hourly rate\r\nAlso, please answer the following questions. Information to answer these questions can be found online at visit my website Upgrade to see actual info\r\n1. Tell me what condition do I specialize in and where are we located?\r\n2. If a prospective patient is calling to find out if he/she can be seen the very next day but all practitioners are currently fully booked. How would you approach this? \r\n3. If a prospective patient is outside of Ontario, and is calling to book an appointment, which service would be appropriate to offer to the patient?\n\r\nThank you",
  "skill_requirements": [
    "Phone Support",
    "Office and Administration",
    "Social Media Marketing"
  ]
}