{
  "job_id": "1422706",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Support-Onboarding-Specialist-Technical-Support-FULL-TIME-NIGHT-SHIFT-1422706",
  "scraped_at": "2025-07-15T12:25:32.367442",
  "title": "Sales Support / Onboarding Specialist / Technical Support - FULL TIME - NIGHT SHIFT",
  "type_of_work": "Full Time",
  "salary": "php 75000 - 155000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Sales Support / Customer Onboarding Specialist  - FULL TIME - NIGHT SHIFT\r\nCompany: Upstack Data\r\nLocation: Remote (Global)\r\nCompensation: 75,Upgrade to see actual info,000 PHP\n\r\nAbout Upstack Data\r\nUpstack Data is a remote-first software company specializing in utilizing data to drive intelligent marketing decisions. We prioritize merit, excellence, and intelligence—focusing on impactful results rather than checkboxes. Our culture thrives on asynchronous collaboration, continuous learning, and customer-centric innovation, enabling our teams to work autonomously while staying highly connected.\r\nThe Role\r\nWe're looking for a Customer Onboarding Specialist who’s part technician, part project manager, and part trusted advisor. You’ll lead our customers through technical onboarding, help them integrate Upstack with tools like Hubspot, Klaviyo, Facebook Ads, Google Ads, and Shopify, and stick with them as their go-to partner across live chat, Slack, email, and support tickets.\r\nThis is a full-time remote role with required hours of 8am–4pm EST. You’ll need a professional video setup, high quality microphone and a high-speed internet connection, because you’ll be face-to-face with customers often.\r\nPlease complete this application questionaire to be considered. If you do not complete the form, you will not be considered for the role.\nUpgrade to see actual info\r\nResponsibilities\r\nOwn onboarding.\r\nLead technical onboarding calls with new customers. Ensure correct installation of Upstack's Shopify app. Connect Shopify, Klaviyo, Facebook Ads, and Google Ads. Reduce time-to-value. Onboardings are done on zoom screenshare with customer. We will train you in the process, but you will be onboarding the customer via a zoom screenshare and remote controlling their screen.\r\nBe the product expert.\r\nUnderstand how customer data flows through our system. Help troubleshoot issues like broken facebook pixels, incorrect setup, incorrectly configured klaviyo flows, missing data. You must understand what a perfect set up looks like —and how to get there. ( we will train you )\r\nDeliver fast, proactive support.\r\nHandle live chat, email, and Slack support. Prioritize tickets, escalate engineering bugs, and get customers unblocked. Track patterns and improve docs along the way.\r\nProject manage each customer journey.\r\nKeep onboarding timelines on track. Document progress and success metrics. Run tight feedback loops to ensure our customers activate, adopt, and see ROI quickly.\r\nDrive continuous improvement.\r\nMonitor product usage, identify accounts at risk, and suggest playbooks to improve performance. Share feedback with product and engineering. Build systems, not chaos.\r\nRequirements\r\n5+ years in customer success, technical support, or onboarding for a SaaS company\r\nProven experience with Shopify, Klaviyo, Facebook Ads pixels and conversion API, and Google Ads conversion tracking\r\nConfident leading technical onboarding calls and integrations\r\nExcellent verbal and written communication—you’ll spend lots of time face-to-face with customers\r\nFamiliar with tracking pixels, conversion APIs, and how marketing data flows\r\nAble to triage and solve both user and technical issues independently\r\nComfortable managing multiple onboarding projects simultaneously\r\nBonus: experience with AI tools for onboarding, support, or automation workflows\r\nBonus: light familiarity with HTML, JS, Shopify Liquid, or similar\r\nStrong WiFi, dedicated workspace, and a professional camera/mic setup for video calls\r\nYou act as a subject matter expert and resource for our customers and internal teams at Upstack Data.\r\nAbility to work in a high volume environment\r\nPositive attitude, empathy, and high energy\r\nBecome a subject matter expert on the Upstack platform and solutions.\r\nTake ownership of new customers and manage their successful onboarding of the Upstack Platform.\r\nBuild strong relationships with our customers to understand the goals of their business.\r\nAct as a project manager to ensure timelines are met and customers are onboarded according to established KPIs.\r\nServe as the main point of contact throughout onboarding and also liaison between the customer and the rest of the Upstack team.\r\nYou’ll thrive in this role if you…\r\nGet excited by solving problems, not handing them off\r\nEnjoy being on video and building trust quickly with customers\r\nThink like an operator and act like an owner\r\nKnow how to balance empathy with efficiency\r\nWant to grow alongside a fast-moving team shipping high-impact software\r\nWorkplace Benefits:\r\nHighly competitive compensation\r\nJoin an experienced, talented, and highly motivated team.\r\nExposure to the biggest and best eCommerce brands globally.\r\nWork remotely with our fast growing team around the world",
  "skill_requirements": [
    "Customer Support",
    "Sales Support",
    "Onboarding"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:41:52.507239",
      "reason": "Job first discovered"
    }
  ]
}