{
  "job_id": "1422635",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Canva-Lead-Magnet-Design-PDF-1422635",
  "scraped_at": "2025-07-15T12:28:11.403190",
  "title": "Canva Lead Magnet Design - PDF",
  "type_of_work": "Gig",
  "salary": "20",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role:\n\r\nI'm looking for a creative, detail-oriented Canva designer who can help me turn a written document into a beautifully designed PDF lead magnet. The content is already written, I just need someone to make it visually engaging and aligned with my branding.\n\r\nThis is a one-off project with potential for future design work if we work well together.\n\r\nProject Scope:\r\nYou’ll be designing a lead magnet titled:\r\n\"How to Say No Without Guilt: Scripts + Mindset Shifts for the Woman Who Always Puts Herself Last\"\n\r\nThe PDF will include:\n\r\nA cover page\r\nIntro section (short and friendly)\r\nSections with real-life examples + script responses\r\nA mindset shift page\r\nA common guilt-traps page\r\nCall-to-action to book a free call with me\r\nBranded with my colours, fonts, and tone (I’ll provide guidance)\r\nApprox. 6–8 pages total\n\r\nWhat I’m Looking For:\n\r\nExperience using Canva (required)\r\nStrong design skills with a clean, feminine aesthetic\r\nAbility to follow brand colours and typography\r\nAble to format written content clearly and visually\r\nGood communication and initiative\r\nCan work independently and deliver on time\n\r\nAbout Me:\r\nI’m based in the UK and run a coaching business that supports women who are first-born/first-generation and often the “strong one” in their families. I’m warm, kind, and organised — and I love working with freelancers who bring good energy and a collaborative spirit!\n\r\nTo Apply:\r\nPlease send:\r\nLinks to your Canva portfolio or examples of past work\r\nYour estimated turnaround time\n\r\nLooking forward to working with someone who can bring this resource to life beautifully! ????\n\r\nIvy",
  "skill_requirements": [
    "Canva"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:29:01.930587",
      "reason": "Job first discovered"
    }
  ]
}