{
  "job_id": "1422652",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Talent-Acquisition-Lead-High-Salary-Long-Term-Opportunity-Extensive-Experience-Required-1422652",
  "scraped_at": "2025-07-15T14:31:44.934603",
  "title": "Talent Acquisition Lead - High Salary - Long Term Opportunity - Extensive Experience Required",
  "type_of_work": "Full Time",
  "salary": "- Long Term Opportunity - Extensive Experience Required - OnlineJobs.ph",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Please watch this Loom video for a detailed explanation from our Operations Manager: Upgrade to see actual info/share/fd56424baf5e476a9ebac12e4f0da644\n\n\r\nDISCLAIMER : We are not just looking for someone to sift through résumés or passively coordinate interviews. We are looking for someone who will own the hiring process end-to-end — someone who takes full responsibility for building high-quality pipelines and ensuring we consistently hire dependable teaUpgrade to see actual infombers. You will be expected to manage everything from sourcing and screening to interviewing and presenting final candidates for review. This role requires initiative, sound judgment, and the ability to move the needle independently. Please watch the Loom video in full to understand exactly the type of ownership and accountability we’re looking for.\n\r\nRequirements:\n\r\n-Proven experience managing high-volume recruitment lines, ideally for operational or support roles (customer service, video editing, data entry, etc.).\n\r\n-Highly organized and detail-oriented.\n\r\n-Strong understanding of people assessment and funnel thinking.\n\r\n-Proficient in English.\n\r\n-Interested in committing to a long term opportunity.\n\n\r\nThe Company:\n\n\r\nAt Nebroo, we are revolutionising the hearing aid industry with cutting-edge technology designed to improve lives. In a couple of months, we've grown into a multi 8-figure business and continue to expand rapidly.\r\nWe specialize in direct response marketing and we are looking to expand on native platforms to repurpose what is working for us on facebook and Upgrade to see actual info.\r\nJoin our passionate and innovative team as we shape the future of hearing aid solutions.\n\n\r\nWho we are looking for and what will you be in charge of:\n\r\nWe are looking for a highly driven and detail-oriented Talent Acquisition Lead who thrives in a fast-paced environment and has a proven track record of independently managing high-volume recruitment pipelines. The ideal candidate is someone who is deeply committed to growth — both personal and professional — and who wants to play a key role in scaling a lean, efficient team that drives real results.\n\r\nYou’ll be fully in charge of our hiring process from A to Z for critical operational roles such as customer service reps, video editors, and data entry assistants. That includes sourcing candidates, reviewing Loom video submissions, conducting interviews, and compiling shortlists of top applicants — all while continuously improving our hiring funnel.\n\r\nThis role is not just about coordination — it's about owning the hiring function, optimizing it, and ensuring we consistently bring in dependable, high-quality people who align with our company culture and goals.\n\r\nSalary:\n\r\nThe salary is extremely dependent on your background and the value that you are going to provide to the company from day one. The higher the value you are going to provide, the higher the salary. This will be further discussed in the next steps.",
  "skill_requirements": [
    "Recruiting",
    "Talent Acquisition",
    "Candidate Screening"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:27:48.567595",
      "reason": "Job first discovered"
    }
  ]
}