{
  "job_id": "1422516",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Assistant-1422516",
  "scraped_at": "2025-07-15T12:27:45.957385",
  "title": "Social Media Assistant",
  "type_of_work": "Part Time",
  "salary": "20000 php",
  "hours_per_week": "24",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re looking for someone sharp and precise who manages social media by observing, researching and adapting to what truly works.\r\nSomeone who adapts to the existing style, studies our audience and delivers high quality communication in everything they create.\n\r\nAbout Us\r\nWe are a foundation that creates community for traveling families. Families who, because of their lifestyle, often lack an organic local network. Through month-long programs around the world and ongoing online services, we bring them together to connect, learn, and grow as a community.\n\r\nThe Role\r\nYou will be responsible for all social media content and related communication. Your focus is on delivering high quality communication that is fully aligned with our audience, based on observation and research, not on personal creative expression. \r\nYou will:\r\n • Research what types of content, topics, tone and formats resonate with our community\r\n • Write posts in our tone and style\r\n • Respond to messages and comments\r\n • Answer questions from potential clients\r\n • Plan and post consistently\r\n • Create visuals and short videos that match our brand\r\n • Analyse which posts perform well and why\r\n • Adjust communication accordingly\r\n • Comment in relevant Facebook groups in our tone and style\r\n • Work in close coordination with the management\n\r\nWhat We Offer\r\n • A meaningful role inside a real community\r\n • A stable, long-term position\r\n • Monthly fixed salary\n\r\nWhat We Ask\r\n • Commitment to high quality communication, in both content and execution\r\n • Excellent English writing skills\r\n • Good at adapting in different styles\r\n • Analytic mindset, you observe, and identify what works well\r\n • Strong feel for visual detail\r\n •  Experience in photo editing \r\n •  Experience in video editing is a plus\r\n • High attention to tone and detail\r\n • Reliable, proactive and precise\n\r\nAvailability\r\nThis is a part-time role of approximately 24 hours per week, spread over 6 days, including Saturdays and Sundays. Flexibility is required. The role may grow over time, with the possibility to take on more hours and responsibilities in the future. Occasionally, extra time will be needed around key Upgrade to see actual infonts.\n\r\nHow to Apply\r\nPlease send your CV along with a short cover letter explaining why you're excited about this role and why you would be a great fit. Make sure to have completed the IQ and DISC tests provided by the platform as we will include them in our hiring process.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Management",
    "Social Media Engagement"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:20:28.477991",
      "reason": "Job first discovered"
    }
  ]
}