{
  "job_id": "1422658",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-EditorVSL-Direct-Response-Full-time-High-Salary-1422658",
  "scraped_at": "2025-07-15T15:44:52.002804",
  "title": "Video Editor(VSL Direct Response) - Full time - High Salary",
  "type_of_work": "Full Time",
  "salary": "- OnlineJobs.ph",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "-A Perfect English level is required\n\r\n-Good video editing skills\n\r\n-Available 40ish Hours per week\n\r\n-A Player, looking to earn and grow A LOT as the company does and you get in charge of the video editing team\n\n\r\nThe Company:\n\n\r\nWe are an ecommerce company, our market is the United States and we are in the hearing loss niche.\r\nOur goal is to build a team of extremely talented people, keep on improving our product until it’s world class and hit 100M$ in revenue by April 2027.\n\r\nWe specialize in long form Upgrade to see actual info and run ads on facebook, google and soon youtube.\r\nThe role of a video editor is crucial in our company as our ads are the main driver of the business’ growth. We are looking for extremely talented video editors to join us.\n\r\nAs you may have noticed we did not put “having experience editing VSLs” in the description, because the truth is, as long as someone is very smart and understands what grabs people's attention, learning how to edit VSLs is not difficult at all, and we will teach it to you.\n\n\r\nThe Job:\n\r\nThe job will consist in editing hooks, leads and bodies of our VSLs and anything video editing related in our company, but mainly VSLs, as this is our focus.\n\n\r\nWorking Hours:\n\r\nYou will be working around 40ish hours per week.\r\nWe will set up a schedule that suits both well as soon as you get hired. We are very flexible when it comes to working hours.\n\n\r\nSalary:\n\r\nThe Salary will be high, above market average.\r\nWhen it comes to salary we have a very simple rule in place. It is dependent on the value that you provide to the company, the higher the value you provide, the higher the salary will be. The salary will be discussed before starting in the following steps.",
  "skill_requirements": [
    "Video Editing",
    "Motion Graphics",
    "CapCut"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:27:43.093247",
      "reason": "Job first discovered"
    }
  ]
}