{
  "job_id": "1422542",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AI-Savvy-Virtual-Assistant-1422542",
  "scraped_at": "2025-07-15T14:29:33.213752",
  "title": "AI-Savvy Virtual Assistant",
  "type_of_work": "Any",
  "salary": "$5 and up",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're Hiring: AI-Savvy Virtual Assistant (Remote, Part-Time to Full-Time Potential)\n\r\nAre you obsessed with the latest AI tools and GPT advancements? Do you love discovering ways to simplify, systematize, and scale businesses using automation and AI?\n\r\nWe're an AI-powered digital agency that helps holistic entrepreneurs and online business owners integrate AI into their marketing, content creation, and daily operations. Now we’re growing and looking for a tech-savvy, resourceful, and growth-minded Virtual Assistant to join our team.\n\r\n???? Who We’re Looking For:\r\nWe want a right-hand partner who:\n\r\nIs up-to-date on the latest AI tools (especially GPTs and automation platforms)\n\r\nCan test, research, and implement tools that improve our workflow\n\r\nLoves helping streamline processes and support our internal and client projects\n\r\nHas excellent communication and is detail-oriented\n\r\nCan manage AI-generated content, templates, workflows, and optimize client deliverables\n\r\n? Must-Have Experience With (or a Deep Willingness to Learn):\n\r\nChatGPT (especially Custom GPTs + GPT Store navigation)\n\r\nNotion AI for project management and automation\n\r\nZapier or Make (Integromat) for workflow automation\n\r\nDescript or Castmagic for AI-powered audio & video processing\n\r\nTrello / ClickUp / Slack for task management and team communication\n\r\nHighLevel (GHL) integrations\n\r\nCanva AI, Adobe Firefly, or other creative AI tools\n\r\nLoom or other async video tools\n\r\nBonus: Prompt engineering, basic HTML/CSS, or experience building GPT bots\n\r\n???? Your Role Will Include:\n\r\nResearching & recommending new AI tools as they emerge\n\r\nSetting up systems, workflows, and templates for the business and clients\n\r\nSupporting with GPT implementation and client onboarding tasks\n\r\nAssisting with AI-enhanced content generation and organization\n\r\nManaging simple automation setups and improving team productivity\n\r\n???? Requirements:\n\r\nStrong interest in AI and emerging tech\n\r\nSelf-motivated, proactive, and solution-oriented\n\r\nFast learner and comfortable with evolving tools\n\r\nExcellent written English and organizational skills\n\r\nReliable internet + consistent availability (must be responsive)\n\r\n???? Hours & Pay:\n\r\nPart-time to start with the potential to grow\n\r\nCompetitive pay based on experience and availability\n\r\n???? How to Apply:\r\nReply with:\n\r\nA short video (Loom or similar) introducing yourself and sharing why you love AI\n\r\nA list of AI tools you’ve used and your favorite use cases\n\r\nResume or portfolio showing relevant experience\n\r\nWe’re building something innovative and impactful—and we’re looking for someone who wants to grow with us. If you're an AI enthusiast and a rockstar VA, we’d love to hear from you.\n\r\nLet’s build the future together. ?????",
  "skill_requirements": [
    "Midjourney",
    "AI Tools"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:33:03.214707",
      "reason": "Job first discovered"
    }
  ]
}