{
  "job_id": "1422402",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Facebook-Media-Buyer-Campaign-Launcher-1422402",
  "scraped_at": "2025-07-15T12:33:04.558854",
  "title": "Facebook Media Buyer Campaign Launcher",
  "type_of_work": "Part Time",
  "salary": "$430 up till $750 per month",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Our e-commerce company is hiring! We are looking for a media buyer to join our team, someone with a thorough understanding of Facebook, Marketing, Shopify and drop shipping business models.\n\r\nResponsibilities and Duties\r\n- Work independently\r\n- Being proactive and coming up with lots of input from your side\r\n- Add extra value to the company which leads to growth\r\n- You NEED to be able to work 6/7 days a week\r\n- You MUST have experience with Facebook Ads\r\n- You NEED to be a REAL team-player\r\n- You NEED to keep yourself accountable by having daily contact with the owner\n\r\nSalary Expectations\r\nYou will start as (Trainee) Media Buyer, where you will be working on the side of the company owner, 2-3 hrs per day with compensation of 5-8$/hr (subject to experience).\r\nWe always start with a one-month trial, to ensure safety for both parties. After that, we'll have an evaluation to see if both parties would like to proceed to work together. If yes, you will be promoted to Senior Media Buyer with an increased compensation to 6-10$/hr (subject to experience).\r\nIf you are the right fit, you can grow to Management level with increased compensation.\n\r\nBenefits:\r\n- Get to work in a young company with lots of ambitions\r\n- Work fully remote and flexible working hours\r\n- Get paid every two weeks, instead of once per month (12 times per year)\r\n- Upgrade your knowledge and skills in the fastest growing industry: digital marketing\n\r\nDO NOT apply for this job if you don't meet any of the above-mentioned. Your reply must include ''Red'' if you read the above.\n\r\nIf you apply, let us know why we should schedule a call with you and why you would be the BEST for this job.\n\r\nKind regards,\n\r\nJeremy",
  "skill_requirements": [
    "Facebook marketing",
    "Facebook Ads",
    "Attention to Detail"
  ],
  "is_active": true,
  "status_history": []
}