{
  "job_id": "1422661",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-SUPERSTAR-Copywriter-Content-Strategist-Remote-1422661",
  "scraped_at": "2025-07-15T12:24:20.620057",
  "title": "Full-Time SUPERSTAR Copywriter & Content Strategist (Remote)",
  "type_of_work": "Full Time",
  "salary": "1000 per month USD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "?? Full-Time Copywriter & Content Strategist - $1000 USD per month. \n\r\nDo you write copy that sells AND connects — especially to smart, ambitious women?\r\n Can you take a message, bring it to life with emotion, and drive action — all while sounding personal, feminine, and magnetic?\r\nIf yes, read on — this might be the opportunity you’ve been waiting for.\n\r\n???? About Us:\r\nShe Sells is a global movement that teaches women how to quit their 9–5 jobs and build freedom through remote closing. We’ve helped thousands of women leave jobs they hate and start making $10k+ per month online — without needing a business, a brand, or a following.\r\nWe’re a premium brand that blends sales psychology, feminine empowerment, and emotional storytelling. Think of us as the intersection between Alex Hormozi and Melanie Ann Layer — and our content needs to reflect that power.\n\r\n???? The Role:\r\nWe're looking for a world-class copywriter from the Philippines who can:\n\r\n>> Write daily emails that feel personal, feminine, and drive clicks\r\n>> Create video ad scripts for our founder Brooke to record\r\n>> Build high-converting sales pages and landing pages\r\n>> Write webinar registration pages, nurture sequences, and VSL scripts\r\n>> Own our content calendar and manage distribution (email + social captions)\r\n>> Repurpose long-form content into reels, carousel copy, and more\n\r\nThis is not a junior role. You’ll be expected to lead copy and messaging across the entire brand.\n\r\n???? You’ll Be Perfect If You:\n\r\n>> Write clean, emotional, high-converting copy (samples required)\r\n>> Understand how to speak to ambitious women who are done settling\r\n>> Can write in a tone that’s empowering, feminine, and confident\r\n>> Have worked in online coaching, high-ticket programs, or direct response\r\n>> Are proactive, fast, and can work independently with minimal edits\r\n>> Love personal development, sales psychology, and women’s empowerment\n\r\n???? Compensation:\r\n>> $1,000 USD/month (full-time, long-term)  \r\n>> Bonuses for performance-based campaigns\r\n>> Work remotely, set your own hours\r\n>> Be part of a brand that’s changing lives every single day\n\r\n???? To Apply:\r\nSend your portfolio to Upgrade to see actual info with the Subject line: \"Copywriter Position with She Sells\" - with at least:\n\r\n>> 1 landing page\r\n>> 2 email campaigns\r\n>> 1 video ad script\r\n>> Write a 150-word email we could send to women thinking of quitting their job to start remote sales. (Tone: empowering, feminine, direct.)\r\n>> Include your CV, timezone, and availability.\r\n>> Include a 2-3 min video introducing yourself and why you are perfect for the role. \n\r\n???? We’re only reviewing applicants who follow the steps above.\r\nIf you’re ready to write content that actually changes lives — we can’t wait to hear from you.",
  "skill_requirements": [
    "Copywriting",
    "Email Copywriting",
    "Funnel Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:25:31.110008",
      "reason": "Job first discovered"
    }
  ]
}