{
  "job_id": "1422274",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Support-1422274",
  "scraped_at": "2025-07-15T12:34:38.702882",
  "title": "Sales Support",
  "type_of_work": "Full Time",
  "salary": "1000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Overview:\r\nAre you an experienced Sales Support who thrives on customer satisfaction, order accuracy, and night shift productivity? We’re seeking a dedicated, detail-oriented, and tech-savvy team player to support our sales operations and provide VIP-level service to our clients—remotely, from the Philippines!\n\r\nThis is a graveyard shift (US EST) position for professionals who are reliable, organized, and driven to work independently while collaborating closely with a US-based team.\n\r\nKey Responsibilities:\r\nAnswer inbound customer calls in a courteous and professional manner\r\nAccurately process and manage customer orders in our system\r\nHandle daily email communications with both customers and internal teams\r\nProvide tailored support to VIP/high-value clients\r\nLearn and understand our product catalog to make relevant recommendations\r\nGenerate accurate price estimates based on client needs\r\nRequest and manage product layout specifications as needed\r\nEnsure clean, organized data entry and record maintenance\n\r\nQualifications:\r\nExcellent English skills (spoken and written) – clear, confident, and professional\r\nBachelor’s degree in Business, Engineering, or related field preferred\r\nMinimum 1 year of experience in a client-facing role (not limited to BPO or online-only support)\r\nProven ability to stay productive and alert during graveyard shifts\r\nStrong attention to detail and ability to manage multiple priorities\r\nTech-savvy; experience with CRMs and order management tools is a plus\r\nQuick learner with strong product comprehension and recommendation skills\r\nHighly motivated, self-managed, and collaborative teaUpgrade to see actual infomber\n\r\nCompensation & Benefits:\r\n$500/month during the 1-month training period\r\n$1000/month regular salary after training\r\nFull-time, long-term opportunity\r\nWork from home – no commute, more work-life balance\r\nSupportive and professional team environment\r\nRoom for growth and development\n\r\nImportant Notes:\r\nGraveyard Shift Required: Monday to Friday, 08:30 AM – 05:30 PM EST\r\nYou must have a reliable internet connection, working headset, and backup power/internet source\r\nApplications without a resume and a short cover letter will not be considered\n\r\nVisit our website: Upgrade to see actual info",
  "skill_requirements": [
    "Sales Support",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": []
}