{
  "job_id": "1422131",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Stack-WordPress-DevOps-Engineer-1422131",
  "scraped_at": "2025-07-14T23:07:55.010409",
  "title": "Full-Stack WordPress / DevOps Engineer",
  "type_of_work": "Full Time",
  "salary": "$2250/mo",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "My name is Dustin, and I am the founder of Marketing Done Right (marketingdr.co/). We're looking for a versatile Full-Stack WordPress / DevOps Engineer to join our tech-driven team and support both development and infrastructure efforts.\n\r\nWhy Join Us?\r\n- Supportive Team Culture: Join a collaborative team where your contributions matter.\r\n- Growth Opportunities: Expand your skills in both development and DevOps. \r\n- Remote Flexibility: Work from anywhere while staying connected through strong asynchronous communication and regular syncs.\r\n- Innovative Projects: Work on diverse and challenging projects, from custom WordPress builds to scalable DevOps infrastructure, where your code directly impacts real users.\r\n- Job Stability: We’re in it for the long run and are looking for someone who is, too.\n\r\nCore Purpose: Own the full life-cycle of MDR’s WordPress sites—from design/build to server administration and security—ensuring fast, reliable, and secure web experiences for clients.\n\r\nKey Responsibilities:\r\n- Custom Development – Build/extend themes and plugins (ACF, Gutenberg blocks, Elementor tweaks, Breakdance Builder, third-party API integrations).\r\n- Front-end Engineering – Responsive UI (HTML 5, SCSS/CSS 3, JavaScript / React ).\r\n- Back-end Engineering – PHP 8+, MySQL, WordPress REST API, cron jobs, WP-CLI automations, JavaScript.\n\r\nDevOps / Server Management –\r\n- Provision, harden, and maintain Ubuntu LEMP Stack droplets on DigitalOcean.\r\n- Manage NGINX, PHP-FPM, Let’s Encrypt, Fail2Ban, UFW, and system updates.\r\n- Automate backups & staging via scripts and ManageWP.\n\r\n- Security & Performance – Implement caching (Redis/object cache, WP-Rocket or equivalent), Cloudflare CDN tuning, malware scans.\r\n- Process & Documentation – GitHub flow (PR + code review), CI/CD with DeployHQ or GitHub Actions, write SOPs for repeatable maintenance tasks.\r\n- Client/PM Collaboration – Translate requirements into tickets, estimate, demo, and document releases process.\n\r\nRequired Skills & Tools: \r\n- Languages/Frameworks: PHP, JavaScript/ES6, React (or Vue), HTML 5, CSS 3/Sass, Bash.\r\n- WordPress: Custom themes/plugins, WooCommerce, ACF, Gutenberg, Elementor, Hooks/Filters, WP-CLI.\r\n- DevOps: Ubuntu 20/22, DigitalOcean, NGINX, MySQL, SSL/TLS, DNS, SSH hardening, Fail2Ban. Skill to manage servers via   command line interface and SSH connection.\r\n- Version Control: Git + GitHub (branching, PRs, actions).\r\n- Utilities: Vaultwarden (Bitwarden), OpenVPN, ManageWP, Jetpack Backup, Asana.\r\n- Soft Skills: Clear written & spoken English, async communication, proactive problem-solving.\n\r\nIf you are interested in this position, please fill out the Google Form below, and I will contact you directly (please note: you will need a Google/Gmail login). Only those who submit the form will be considered for a position:\n\r\nAPPLY HERE: Upgrade to see actual info",
  "skill_requirements": [
    "Wordpress",
    "Fullstack",
    "Devops"
  ]
}