{
  "job_id": "1422455",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Project-Manager-5-Years-Experience-1422455",
  "scraped_at": "2025-07-15T15:47:45.043126",
  "title": "Project Manager (5+ Years Experience)",
  "type_of_work": "Full Time",
  "salary": "$1,000 CAD per month + Processing fees",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Project Manager (5+ Years Experience)\r\nRemote | Hybrid Preferred (Markham, ON) | Contract\r\nIndustry: Building & Energy Efficiency | Immersive Educational Content\r\nMonthly Salary: $1,200 CAD (First 2 Months), increasing to $1,500 CAD\r\nWork Schedule: Weekdays, Full-time 9:30 – 5:30 PM\n\r\nAbout the Role\r\nThe Enspire Program Immersive Content Studio is seeking a Project Manager with 5+ years of experience to lead high-impact sustainability and innovation projects. Our team is dedicated to reshaping how building performance and energy efficiency are delivered across Canada through educational content, training, and collaborative delivery models.\r\nThis is a full-time, fully remote position operating Monday to Friday, 9:30 AM – 5:30 PM EST.\r\nIf you’re a strategic thinker who thrives on structure, timelines, and empowering teams to deliver their best work, this position could be your next great move.\r\nKey Responsibilities\r\n• Manage the full project lifecycle: initiation, planning, execution, monitoring, and closeout\r\n• Track project milestones, schedules, budgets, and risks; apply contingency plans as needed\r\n• Coordinate cross-functional teams including engineers, designers, subject matter experts, and clients\r\n• Prepare and maintain clear project documentation and status reports for internal and external stakeholders\r\n• Ensure deliverables meet agreed scope, quality, and deadline expectations\r\n• Conduct research related to funding opportunities, industry best practices, and program requirements\r\n• Identify and apply for grants or funding streams aligned with project goals and organizational priorities\r\n• Collaborate with partners to compile supporting documentation and ensure compliance with grant requirements\r\n• Monitor reporting obligations for funded projects and support timely submissions\r\nRequired Qualifications\r\n• Minimum 5 years of project management experience in technical or construction-related fields\r\n• Excellent verbal and written communication skills\r\n• Strong proficiency with project management software (e.g., MS Project, ClickUp, Asana, or similar)\r\n• Ability to manage multiple stakeholders, competing priorities, and tight deadlines\r\n• PMP certification or equivalent is preferred\r\n• Bachelor’s degree in Engineering, Architecture, Construction Management, or a related field\r\n• Experience in sustainability or energy efficiency programs is a strong asset\n\r\nInstructions to Apply (Mandatory)\r\n1. Apply for this job position with 6 AP through Upgrade to see actual info\r\n2. Title your message with the following format: “The Next GEST Staff – “ and your full name.\r\na. For example: The Next GEST Staff – Jack Zhou\r\n3. Attach a PDF version of your resume with the application submission\r\n4. Record a video and tell us why we should hire you for this position. Share the link with us as part of your application submission.\r\nNote: Applications that do not follow these instructions will not be considered.\n\r\nAdditional Info\r\n• This is a remote role\r\n• This position is ideal for experienced professionals seeking long-term contract work with a mission-driven organization\r\n• Successful candidates may be offered opportunities to lead additional initiatives within the Enspire program                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}