{
  "job_id": "1422896",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Cold-Caller-Real-Estate-Land-Wholesaling-Closify-Offers-Inc-1422896",
  "scraped_at": "2025-07-15T14:27:30.250826",
  "title": "Cold Caller – Real Estate (Land Wholesaling) | Closify Offers Inc.",
  "type_of_work": "Full Time",
  "salary": "900",
  "hours_per_week": "36",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a confident, articulate speaker with a neutral or great English accent? Do you want a consistent, full-time role with growth opportunities and weekly pay?\n\r\nClosify Offers Inc. is a fast-growing U.S. real estate investment company focused on land deals — and we’re hiring Cold Callers to join our acquisitions team!\n\r\nWe provide scripts, leads, and full support — you bring the voice, drive, and consistency to help us grow.\n\r\n???? Job Responsibilities:\r\nMake outbound calls to landowners in the U.S. using our lead lists\n\r\nFollow our script to identify motivated sellers\n\r\nAsk qualifying questions and tag responses\n\r\nSet call-back appointments for our closing team\n\r\nTrack lead status accurately and follow basic CRM procedures\n\r\nAttend weekly check-ins and stay in communication with our team\n\r\n???? Compensation:\r\n$4.00 USD per hour, paid weekly via Wise or PayPal\n\r\n36 hours a week of work! ( Full Time )\n\r\n$5 bonus per qualified appointment you set\n\r\n0.5% commission on any deal that closes from your lead\n\r\nPaid training & potential for long-term promotion into higher roles (Lead Manager, Closer, etc.)\n\r\n???? What We're Looking For:\r\nNeutral or Great English Accent (U.S.-friendly tone, clear pronunciation)\n\r\n1+ year of experience in cold calling, sales, telemarketing, or real estate preferred\n\r\nStrong communication skills — able to follow scripts and handle objections professionally\n\r\nReliable internet connection, computer, and noise-canceling headset\n\r\nAvailability to work full-time (U.S. business hours)\n\r\nMust be focused, consistent, and open to feedback\n\r\n???? How to Apply (Read Carefully):\r\nTo be considered, please do the following:\n\r\nStart your message with the keyword: Land Shark\r\n(This helps us see who pays attention and follows instructions.)\n\r\nInclude a voice or video recording (1–2 minutes) using Vocaroo, Loom, or another link —\n\r\nIntroduce yourself\n\r\nTell us why you're a great fit for this role\n\r\n? That’s it! No resume, no long paragraphs. Just the keyword + voice/video.\n\r\nIf your voice and energy are a match, we’ll send you our official application form and move you into the next round.\n\r\nWe’re looking for A-players who want to grow with a company that values communication, reliability, and performance. If that’s you — apply now and let’s close some deals together!",
  "skill_requirements": [
    "Outbound Sales",
    "Cold Calling",
    "English Speaking"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:29:05.331282",
      "reason": "Job first discovered"
    }
  ]
}