{
  "job_id": "1422811",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Real-Estate-Admin-Extraordinare-Client-Assistance-1422811",
  "scraped_at": "2025-07-15T14:31:32.581854",
  "title": "Real Estate Admin Extraordinare & Client Assistance",
  "type_of_work": "Part Time",
  "salary": "600",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "**Seeking a proactive, detail-obsessed VA to support a high-end property consultancy as the behind-the-scenes powerhouse who keeps everything running with grace and precision**\n\n\r\nWe are an Australian Property Group that operates more like a private consultancy than a traditional agency. We guide financially ready, lifestyle-driven clients through premium off-the-plan property decisions with clarity, precision, and insight.\n\r\nOur founder is a strategic advisor, not a sales agent. Every deal is intentional. Every client is matched. Every step is high-touch and high-trust.\n\r\nNow, we’re looking for someone extraordinary behind the scenes.\n\r\nWe’re searching for someone who thrives on attention to detail, naturally thinks three steps ahead, and quietly takes pride in making things smoother, faster, and more refined. You don’t wait to be chased — you’re already there with the next step. You notice what’s missing before it’s mentioned. You see admin as an art form, and structure as your superpower.\n\r\nIf you're the kind of person who:\r\nLoves ticking things off with precision and style\n\r\nCan spot a tiny typo or design misalignment instantly\n\r\nIs quietly running the show behind the show — and loves it\n\r\nFinds deep satisfaction in elevating someone else’s vision\n\r\nAnd genuinely enjoys being the calm, capable presence that keeps everything flowing...\n\r\nThen you might be exactly who we’ve been looking for.\n\r\nThis is a part-time, long-term opportunity (with the potential to transition to full-time for the right candidate) supporting a premium, soul-led property consultancy. You’ll be an integral part of a small, mission-driven team — helping us stay organised, look professional, and deliver excellence at every turn.\n\r\n---What We’re Looking For:---\n\r\n1. Client-Facing Warmth + Professionalism\r\nCan write warm, clear emails that reflect our brand voice\n\r\nConfident managing communications with high-value clients\n\r\nUnderstands tone — not too casual, not robotic\n\r\n2. Organised + Detail-Oriented\r\nKeeps folders, docs, and CRM systems immaculate\n\r\nTracks multiple moving parts with grace\n\r\nFollows SOPs but also speaks up when something looks off\n\r\n3. Tech-Savvy with Canva + Email Tools\r\nComfortable using Google Drive, Gmail, Canva, MailerLite, Trello or ClickUp\n\r\nBonus: Experience with MailerPage, TidyCal or similar tools\n\r\nWilling to use AI tools like ChatGPT to assist with drafts and admin\n\r\n4. Real Estate or Luxury Services Background (a bonus)\r\nDoesn’t need to be a licensed agent — but should understand:\n\r\nWhat an off-the-plan property is\n\r\nThe typical buyer journey\n\r\nThe need for premium service and discretion\n\r\n5. Self-Starter + Fast Learner\r\nWorks independently without needing micromanagement\n\r\nAsks great questions and solves problems proactively\n\r\nEnjoys being part of a small, growing, vision-driven team\n\r\n==HOW TO APPLY==\r\n- This is YOUR chance to impress us and stand out from the crowd\r\n- Yes, submit the standard Resume & Work Experience\r\n- And also let us know why YOU? In writing or in a short video ... or why not both?",
  "skill_requirements": [
    "Social Media Management",
    "Office and Administration",
    "Client Relationship Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T06:39:09.935626",
      "reason": "Job first discovered"
    }
  ]
}