{
  "job_id": "1422154",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422154",
  "scraped_at": "2025-07-14T23:06:36.611652",
  "title": "Kajabi + Tech Virtual Assistant – Funnels, Emails & Delivery",
  "type_of_work": "Part Time",
  "salary": "$120 - 240 per month",
  "hours_per_week": "10",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Kajabi + Tech VA Wanted – Long-Term Role with Growth Potential!\n\r\nHello and welcome \n\r\nIf you love organizing systems, building automations, and keeping digital things running behind the scenes—this role is for you.\r\nI’m looking for a technically savvy and detail-obsessed Virtual Assistant to help manage the backend of my digital product and coaching business. This is a long-term opportunity with lots of variety, growth, and respect built in.\r\nWe work fast, hold high standards, and value people who take ownership. If you’re looking for a place where you can build systems, not just fix problems, read on.\n\r\nOutcome:\r\nMake sure all our Kajabi products, pipelines, automations, and email systems are built, tested, and running perfectly—so customers and clients receive a seamless experience, and the business grows without daily founder intervention.\n\r\nResponsibilities:\r\n• Set up Kajabi courses, landing pages, pipelines, and email sequences\r\n• Format digital products (videos, PDFs, downloads) for delivery\r\n• Build opt-in and sales pages using branded templates\r\n• Manage tagging, segmentation, and automations\r\n• Connect Kajabi to other tools (e.g., Calendly, Stripe, Meta Ads, Zapier, etc.)\r\n• Test everything—ensure all links, flows, and purchases work flawlessly\r\n• Troubleshoot bugs and make system improvements proactively\n\r\nYou’ll Be a Great Fit If:\r\n• You have 1–2+ years of experience in Kajabi, ConvertKit, or similar platforms\r\n• You love working behind the scenes to make everything run like clockwork\r\n• You’re a natural at documentation, checklists, and version control\r\n• You’re confident with light tech troubleshooting and integrations\r\n• You take initiative and solve problems\r\n• You want to grow with a modern digital business and be trusted with key systems\r\n• You’re comfortable using AI tools like ChatGPT or Zapier AI to streamline workflows\n\r\nWhat’s In It for You:\r\n• Competitive pay \r\n• Room to grow into a systems manager or tech lead\r\n• Autonomy: no micromanaging, just results + respect\r\n• A fun, fast-paced culture where your work truly matters\r\n• Opportunities for skill-building\n\r\nHow to Apply:\r\nApply here by filling out this form: Upgrade to see actual info \r\nYou’ll be asked to upload:\r\n• A quick 2–3 minute Loom/video introduction\r\n• A few links or screenshots of Kajabi or tech systems you’ve built\r\n• Your Facebook Messenger User ID\r\n• An inspirational quote that keeps you going\r\n• When asked for “Your favorite software tool,” reply with: apples\n\r\nLet’s build a business that works because of you—not around you.\r\n— Aaron",
  "skill_requirements": [
    "Canva",
    "ChatGPT",
    "Kajabi"
  ]
}