{
  "job_id": "1422615",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Client-Services-Coordinator-1422615",
  "scraped_at": "2025-07-15T12:31:59.208904",
  "title": "Client Services Coordinator",
  "type_of_work": "Full Time",
  "salary": "Competitive monthly salary (in PHP, commensurate with experience)",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Overview of the Role\r\nWe are seeking a proactive and professional Client Services Coordinator based in the Cebu City area of the Philippines to support Regis Design’s operations by providing timely and effective service to both B2B Customers and Retail Customers across multiple channels. The ideal candidate will be customer-focused, tech-savvy, and capable of working independently within a remote environment.\r\nKey Responsibilities\r\n• Support the Business Development Managers with Invoices, placing orders, shipment updates, production updates and basic troubleshooting requests\r\n• Respond to customer inquiries via email, chat, and other electronic channels in a professional and timely manner\r\n• Respond to Retail customer enquiries and complete orders, invoices, refunds, returns and warranty requests\r\n• Maintain accurate customer records and documentation, update Google spreadsheets and provide reports\r\n• Escalate issues to internal departments as needed and follow through to resolution\r\n• Contribute to continuous improvement by reporting recurring issues and suggesting process enhancements\r\n• Provide administrative support related to customer service operations\r\n• Be flexible and available for out of hours meetings with our global offices \r\nKey Requirements\r\n• Minimum 2-5 years of experience in a customer service or virtual assistant role\r\n• Excellent verbal and written communication skills in English\r\n• Passion for the automotive industry and wheels industry \r\n• High level of attention to detail and accuracy\r\n• Intermediate Spreadsheets skills – using google sheets\r\n• Strong problem-solving and decision-making abilities\r\n• Proficiency with inventory systems, Google Workspace, and live chat platforms\r\n• Self-motivated and able to work remotely with limited supervision\r\n• Reliable internet connection and a quiet, professional home office setup. – Computer and Monitor will be provided\r\n• Ability to travel to Sydney Australia for Training – 2 weeks initial training in Sydney\r\n• Future opportunity to work from office location in Cebu City with a team\r\nWork Hours\r\nStandard Monday to Friday,  8 hours per day but flexible around 9:00 AM – 5:00 PM AEST and must be available for global meetings outside these hours and emergencies.\r\nCompensation & Benefits\r\n• Competitive monthly salary (in PHP, commensurate with experience)\r\n• 13th-month bonus (pro-rata if applicable)\r\n• Paid Australian public holidays",
  "skill_requirements": [
    "Email Support",
    "Client Relationship Management",
    "Logistics Coordination"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T01:32:45.147649",
      "reason": "Job first discovered"
    }
  ]
}