{
  "job_id": "1422136",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Product-Research-Analyst-1422136",
  "scraped_at": "2025-07-15T12:35:58.906751",
  "title": "Amazon Product Research Analyst",
  "type_of_work": "Full Time",
  "salary": "$4/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Description: Amazon Product Research Analyst\n\r\nJob Summary\n\r\nWe are seeking a detail-oriented and creative Amazon Product Research Analyst to join our team. This role involves researching products from vendor catalogs, analyzing competitors, calculating Amazon fees, and determining profitability for potential listings. The ideal candidate will also propose creative product combinations and variations to maximize sales potential on Amazon.\n\r\nKey Responsibilities\n\r\nProduct Research: Analyze vendor catalogs to identify products suitable for listing on Amazon.\n\r\nCompetitor Analysis: Research top competitors for selected products, documenting their pricing, features, and customer reviews in a structured spreadsheet.\n\r\nFee and Profitability Analysis: Calculate Amazon fees (e.g., FBA fees, referral fees) and assess potential profit margins to determine if listing a product is financially viable.\n\r\nCreative Listing Development: Propose innovative product combinations and variations based on Amazon data and personal creativity (e.g., creating listings for paper cups with lids, cups without lids, standalone lids, or multi-size cup combos).\n\r\nData Management: Maintain accurate and organized spreadsheets to track product details, competitor data, fees, and profitability metrics.\n\r\nMarket Trend Awareness: Stay informed about Amazon marketplace trends and customer preferences to recommend high-potential products and strategies.\n\r\nQualifications\n\r\nExperience:\n\r\nExperience in product research, or data analysis (Amazon marketplace experience preferred).\n\r\nFamiliarity with Amazon Seller Central and FBA processes is a plus.\n\r\nSkills:\n\r\nStrong analytical skills with the ability to interpret data and make data-driven recommendations.\n\r\nProficiency in Microsoft Excel or Google Sheets for data organization and calculations.\n\r\nCreative thinking to develop unique product combinations and listing strategies.\n\r\nExcellent attention to detail and organizational skills.\n\r\nNice-to-Haves:\n\r\nExperience with Amazon product research tools (e.g., Helium 10, Keepa).\n\r\nKnowledge of Amazon’s pricing and fee structures.\n\r\nPersonal Attributes\n\r\nProactive and self-motivated with a strong work ethic.\n\r\nCreative and innovative, with a knack for identifying market opportunities.\n\r\nComfortable working independently and collaborating with a small team.\n\r\nReliable and punctual.\n\r\nBenefits:**\r\nFully remote:\r\nSalary - $4 per hour\r\nOpportunities for professional development and growth.\r\nDynamic and supportive work environment.\r\nFull time, Monday through Friday, EST\r\nJob Security and Stability\r\nPTO\r\nInclusive Culture\r\nUpskilling Opportunities\r\n100% Work-From-Home\r\nExceptionally Supportive Team\r\nOpportunities for Career Growth\r\nTechnical Requirements:\r\nUSB Headset with Noise Cancellation feature\r\nWorking Webcam\r\nComputer with at least 1.8 GHz processor and at least 4GB RAM\r\nMain Internet Service Speed: at least 25 Mbps cable connection\r\nBackup Internet Service Speed: at least 10 Mbps\n\r\nHOW TO APPLY:\r\n-Apply only if you agree with the work schedule, if you commit full time and long- term, if you agree with using Hubstaff to track time, if you agree to the salary rate per hour.\r\n-Please fill out the form below with your contact information, updated CV, and SELF-INTRODUCTION VIDEO. Thank you!\n\nUpgrade to see actual info/forms/d/e/1FAIpQLScdmYyC5iwNl6_tX3Xi9s23eRqFXK27Ksu3AzSBqHGg2ZmSUw/viewform",
  "skill_requirements": [
    "Seller Page Management",
    "Analytics - Amazon CloudSearch",
    "Helium10"
  ],
  "is_active": true,
  "status_history": []
}