{
  "job_id": "1422562",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Walmart-Product-Sourcing-Virtual-Assistant-Work-from-Home-PLEASE-READ-ENTIRE-AD-BEFORE-APPLYING-1422562",
  "scraped_at": "2025-07-15T15:39:07.077024",
  "title": "Amazon & Walmart Product Sourcing Virtual Assistant (Work from Home)** PLEASE READ ENTIRE AD BEFORE APPLYING",
  "type_of_work": "Full Time",
  "salary": "$3hr to start + generous performance bonuses",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Position Title: Product & Distributor Sourcing VA\r\nWork Hours: Full-time or Part-time (flexible, may need to be available during afternoon/evening US hours.\r\nSalary: Hourly + performance bonuses\r\nLocation: Remote \n\n\r\n???? About the Role:\r\nWe are an eCommerce business based in the U.S., selling on Amazon and Walmart, and we’re looking for a highly skilled Virtual Assistant to help us find profitable products and source reliable distributors or wholesalers.\n\r\nThis position will start part time with 20 hours a week, with the opportunity to become fulltime as quickly as you prove what you can do. This is a long-term position for someone who is proactive, resourceful, and ready to grow with our company. If you're experienced in product research, distributor outreach, and Amazon/Walmart marketplaces, this could be a great opportunity for you!\n\r\n????? Responsibilities:\r\nResearch profitable products to resell on Amazon and Walmart\n\r\nSource U.S.-based and international distributors/wholesalers\n\r\nRequest and organize catalogs and pricing sheets\n\r\nAnalyze profit margins using tools like Keepa, SellerAmp, and Google Sheets\n\r\nSubmit and track wholesale applications\n\r\nMaintain a sourcing tracker and CRM\n\r\nCommunicate effectively with suppliers via email and phone\n\r\n? Qualifications:\r\n1+ year experience in Amazon or Walmart product sourcing\n\r\nFamiliar with Seller Central and/or Walmart Seller Center\n\r\nExperience using Keepa, SAS, Tactical Arbitrage, or similar tools\n\r\nExcellent written and spoken English\n\r\nHighly organized and self-motivated\n\r\nAble to work independently and meet deadlines\n\r\nReliable internet and a distraction-free workspace\n\r\n???? Compensation & Perks:\r\nCompetitive salary based on experience\n\r\nPerformance bonuses for successful product finds\n\r\nLong-term and stable work\n\r\nUnlimited growth opportunities - Help us grow and you will grow with us. \n\r\n???? How to Apply:\r\nSend the below when applying and PLEASE PUT IN SUBJECT LINE \"I HAVE EXPERIENCE SOURCING PRODUCTS FOR AMAZON\"\n\r\nUpdated resume\n\r\nA short voice recording introducing yourself (30–60 seconds)\n\r\nA few sentences explaining your sourcing experience\n\r\nList any tools or software you've used for product research\n\r\nThis is your chance to work with a growing U.S. business and build a long-term career. We’re excited to find a VA who’s ready to take ownership and grow with us!",
  "skill_requirements": [
    "Amazon",
    "FBA",
    "Product Sourcing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:25:38.310873",
      "reason": "Job first discovered"
    }
  ]
}