{
  "job_id": "1422519",
  "url": "https://www.onlinejobs.ph/jobseekers/job/HIRING-Social-Media-Content-Creator-Digital-Assistant-WellnessCreative-Industry-1422519",
  "scraped_at": "2025-07-15T14:25:34.115905",
  "title": "[HIRING] Social Media Content Creator & Digital Assistant (Wellness/Creative Industry)",
  "type_of_work": "Part Time",
  "salary": "$200 to 300",
  "hours_per_week": "3",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Part-time – Long-term collaboration\r\nRemote | Yoga, Wellness, and Joyful Movement Niche\n\r\nI'm a yoga teacher, creative movement educator, and wellness entrepreneur looking for a proactive, creative, and detail-oriented content creator + virtual assistant to help me grow my online presence and community. I offer courses, memberships, and online programs.\n\r\n?? Your Mission:\r\nSupport me in expressing my work online with clarity, consistency, and beauty. You’ll help manage content, engagement, email support, and marketing—all aligned with my values of authenticity, presence, and joyful connection.\n\r\nKEY RESPONSABILITIES:\n\r\n?? Content Planning & Scheduling\r\n- Create and maintain a monthly content calendar\r\n- Plan campaigns with clear calls to action (conversion & awareness)\r\n- Align email and social content around launches\n\r\n?? Content Creation\r\n- Edit 8 Instagram Reels per month (sometimes carousel posts)\r\n- Design 16 stories per month related to each Reel/post\r\n- Use Canva to create beautiful graphics, thumbnails, quotes, and visuals\n\r\n?? Social Media Engagement\r\n- Interact with followers and grow community through comments, DMs, and engaging with aligned accounts\r\n- Support organic growth of my Instagram and open & grow a TikTok account (repurpose IG content)\n\r\n?? Analytics & Reporting\r\n- Track performance: reels reach, story views, website clicks, bio link\r\n- Provide monthly or bi-weekly performance reports\r\n- Use insights to improve strategy and content choices\n\r\n?? Email & Platform Support\r\n- Keep members and subscribers updated (newsletters, reminders, campaigns)\r\n- Manage email sequences (re-engagement, new subscribers, etc.)\r\n- Light tech support on platform (uploading new content, tagging videos, etc.)\n\r\n?? Launch Support\r\n- Create countdown content, stories, aligned emails\r\n- Help synchronize all channels during launches\n\r\n?? Client Testimonials & Social Proof\r\n- Collect and format client feedback into shareable Canva visuals\r\n- Create a library of testimonials for future campaigns\n\r\n?? Marketing & Strategy\r\n- Suggest ideas for growing visibility (new platforms, hashtags, collaborations)\r\n- Research trends in wellness + online marketing\r\n- Help me prosper online in a soulful and sustainable way\n\r\n?? You Are:\r\n    - A proactive communicator who brings ideas\r\n    - Fluent in Instagram and Canva (TikTok a bonus!)\r\n    - Detail-oriented, reliable, and creative\r\n    - Aware of yoga, wellness, or spiritual content (ideal but not required)",
  "skill_requirements": [
    "Influencer Content Creation",
    "Social Media Management",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T23:24:45.947227",
      "reason": "Job first discovered"
    }
  ]
}