{
  "job_id": "1422979",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Lead-Generation-Specialist-Real-Estate-1422979",
  "scraped_at": "2025-07-15T15:33:00.594886",
  "title": "Lead Generation Specialist (Real Estate)",
  "type_of_work": "Full Time",
  "salary": "$360-$720 monthly",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Position Overview\r\nWe’re seeking a motivated and energetic Cold Caller - Real Estate VA to drive our outbound lead generation efforts. This is a full-time, remote opportunity where you’ll reach out to potential home sellers, qualify prospects, and manage lead data within our CRM. Success in this role requires excellent spoken English, a confident and courteous phone presence, and the ability to maintain Upgrade to see actual infontum in a high-volume calling environment. Be part of a fast-growing team where your impact is direct and measurable!\n\r\nKey Responsibilities\r\n- Make 250–300 outbound calls daily using an auto-dialing system\r\n- Use pre-written scripts to initiate conversations and collect essential details\r\n- Spot motivated sellers and log accurate information into the CRM\r\n- Record detailed notes from each call and input data efficiently\r\n- Schedule follow-ups and escalate urgent leads for further attention\r\n- Collaborate with the acquisitions team to assess lead quality and conversion progress\n\r\nQualifications We Value\r\n- Clear and fluent spoken English with a friendly, persuasive tone\r\n- Prior experience in cold calling, sales, or real estate outreach\r\n- Strong listening abilities and comfort using structured scripts\r\n- Self-discipline to hit daily call goals consistently\r\n- Basic computer knowledge and ease working with digital tools\n\r\nPreferred Experience\r\n- Familiarity with CRM platforms like Podio, Zoho, or REsimpli\r\n- Knowledge of dialers such as Mojo or CallTools\r\n- Experience communicating with U.S. homeowners or real estate investors\r\n- Quiet work environment with stable internet and quality audio equipment\r\n- Coachable mindset and a desire for continuous improvement\n\r\nWhy Work With Us?\r\nWe provide a collaborative, performance-focused setting where you can grow professionally and contribute meaningfully. Your efforts will directly support our property acquisition pipeline and help shape our success. If you thrive in a phone-heavy role, enjoy connecting with people, and are eager to be part of a high-achieving team, we’d love to hear from you!",
  "skill_requirements": [
    "Real Estate",
    "Communication",
    "Sales"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:21:16.835361",
      "reason": "Job first discovered"
    }
  ]
}