{
  "job_id": "1422176",
  "url": "https://www.onlinejobs.ph/jobseekers/job/1422176",
  "scraped_at": "2025-07-14T23:08:25.042297",
  "title": "? Part-Time Sales & CRM Virtual Assistant (Strategic Support Role – US School Programs)",
  "type_of_work": "Part Time",
  "salary": "400-800",
  "hours_per_week": "15",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We're looking for a highly organized, detail-oriented Sales & CRM Virtual Assistant to help manage our outreach and follow-up process with schools and school districts across the U.S. We’re a fast-growing education company that provides turnkey Spanish programs to public, private, and Catholic schools.\n\r\nThis is a part-time (2–4 hours per day), long-term position with growth potential.\n\r\nYour Responsibilities Will Include:\r\n? Reviewing and organizing leads in our CRM (ActiveCampaign, maybe Pipedrive)\r\n? Tagging contacts by priority: warm leads, key decision-makers, cold outreach targets\r\n? Assigning daily follow-up tasks to our sales and customer success reps\r\n? Tracking proposals, booked meetings, and recent inquiries to ensure consistent follow-up\r\n? Helping plan and organize relationship-building outreach to Diocesan leaders and Curriculum Directors\r\n? Identifying high-potential leads from our database of thousands of school contacts\r\n? Assisting in preparing targeted contact lists for email, phone, or mail outreach campaigns\n\r\nYou’re a Great Fit If You:\r\n???? Are highly organized and LOVE making sense of messy data\r\n???? Are confident in your English writing and reading comprehension\r\n???? Have experience using CRMs (like Pipedrive, HubSpot, Salesforce, etc.)\r\n???? Can think strategically: You know a superintendent matters more than a secretary\r\n???? Work independently and take pride in delivering error-free, clean work\r\n???? Are fast and consistent — we’ll train you, but you need to own your lane\r\n???? Have stable internet and are available to overlap with U.S. mornings (your evening hours)\n\r\nBonus (but not required):\r\n? Experience in sales ops, customer support, or lead generation\r\n? Familiarity with schools, education, or nonprofit data management\r\n? Prior work with U.S.-based teams or campaigns\n\r\nSchedule & Pay:\r\n? 2–4 hours per day (flexible, but must overlap at least partially with 9AM–12PM CST)\r\n???? Competitive pay based on experience (please include your desired hourly rate)\r\n???? Long-term opportunity for increased hours and growth if you're amazing\n\r\nHow to Apply:\n\r\nInclude a short cover letter explaining why you're a great fit\n\r\nShare your experience with CRM or lead organization\n\r\nInclude the word “Strategic” in the subject line so we know you read the post\n\r\nShare your OnlineJobs.ph profile link and your preferred hourly rate, and be sure to apply with at least 6 apply points. \n\r\nWe’re looking to hire quickly — apply today if you want to help us impact thousands of students while building something meaningful and organized!",
  "skill_requirements": [
    "Inbound Sales",
    "Outbound Sales",
    "Sales Management"
  ]
}