{
  "job_id": "1422831",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Operation-Manager-1422831",
  "scraped_at": "2025-07-15T15:43:09.434207",
  "title": "Operation Manager",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us\r\nWe’re an Australian trade-services group with three fast-growing divisions—cleaning & care, steel fabrication, and multi-trade maintenance. Across all units we share one priority: smooth, reliable operations that let our field teams shine. To keep projects moving and clients happy, we’re hiring one versatile Admin & Operations Professional to become the digital backbone of our day-to-day work. You’ll report directly to the business owners, work shoulder-to-shoulder with site supervisors, and own the systems that keep jobs, documents, and dollars in sync.\n\r\nKey Responsibilities\r\n- Client communication: Answer and route calls, triage inboxes, and handle routine enquiries with a friendly, “right-first-time” approach.\r\n- Scheduling & coordination: Book jobs, confirm appointments, and keep shared calendars and task boards current so crews know exactly where to be.\r\n- Documentation & file control: Build clear folder structures, enforce version control, and keep Google Drive tidy and searchable.\r\n- Invoicing & basic bookkeeping: Raise and track invoices, maintain billing records, and liaise with our bookkeeper to ensure clean month-end close.\r\n- Workflow optimisation: Spot bottlenecks, set up light automations (e.g., Zapier), and propose process tweaks that save hours each week.\r\n- Team support & reporting: Provide concise status updates, maintain simple KPI dashboards, and keep everyone aligned on priorities.\n\r\nWhat You’ll Bring\r\n- 3–5 years of solid admin/operations experience, ideally within construction, trades, or service businesses.\r\n- Confident with Google Workspace, VOIP phone systems, Xero (or similar), and basic automation tools like Zapier.\r\n- Eagle-eye for detail, natural systems thinker, and a proactive communicator who owns outcomes end-to-end.\r\n- Comfortable working remotely, balancing independent focus with real-time collaboration during AEST business hours.\n\r\nTools & Software You’ll Use\r\n- Google Workspace & Drive – day-to-day documents, shared folders, version control\r\n- Google Calendar – job and crew scheduling\r\n- Xero – invoicing, reconciliation, month-end close\r\n- Invoice Simple – quick invoice generation for smaller jobs\r\n- Fergus (or similar job-tracking platform) – track work orders and site progress\r\n- Ascorer / task-management software – keep tasks visible and on target\r\n- Zapier – build light automations that eliminate double-handling\r\n- VOIP / Softphone system – handle inbound and outbound calls from anywhere",
  "skill_requirements": [
    "CRM",
    "Property Management",
    "Operation Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:44:57.939124",
      "reason": "Job first discovered"
    }
  ]
}