{
  "job_id": "1422580",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Shopify-Developer-1422580",
  "scraped_at": "2025-07-15T14:30:42.850877",
  "title": "Senior Shopify Developer",
  "type_of_work": "Full Time",
  "salary": "To be discussed based on experience and skills.",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Our Story :\r\nFounded in 2016, Overdose has grown to a team of 300+, with offices across New Zealand, Australia, South East Asia, Europe and the USA. We work in a partnership format with a select group of clients looking for innovation and accelerated growth in a competitive digital landscape.\n\r\nOverdose. connects unique local talent, entrepreneurial thinking, and global expertise to help merchants grow through aligned digital services for sustained business success.\n\r\nWe call this Complete Commerce.\n\n\r\nAbout the Role :\r\nAs a Senior Developer at Overdose, you will be at the forefront of creating high-quality eCommerce solutions using platforms such as Shopify and Adobe Commerce. You will work closely with cross-functional teams to deliver scalable, reliable solutions, and ensure successful project execution. This role requires a balance of technical excellence, problem-solving abilities, and clear communication to drive both client and company success.\n\r\nPlease attach your CVs in English as this role will require English proficiency.\n\n\r\nResponsibilities :\r\nDevelop front-end and back-end solutions using Adobe Commerce and Shopify platforms.\r\nBuild dynamic, responsive user interfaces and server-side applications using JavaScript, Node.js, and React.\r\nEnsure code adheres to best practices, is well-documented, and meets project requirements.\r\nTest and validate development work in staging environments to minimise bugs during QA or UAT.\r\nDesign and build efficient solutions using platform features, APIs, third-party integrations, and custom development.\r\nWork closely with delivery managers, project managers, and client success teams to ensure smooth project execution.\r\nThoroughly test all development work before submission and contribute to improving QA processes.\r\nTrack time accurately for all project-related tasks, following internal reporting protocols.\n\n\r\nSkills & Experience :\r\nA solid understanding of Adobe Commerce and Shopify development, with exposure to other eCommerce platforms like BigCommerce and CommerceTools.\r\nExperience working with the LEMP stack (Linux, Nginx, MySQL, PHP).\r\nProficient in working with Shopify's platform, APIs, and relevant development tools.\r\nStrong experience in JavaScript development, including frameworks such as React for the front end and Node.js for the back end.\r\nFamiliarity with modern frontend tooling and state management (e.g., Webpack, Vite, Redux).\r\nStrong written and verbal communication skills in English.\r\nExcellent time management skills and the ability to meet tight deadlines.\r\nCreative problem-solving and logical thinking to develop tailored eCommerce solutions.\r\nHigh attention to detail, both in deliverables and during internal review processes.\r\nAbility to manage multiple tasks simultaneously and work well under pressure.\r\nSelf-motivated, with the ability to work independently but knowing when to ask for help.\r\nA strong willingness to learn and grow with the team, contributing to collective success.\n\r\nPerks and Benefits :\r\nThe chance to learn from some of the best eCom leaders all around the world.\r\nAbility to continue your learning and development through globally recognised courses.\r\nGreat humans to work alongside everyday.",
  "skill_requirements": [
    "Shopify",
    "Shopify",
    "Shopify"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T00:22:27.403057",
      "reason": "Job first discovered"
    }
  ]
}