{
  "job_id": "1422061",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Property-Management-Real-Estate-Admin-1422061",
  "scraped_at": "2025-07-15T10:31:28.976911",
  "title": "Property Management / Real Estate Admin",
  "type_of_work": "Full Time",
  "salary": "Php 30,000-35,000 / month",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are seeking a proactive, detail-oriented, and highly organized Real Estate / Property Management Admin Assistant to support an entrepreneur in the real estate industry. The ideal candidate has excellent time management skills, can handle sensitive information with discretion, and thrives in a fast-paced, remote work environment. We are specifically looking for individuals who are polished, professional, and highly organized. Familiarity with basic bookkeeping is a plus but not required.\n\r\nYou will play a key role in ensuring smooth day-to-day operations by providing high-level administrative support, managing schedules, coordinating communications, and assisting with light financial tasks when needed. A neutral to no accent is preferred, and professionalism is essential in both written and verbal communication.\n\r\nResponsibilities include, but are not limited to:\r\n- Provide administrative support to the real estate/property management team, including calendar management, email - handling, and scheduling.\r\n- Perform accurate and efficient data entry and document management.\r\n- Prepare, format, and proofread reports, presentations, and internal documentation.\r\n- Assist with time-sensitive projects and ensure timely task execution.\r\n- Support bookkeeping tasks (e.g., expense tracking, invoice monitoring) if applicable.\r\n- Utilize Rent Manager or similar property management tools (experience is a plus).\r\n- Maintain confidentiality and handle sensitive information with integrity.\r\n- Provide general administrative support and assist with office coordination as needed.\n\r\nRequirements:\r\n- Experience with Upgrade to see actual info is a plus.\r\n- Rent Manager experience is a plus.\r\n- Familiarity with basic bookkeeping is an advantage.\r\n- Proven experience as a Real Estate Admin Assistant, Property Management Assistant, Executive Assistant, Virtual Assistant, or in a similar administrative role.\r\n- Excellent communication skills—both verbal and written—with a neutral or no accent.\r\n- Strong organizational and time management skills with the ability to prioritize effectively.\r\n- Proficiency in Microsoft Office, Google Workspace, and CRM systems.\r\n- Ability to work independently with minimal supervision and collaborate within a team.\r\n- High attention to detail and a commitment to accuracy.\r\n- Adaptability and flexibility to meet changing priorities and business needs.\r\n- Bachelor’s degree or equivalent work experience is preferred but not required.\r\n- Willingness to undergo a background check.\n\r\nMore info:\r\nThis is a work-from-home opportunity and a full-time position requiring 40 hours per week. You will need a steadfast computer with a reliable and consistent high-speed internet connection. You will need to ensure that you have a designated workspace that will allow you to focus and work uninterruptedly.\n\r\nCompensation + Perks:\r\n- Salary based on experience and expertise\r\n- Long-term employment focus with opportunities for mutual growth\r\n- Monthly benefits package starting after 6 months: Premium healthcare plan, Paid holidays and vacation days, Additional incentives\r\n- Annual performance reviews for potential salary increases\r\n- Monthly virtual team-building events with fun activities, games, and rewards\n\r\nTo apply:\n\r\nFollow this format:\n\r\nSubject: Property Management / Real Estate Admin - [Name]\n\r\nWhat to include in the email:\r\nNight shift (PH time) experience: [Y/N]\r\nVA experience: [Y/N]\r\nHas active employment: [Y/N]\n\r\nAttachments:\r\n- Resume\r\n- A 2-minute or less audio recording explaining why you would be a good fit for the position\r\n- A photo of your work-from-home setup\r\n- Equipment/computer specs\n\r\nSend to: Upgrade to see actual info",
  "skill_requirements": [
    "Property Management",
    "Real Estate",
    "Office and Administration"
  ],
  "is_active": true,
  "status_history": []
}