{
  "job_id": "1422743",
  "url": "https://www.onlinejobs.ph/jobseekers/job/FB-Social-Media-Marketing-Ads-Manager-1422743",
  "scraped_at": "2025-07-15T15:41:06.252867",
  "title": "FB Social Media Marketing Ads Manager",
  "type_of_work": "Full Time",
  "salary": "$5 - 7 depending on experience",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are Looking for a Creative Social Media Marketing Manager to join our Team. You'll oversee our Brands Social Media Accounts using Hootsuite, Facebook, Youtube, Tiktok, Instagram & X to streamline content management.\n\r\nThe ideal candidate is passionate, self-motivated, problem solver, flexible and with an ability to juggle multiple responsibilities with an extreme organization and unwavering attention to detail, all while always meeting weekly deadlines. Your role will involve crafting winning strategies and creating Weekly Content Calendar that truly resonates with our Brand Guidelines & Audience.\n\r\nKey Responsibilities:\r\nContent Calendar Development & Management:\r\nCreating and maintaining comprehensive content calendars for all Brand Social Accounts by working closely with the Creative Team to brainstorm and develop compelling video and graphics strategic content to grow our Youtube subscriber, Facebook Followers and increase video views on Tiktok & instagram that accurately represents and captures the attention that aligns with our brand and resonates with our audience that align with marketing strategies and brand messaging. This includes:\n\r\n~ Strategic Content Planning: Mapping out content themes, formats, and distribution schedules based on marketing goals and audience insights.\n\r\n~ Workflow Implementation: Establishing efficient workflows for content creation, review, approval, and scheduling.\r\nCross-Functional Coordination: Collaborating effectively with content creators, designers, and other stakeholders to ensure timely content delivery.\n\r\n~ Platform Optimization: Tailoring content schedules and formats to the specific nuances of each social media platform.\r\nPerformance Integration: Using analytics to inform future content calendar planning and optimize content performance.\r\nTool Proficiency: Experience utilizing content calendar and scheduling tools (e.g., Hootsuite Planner, Later, Asana, Trello).\n\r\n~ Ads Campaign Management: Stay informed about the latest social media marketing trends and best practices that are driving engagement and virality. Has ability to develop and implement structured paid social media advertising campaigns across various platforms (Facebook, Instagram, etc.). This includes:\n\r\n~ Strategic Planning: Defining campaign objectives, target audiences, and budget allocation.\r\n~ Campaign Setup & Optimization: Proficiently setting up campaigns, ad sets, and ad creatives within platform ad managers.\r\nA/B Testing & Iteration: Implementing rigorous A/B testing methodologies for ad copy, visuals, and targeting to optimize performance.\n\r\nPerformance Analysis & Reporting:\r\n~ Establishing clear KPIs: Tracking campaign performance, and generating insightful reports with actionable recommendations.\r\nBudget Management: Effectively managing and optimizing advertising budgets to maximize ROI.\n\r\n~ Audience Engagement: Foster strong relationships and connections with our audience by actively engaging with their comments, questions, and concerns in a timely and personalized manner.\n\r\nCreative & Content Skills:\r\n~ Exceptional Visual Storytelling: Proven ability to create compelling and engaging visual content (images, videos, GIFs, infographics) that aligns with brand identity and resonates with target audiences.\n\r\n~ Graphic Design Proficiency: Strong command of design principles (layout, typography, color theory) and proficiency in design software (e.g., Adobe Creative Suite, Canva).\n\r\n~ Videography & Editing Skills: Experience in planning, shooting, and editing short-form and potentially long-form video content optimized for various social platforms.\n\r\n~ Photography Skills: Ability to capture high-quality photos for social media, showcasing products, brand aesthetics, or behind-the-scenes content.\n\r\n~ Copywriting & Storytelling: Excellent writing skills with the ability to craft engaging, concise, and brand-consistent social media copy that drives action. Understanding of different platform writing styles.\n\r\n~ Content Adaptation & Repurposing: Ability to adapt existing content for various social media platforms and repurpose successful content into different formats.\n\r\n~ Understanding of Social Media Trends: Keeps a finger on the pulse of emerging trends, viral content formats, and platform updates to leverage them creatively.\n\r\nQualifications:\r\n~ 4-5 Years Experience as Social Media Marketing Campaign Ads Manager focus on graphics and video content.\r\n~ Strong Knowledge of Ads Campaign Facebook and their algorithms.\r\n~ Solid Understanding of Social Media Marketing Principles\r\n~ Collaborative and the ability to work effectively with others.\r\n~ Creative and Growth mindset.\r\n~ Strong analytical skills to interpret data and identify algorithm trends\r\n~ Stable & High-speed internet access to support remote work.\n\r\nHow to Apply: Please use CREATIVE as a subject line, making sure you read the listing. Also, include your Skype ID along with your resume link & portfolio link those without the subject line will not be entertained.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:32:21.674009",
      "reason": "Job first discovered"
    }
  ]
}