{
  "job_id": "1422789",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Specialist-Remote-1422789",
  "scraped_at": "2025-07-15T15:32:37.721840",
  "title": "Amazon Specialist (Remote)",
  "type_of_work": "Full Time",
  "salary": "800-1000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We're looking for a hands-on Amazon Specialist to help manage and grow our operations on Amazon. This role is focused on the backend — from inventory and listings to account health and promotions. If you're organized, experienced with Amazon Seller Central, and bonus — have some PPC knowledge — you are the one we're looking for.\n\r\nWhat You’ll Do\r\n- Manage Listings: Create, edit, and optimize product listings (titles, bullets, descriptions, A+ content, variations).\r\n- Track Inventory: Monitor stock levels across marketplaces and fulfillment centers; flag and resolve inventory issues (stranded, suppressed, low-stock).\r\n- Run Promotions: Set up coupons, deals, and other promo activities aligned with campaign calendars.\r\n- Maintain Account Health: Stay on top of performance metrics and compliance alerts; flag and resolve potential issues.\r\n- [Bonus] Assist with PPC: While this isn’t a core focus, any ability to analyze or manage basic campaigns is a welcome plus.\n\r\nWho You Are\r\n- 1–2 years experience managing Amazon Seller Central operations (not just ads).\r\n- Strong working knowledge of Amazon listing and inventory tools.\r\n- Excellent attention to detail and ability to manage tasks independently.\r\n- Proactive problem-solver who knows how to troubleshoot common Amazon issues.\r\n- Comfortable working remote, with strong written communication skills.\r\n- [Bonus] Familiarity with Amazon PPC basics — at least enough to interpret ad performance or coordinate with ad specialists.\n\r\nWho We Are — ShiftCam\r\nShiftCam is a photography-first tech company building innovative mobile gear that helps creators shoot better with their phones. From award-winning camera lenses to pro-grade lighting and grips, we help bridge the gap between mobile convenience and cinematic results. Our gear is sold globally and used by content creators, mobile filmmakers, and photographers who want professional results from their smartphone.",
  "skill_requirements": [
    "Amazon Ads",
    "Catalog Management",
    "Seller Central"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T05:35:08.398894",
      "reason": "Job first discovered"
    }
  ]
}