{
  "job_id": "1422175",
  "url": "https://www.onlinejobs.ph/jobseekers/job/FUN-Customer-Support-Written-No-Experience-Needed-Dance-Academy-Salsa-Bachata-1422175",
  "scraped_at": "2025-07-15T12:22:16.663946",
  "title": "FUN Customer Support (Written) | No Experience Needed | Dance Academy (Salsa / Bachata)",
  "type_of_work": "Full Time",
  "salary": "To be determined",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Hiring TWO representatives. \n\r\nFull-time, long-term opportunity.\n\r\nNo experience needed.\n\r\nABOUT US\r\nWe are the largest salsa & bachata dance academy in Los Angeles and are growing rapidly.\n\r\nThe culture here is FUN, fast, and friendly. Our goal is to make every student feel welcome and completely taken care of.\n\r\nDancing changes lives - we are on a mission to deliver the best salsa/bachata educational experience on Earth.\n\r\nThe company is Movers and Shakers Salsa and Bachata Dance Academy.\n\n\r\nABOUT YOUR TEAM\r\nWorking with a remote team that helps with all facets of the business, you'll form a close working relationship and bond with your team mates. We even host team retreats in the Philippines!\n\n\r\nSCHEDULE\r\nAll times written in PST (Los Angeles time)\n\r\n• 2-week training: Sunday to Thursday 11:00AM - 8:00PM with a break for lunch\r\n• After training: two weeks same schedule\r\n• After training is complete:\n\r\nOPTION 1:\r\nMonday - Friday 9am - 6pm\n\r\nOPTION 2:\r\nSaturdays, Sundays 9am-6pm, and \r\nMonday - Wednesday 8am-5pm\n\n\r\nYOUR ROLE\r\n• Your primary role is written student support (text, email etc.)\r\n• When there are no support tasks to complete, you'll contribute in a wide variety of other ways, depending on your skills and interests. Some examples may include writing blogs, updating websites, doing research, collecting and analyzing numerical data and using it to create reports, etc.\n\n\r\nWRITTEN VS PHONE SUPPORT\r\n• 95% of our student support is written. However, occasionally you will need to be on the phone with a student. You must be comfortable on the phone.\n\n\r\nTYPES OF SUPPORT YOU'LL HANDLE\r\n• One on one texting and emailing\r\n• Mass texting and emailing\r\n• Occasional phone calls (rare)\r\n• Updating database after every interaction and attempted interaction\r\n• Daily reports\r\n• Etc.\n\n\r\nCOMPANY CULTURE\r\nWorking in a small business like ours is very different from a large corporation. Some of the differences are:\n\r\n• Personal tone: Our communications with students are FRIENDLY, FUN, and PERSONAL. It's like talking to your best friend. We use emoji's and exclamation points and are very personal. We take the opposite approach of large corporations that give robotic, frustrating, not very helpful support. You need to be intuitive and have strong emotional intelligence to feel what the students are needing when they communicate.\n\r\n• More creativity: there is more freedom to adjust your responses for each scenario. This is more challenging than just following strict templates, but also more stimulating and exciting.\n\r\n• Impact: your actions will have a big impact on the business, which you will clearly see\n\r\n• Feedback: your feedback on what we are doing well, and what could be better, is not only valued, but is mandatory! We want everyone here thinking as if they were the business owner.\n\n\r\nABOUT YOU\r\n• Perfect written English\r\n• Available full-time\r\n• High emotional intelligence\r\n• Flexible\r\n• Quick learner\r\n• Thrives in fast-paced, quickly changing environment\r\n• Desire to always seek better ways to do things, including finding ways to use A.I. tools\r\n• Happy to be on the phone when needed (which is rarely)\r\n• Tremendous attention to detail - gets things right the first time\r\n• PRO-ACTIVE. Always looking for ways to improve.\r\n• Meticulous, organized, methodical. Almost never misses a detail.\r\n• Critical, creative thinker. Not robotic. Always looking for better ways to do things. Always considering all the angles of a task.\r\n• Not afraid to share your opinion - we NEED to hear your opinion on the approaches that we take so that we can improve.\r\n• Able to ask clarifying questions in order to get tasks right the first time\r\n• Strong communicator\r\n• Makes decisions independently\r\n• Quick learner\r\n• Fast computer\r\n• Fast, dependable Internet\r\n• Bonus if you have experience or interest in salsa or bachata or any dance!\n\n\r\nAPPLY NOW. FORMAT YOUR APPLICATION AS A NUMBERED LIST WITH THE FOLLOWING:\r\n1. A brief intro about yourself\n\r\n2. Which hours, of the above two options, would you prefer to work? Option 1 or option 2?\n\r\n3. Are you happy to be on the phone when needed?\n\r\n4. This is a fast-paced environment with quickly changing conditions. You’ll need to be able to think quickly on your feet and track dozens of moving pieces at once with precision and accuracy. This role is NOT for people who feel overly anxious in this type of environment. Apply only if you thrive in such an environment. Based on this information, do you still feel this role is a good fit for you?\n\r\n5. Complete this form: Upgrade to see actual info/Upgrade to see actual info. 6. Write in the subject line of your application the answers to the assessment in the link above: 1. Grammar score 2. Typing WPM 3. Numbers assessment answer (regarding achieving $2,000 profit) 4. Highest level of formal education\n\r\n7. Any sales experience? (Not required - bonus). If yes, please describe.\n\r\n8. These positions are competitive, often with hundreds of applicants. What is your competitive requested monthly payment for this full-time position?\n\n\r\n(Don't email us off the platform or message on social media - your application will be disqualified. Don't worry, we personally check every application here)\n\r\nLooking forward to meeting you!\n\n\n\n\r\n——————————————\r\nSearch: Student support, customer support, virtual assistant, va, virtual assistance                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": []
}