{
  "job_id": "1422655",
  "url": "https://www.onlinejobs.ph/jobseekers/job/HUUB-Client-Success-Associate-Virtual-Assistant-1422655",
  "scraped_at": "2025-07-15T12:33:18.815430",
  "title": "HUUB Client Success Associate / Virtual Assistant",
  "type_of_work": "Full Time",
  "salary": "$1,200/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Terms\r\nRemote, Mon-Fri 9-6 USA time\r\n40 hours/week - $1,200/month\n\r\nWhat is HUUB?\r\nHUUB is a city-wide, data-driven, digital entrepreneur support platform for entrepreneurs. Our goal is to create access to vital entrepreneur resources for small business owners so they can survive, thrive and build generational wealth. We do this through our digital platform that helps city governments deliver: free learning programs, and social feeds, find free or discounted consultants, and connect the resources in their community to better serve business owners. \n\r\nLearn about HUUB: Upgrade to see actual info\n\r\nWho is HUUB?\r\nWe are a small but mighty team passionate about supporting small businesses on their quest to be successful today and be resilient to whatever they face tomorrow. A day in the life of a teaUpgrade to see actual infomber is constantly changing as we grow and develop the platform. We adapt swiftly and thoughtfully to the needs of our communities, while always taking pause to ask questions and challenge ourselves to think bigger as we grow and scale. \n\r\nWhere do we need help?\r\nThe HUUB team is seeking a motivated, highly-skilled customer support representative to assist in generating new leads and nurturing new and existing long-term relationships with our small business and government clients through consistent, comprehensive outreach campaigns and follow-up.\n\r\nAs the Client Success Associate, you will be the front line for all support issues, as well as handling outreach to customers to support scheduling and overall happiness of clients with our software. You will be expected to respond to LiveChat messages, develop text and email campaigns to improve engagement, run Zoom support calls, proactively support users, and occasionally handle cold calling outreach. \n\r\nYou will work closely with the COO and the Executive Operations Associate to collaborate with existing and new strategies for our B2B and B2G (government) marketing initiative and manage our first line of communication with our contacts. \n\r\nWhat does the job entail today?\r\nHere’s what you’ll be working on day-to-day, but flexibility is key, and other responsibilities may arise. You will be focusing on proactive outreach and support of end users and governments. You will be reporting to our COO and Executive Operations Associate:\r\nOversee contact management for relationship nurturing and engagement, through phone calls, messaging, and email campaigns.\r\nMeasure conversion and meet performance goals and benchmarks. \r\nOrganize and report resulting engagement and conversion from implemented marketing initiatives, and recommend campaign improvements based on first-hand conversations.\r\nProactively develop campaigns and ideas for outreach and engagement.\r\nBuild emails to users when new releases are deployed.\r\nRun and support the customer support office hours.\r\nManage and update the knowledge base with videos and text for end users\r\nManage and update team database (CRM), including contact sourcing, creation, screening, qualification, follow-up, nurturing, deletion, tagging, and appointment setting. \r\nImmediately respond to incoming calls, texts, and emails. \r\nManage qualified contacts and oversee automated content delivery. \r\nFollow up on the contact list to maintain consistent engagement. \r\nCollaborate with other internal teams to develop, support, and monitor strategic marketing initiatives and campaigns.\r\nResearch leads and prospecting opportunities.\r\nAs needed across multiple departments, fill gaps cross-functionally by building an understanding of the unique operational needs of our business.\n\r\nWhat kind of person are we looking for?\r\nAdaptive Communication: Strong written and verbal skills with sharp attention to detail, accuracy, and timeliness, ability to communicate well both internally and externally\r\nProactive: Take-care-of-it now mentality when appropriate, and timely execution of future deadlines \r\nOrganized + Detail Oriented: Can keep track of multiple projects at the same time and catch mistakes, errors, or changes before they snowball into a bigger problem\r\nSharp + Resilient: Quick to learn new systems and problem solve, have a never-give-up mentality, an ability to adapt to change, and an ability to stay motivated in front of challenges and multiple rejections. \r\nMotivated: Able to bring new ideas to life by driving projects on your own\r\nApproachable/High EQ: the ability to keep cool under pressure; let the small things go; be the person that others can come to for answers (or point them in the right direction); humble and curious\r\nCollaborative: Communicate cross-functionally and within teams via appropriate mediums (email/Slack/text/call) and collaborate with people to get things done efficiently while keeping it all together\n\r\nThe practical skills needed:\r\nExceptional communication skills, with a natural American accent\r\nExperience in outbound outreach, preferably in an appointment-setting role\r\nExperience with tools for automation, CRM, email marketing, project management, communication, collaboration, etc. \r\nExperience working with a remote team\r\nProactive in creating training documents and writing guides\r\nAbility to work with little or no supervision\r\nAbility to work independently or as part of a team\n\r\nExperience with tools:\r\nFollow Up Boss\r\nZapier\r\nGoogle Suite\r\nLiveChat\n\r\nTo apply, please complete this form: Upgrade to see actual info.",
  "skill_requirements": [
    "CRM",
    "Customer Support",
    "Client Relationship Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:24:49.589817",
      "reason": "Job first discovered"
    }
  ]
}