{
  "job_id": "1422662",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Cold-Caller-Lead-Generator-1422662",
  "scraped_at": "2025-07-15T14:41:05.998249",
  "title": "Cold Caller & Lead Generator",
  "type_of_work": "Full Time",
  "salary": "$3.45",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "This is a remote position ideal for someone with experience in real estate wholesaling or cold calling who’s comfortable making hundreds of calls per day, following a script, and qualifying motivated seller leads.\n\r\nIn this role, you will be responsible for calling through lists of property owners using our dialer system (BatchDialer) and sourcing new leads using BatchLeads. Your main goal is to identify motivated sellers, gather key information about their property and situation, and take clear notes in our CRM. You’ll also be expected to update our lead tracker daily and communicate with the team on any hot leads, follow-ups, or scheduled appointments.\n\r\nThe ideal candidate has prior experience with cold calling, preferably in real estate, and understands how to handle objections while maintaining a friendly, professional tone. You should be comfortable with using tools like BatchLeads, BatchDialer, and Google Sheets. Strong spoken English, reliability, and the ability to work during U.S. hours (CST or EST preferred) are all required.\n\r\nThis is a performance-focused position. You’ll be expected to make 300–500 calls per day and generate qualified leads consistently. Pay starts at a base hourly rate and increases over time depending on performance, with bonuses available for every qualified lead or closed deal that results from your calls.\n\r\nIf you’re hungry, coachable, and ready to be part of a growing real estate business, we’d love to hear from you. Please apply with your resume, a short message about your experience, and any examples of previous work if available. We’re excited to find someone who wants to grow with us.",
  "skill_requirements": [
    "Real Estate",
    "Cold Calling",
    "Lead Generation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:30:47.519650",
      "reason": "Job first discovered"
    }
  ]
}