{
  "job_id": "1422902",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Operations-VA-1422902",
  "scraped_at": "2025-07-15T12:23:44.783387",
  "title": "Marketing Operations VA",
  "type_of_work": "Full Time",
  "salary": "$5- $7 per hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role:\r\nWe are looking for a proactive and detail-oriented Marketing Operations Virtual Assistant to support our fast-paced digital marketing team. You’ll work directly with the founder to execute email campaigns, manage domains and data, maintain CRM accuracy, and ensure operational excellence across our marketing systems. This is a hands-on role ideal for someone who thrives in a tech-driven environment and values output, autonomy, and precision.\n\r\nKey Responsibilities:\r\n- Manage domains, proxies, and accounts across sheets and platforms, ensuring clear organization and updated tracking\r\n- Build, test, and deploy automated email campaigns in tools like Klaviyo, AWeber, and Sendlane, including troubleshooting deliverability issues\r\n- Maintain and segment CRM lists across international markets, ensuring clean and compliant data across all flows\r\n- Collaborate on campaign creatives—especially around casino or lead gen content—and suggest adjustments based on performance or compliance feedback\r\n- Operate in platforms like AdsPower and SendGrid to validate domains, run system checks, and troubleshoot platform bans or flags\r\n- Coordinate with the CEO for regular briefings and task updates, ensuring timely approvals and decision-making\r\n- Track financial transactions and maintain internal records across sheets and masterlists to reflect daily and weekly output\n\r\nMandatory Requirements:\r\n- 1–2 years of experience in marketing operations, CRM management, or digital/email campaign execution\r\n- Excellent proficiency in Google Sheets (advanced formulas, conditional formatting, and data validation)\r\n- Familiarity with email automation platforms like Klaviyo, AWeber, or Sendlane\r\n- Strong written and spoken English communication skills\r\n- Highly organized with strong attention to detail and accountability\r\n- Comfortable working independently in a fast-paced, remote-first environment\n\r\nPreferred Skills:\r\n- Experience with AdsPower or similar browser/proxy tools\r\n- Background in email marketing, performance marketing, or data monetization\r\n- Familiarity with DNS, deliverability testing, or domain/IP reputation management\r\n- Experience supporting marketing or tech teams in lean, remote setups\r\n- Basic understanding of marketing compliance and flagged content prevention (e.g., in casino/affiliate niches)\n\r\nWhy Join Us:\r\nWork closely with a performance-focused founder and gain hands-on experience in high-level marketing infrastructure. You’ll be joining a nimble but powerful team that leverages cutting-edge tools to scale impactful campaigns across global markets. With clear responsibilities, no corporate fluff, and a strong emphasis on independence and execution—you’ll have room to grow, innovate, and deliver results that matter.",
  "skill_requirements": [
    "CRM",
    "Campaign Building",
    "Google Sheets"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:33:53.453570",
      "reason": "Job first discovered"
    }
  ]
}