{
  "job_id": "1422081",
  "url": "https://www.onlinejobs.ph/jobseekers/job/WordPress-Developer-with-MLS-Integration-for-Real-Estate-Website-1422081",
  "scraped_at": "2025-07-15T11:35:42.645876",
  "title": "WordPress Developer with MLS Integration for Real Estate Website",
  "type_of_work": "Full Time",
  "salary": "25000-60000",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Job Overview:\r\nWe are seeking for 5-10 years experienced and reliable WordPress Developer to consolidate and rebuild multiple websites into one modern, high-performance real estate platform.\n\r\nYou must understand how to build for modern search, including Google SEO, Answer Engine Optimization (AEO), and Generative Engine Optimization (GEO), with strong backend usability and frontend design. Experience with real estate listing sites, MLS integration, or agent directories is a big plus.\n\r\nThis will be a high-quality site with luxury branding and must be built with scalability, automation, and visibility in mind.\n\r\nKey Responsibilities:\r\n• Rebuild and consolidate multiple WordPress websites into one scalable platform\r\n• Use a drag-and-drop builder (Elementor preferred)\r\n• Implement MLS listing feed via IDX/RETS (Toronto Real Estate Board or similar) on reachre (dot) ca (domain name)\r\n• Structure the site for SEO, AEO, and AI visibility (Google SGE, ChatGPT, Perplexity, Bing Copilot)\r\n• Create modular content blocks (FAQs, project specs, developer profiles, community guides)\r\n• Optimize for mobile, speed, and Core Web Vitals\r\n• Migrate and rebrand existing content into a clean new site structure\r\n• Provide admin documentation or brief training for our in-house team\r\n• Set up basic backend upload tools for brochures, PDFs, event banners, and listings\r\n• Recommend hosting, backup, and security setup\n\r\nMust-Have Skills:\r\n• WordPress development (Elementor or Gutenberg)\r\n• Strong on-page SEO knowledge (titles, URLs, schema, internal linking)\r\n• AEO/GEO understanding — ability to build sites that show up in AI search tools\r\n• Schema markup implementation (FAQ, RealEstateAgent, Product, Breadcrumb, etc.)\r\n• Familiarity with IDX/RETS listing feeds (or similar API/data integrations)\r\n• Mobile-first responsive design skills\r\n• Basic UI/UX sense — clean layout, easy navigation, CTA placement\r\n• Ability to communicate clearly in English\r\n• Ability to work independently and meet deadlines\n\r\nAI-Structured Site Architecture (Must Understand):\r\nThis website will be structured to show up in AI-generated answers. You must know how to:\r\n• Build structured data blocks for real estate content (project info, pricing, availability, agent bios)\r\n• Add FAQ/Q&A schema for AEO optimization\r\n• Structure pages so AI tools like ChatGPT, Perplexity, and Google SGE can scrape and summarize key data\r\n• Create clean, keyword-friendly, localized URLs\r\n• Design a website where users searching for “best investment property agent in Ontario” or “pre-construction homes with ROI” will see this brand appear as a source\n\r\nBonus Skills (Nice to Have):\r\n• Experience building real estate websites (especially in North America)\r\n• Familiarity with WP All Import, WPML, RankMath, or Schema Pro\r\n• Ability to create mortgage calculator widgets, lead-capture forms, and property comparison tools\r\n• Knowledge of API integration or Zapier\r\n• Experience with Mailchimp, HubSpot, or similar CRM tools\r\n• Good eye for modern, clean design (luxury/white space branding)\n\r\nHow to Apply:\r\nPlease send:\r\n1. Your updated resume and portfolio\r\n2. Links to any real estate or SEO/AEO-focused websites you’ve built\r\n3. Your monthly rate in PHP\r\n4. When you can start\r\n5. A short message about your experience with SEO or AI-ready websites\n\r\nApply directly via OnlineJobs.ph\n\r\nWe will contact shortlisted applicants for a short test task and next-round interview.",
  "skill_requirements": [
    "Wordpress",
    "Web Development"
  ],
  "is_active": true,
  "status_history": []
}