{
  "job_id": "1422468",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Cold-Email-Campaign-Operator-1422468",
  "scraped_at": "2025-07-15T12:37:00.384367",
  "title": "Cold Email Campaign Operator",
  "type_of_work": "Full Time",
  "salary": "$1,500 USD Monthly",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Cold Email Campaign Operator (Clay, Smartlead, and Apollo)\n\r\nSalary: $1,500 Philippines \r\nSchedule: Monday–Friday, 9 AM–6 PM EST (9 PM–6 AM PH)\n\r\nAbout the Role:\n\r\nWorkSpark is a US-based company building a high-performance outbound engine. We are hiring a Cold Email Campaign Operator to manage and execute daily cold email operations. Your primary tool will be Clay, and you’ll be responsible for preparing lead lists, enriching contacts, and launching targeted campaigns that drive our growth.\n\r\nThis is not a programming or automation role. This is a data-focused, execution role where you’ll work inside Clay and related tools to make our outreach strategy run smoothly and at scale.\n\r\nYou’ll work directly with our team based in the United States and must be comfortable working full-time during US business hours (EST/EDT).\n\r\nKey Responsibilities:\r\n- Build and manage Clay tables for new outbound campaigns\r\n- Clean, enrich, and segment lead lists using Clay’s AI and integrations\r\n- Launch campaigns using proper filters, tags, variables, and segments\r\n- Source or verify lead data using Apollo, ensuring quality before enrichment\r\n- Track campaign performance and identify missing or duplicate data\r\n- Coordinate syncing between Clay, Smartlead, Gmail, and Upgrade to see actual info\r\n- Occasionally support troubleshooting in Upgrade to see actual info\r\n- Communicate clearly in English with our internal US team\n\r\nRequirements:\n\r\n- Fluent in English (written and spoken)\r\n- Proven experience using Clay or similar enrichment/workflow tools\r\n- Strong understanding of cold email workflows (segmentation, personalization, deliverability)\r\n- Experience with Apollo or similar lead sourcing platforms\r\n- Comfortable working with data, spreadsheets, and CRMs\r\n- Experience using tools like Smartlead, Instantly, or other cold email platforms\r\n- Must be available full-time during US Eastern business hours\r\n- Stable internet connection and backup\r\n- Quiet, professional work environment\r\n- Headset and webcam for team calls\n\r\nPreferred but Not Required:\r\n- Familiarity with Upgrade to see actual info\r\n- Previous experience working with remote teams in US time zones\n\r\nBenefits:\n\r\n- Performance bonuses based on lead generation, campaign success, and proactive problem solving\r\n- Fully remote work \r\n- Opportunity to work with U.S. clients and grow your automation skills\r\n- PTO accrued after 3 month probation period\n\r\nHow to Apply:\n\r\n - Follow this link to apply: Upgrade to see actual info\r\n- Include a  short message/video  explaining:\r\n- Your experience with Clay, Apollo, or similar tools\r\n- The most complex lead workflow or campaign you’ve handled\n\r\nWe are only looking for full-time, long-term teaUpgrade to see actual infombers who can grow with us. If you’re experienced, detail-oriented, and ready to contribute to a high-performing team, we’d love to hear from you.",
  "skill_requirements": [
    "Email Marketing",
    "Campaign Building",
    "Apollo"
  ],
  "is_active": true,
  "status_history": []
}