{
  "job_id": "1422215",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Data-driven-Marketing-Coordinator-1422215",
  "scraped_at": "2025-07-14T23:09:45.621487",
  "title": "Data-driven Marketing Coordinator",
  "type_of_work": "Full Time",
  "salary": "80,000 - 100,000 PHP/month + Monthly bonuses + Quarterly Company Profit Share",
  "hours_per_week": "TBD",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Role Details\r\nFull-Time | 8 hours/day | Monday to Friday\r\nWork Hours: 8AM – 4PM Pacific Time (PST)\r\nLocation: Remote (must have reliable power, internet, and backup)\r\nCompensation: PHP 80,000 – 100,000/month depending on experience\r\nBonuses: Monthly performance-based bonuses + quarterly company profit-sharing (after probation)\n\r\nWe’re looking for a sharp, data-driven Marketing Coordinator to help us grow faster and smarter across multiple client campaigns. You’ll be working closely with our Head of Marketing to plan and execute full-funnel campaigns across paid ads, email marketing, and creative testing. If you’re passionate about growing in marketing, love working with data, and want to take ownership of performance, this is your chance to level up.\n\r\nThis is not a pure execution job. We’re hiring someone who’s hungry to grow into a true strategic marketer, someone who doesn’t just follow instructions, but helps shape winning campaigns and knows when to pivot based on performance data.\n\r\nWhat You’ll Be Doing\r\n• Performance Marketing & Media Buying\r\n• Launch and manage paid ads (primarily on Meta and YouTube), including creative rotation, budget allocation, and performance tracking\r\n• Turn off underperformers and scale winners systematically\r\n• Track and report on key KPIs across ad platforms and email campaigns, keeping dashboards clean and accurate\n\r\nCreative Coordination\r\n• Work with our designer and video editor to request new image and video creatives based on performance insights\r\n• Brief creatives clearly, manage deadlines, and give actionable feedback that improves results\n \nEmail Marketing & Retention\r\n• Write and schedule marketing emails for active client campaigns and nurture sequences\r\n• Track open rates, click-through rates, and conversions, and optimize accordingly\n\r\nClient Support\r\n• Support live campaign rollouts such as webinars, sales pushes, and launches\r\n• Jump into Slack or meetings to support client questions and execution needs as campaigns go live\n\r\nWhat We’re Looking For\r\n• 1+ year in a similar role (marketing coordinator, media buyer, or campaign manager; bonus if in the online coaching/education space)\r\n• High initiative and desire to grow into a strategic marketer, not just stay in execution\r\n• Comfortable analyzing ad/email metrics (ROAS, CTR, CPL, open rates, etc.) and making decisions based on numbers\r\n• Good eye for creatives and understanding what converts, even better if you can do light image or video editing\r\n• Strong attention to detail, especially around reporting and campaign data\r\n• Solid communication and task management skills; you’re responsive, organized, and reliable\n\r\nMain Tools We Use\r\n• Ad Platforms: Meta Ads, Google Ads Manager\r\n• Email & Automation: Mailchimp, GoHighLevel, ActiveCampaign, Zapier\r\n• Collab Tools: Slack, Loom, Google Drive\r\n• Reporting: Google Sheets, Hyros\n\r\nAbout Sales Possible\r\nAt Sales Possible, we partner with mission-driven online coaching businesses to scale their impact through world-class marketing, sales systems, and team training. Whether we’re helping founders scale their offers or equipping marketing and sales teams with the right tools and mindset, our goal is to drive sustainable growth with integrity.\n\r\nWe don’t just teach sales, we build full-funnel systems that empower both businesses and the people behind them. Our clients range from expert coaches to fast-growing education brands, and we take pride in helping them turn vision into real results.\n\r\nWe’re a tight-knit, fast-moving team that values clear communication, ownership, and continuous growth. If you’re someone who thrives in a proactive, performance-driven environment and wants to make a real difference through your work, you’ll feel right at home here.",
  "skill_requirements": [
    "Facebook Ads",
    "Media Buying",
    "Youtube Ads"
  ]
}