{
  "job_id": "1422179",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-Credit-Specialist-Urgent-Hiring-1422179",
  "scraped_at": "2025-07-15T12:29:32.187728",
  "title": "Executive Assistant - Credit Specialist ( Urgent Hiring! )",
  "type_of_work": "Any",
  "salary": "$5/hr",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We are conducting interviews this week, if you're a hard worker and want to be a part of a world-class team and make an impact be sure to apply!\n\r\nCredit Specialist | Legacy Strong | $500+ / mo Upside | REMOTE\n\r\nI’m Alec Delpuech, the founder of Legacy Strong, a B2B accelerator that has worked with over 50 clients in the past year.\n\r\nWe’re on the hunt for a Credit Specialist to help take us to 15 new clients per month.\n\r\nLegacy Strong is a company that helps entrepreneurs and small businesses secure funding through bank financing. We are currently seeking a dynamic and self-motivated Credit Specialist to join our remote team.\n\r\nMore details:\r\n- Looking for a a dynamic and self-motivated individual with a strong understanding of the American credit system.\r\n- Work with the Credit Repair Cloud software and remove negative items on client credit reports.\r\n- Reporting to CEO.\n\r\nSelling Points:\r\n- Unique opportunity to help build a company from 50 clients to 1000 in just a few years.\r\n- We have a “Conscious Culture:”: there is an incredible balance of world-class standards & intensity while promoting a healthy lifestyle. An extremely fun and empowering environment to be in.\n\r\nRequirements:\r\n- Excellent English speaking and writing\r\n- Minimum 1 year experience working in the American credit repair industry\r\n- Experience in using Credit Repair Cloud software\r\n- Strong decision-making skills\r\n- High emotional intelligence, resilience, and problem-solving ability\r\n- Comfortable speaking over the phone and answering questions\r\n- Good organization skills\n\r\nHow to apply:\r\n- Attach resume\r\n- Input \"Golden Doodle\" in the application subject line\n\r\n------------\n\r\nIf this seems interesting, please apply!\r\nLooking forward to connecting!\n\n\r\nAlec Delpuech\r\nLegacy Strong",
  "skill_requirements": [
    "Customer Support",
    "Credit Repair",
    "Risk Analysis"
  ],
  "is_active": true,
  "status_history": []
}