{
  "job_id": "1422963",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Assistant-1422963",
  "scraped_at": "2025-07-15T15:43:03.562678",
  "title": "Marketing Assistant",
  "type_of_work": "Full Time",
  "salary": "$5-6 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a creative, detail-driven marketer who thrives in a fast-paced, process-focused environment? Do you have a passion for real estate and a knack for engaging content? If you’re looking for a long-term, full-focus virtual role with a friendly, high-performing team, we want to meet you!\n\r\nTuesday to Saturday, 8:30 AM – 5:30 PM EST - Applicants must have experience working these hours.\n\r\nWho We’re Looking For:\n\r\nMarketing-focused: You love brainstorming content, writing captions, managing social media, and know what grabs attention online.\r\nProcess-driven: You follow instructions, double-check your work, and thrive on consistency.\r\nResourceful & analytical: You dig for answers, research trends, and solve problems independently.\r\nCreative & tech-savvy: You’re comfortable with video editing, blog writing, and using the latest tools and platforms.\r\nExcellent communicator: You keep the team in the loop and manage your time well.\r\nReal estate knowledge is a huge plus!\n\r\nKey Responsibilities:\r\nSocial media management: Create engaging captions, stories, reels, and visual content.\r\nContent creation: Write blogs, email promos, and help plan campaigns.\r\nVideo editing: Edit short-form videos for social and web.\r\nAdministrative support: Oversee transaction processes, data entry, and help build marketing systems.\n\r\nHow to Apply:\n\r\nOnly applicants who complete the application form below and are within the pay range will be considered.\n\n\nUpgrade to see actual info/forms/d/e/1FAIpQLSd6rxjby8Z8pbQuQ1v7zNJ65FsCaclYOxu-ORzdjaxpvHwGCQ/viewform?usp=sf_link",
  "skill_requirements": [
    "Graphic Design",
    "Social Media Video Editing",
    "Office and Administration"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T09:35:03.009112",
      "reason": "Job first discovered"
    }
  ]
}