{
  "job_id": "1422745",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Ecommerce-DTC-Video-Editor-1422745",
  "scraped_at": "2025-07-15T15:33:21.915293",
  "title": "Ecommerce DTC Video Editor",
  "type_of_work": "Full Time",
  "salary": "800-2000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We're looking for a creative, long-term video editor to craft high-quality ad creatives for our eCommerce brand. You'll focus on storytelling, pacing, and editing styles that range from organic UGC-style content to more direct-response, VSL-style videos.\n\r\n???? Key Responsibilities\r\n???? Edit UGC and raw footage into compelling, high-converting direct response ads\r\n???? Use platform-native editing techniques: quick cuts, dynamic captions, and punchy hooks\r\n???? Collaborate closely with our creative team to iterate based on performance data\n\r\n???? Requirements\n\r\nExperience & Skills:\r\n? 1+ year editing videos for performance-based marketing\r\n? Portfolio showcasing UGC-style or native platform ad creatives\r\n? Solid grasp of direct response fundamentals: strong hooks, retention tactics, and CTAs\r\n? Ability to follow briefs while also contributing creative ideas\n\r\nSoftware Proficiency:\r\n? Proficient in CapCut, Adobe Premiere Pro, or similar editing tools\r\n? Able to work efficiently with quick turnarounds\r\n? Familiar with AI tools like ElevenLabs, HeyGen, or Kling for voiceovers and avatars\n\r\nBonus Experience (Nice to Have):\r\n? Experience with VSL-style or longer-form ads\r\n? Understanding of creative testing, iterations, and optimizing based on ad performance\n\r\n???? Pay Structure & Workload\r\nThis role starts as part-time with flexible hours (typically 15–25 hours/week). If we’re a great match and you consistently deliver strong work, you’ll have the opportunity to move into a full-time role (40+ hours/week) with steady income and performance-based bonuses.\n\r\nCompensation:\r\n???? Up to $12/hour full-time (depending on experience & speed)\r\n???? Performance Bonuses: $50–$150 for creatives that scale to $1k–$10k ad spend at 2.0+ ROAS\n\r\n???? How to Apply\r\nIf you're a performance-focused editor who knows how to craft conversion-optimized videos, we’d love to hear from you.\n\r\nPlease include:\r\n???? Your portfolio or links to relevant work\r\n???? Your expected rate for part-time (15–25 hours/week) and full-time (40+ hours/week)\r\n???? A list of the tools and software you’re confident using\n\r\n???? Important: Be sure to include the word “Almond” in your application so we know you read the full post!",
  "skill_requirements": [
    "Video Editing",
    "CapCut"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T04:30:59.830575",
      "reason": "Job first discovered"
    }
  ]
}