{
  "job_id": "1422513",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Remote-Finance-Associate-1422513",
  "scraped_at": "2025-07-15T14:30:12.843788",
  "title": "Remote Finance Associate",
  "type_of_work": "Full Time",
  "salary": "$5-8/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "All You Need Services is a growing U.S.-based construction and project management company known for delivering reliable, high-quality services to clients across the country. As we expand, we are looking for a detail-oriented, trustworthy, and motivated Finance Associate to join our remote team and support our day-to-day financial operations.\n\r\nThis is a long-term, full-time position with growth potential for the right candidate.\n\r\nKey Responsibilities:\n\r\n*Assist in the preparation and analysis of financial reports, including income statements, balance sheets, and cash flow statements.\r\n*Support the development of company budgets and financial forecasts.\r\n*Collaborate with various departments to consolidate financial records, analyze data, and ensure budgets align with organizational goals and objectives.\r\n*Manage the accounts payable process, including invoice processing, vendor statement reconciliation, and timely payment execution.\r\n*Oversee accounts receivable activities, such as issuing invoices, monitoring incoming payments, and following up on outstanding balances.\r\n*Support daily financial operations, including maintaining accurate financial records, preparing journal entries, reconciling bank statements, and managing petty cash.\r\n*Ensure compliance with financial regulations, internal controls, and company policies.\r\n*Utilize financial systems and accounting software to input, process, and retrieve financial data; maintain and update financial databases; and generate reports as required.\n\r\nQualifications:\n\r\n*Bachelor’s degree in Accounting or a related field\r\n*Certified Public Accountant (CPA) / Board passer\r\n*At least 5 years of professional experience in U.S.-based accounting\r\n*Strong proficiency in QuickBooks Online or Xero (similar systems)\r\n*Excellent knowledge of GAAP and U.S. accounting principles\r\n*Proficiency in Google Sheets or Microsoft Excel\r\n*Strong written and spoken English communication skills\r\n*High attention to detail, confidentiality, and integrity\r\n*Ability to work independently and manage multiple tasks\r\n*Experience with construction or service-based businesses is a plus\r\n*Comfortable working full-time during EST hours\r\n*Has a reliable internet connection and devices",
  "skill_requirements": [
    "Accounting",
    "Data Analytics",
    "Communication"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-14T22:17:48.091884",
      "reason": "Job first discovered"
    }
  ]
}