{
  "job_id": "1422763",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-for-Operations-Organization-Across-3-Businesses-Email-SOPs-Google-Drive-1422763",
  "scraped_at": "2025-07-15T15:40:01.216594",
  "title": "Virtual Assistant for Operations & Organization Across 3 Businesses (Email, SOPs, Google Drive)",
  "type_of_work": "Part Time",
  "salary": "$4-8/HR",
  "hours_per_week": "10",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Virtual Assistant for Operations & Organization Across 3 Businesses (Email, SOPs, Google Drive)\n\r\nWe’re hiring a proactive and detail-oriented Virtual Assistant to support daily operations across three of our businesses:\n\r\n- Roaterra LLC (parent company)\r\n- Vancillary (e-commerce van parts brand)\r\n- Future Business Purchase (entertainment & events business)\n\r\nIf you’re highly organized, comfortable managing email communications, and love building efficient systems, we want to work with you!\n\r\n???? What You’ll Do:\n\r\n???? Email Management: Monitor multiple Gmail accounts daily. Flag priority messages, organize inboxes, and respond to basic customer service inquiries after training.\n\r\n???? Create SOPs: Document repeatable processes like uploading products to Shopify, connecting with affiliates and builders, or designing new escape rooms. Help build a long-term training system for future teaUpgrade to see actual infombers.\n\r\n????? Google Drive Organization: Maintain a clean, logical file system for Google Docs, photos, design files, and other content across all businesses.\n\r\n? To-Do List Management: Help organize and manage the shared “To Do” list between the two founders, making sure tasks are tracked and followed up on.\n\r\n???? General Admin Support: File attachments from email, assist with media library organization, draft templated replies, and more.\n\r\n???? Skills & Qualities We’re Looking For\n\r\n • ? Prior experience as a Virtual Assistant or Executive Assistant\r\n • ? Excellent written and verbal English skills\r\n • ? Comfortable using Gmail, Google Drive, and Slack\r\n • ? Familiar/ Experienced with Shopify and supported apps\r\n • ? Familiar with SOP creation (in Google Docs, Notion, or other tools)\r\n • ? Detail-oriented, efficient, and reliable\r\n • ? Comfortable working with minimal supervision after onboarding\r\n • ? Able to suggest improvements and solve problems independently\n\r\n? Work Hours\r\n • 10–20 hours per week to start\r\n • Flexible working hours, but must check emails at least two to three times per day and communicate via Slack daily\r\n • Available for occasional Zoom check-ins (1–2 times/week)\n\r\n???? Compensation\r\n • $4–$8/hour depending on experience and skill set\r\n • Paid weekly via Wise\n\r\n???? How to Apply:\n\r\n- Send us a message with the subject line: “VA Application – Organized & Ready”\r\n- Include a short paragraph (3–5 sentences) explaining:\r\n- Why you’re a great fit for this role\r\n- An example of a time you improved a system or process for someone else\r\n- Share your resume and any relevant links (LinkedIn, online portfolio, etc.)\r\n- (Optional but appreciated) Share a 1-minute Loom video introducing yourself",
  "skill_requirements": [
    "Email Support",
    "Office and Administration",
    "Organization"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T05:30:40.458180",
      "reason": "Job first discovered"
    }
  ]
}