{
  "job_id": "1422924",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Follow-Up-VA-Real-Estate-Land-Wholesaling-Closify-Offers-Inc-1422924",
  "scraped_at": "2025-07-15T14:34:43.809492",
  "title": "Follow-Up VA – Real Estate (Land Wholesaling) | Closify Offers Inc.",
  "type_of_work": "Full Time",
  "salary": "$1000",
  "hours_per_week": "36",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you great at staying organized, consistent with follow-through, and able to build rapport through calls and texts?\n\r\nClosify Offers Inc. is a U.S.-based real estate investment company looking for a proactive and detail-oriented Follow-Up Virtual Assistant to help us stay in touch with landowners who have shown interest in selling but haven’t closed yet.\n\r\nThis is a critical role in our acquisition pipeline — you’ll help us turn “maybe” leads into signed deals.\n\r\n???? What You’ll Be Doing:\r\nFollow up consistently with warm leads via phone, SMS, and email\n\r\nUse our scripts and templates to re-engage sellers\n\r\nTag, update, and organize lead statuses in our internal CRM\n\r\nSet appointments for acquisition managers with re-engaged leads\n\r\nKeep daily notes and communicate with the team about progress\n\r\nStay on top of follow-up schedules without needing reminders\n\r\n???? Compensation:\r\n$5/hour, paid weekly (Wise or PayPal)\n\r\n$5 bonus for each re-engaged lead that becomes an appointment\n\r\n$10 bonus for each lead that signs contract\n\r\n1% commission on deals closed from your follow-up efforts\n\r\n? What We’re Looking For:\r\nExcellent English (spoken and written) with a neutral or great accent\n\r\nAt least 6 months of VA, cold calling, follow-up, or sales experience\n\r\nOrganized and consistent — must be able to follow through daily\n\r\nComfortable texting AND calling leads\n\r\nSelf-motivated, dependable, and good with time management\n\r\nFamiliarity with real estate or wholesaling is a plus, but not required\n\r\nFull-time availability during U.S. hours (EST preferred)\n\r\n???? How to Apply (Read Carefully):\r\nOnly applicants who follow these 2 steps will be considered:\n\r\nStart your message with the keyword: “Closer Fuel”\n\r\nSubmit a voice or video recording (via Vocaroo, Loom, or any link)\n\r\nIntroduce yourself\n\r\nShare why you think you're a great fit for a follow-up role\n\r\n?? No resume, no cover letter. Just the keyword + recording.\r\nIf we like what we hear, you’ll receive a link to our official application form.\n\r\nWe’re scaling fast and looking for people who are hungry, coachable, and committed to long-term growth. If that’s you — apply today and let’s lock in some deals!",
  "skill_requirements": [
    "Appointment Setting",
    "ISA Real Estate",
    "English Speaking"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T08:29:16.538996",
      "reason": "Job first discovered"
    }
  ]
}