{
  "job_id": "1422876",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Product-Lister-Data-Entry-Specialist-1422876",
  "scraped_at": "2025-07-15T14:39:26.497276",
  "title": "Shopify Product Lister / Data Entry Specialist",
  "type_of_work": "Full Time",
  "salary": "$700",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a fast-growing e-commerce company looking for a highly detail-oriented Product Lister / Data Entry Specialist to help us optimize and upload product listings to our Shopify stores.\n\r\nThis is an initial full-time project (approx. 4 weeks), with the possibility of a long-term position for the right candidate.\n\r\nIf you’re meticulous, hard-working, and have experience listing products in Shopify, we want to hear from you!\n\r\nKey Responsibilities:\n\r\n- Upload and edit product listings in Shopify\r\n- Create unique and relevant product names for new listings\r\n- Check and correct product variants\r\n- Write new meta descriptions optimized for SEO (can use tools like ChatGPT)\r\n- Edit and correct URL handles for consistency and SEO\r\n- Ensure product descriptions include correct dimensions (Spanish language — translations tools can be used)\r\n- Basic photo editing when required (cropping, resizing, optimizing)\n\r\nRequirements:\r\n? At least 6–12 months of hands-on experience working with Shopify product listings\r\n? Proven attention to detail — you must be extremely accurate and precise\r\n? Experience with basic photo editing tools (e.g., Canva, Photoshop, etc.)\r\n? Ability to work independently with minimal supervision\r\n? Willingness to work flexible hours and with a “no 9-to-5 mentality” (we work at a fast pace and expect full dedication during the project)\r\n? Ability to communicate in English (written/spoken)\r\n? Comfort using translation tools (for Spanish product content)\n\r\nWork Conditions:\n\r\nFull-time: 40+ hours per week, 5–7 days per week (flexible)\n\r\nDuration: Approx. 1 month to start, with evaluation for potential long-term engagement\n\r\n$4 USD per hour\n\r\nRemote work from anywhere. Don't apply if you don't have experience with Shopify and or data entry.\n\r\n???? IMPORTANT: To make sure you’ve read this carefully, please include your favorite food in your application message. Applications without this will not be considered.",
  "skill_requirements": [
    "Product Optimization",
    "Shopify",
    "Data Entry"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T07:43:31.376246",
      "reason": "Job first discovered"
    }
  ]
}