{
  "job_id": "1422042",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-Outbound-Calls-Customer-Service-1422042",
  "scraped_at": "2025-07-15T09:31:16.625263",
  "title": "Virtual Assistant (Outbound Calls & Customer Service)",
  "type_of_work": "Full Time",
  "salary": "$5.00 - $6.00 per hour",
  "hours_per_week": "40",
  "date_updated": "Jul 14, 2025",
  "job_overview": "We’re seeking a talented and trustworthy individual with proven skills in outbound sales, lead generation, and customer service. If you have a passion for connecting with people, delivering proven results, and offering outstanding customer support, we’d love to hear from you.\n\r\nKey Responsibilities:\r\n- Conduct outbound calls to potential leads, with a focus on building rapport and creating engagement.\r\n- Handle customer service inquiries with professionalism and empathy, ensuring a positive customer experience.\r\n- Generate and qualify leads through proactive outreach and follow-up strategies.\r\n- Maintain accurate and organized records of interactions and outcomes.\r\n- Collaborate with the team to meet and exceed performance targets.\n\r\nQualifications:\r\n- Strong English communication skills, both verbal and written, with minimal accent.\r\n- Proven experience in outbound sales, lead generation, and/or customer service.\r\n- Ability to quickly build trust and maintain positive relationships with customers and leads.\r\n- Excellent problem-solving and interpersonal skills.\r\n- Comfortable working independently in a remote environment.\r\n- Reliable internet connection and appropriate home office setup.\n\r\nPreferred Skills:\r\n- Experience with CRM tools and outbound call software.\r\n- Ability to handle high call volumes while maintaining attention to detail.\r\n- Familiarity with U.S. markets is a plus.\n\r\nIf you’re a self-motivated, results-driven professional who enjoys connecting with people and providing excellent service, we encourage you to apply.\n\r\nPlease submit your resume along with a short introduction video (1-2 minutes) highlighting your skills, experience, and why you would be a great fit for this role.",
  "skill_requirements": [
    "Lead Generation",
    "English Speaking",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": []
}