{
  "job_id": "1422701",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Real-Estate-Skip-Tracer-1422701",
  "scraped_at": "2025-07-15T14:24:44.162907",
  "title": "Real Estate Skip Tracer",
  "type_of_work": "Full Time",
  "salary": "$1000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "???? Real Estate Research Assistant (Probate, Divorce, Skip Tracing Specialist)\r\nAre you a skilled online researcher with a knack for finding off-market real estate leads? We're looking for a Real Estate Research Assistant who can dig deep into public records, court filings, and databases to uncover properties with motivated sellers due to probate, divorce, or financial distress.\n\r\nThis is a key role that will directly feed high-quality leads to our acquisitions team.\n\r\n???? What You’ll Do:\r\nResearch public probate records to identify recently deceased property owners\n\r\nSearch divorce filings and public records to find homes tied to divorce cases\n\r\nUse skip tracing tools and public data to track down owner contact info\n\r\nIdentify distressed property owners (tax delinquent, pre-foreclosure, code violations)\n\r\nOrganize and input data into spreadsheets or our CRM\n\r\nDeliver consistent, accurate lead lists with full property and owner details\n\r\nCommunicate closely with our lead manager to align on criteria\n\r\n???? Ideal Candidate Has:\r\nExperience with probate, divorce, or real estate lead research\n\r\nKnowledge of public records, county websites, court filings, etc.\n\r\nStrong skip tracing skills using tools like BeenVerified, LexisNexis, TLO, or similar\n\r\nHigh attention to detail — data accuracy is critical\n\r\nOrganized, focused, and self-directed\n\r\nExperience in U.S. real estate markets a major plus\n\r\n????? Tools You Should Be Comfortable With:\r\nOnline public record systems (county assessor, probate courts, etc.)\n\r\nSkip tracing platforms\n\r\nGoogle Sheets / Excel\n\r\nGmail, Google Docs, Google Calendar\n\r\nCommunication tools: Skype, Telegram, WhatsApp, etc.\n\r\nSend us the following:\n\r\nYour resume\n\r\nA short message explaining your experience with real estate research or skip tracing\n\r\nAny sample work or tools you've used (if available)\n\r\nWhat is the answer to 10+10? Put the answer in the subject when applying. Thank you",
  "skill_requirements": [
    "Real Estate",
    "Lead Generation",
    "Skip Tracing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T03:35:30.866959",
      "reason": "Job first discovered"
    }
  ]
}