{
  "job_id": "1422249",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Marketing-Executive-Assistant-1422249",
  "scraped_at": "2025-07-15T12:36:18.080893",
  "title": "Marketing Executive Assistant",
  "type_of_work": "Any",
  "salary": "1,300.00",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Please Note: This position requires a minimum of 5 years of experience supporting C-suite executives, preferably with a focus on Marketing Executive Assistant responsibilities. \n\r\nJob Summary:\r\nWe are seeking a highly organized, marketing-savvy to support our fast-paced marketing team. This role works closely with the Director of Affiliate Partnerships and senior marketing leadership to drive execution across campaigns, affiliate partnerships, performance reporting, and cross-functional collaboration. The ideal candidate is equal parts proactive project manager, detailed communicator, and data-literate marketer. You’ll be the go-to person to keep campaigns on track, help onboard partners, prepare high-quality marketing deliverables, and ensure the marketing department runs like a well-oiled machine.\n\r\nKey Responsibilities: \r\n• Campaign & Project Management: Organize timelines and assets for paid ad campaigns, affiliate initiatives, and influencer partnerships.\r\n• Cross-Team Coordination: Liaise with internal teams including content, development, media buyers, and design to meet deadlines and launch schedules.\r\n• Affiliate & Influencer Support: Assist in outreach, onboarding, and ongoing communication with affiliate and influencer partners. Support meetings, prep materials, and follow up on tasks.\r\n• Executive Support: Provide day-to-day assistance to the Director of Affiliate Partnerships and senior marketing team—including preparing briefs, proposals, reports, and email communications.\r\n• Tool & Platform Management: Help maintain marketing tech stack tools, including CRM platforms, tracking dashboards, and project management software.\r\n• Quality Control: Proofread and format marketing materials, catching copy or formatting issues before delivery.\r\n• Performance Tracking: Monitor key marketing KPIs like CPL, ROAS, and conversion rates using tools like Google Ads, Meta Ads, Salesforce, and Wicked Reports.\r\n• Problem-Solving: Proactively identify roadblocks and help resolve issues to keep projects moving efficiently and on deadline.",
  "skill_requirements": [
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:24:43.319372",
      "reason": "Job first discovered"
    }
  ]
}