{
  "job_id": "1423096",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Operations-Assistant-1423096",
  "scraped_at": "2025-07-15T14:32:17.792607",
  "title": "Operations Assistant",
  "type_of_work": "Any",
  "salary": "$1050",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "You are ambitious and like being part of a kind and brilliant team. You like having a job where every day brings something new and something to learn. \n\r\nWelcome to UpToSpeed.\n\r\nAs the second member of our Operations team, you’ll be taking on a vast array of operational challenges as part of a fast-growing global startup. One day you’ll be setting up new websites and learning to monitor SEO; the next day you might be researching eligibility for research grants in the European Union. You’ll also take on secondary virtual assistant work for a member of our engineering team, solving problems ranging from hunting down a nonpaying tenant to planning a birthday surprise for the spouse.\n\r\nUpToSpeed is a fast-growing venture-backed global AI company. Our product is used by software engineering and cybersecurity experts to understand complex systems 4x faster than any human could before. We’re not looking for someone who wants to stay in place for the next 40 years. We’re looking for someone like the first member of the operations team — who became a top performer, and now holds equity in this fast-growing $25M company with business travel to Thailand and Argentina.  We’re looking for full teaUpgrade to see actual infombers who want to be part of something that changes the world, and to grow into greatness. Perhaps that’s you.\n\r\nNote: As our existing teaUpgrade to see actual infomber works Tuesday-Saturday, we’re looking for someone willing to work Sunday-Thursday.\n\r\n(If you've read this in full, mention your favorite animal in the subject line.)",
  "skill_requirements": [
    "Operation Management",
    "Executive Assistance"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:28:45.508154",
      "reason": "Job first discovered"
    }
  ]
}