{
  "job_id": "1423166",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Video-Editor-Luxury-Outdoor-Living-Brand-Reels-Ads-Website-Content-1423166",
  "scraped_at": "2025-07-15T15:46:51.637034",
  "title": "Full-Time Video Editor – Luxury Outdoor Living Brand (Reels, Ads, Website Content)",
  "type_of_work": "Full Time",
  "salary": "500-1000USD",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Company: Pergolas Signature\r\nLocation: Remote\r\nWork Hours: Flexible, with at least some overlap with EST (Canada)\r\nSalary: USD $500–$1,000/month (based on experience)\r\nStart: ASAP\n\r\n???? About Us\r\nPergolas Signature is a high-end outdoor living company based in Québec, Canada. We specialize in custom aluminum pergolas, outdoor kitchens, and luxury backyard transformations. We're growing fast and looking for a creative and reliable full-time video editor to join our content team.\n\r\n???? What You'll Do\r\nEdit raw footage from our job sites (drone, phone, camera)\n\r\nCreate short-form reels (IG, TikTok, YouTube Shorts) that are trendy yet polished\n\r\nProduce high-end video ads for Meta, Google, YouTube\n\r\nBuild visual narratives for our website and brand videos\n\r\nAdd captions, transitions, light motion graphics, and branding\n\r\nColor grading to match luxury tone\n\r\nExport and organize deliverables cleanly for use by our marketing team\n\r\n? What We’re Looking For\r\n2+ years of video editing experience\n\r\nExpert in Adobe Premiere Pro (or Final Cut)\n\r\nKnowledge of After Effects or motion graphics is a big plus\n\r\nEye for cinematic visuals, strong storytelling\n\r\nAbility to cut to music, understand pacing for reels and ads\n\r\nComfortable with Google Drive, ClickUp\n\r\nStrong English communication (French is a bonus but not required)\n\r\nBonus if you’ve worked with construction, real estate, or design brands\n\r\n???? What We Offer\r\nStable full-time remote role\n\r\nLong-term opportunity with a growing Canadian brand\n\r\nSupportive team with clear brand guidelines and video direction\n\r\nPaid time off, holidays, and bonuses for great work",
  "skill_requirements": [
    "Facebook Ads",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:41:12.400689",
      "reason": "Job first discovered"
    }
  ]
}