{
  "job_id": "1423089",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Graphic-Designer-Image-Ads-Email-Design-Ecommerce-1423089",
  "scraped_at": "2025-07-15T15:30:04.949365",
  "title": "Graphic Designer – Image Ads & Email Design (Ecommerce)",
  "type_of_work": "Part Time",
  "salary": "$800-$1500",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "ABOUT US\r\nWe’re a fast-growing direct-to-consumer eCommerce brand focused on beauty and wellness products, primarily targeting women 40 and up. We run performance-driven marketing across Facebook, Instagram, and email, and we're looking for a skilled graphic designer who can create high-converting image ads and engaging email designs. Our team values speed, creativity, and results.\n\r\nABOUT THE ROLE\r\nThis is a part-time, performance-focused design role where you’ll be creating high-converting image ads and mobile-optimized email graphics for our eCommerce brand. We’re looking for someone with strong visual instincts, the ability to produce creative variations quickly, and a passion for performance marketing. This role has long-term potential and can evolve into a full-time leadership role in the near future.\n\r\nKEY RESPONSIBILITIES\r\nDesign static image ads for Facebook and Instagram, following briefs or creative concepts.\n\r\nDesign visually appealing, mobile-optimized email graphics and layouts for campaigns (primarily in Klaviyo).\n\r\nProduce 3 design variations per concept to test different creative angles.\n\r\nUse your creativity to come up with new designs that have the potential to convert on paid traffic. You can come up with your own ideas or use internal resources (trend databases, ad swipes, paid training) to improve your output and stay inspired.\n\r\nYou'll receive access to paid swipe libraries, ad inspiration platforms, and creative training resources.\n\r\nWork independently and turn around assets quickly, without compromising quality.\n\r\nCollaborate with our creative strategist to iterate and optimize designs for better performance.\n\r\nShow that you're willing to learn more about how to improve your work. The goal is to make this a long-term collaboration.\n\r\nREQUIREMENTS\r\nProven experience creating image ads for eCommerce (DTC brands preferred).\n\r\nExperience with email design and a strong understanding of layout for mobile-first templates.\n\r\nUnderstanding of performance marketing principles — you know how to design for conversion, not just aesthetics.\n\r\nAbility to follow briefs and also contribute your own creative ideas and visual research.\n\r\nStrong communication skills & willingness to improve.\n\r\nBonus: Familiarity with AI tools that can speed up or enhance the creative process.\n\r\nTOOLS TO USE\r\nYou can use any tool you feel comfortable with, preferably Figma or Canva.\n\r\nTIME COMMITMENT\r\nAround 40 to 80 hours per month, depending on output speed and availability.\n\r\nOur goal is to find someone we can work with long-term, train, and grow with.\n\r\nWe're already working with multiple graphic designers weekly, so in just a few months after hiring, there will be promotion opportunities to Director of Graphic Designers.\n\r\nCOMPENSATION & NEXT STEPS\r\nCompensation: Hourly, $15–$30 based on experience, with performance bonuses.\n\r\nNext Steps: There are 3 stages in the hiring process\n\r\nSelected candidates will receive a short and simple trial task to showcase their skills.\n\r\nCandidates who pass the trial will be invited for a short interview with the Founder of the brand.\n\r\nSuccessful candidates will receive an offer to work with us.\n\r\nThe first month will be a paid trial. If things go well, you'll automatically receive a long-term collaboration agreement at the end of the month — including a salary raise.\n\r\nWHERE TO APPLY\r\nPlease apply using the following form:\r\n ???? Upgrade to see actual info\r\nApplications not submitted via this form will not be considered.",
  "skill_requirements": [
    "Facebook Ads",
    "Graphic Design",
    "Ecommerce"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:33:34.282261",
      "reason": "Job first discovered"
    }
  ]
}