{
  "job_id": "1423056",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Maintenance-Cleaner-Claims-Coordinator-Airbnb-STR-Property-Management-6hr-1423056",
  "scraped_at": "2025-07-15T14:30:44.814307",
  "title": "Maintenance + Cleaner + Claims Coordinator | Airbnb - STR Property Management | $6/hr",
  "type_of_work": "Full Time",
  "salary": "$6/hr + bonus depending on performance",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a fast-growing U.S.-based short-term rental (Airbnb) property management company operating in over 10 states. Our team is remote-first and performance-driven. We specialize in turning underperforming vacation rentals into high-earning listings through smart pricing, guest support, and streamlined operations.\n\r\nWe’re looking for a Maintenance, Cleaner and Claims Coordinator to join our team. You’ll be responsible for everything cleaner and maintenance related tasks, solving property issues quickly, filing damage or violation claims, and making sure each home is ready for the next guest.\n\n\r\nKey Responsibilities\r\n• Coordinate cleaning schedules and confirm turnovers are done on time\r\n• Dispatch maintenance requests and follow through until completed\r\n• Negotiate contractor prices and research fair market rates\r\n• Make sure all work is documented before and after with photos and video\r\n• Track property status updates and communicate with the team in real time\r\n• Only approve payments after confirming job completion with complete documentation\r\n• Keep inventory and supplies organized and stocked per property\r\n• Maintain checklists and suggest workflow improvements\r\n• File and follow up on guest damage or violation claims\r\n• Communicate with guests or owners when needed to resolve issues\r\n• Flag risky guests or patterns that lead to negative reviews or damages\r\n• Handle sensitive cases with care and attention to detail\n\n\r\nRequirements\r\n• Excellent English (spoken and written)\r\n• Strong coordination, follow-up, and time management\r\n• Fast and reliable internet\r\n• Must be comfortable working EST hours\r\n• Confident using tools like Airbnb, Hostaway, Slack, OpenPhone, and Google Workspace\r\n• Self-motivated, organized, and detail-oriented\r\n• Experience managing remote teams or contractors is required\r\n• Background in Airbnb, STR, or hospitality is a plus\r\n• Comfortable handling high-pressure or sensitive tasks\n\n\r\nSalary and Growth\r\n• $6/hour starting rate\r\n• Bonuses for great performance and added value\r\n• Long-term position with opportunity to move into team lead roles\n\n\r\nBonus Tasks for Potential Bonuses/Raises\r\n• Build or improve SOPs, checklists, and documentation\r\n• Improve the process for claims and dispute resolution\r\n• Suggest ways to reduce costs for cleaning or maintenance\r\n• Track expenses with full invoice documentation for the finance team\r\n• Research and provide reports to improve and support your work\n\n\r\nHow to Apply\r\n1. Send a 2-minute voice recording sharing:\r\n• Your experience managing cleaners or contractors\r\n• A time you handled an urgent property repair\r\n• Use Vocaroo or Google Drive (set to public)\n\r\n2. Describe how you would handle same-day turnovers for 5 properties:\r\n• Use bullet points to show your workflow\r\n• Include tools you would use\r\n• Explain how you’d handle delays or no-shows\r\n• List problems you expect and how you’d avoid them\n\r\n3. Attach your resume with your current work status and past experience\n\n\r\nWhy Join Us\r\n• Long-term remote job with stable bi-weekly pay\r\n• Bonus pay for high-quality work\r\n• Team that values results, initiative, and consistency\r\n• Fast-growing company in the Airbnb space\n\n\r\nWe’re actively interviewing. Apply now!",
  "skill_requirements": [
    "Property Management",
    "Short Term Rentals",
    "Airbnb"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:08:00.728789",
      "reason": "Job first discovered"
    }
  ]
}