{
  "job_id": "1423137",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-Real-Estate-Virtual-Assistant-Lead-Generation-Marketing-CRM-and-Social-Media-1423137",
  "scraped_at": "2025-07-15T14:33:11.743560",
  "title": "Full-Time Real Estate Virtual Assistant (Lead Generation, Marketing, CRM, and Social Media)",
  "type_of_work": "Full Time",
  "salary": "$800-$900/month USD (depending on experience)",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Location: Remote (Philippines)\r\nHours: Full-Time (40 Hours/Week) | Must be available during some CST working hours\r\nSalary: Competitive, Based on Experience | 13th Month Pay\n\r\nAbout Us:\r\nWe are a husband-and-wife real estate business in Austin, Texas specializing in relocation buyers and new construction homes. We generate leads primarily through YouTube, social media, and targeted marketing campaigns. We are looking for a high-level, detail-oriented VA to help us scale with lead generation, marketing, CRM management, and content repurposing.\n\r\nWho We’re Looking For:\r\nProactive, resourceful, solutions-focused\r\nExcellent English communication skills (written and verbal)\r\nStrong attention to detail, accuracy, and brand consistency\r\nComfortable receiving feedback and improving from it\r\nFamiliar with real estate lead generation and marketing (preferred)\r\nExperienced with modern marketing tools (YouTube, Instagram, Facebook, LinkedIn, CRMs, automations)\r\nExperienced in GoHighLevel, Lofty CRM, Canva, ChatGPT, Google Workspace, Manus, CapCut or Filmora, Descript, Captions.ai, and Trello\r\nStrong experience building GoHighLevel workflows, automations, pipelines, triggers, and nurture sequences\r\nAble to troubleshoot and optimize automation performance independently\n\r\nYour Responsibilities:\r\n? Lead generation (outbound, inbound, follow-up)\r\n? CRM management (GoHighLevel, Lofty) — pipelines, workflows, automations, email/text campaigns\r\n? Build and maintain robust GoHighLevel automations and workflows to support lead nurture, follow-up sequences, pipeline management, and marketing campaigns\r\n? Social media content calendar creation and scheduling\r\n? Scriptwriting for Instagram Reels, YouTube, and email\r\n? Content repurposing (social posts from long-form content)\r\n? Responding to emails, DMs, texts from leads\r\n? Canva graphics for social media\r\n? General admin support and task tracking\n\r\nTools We Use:\r\nGoHighLevel | Lofty CRM | Canva | ChatGPT | Trello | Google Workspace | Meta Business Suite | Manus | CapCut or Filmora |  Descript | Captions.ai | Loom | Zoom\n\r\n???? Important: How to Apply (Read Carefully or You Will Not Be Considered)\r\nWe only interview applicants who successfully complete the submission test outlined below. This test is designed to evaluate your attention to detail, organization, and ability to follow instructions which are essential for this role.\n\r\nIf you skip this step or submit incorrectly, your application will not be reviewed.\n\r\nStep 1: Submit the Following via OnlineJobs.ph:\r\n1?? Your updated resume\r\n2?? A 1-2 minute video introducing yourself and explaining why you’re the perfect fit for this role\r\n3?? Examples of past marketing, lead generation, or social media work (screenshots, links, or PDFs)\n\r\nUse the subject line: DETAILS - I’m Your Next Real Estate VA\n\r\nStep 2: Complete This Simple Test Task (Required to Proceed):\n\r\nWe will provide:\r\nA link to one of our existing YouTube videos\r\nA sample of our branding tone/voice\n\r\nYour Task:\r\n? Write 3 alternative YouTube titles (curiosity-based, SEO, short/punchy)\r\n? Write 1 Instagram Reel caption (under 100 words, with 3 hashtags)\r\n? Write 1 short talking head script for a Reel (under 50 words)\r\n? Create 1 Canva Instagram post (carousel)\r\n? Write 1 short nurture email for someone who downloaded our Austin Relocation Guide\n\r\n???? Google Drive Submission Instructions for Your VA Test\n\r\n? Step 1: Create a Google Drive Folder\r\nCreate a new Google Drive folder.\n\r\nName the folder exactly like this:\r\n[Your Full Name] – Wilson VA Test\r\n(Example: Maria Santos – Wilson VA Test)\n\r\n? Step 2: Organize Your Folder Like This:\r\nInside your main folder, create these subfolders and place your work inside them:\n\r\n???? [Your Full Name] – Wilson VA Test  \r\n     ??? ???? 1. YouTube Titles  \r\n     ??? ???? 2. Instagram Caption  \r\n     ??? ???? 3. Reel Script  \r\n     ??? ???? 4. Canva Graphic  \r\n     ??? ???? 5. Nurture Email \n\r\nUpload your completed tasks into each labeled folder. Use Google Docs for writing tasks and PNG or JPG for the Canva graphic.\n\r\n? Step 3: Share Your Folder Correctly\r\nRight-click on your main folder.\r\nSelect “Share.”\r\nUnder “General Access,” change it to “Anyone with the link can view.”\r\nCopy the sharing link.\n\r\n? Step 4: Email Your Submission\n\r\nSend one email to: Upgrade to see actual info \r\nSubject Line: [Your Full Name] – Wilson VA Test Submission \nEmail Body:\n\r\nHello,  \n\r\nHere is my completed VA test for your review.  \n\r\nGoogle Drive Folder Link: [Insert Link]  \n\r\nHow long this test took me: [Insert Time]  \r\nDid I use AI tools? Yes/No (If yes, specify which tasks.)  \r\nAny feedback or questions I had: [Insert Here]  \n\r\nThank you for your time and consideration.  \n\r\nBest,  \r\n[Your Full Name]  \n\r\nWhat Happens Next:\r\n? If you complete the task correctly, we will review your work.\r\n? If your work meets our expectations, we will invite you to a video interview via Zoom.\r\n? If you skip this step, we will not respond.\n\r\nWhy Work with Us?\r\n? 13th Month Pay\r\n? Performance-Based Bonuses Possible After 90 Days (Lead Generation & Appointments Set)\r\n? Direct communication — no intermediaries\r\n? Stable, long-term position with opportunity for growth\r\n? Supportive, professional environment with clear expectations\r\n? Work with a U.S.-based real estate business focused on relocation buyers\r\n? Consistent systems, workflows, and feedback to help you succeed\r\n?Experience with GoHighLevel automations is a key requirement for this role. Applicants who can demonstrate strong GHL skills will be prioritized for higher pay within the advertised range.",
  "skill_requirements": [
    "Social Media Content Creation",
    "Gohighlevel Real Estate",
    "Lead Generation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:28:45.930553",
      "reason": "Job first discovered"
    }
  ]
}