{
  "job_id": "1423191",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Quality-Assurance-Audit-Specialist-Full-Time-Remote-1423191",
  "scraped_at": "2025-07-15T14:42:48.898985",
  "title": "Quality Assurance Audit Specialist – Full-Time (Remote)",
  "type_of_work": "Full Time",
  "salary": "Php 50,000-Php 60,000 per month",
  "hours_per_week": "39",
  "date_updated": "Jul 15, 2025",
  "job_overview": "As a QA Audit Specialist, you’ll be responsible for reviewing and verifying data entries made by agents across Slack and CRM platforms. You’ll play a key role in maintaining data integrity, streamlining processes, and helping team leads focus on performance rather than manual checking.\n\r\nKey Responsibilities:\r\n-Review client details submitted by agents in Slack and cross-reference with multiple CRM platforms\r\n-Ensure adherence to rate cards and operational protocols for various partner companies\r\n-Categorize audit results using a thumbs-up/thumbs-down system and provide constructive feedback\r\n-Track and document audit results for performance improvement and accountability\r\n-Identify recurring error patterns and collaborate with team leads for corrective actions\r\n-Assist in centralizing the QA process to reduce part-time support dependencies\r\n-Stay updated with software/system changes and audit requirement updates\r\n-Support continuous process improvement initiatives\n\r\nRequirements:\r\n-Proven experience in quality assurance, data auditing, or verification roles\r\n-High attention to detail and accuracy when working with large data sets\r\n-Familiarity with CRM tools and audit protocols\r\n-Ability to work independently and manage tasks with minimal supervision\r\n-Strong organizational and analytical thinking skills\r\n-Willing to undergo in-depth training across seven different platforms\r\n-Flexibility to work in a rotating shift within a 14-hour window\n\r\nPreferred Qualifications:\r\n-Experience in customer support or operations in a fast-paced environment\r\n-Familiarity with Slack, Front (ticketing system), and AI-driven automation tools\r\n-Background in process improvement and data-based decision-making\n\r\nApply now if you’re ready to play a critical role in ensuring accuracy and efficiency for growing remote teams!",
  "skill_requirements": [
    "Auditing",
    "Quality Assurance",
    "Customer Relationship Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:42:48.900450",
      "reason": "Job first discovered"
    }
  ]
}