{
  "job_id": "1423140",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Graphic-designer-1423140",
  "scraped_at": "2025-07-15T15:36:30.361615",
  "title": "Graphic designer",
  "type_of_work": "Part Time",
  "salary": "150",
  "hours_per_week": "16",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a passionate graphic designer with a flair for high-speed creativity? Do you love crafting visuals that capture the thrill of the rally an racetrack and inspire action? We're a dynamic motorsport management service specialising in driver and team support – from career boosting and sponsorship strategies to team optimisation and performance enhancement. \n\r\nWe're seeking a talented Filipino designer to help us rev up our Instagram presence with stunning ads that attract ambitious autosporters ready to level up their game! What You'll Do:  Design eye-catching Instagram posts, carousels, Stories, and Reels that showcase our expertise in driver and team management. Think dynamic visuals featuring race cars, pit stops, victory podiums, and motivational elements to highlight benefits like \"Accelerate Your Career with Pro Management!\"  \n\r\nCreate wervende graphics with bold typography, high-energy colours (e.g., reds, blacks, and metallics), and engaging calls-to-action to reach our target audience of racers, teams, and motorsport enthusiasts.  \r\nCollaborate remotely on 2-20 posts per month initially, using tools like Canva, Adobe Photoshop, or Illustrator to ensure professional, mobile-optimised designs (1080x1080 px format).  \n\r\nBrainstorm creative ideas based on briefs, incorporating trends in social media and motorsport aesthetics for maximum engagement and impact.\n\r\nWhat We're Looking For:  \n\r\nProven experience in graphic design for social media, especially Instagram ads or posts – please share your portfolio with relevant examples (motorsport or sports-themed work is a huge plus!).  \n\r\nProficiency in design software (Canva essential; Adobe suite preferred) and an understanding of Instagram best practices (e.g., high-contrast visuals, minimal text overlays).  \n\r\nA creative mindset with attention to detail – you should be able to turn concepts like \"Team Strategy for Winning Races\" into visually compelling stories that motivate sporters to connect with us.  \n\r\nExcellent English communication skills for seamless collaboration (we're based in the Netherlands but work globally).  \r\nReliability, quick turnaround (1-3 days per project), and enthusiasm for autosports or high-performance themes.",
  "skill_requirements": [
    "Adobe",
    "Graphic Design",
    "Canva"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:32:31.272563",
      "reason": "Job first discovered"
    }
  ]
}