{
  "job_id": "1423238",
  "url": "https://www.onlinejobs.ph/jobseekers/job/HR-Generalist-I-1423238",
  "scraped_at": "2025-07-15T15:35:29.849670",
  "title": "HR Generalist I",
  "type_of_work": "Full Time",
  "salary": "$3.55 to $4.45 commensurate based on relevant years of experience",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "PLEASE APPLY THROUGH THIS LINK: Upgrade to see actual info/applyjob-noncaller-1\n\r\nAbout Us:\r\nWith over 100 years of combined industry experience, the Community Minerals team specializes in the purchase of mineral or royalty rights all over the US. We have earned a stellar reputation with hundreds of satisfied customers and an “A” Rating with the Better Business Bureau. With our proven track record, we continue to serve mineral owners in several states with transparency, accountability, and a personalized experience to meet individual needs.\n\r\nThe HR Generalist – HR Operations is responsible for executing and overseeing core HR processes such as onboarding, offboarding, regularization, HMO administration, and HR data management. The role requires a balance of administrative efficiency and process oversight, ensuring compliance with HR policies and supporting workforce lifecycle operations. This position supports cross-functional coordination, accurate documentation, and timely reporting to uphold service quality across the organization.\n\r\nJob Description:\n\r\n*Coordinate onboarding and offboarding processes, ensuring accurate documentation and timely follow-through.\r\n*Monitor regularization schedules, evaluations, and reporting requirements.\r\n*Manage HMO enrollment, orientation, and related benefit coordination.\r\n*Maintain and audit HRIS trackers, 201 folders, and contractor movement logs.\r\n*Submit weekly and monthly reports on HR Operations deliverables and timelines.\r\n*Communicate and follow up with department heads, IT, Payroll, and other stakeholders for HR process alignment.\r\n*Escalate issues and recommend improvements in HR operational workflows.\r\n*Participate in job fairs or HR initiatives and perform other tasks as may be assigned within the scope of HR Operations and/or SPMS.\n\r\nQualifications:\n\r\nEducation:\r\nBachelor’s Degree in Human Resource Management, Psychology, Business Administration, or a related field.\n\r\nExperience:\r\n*At least 2 to 3 years of relevant experience in HR operations or generalist roles.\r\n*Experience handling onboarding/offboarding, employee records, and HRIS tools is essential.\r\n*Exposure to HMO or benefits administration is a strong advantage.\n\r\nTechnical Skills:\r\n*Proficiency in Google Workspace (Docs, Sheets, Drive) for managing trackers and reports.\r\n*Familiarity with HRIS or employee databases and digital file management systems.\r\n*Working knowledge of communication tools such as Slack, email platforms, and Viber for coordination.\r\n*Experience with checklist routing, audit tools, and documentation workflows.\n\r\nSoft Skills:\r\n*Attention to detail - ensures accuracy in data entry, compliance tracking, and documentation.\r\n*Time management – balances multiple deadlines and deliverables without compromising quality.\r\n*Professional communication – coordinates effectively with internal and external stakeholders.\r\n*Initiative – able to spot gaps and inconsistencies in processes and take action or escalate appropriately.\r\n*Resilience and adaptability – remains composed and effective during periods of high volume or pressure.\r\n*Dependability – Meets expectations consistently with minimal supervision.\r\n*Professionalism – Demonstrates maturity, respect, and positive behavior in all interactions.\r\n*Adaptability – Can shift priorities quickly based on business or leadership direction.\r\n*Resourcefulness – Finds efficient and compliant ways to address operational challenges.\r\n*Resilience – Maintains focus, calm, and performance even during periods of high workload or process changes.\n\r\nIndustry Knowledge:\r\n*General understanding of HR practices within remote or distributed organizations.\r\n*Familiarity with workforce lifecycle processes (onboarding to offboarding) in contractor-based or service-oriented industries.\r\n*Basic awareness of health insurance processes and benefits coordination.\n\r\nOther Requirements:\r\n- Willing to work in US Business Hours (CST)\r\n- A Computer with 2 monitors is recommended.\r\n- Must have stable Internet and Power Connection\r\n- Must have an Office 365 Microsoft License.\n\r\nSystem Requirements:\r\nTo ensure optimal performance and functionality while using different web and application tools, please make sure that your systeUpgrade to see actual infoets the following requirements:\n\r\nOperating System:\r\n- Windows: Windows 8.1 (64-bit) or higher\r\n- macOS: macOS 10.13 (High Sierra) or higher\n\r\nProcessor:\r\n- Intel: Skylake-class 6th Gen i3, i5, or i7 processor or higher\r\n- AMD: Excavator-class (2015) processor or higher\n\r\nMemory (RAM):\r\n- A minimum of 8 GB of RAM is required.\n\r\nJob Type: Full-time, remote\n\r\nBenefits:\r\nHealth insurance\r\nLife insurance\r\nSchedule: 8-hour shift",
  "skill_requirements": [
    "HR Management",
    "Customer Service",
    "Google Workspace"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:35:29.851464",
      "reason": "Job first discovered"
    }
  ]
}