{
  "job_id": "1423115",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Video-Editor-Shopify-E-commerce-Brand-1423115",
  "scraped_at": "2025-07-15T14:36:08.713263",
  "title": "Video Editor - Shopify E-commerce Brand",
  "type_of_work": "Full Time",
  "salary": "$1200-$1800/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Looking for a video editor to join our team for our Shopify brand. We're in the health & wellness niche, specifically supplements. Team environment is super chill and if you like making money and want to make a lot of it, this is a good place to be. I need someone with the following requirements:\n\r\n- Previous experience working for Shopify brands SPECIFICALLY E-commerce.\r\n- Able to use tools like Capcut/Premiere Pro, ElevenLabs, everything else I can teach you like AI video generation, caption removal, deepfake softwares, etc.\r\n- Be a cool person\r\n- Be open to learning, I will personally purchase a full course for you to learn from and have our current editor walk you through his process so you can get caught up to speed with our team\n\r\nEveryone on my team loves the environment and we're all actively looking to grow this brand. You will not be working for me, you will be working WITH me. \n\r\nYou will have the opportunity to earn more based on performance, on top of regularly pay. The more money we make on this brand, the more money I can put in your pocket. If you're looking for a young, fast-growing team environment, then this is the perfect fit. If you just care about making a quick buck then this isn't.\n\r\nREAD THIS!!!\r\nIf you're interested in learning more about the opportunity, please submit a 30 second loom video introducing yourself and attach your previous work. I don't need a resume or any proof of education, I just want to see what edits you have done before.\n\r\nIF YOU DO NOT SUBMIT A LOOM OR DRIVE FOLDER WITH PREVIOUS WORK I WILL NOT LOOK AT YOUR APPLICATION.\n\r\nGood luck :)",
  "skill_requirements": [
    "Shopify",
    "Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:29:52.654041",
      "reason": "Job first discovered"
    }
  ]
}