{
  "job_id": "1423126",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-Operations-Support-Specialist-1423126",
  "scraped_at": "2025-07-15T14:37:51.417735",
  "title": "Executive Assistant & Operations Support Specialist",
  "type_of_work": "Full Time",
  "salary": "$5",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "KINDLY READ THE JOB DESCRIPTION BEFORE APPLYING. \n\r\nPosition Overview:\r\n We are seeking a highly organized, detail-oriented, and culturally-aware Executive Assistant & Operations Support Specialist to provide high-level administrative and operational support to a small business founder and her team. This role involves a broad scope of responsibilities, including executive assistance, bookkeeping, human resources administration, customer service coordination, and CRM reporting.\r\nThe ideal candidate will possess strong communication skills in English (spoken and written), a proactive work ethic, cultural empathy, and the ability to manage multiple responsibilities while maintaining discretion and professionalism.\n\r\nKey Responsibilities:\r\nExecutive Assistance\r\n- Attend internal meetings, take detailed notes, and follow up on action items.\r\n- Assist in managing the founder’s schedule and email communications.\r\n- Support with team accountability by tracking deliverables and deadlines.\n\n\r\nCustomer Service & CRM Oversight\r\n- Monitor incoming emails for order accuracy; flag and correct discrepancies.\r\n- Assist with customer payment follow-ups and ensure clarity in communications.\r\n- Generate CRM reports, track sales data, and manage follow-ups with the sales team.\r\n- Provide backup support for answering phones when needed.\n\n\r\nHuman Resources & Administrative Support\r\n- Prepare and maintain new hire paperwork and HR documentation.\r\n- Track PTO, employee reviews, birthdays, and milestone celebrations.\r\n- Ensure timely acknowledgment of employee birthdays and events.\r\n- Assist with onboarding tasks and maintain employee records.\n\n\r\nBookkeeping & Financial Coordination\r\n- Manage journal entries, credit card reconciliation, and checkbook balancing.\r\n- Support weekly creation of the CEO’s dashboard report.\r\n- Assist with payroll submissions and related documentation.\n\n\r\nRequired Qualifications:\r\n- At least 3 years of relevant experience in executive support, bookkeeping, HR, or operations.\r\n- Proficient in QuickBooks, Google Workspace, Microsoft Office, and common CRM platforms.\r\n- Excellent English communication skills—both verbal and written.\r\n- Strong attention to detail, organizational skills, and accountability.\r\n- Comfortable navigating cultural differences with professionalism and empathy.\r\n- Ability to work independently with minimal supervision.\n\r\nPreferred Qualifications:\r\n- Experience working with U.S.-based clients or companies.\r\n- Prior HR or payroll administration experience.\r\n- Familiarity with remote communication tools (Zoom, Slack, etc.).\r\n- Experience managing internal team celebrations and employee engagement initiatives.",
  "skill_requirements": [
    "Payroll",
    "HR Management",
    "Operation Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:44:20.615946",
      "reason": "Job first discovered"
    }
  ]
}