{
  "job_id": "1423146",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Entry-Level-Technical-VA-No-Experience-Needed-1423146",
  "scraped_at": "2025-07-15T15:35:09.918313",
  "title": "Entry Level Technical VA- No Experience Needed",
  "type_of_work": "Full Time",
  "salary": "$520/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "A thriving marketing agency is looking to add one more member to our amazing staff! We are looking for a brilliant, organized individual who has the aptitude to perform logic-based and detail-oriented tasks at a reasonable pace, understands the value of hard work, and wants to grow with the company.\n\r\nWriting ability and knowledge of basic web development and Schema Markup for SEO is a big plus. You do not need any kind of experience - we will train. We look for brains, ambition, and work ethic – not experience. But experience is always great :). Please watch this video before applying (fix the link to watch the video. link: www.loom. com/share/706dc17d459e435b9b5ef748eb3670f8 )\n\r\nBenefits include:\r\n4-day workweek!\r\n15 paid days off\r\n13th month pay\r\nPerformance-based Equipment Bonus\r\n2 raises a year (sometimes more based on performance)\r\nPaid 105 days maternity leave (eligible only if you've been with the company for at least 1 year)\r\nPaid 3 weeks paternity leave (eligible only if you've been with the company for at least 1 year)\r\nA respectful and welcoming work environment\r\nA variety of assignments\n\r\nStarting full-time salary is $130 per week (40 hours/week). Work hours would be 10 hours per day, Monday through Thursday. Shift time may vary depending on job assignment upon hiring with the range being 3 PM to 1 AM or 5 PM to 3 AM PH Time)\n\r\nPlease do not apply for the position if you are not comfortable with this salary, or if you have other commitments, such as being a student or having another job. After 1 month, you'll be eligible for up to 10 hours of paid overtime per week at 1.5x the regular rate, so if you want to earn more, you do not need to go outside of the company.\n\r\nPlease include the word \"unicorn\" in the title of your application. Also, before sending your application, please answer this questionnaire (https ://forms. gle/AU2BM4dWacedPq9v7). Send a screenshot of confirmation that you have finished the questionnaire.\n\r\nPlease be aware that there will be a trial interview following the initial interview process.",
  "skill_requirements": [
    "SEO",
    "Administrative Management",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:30:01.996095",
      "reason": "Job first discovered"
    }
  ]
}