{
  "job_id": "1423088",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AI-Computer-Programer-Full-Time-1423088",
  "scraped_at": "2025-07-15T14:32:01.771152",
  "title": "AI & Computer Programer (Full Time)",
  "type_of_work": "Full Time",
  "salary": "$9/hour",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "AI & Computer Programer (Full Time)\n\r\nPlease read this carefully to the end. If you do not, I will not respond to your application. Attention to detail is key.\n\r\nI’m looking for a proactive, AI-literate operator to help us stay ahead of the curve by leveraging AI tools to create content, automate tasks, and improve business efficiency. This is a full-time role with serious growth potential. You must be someone who constantly experiments with new tools and loves turning innovation into systems.\n\r\nOur agency specializes in marketing and business support for martial arts schools, eCommerce brands, and service providers — and we are increasingly building AI into our workflows. You’ll work closely with me to implement AI across content, automation, lead nurturing, and backend operations.\n\r\nKey Responsibilities\n\r\n• AI-Powered Video Creation\n\r\n• Use tools like Veo 3, Runway, Pika, or Sora to create short-form AI videos for ads, social content, and storytelling\n\r\n• Assist in turning briefs or written concepts into visual content using AI tools\n\r\n• Add text, captions, voiceovers, and music to finalize AI video assets\n\r\n• Manage content delivery across multiple platforms: Instagram, TikTok, YouTube Shorts, etc.\n\r\nBusiness Optimization Through AI\n\r\n• Identify ways to streamline internal operations using AI (e.g., lead routing, onboarding, reporting)\n\r\n• Set up workflows using tools like Zapier, Make (Integromat), or GoHighLevel automations\n\r\n• Help automate tasks like email responses, meeting scheduling, proposal generation, client reporting, etc.\n\r\n• Research and test new AI tools as they’re released — bring us the best of what’s new\n\r\n• Document repeatable processes and systems as we scale\n\r\nAI Content & Communications\n\r\n• Use ChatGPT or other LLMs to help write emails, blog drafts, sales scripts, and FAQs\n\r\n• Generate creative briefs, outlines, or newsletters using AI\n\r\n• Help brainstorm and test new content strategies across channels\n\r\nMust-Have Experience With Some of These Tools:\n\r\n• AI Content & Automation Tools:\n\r\n• Veo 3, Runway, Pika, Kaiber, Sora\n\r\n• ChatGPT, Claude, Jasper, Copy.ai\n\r\n• Zapier, Make (Integromat), GoHighLevel workflows\n\r\n• Google Sheets + AI formulas/macros\n\r\n• Notion AI, Airtable AI (bonus)\n\r\nMarketing + Design Stack:\n\r\n• Canva, CapCut, Adobe Premiere Pro (bonus)\n\r\n• Meta Ads, TikTok Ads, YouTube Studio\n\r\n• Slack, ClickUp, Gmail\n\r\n• Shopify or Amazon (bonus if you understand eCommerce workflows)\n\r\nWhat We’re Looking For:\n\r\n• A genuine passion for AI and emerging tech — you keep up with releases\n\r\n• Someone who thinks in systems and is always looking for what can be automated\n\r\n• Excellent communication skills — you can simplify complexity and write clearly\n\r\n• Strong attention to detail and the ability to turn ideas into structured workflows\n\r\n• Self-sufficient and proactive: you don’t wait to be told what to fix — you spot it and do it\n\r\nThis role is full-time. If you’re good, you’ll grow with us. You’ll be helping lead the AI side of the company — not just following checklists.\n\r\nTo ensure you’ve read this entire listing, please reply with the word “triangle” and share a list of the AI tools you are most comfortable with. If you’re really about this life, also tell me one brand or business you think is doing something innovative with AI right now.",
  "skill_requirements": [
    "Web Programming",
    "ChatGPT",
    "AI Tools"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:31:58.089657",
      "reason": "Job first discovered"
    }
  ]
}