{
  "job_id": "1423079",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Course-Creator-with-LMS-Video-Editing-and-AI-Experience-1423079",
  "scraped_at": "2025-07-15T12:30:22.919815",
  "title": "Course Creator with LMS, Video Editing, and AI Experience",
  "type_of_work": "Any",
  "salary": "N/A",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "???? Job Opportunity: CE Course Creator with LMS, Video Editing, and AI Experience\r\nAre you a creative instructional designer, video content editor, and AI-savvy course builder looking to take part in shaping powerful CE (Continuing Education) classes?\n\r\nWe are seeking an experienced content creator to help develop high-quality CE courses using a modern Learning Management System (LMS). You will be responsible for editing instructional videos, structuring interactive lessons, and utilizing AI tools (especially ChatGPT) to enhance content quality and delivery.\n\r\n?? Important: You must submit your application as a short video answering the key questions below. Text-only responses will be disregarded.\n\r\n? Key Responsibilities\r\nDesign and structure CE courses on an LMS (e.g., Teachable, LearnWorlds, Kajabi, Moodle, or similar)\n\r\nEdit video content for clarity, engagement, and flow (adding captions, transitions, music, etc.)\n\r\nUse AI tools like ChatGPT, Descript, Pictory, Synthesia, or similar for:\n\r\nScriptwriting\n\r\nLesson plan generation\n\r\nAI-generated video assistance\n\r\nCoordinate with subject-matter experts to transform raw ideas into polished educational content\n\r\nEnsure all course components align with CE accreditation standards and offer learner engagement\n\r\n???? Must-Have Experience\r\nProven experience building online courses with LMS platforms\n\r\nVideo editing experience (Final Cut Pro, Adobe Premiere, CapCut, or AI-powered tools)\n\r\nDemonstrable use of ChatGPT or similar AI tools for content planning or media creation\n\r\nAbility to work independently and hit deadlines\n\r\nStrong visual and instructional design sense\n\r\n???? How to Apply (VIDEO REQUIRED)\r\nPlease record and send a 2–3 minute video answering the following:\n\r\nWhat LMS platforms have you used, and what specific course features did you build?\n\r\nWhat video editing tools do you use, and what’s one editing trick you always apply to educational content?\n\r\nHow have you used AI or ChatGPT in course or video creation? Be specific.\n\r\nWhat’s your approach to structuring a CE course from scratch?\n\r\nWhy are you the perfect fit for this role?\n\r\n???? Your video is your first test — quality, clarity, and presentation matter. Think of it as your first lesson!",
  "skill_requirements": [
    "Content Creation",
    "Video Content Creation",
    "Tutorial Teaching"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:06:14.925644",
      "reason": "Job first discovered"
    }
  ]
}