{
  "job_id": "1423178",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Support-Specialist-1423178",
  "scraped_at": "2025-07-15T15:28:17.451522",
  "title": "Customer Support Specialist",
  "type_of_work": "Full Time",
  "salary": "800-1200",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "As a Customer Support Specialist, you will be the voice of our brand, responsible for providing top-notch support to our customers. You will handle inquiries, resolve issues, and ensure that every customer interaction is positive and efficient. The ideal candidate should have experience in e-commerce customer service and be able to navigate fast-paced environments while maintaining a calm and professional demeanor.\n\r\nWe are looking for someone who has worked with e-commerce brands or online stores and understands the importance of delivering exceptional customer support that drives loyalty and satisfaction.\n\r\nKey Responsibilities:\n\r\nRespond to customer inquiries via email, live chat, and social media, providing clear, helpful, and timely support.\n\r\nResolve customer issues related to orders, shipping, returns, and product information, ensuring a high level of customer satisfaction.\n\r\nManage and follow up on customer feedback and complaints, ensuring that all issues are resolved promptly and effectively.\n\r\nWork with the team to identify recurring issues or concerns, suggesting improvements to processes or policies as needed.\n\r\nKeep accurate records of customer interactions and transactions, tracking issues and resolutions in the customer support system.\n\r\nCollaborate with other teams (e.g., fulfillment, marketing) to address customer concerns and ensure smooth order fulfillment.\n\r\nAssist with product inquiries and recommendations, enhancing the customer’s shopping experience.\n\r\nRequirements:\n\r\nProven experience as a Customer Support Specialist in e-commerce or with e-commerce brands.\n\r\nStrong written and verbal communication skills, with a focus on clear and empathetic responses.\n\r\nAbility to multitask, prioritize, and manage time effectively in a fast-paced environment.\n\r\nExperience with customer support tools (e.g., Zendesk, Freshdesk, Shopify) and CRM software.\n\r\nKnowledge of e-commerce platforms and order fulfillment processes.\n\r\nStrong problem-solving skills with a customer-first mindset.\n\r\nAbility to work independently, stay organized, and meet deadlines.\n\r\nPrevious experience handling customer support in a remote setting is a plus.\n\r\nHow to Apply:\r\nTo apply for this position, please include a list of the brands / stores where your previous experience in e-commerce customer support comes from. \n\r\nSpecifically, share examples of your role in solving customer issues, how you communicated with clients, and how you ensured their satisfaction for the brands / stores.",
  "skill_requirements": [
    "Customer Support",
    "Email Support",
    "Customer Relationship Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:33:02.679981",
      "reason": "Job first discovered"
    }
  ]
}