{
  "job_id": "1423018",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Assistant-for-Online-Info-Coaching-Business-1423018",
  "scraped_at": "2025-07-15T12:24:11.554412",
  "title": "Executive Assistant for Online Info Coaching Business",
  "type_of_work": "Full Time",
  "salary": "$1,000-$1,500",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a fast-growth coaching company helping men launch and scale home service businesses. Our START and SCALE programs help beginners and underperforming entrepreneurs hit $10K/month in 90 days. We operate with speed, systems, and high standards. The mission: help blue-collar men unlock freedom through discipline, skill, and entrepreneurship.\n\r\nRole Overview\r\nWe’re hiring a high-performance Executive Assistant to support our CEO and COO. This is not just a calendar manager role. You’ll be embedded in operations, helping drive projects, solve problems, and keep the company moving fast.\n\r\nKey Responsibilities\n\r\n- Manage executive inbox and calendar with extreme attention to detail\n\r\n- Coordinate meetings, travel, and logistics with no dropped balls\n\r\n- Track projects across sales, operations, and delivery\n\r\n- Support recruiting: post job ads, screen candidates, coordinate interviews\n\r\n- Maintain and help improve SOPs and internal systems (Notion, Slack, N8N, drive)\n\r\n- Communicate with teaUpgrade to see actual infombers to ensure accountability and follow-through\n\r\n- Execute ad hoc research, tasks, and logistics as needed\n\r\nPLEASE NOTE: \n\r\nWe will only be screening applicants using a MINIMUM of 10 apply points to apply to this role. \r\nIf you use under 10 apply points you will NOT be considered",
  "skill_requirements": [
    "Google Suite",
    "GoHighLevel",
    "Notion"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:30:41.723619",
      "reason": "Job first discovered"
    }
  ]
}