{
  "job_id": "1423086",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Productcompetitor-researcher-dropship-1423086",
  "scraped_at": "2025-07-15T15:37:07.824204",
  "title": "Product/competitor researcher dropship",
  "type_of_work": "Full Time",
  "salary": "700",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a fast-growing e-commerce company specializing in fashion dropshipping, and we're currently looking for a Product & Competitor Researcher to join our team for the long term. Make sure to include the word strawberry in your response so we know you’ve read the full job post. Please respond to this job posting only if you meet the requirements below and have experience with evidence-based product/competitor research.\n\r\nPlease understand that this job offers enormous growth opportunities. We will work with fast fee + bonusses. We are really looking for an A player who can grow with us and take on more responsibility over time. This will of course be rewarded. But on the contrary, we will immediately eliminate half-hearted efforts. So please only respond if you are thinking long term.\n\r\nResponsibilities:\r\n• Researching fashion dropshipping competitors across multiple platforms\r\n• Keeping our competitor sheet regularly updated with accurate insights\r\n• Identifying hot-selling fashion products in different markets\r\n• Monitoring scaled products and trends from competitors\r\n• Exploring and reporting on new markets that show signs of Upgrade to see actual infontum\n\r\nWho We're Looking For:\r\nWe want someone who:\r\n• Has a strong sense of responsibility and attention to detail\r\n• Is highly proactive and can work independently\r\n• Is looking for a long-term position in a growing company\r\n• Has strong communication skills in English\r\n• Feels confident working with Excel or Google Sheets\n\r\nPlease answer the following questions in your application:\r\n1. Have you previously worked as a product researcher for a dropshipping company?\r\n2. What is your experience in this field?\r\n3. Which tools have you used for product and competitor research?\r\n4. When was your last role at an e-commerce business?\r\n5. Are you available full time?\r\n6. Why should we hire you?\r\n7. How do you see your future with us?\n\r\nWho knows, we may see each other soon, with kind regards,\r\nArif",
  "skill_requirements": [
    "Product Research",
    "Attention to Detail",
    "Market Research"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:25:27.210741",
      "reason": "Job first discovered"
    }
  ]
}