{
  "job_id": "1423173",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Tour-Activity-and-Content-Writer-1423173",
  "scraped_at": "2025-07-15T14:35:48.701448",
  "title": "Tour Activity and Content Writer",
  "type_of_work": "Full Time",
  "salary": "$4/hr",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Let’s Roam: Tour Activity Creative Writer And Editor\n\r\nYou are creative, funny, and clever. You are an extremely strong writer. Your friends live vicariously through your travel photos and stories. You love to discover new places, explore and connect with friends. You know how to be silly and have a good time. You love writing about and sharing incredible experiences. You are able to take feedback well and be focused and fast in your writing.\n\r\nWe will narrow it down to one or two candidates and then ask for a writing project to select whom we work with. We need someone who is capable of sticking to deadlines and can create compelling, interesting, and funny content with minimal editing/proofreading needed.\n\r\nWe are seeking someone to start immediately. You’ll work directly with our team, who will help you get set up quickly and easily.\n\r\nWe look forward to hearing from you!\n\r\nYou are an enthusiastic teaUpgrade to see actual infomber who embraces the Let’s Roam ethic of positive collaboration and shared purpose. You’re an ideas person–enthusiastically sharing yours and supporting others when their own lightbulbs snap on. You like to ask yourself, “Is there a way to make this experience more fun, more inspiring, or more communal? Am I growing in this role, and am I helping others to do the same?” You anticipate setbacks but aren’t put off by them. Problems are opportunities to work together, to learn from one’s mistakes, and eventually, to experience the rewards of overcoming those trials. You believe that all work has value, and you’re excited about your place on this team. You enjoy showing people how Let’s Roam can enhance their lives.\n\r\nPublic Job Description: Upgrade to see actual info/document/d/1sKTRkXF3NtBGuaSRdE08SSCCxNBMmkUYSFpy9o5enxA/edit?tab=t.0\n\r\nAll applicants are required to complete the application form including the series of questionnaires and a video recording interview here:\nUpgrade to see actual info\n\r\nShould any error or issue persist, please contact me via email at Upgrade to see actual info\n\r\n*Only applicants who completed the application form in the above link will be screened accordingly.",
  "skill_requirements": [
    "Content Creation",
    "Microblog Content Writing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:35:48.702970",
      "reason": "Job first discovered"
    }
  ]
}