{
  "job_id": "1423158",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-Commercial-Construction-Estimator-Light-Commercial-1423158",
  "scraped_at": "2025-07-15T14:25:10.958224",
  "title": "Senior Commercial Construction Estimator - Light Commercial",
  "type_of_work": "Full Time",
  "salary": "$1500 to $2500 /Month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking an experienced Project Estimator who can hit the ground running and play a vital role in driving our company's growth. The ideal candidate will have a strong construction background and possess the skills to accurately estimate project costs, including labor, materials, and related expenses\n\r\nKey Responsibilities:\n\r\nConduct comprehensive evaluations of project requirements, specifications, and drawings to determine the scope of work and estimate project costs.\r\nUtilize construction background and industry knowledge to accurately estimate labor, material, equipment, and subcontractor costs.\r\nCollaborate with project managers, architects, engineers, and stakeholders to gather relevant information and clarify project requirements.\r\nIdentify potential risks and challenges in project execution and incorporate them into the estimation process.\r\nAnalyze historical data and benchmarks to improve estimating accuracy and processes.\r\nPrepare and present detailed cost estimates, proposals, and bid documents, utilizing on-screen take-off software.\r\nPrepare detailed critical path job schedules.\n\r\nRequirements\n\r\n5+ years of construction estimating experience.\r\nProficiency with commercial estimating software.\n\r\nExtensive knowledge of industry practices, procedures, and market trends.\r\nDedication, organizational skills, and the ability to plan, prioritize, and manage multiple tasks.\r\nAttention to detail and focus on quality and accuracy.\n\r\nTypes of Projects:\n\r\nAs Prime Contractor:\r\nTenant Build outs Less than 15,000 SF\r\nExterior Renovations\r\nRetrofits\r\nLight commercial Ground up\n\r\nAs a sub-contractor:\r\nPainting\r\nFlooring\r\nTile\r\nDrywall\r\nFraming - light metal and lumber\r\nAcoustical Ceilings\r\nMill work\r\nCabinetry\r\nDoors\r\nLight Concrete\r\nPavilions\r\nTimber and lumber structures",
  "skill_requirements": [
    "Costing",
    "Estimate",
    "Quantity Takeoff"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:25:10.959955",
      "reason": "Job first discovered"
    }
  ]
}