{
  "job_id": "1423090",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Assistant-Creative-Support-Specialist-1423090",
  "scraped_at": "2025-07-15T12:33:45.100234",
  "title": "Virtual Assistant & Creative Support Specialist",
  "type_of_work": "Part Time",
  "salary": "$3-$5 USD per hour",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Part-Time to Full-Time | Remote | Flexible Hours\r\nAre you a reliable, creative, and detail-oriented Virtual Assistant looking for a stable, long-term position with a mission-driven business? I’m looking for a loyal and proactive teaUpgrade to see actual infomber to help me manage day-to-day operations in my faith-based health coaching business. I help women over 50 lose weight, lower blood sugar, and improve their health using simple, natural strategies that align with biblical principles.\r\nThis is a multifaceted role that combines creative work (graphics, social media, and presentations) with administrative and customer support tasks. If you enjoy variety, are a fast learner, and love supporting others, this could be a great fit for you.\n\r\nResponsibilities\r\nDesign and Presentation Creation\r\nCreate high-quality graphics using Canva for social media, courses, and handouts\r\nDesign PowerPoint or Canva slide decks for webinars, masterclasses, and speaking presentations\r\nSocial Media Support\r\nSchedule and post content on Instagram, Facebook, and YouTube\r\nMonitor comments and messages, and engage with members inside private Facebook groups\r\nTrack and report social media analytics weekly\r\nAdministrative and Project Support\r\nUse Trello to manage tasks and timelines\r\nCreate and update standard operating procedures (SOPs) using checklists and Loom or other video tools\r\nHelp set up and support live webinars and online events\r\nManage inbox and help with scheduling, when needed\r\nCustomer Support and Client Onboarding\r\nRespond to client inquiries in a friendly and timely manner\r\nOnboard new clients into courses and programs by granting access and offering support\r\nAssist with troubleshooting login or access issues\n\r\nRequirements\r\n1 to 2 years of experience as a Virtual Assistant or in a similar support role\r\nProficiency in Canva, Trello, PowerPoint or Google Slides, and major social media platforms\r\nStrong English communication skills, both written and spoken\r\nHighly organized and detail-oriented\r\nSelf-motivated and able to work independently without constant supervision\r\nComfortable learning new tools and documenting workflows\r\nStable internet connection with backup options for power or connectivity\n\r\nPreferred (Not Required)\r\nBasic video editing skills for reels, shorts, or screen recordings\r\nExperience with GoHighLevel\r\nFamiliarity with the health coaching or faith-based personal development space\n\r\nWork Schedule and Compensation\r\n10 to 20 hours per week to start\r\nFlexible schedule with occasional availability needed for live events or check-ins\r\nHourly rate: $3 to $5 USD depending on experience\r\nLong-term opportunity with potential to grow into a full-time",
  "skill_requirements": [
    "Social Media Content Creation",
    "Social Media Management",
    "Graphic Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:33:45.101815",
      "reason": "Job first discovered"
    }
  ]
}