{
  "job_id": "1423196",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Representative-Full-Time-Remote-1423196",
  "scraped_at": "2025-07-15T15:46:08.980683",
  "title": "Sales Representative – Full-Time (Remote)",
  "type_of_work": "Full Time",
  "salary": "Php 50,000-Php 60,000 per month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you a strong communicator who thrives in a fast-paced, service-driven environment? We’re hiring a Sales Representative / Customer Service Specialist to join a growing remote team.\n\r\nThis role is ideal for someone who enjoys both sales and service, can pivot between platforms, and is driven to meet high standards in call handling, CRM accuracy, and customer satisfaction.\n\r\nKey Responsibilities\r\n-Call Handling & Communication\r\n-Answer inbound calls and make outbound follow-ups professionally and promptly\r\n-Convert new leads into booked appointments using consultative sales techniques\r\n-Clearly communicate services, pricing, and schedule availability\r\n-Follow scripts, call flows, and use rebuttals where necessary\r\n-Accurately document call outcomes and details in the CRM or ticketing system\r\n-Escalate or transfer calls in line with campaign-specific guidelines\r\n-CRM & Software Navigation\r\n-Navigate multiple CRMs, dashboards, and portals during live calls\r\n-Reference rate cards, SOPs, and client profiles to provide accurate info\r\n-Use internal tools like Slack, email, and ticketing systems to collaborate\r\n-Quality, Accuracy & Compliance\r\n-Maintain call accuracy, a professional tone, and precise data entry\r\n-Follow all compliance rules and documentation protocols\r\n-Participate in quality assurance reviews and respond to coaching feedback\n\r\nPerformance Expectations\r\n-Be consistently present and on time for scheduled shifts\r\n-Spend at least 60% of your shift actively on calls\r\n-Meet lead-to-appointment conversion rate targets (for sales campaigns)\r\n-Maintain a data error rate below 2%\r\n-Participate in mock calls, weekly coaching, and campaign updates\n\r\nRequirements\r\n-1+ year of experience in customer service or phone sales (BPO or remote)\r\n-Excellent English communication skills (verbal and written)\r\n-Proven ability to multitask across software and platforms\r\n-Comfortable following scripts, adapting when needed, and handling objections\r\n-Tech-savvy with a reliable home office setup and strong internet connection\r\n-Willingness to work US hours and attend regular coaching sessions\n\r\nIf you’re ready to be the voice of great service and sales for leading US brands, apply now and show us your talent!",
  "skill_requirements": [
    "Inbound Sales",
    "Outbound Sales",
    "Sales Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:46:08.982225",
      "reason": "Job first discovered"
    }
  ]
}