{
  "job_id": "1423083",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Stock-Trading-Analyst-1423083",
  "scraped_at": "2025-07-15T14:38:34.282097",
  "title": "Stock Trading Analyst",
  "type_of_work": "Part Time",
  "salary": "$7.50/hr",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us\r\nTrade Edge Pro is an American based stock alerts community that provides stock picks to medium term investors with a target maturity of 6-18 months per trade. Our alerts are hosted on our custom built app and include buy zones, sell targets, and the narrative supporting a stock. We focus on teaching traders about using stock charts over narrative and that you can in-fact time the market. \n\r\nWe are also in the process of building a community using Circle.so where we can facilitate better group and 1-on-1 interactions with members, along with offering a full education course. \n\r\nPosition Overview:\r\nThe Stock Trading Analyst will play a pivotal role in researching, charting, and posting potential trade ideas to our group. This position requires a deep understanding of market trends, technical analysis, and risk management strategies to make informed decisions. The successful candidate will be responsible for finding new trade ideas, creating attractive charts on TradingView, submitting information to our custom platform, and working with our social media team to alert our trades. \n\r\nResponsibilities:\r\nResearch\r\nYou will be responsible, alongside the Founder, for identifying stocks that fit our investment criteria using technical analysis.\r\nFollow our current stock research methodology to find investment leads through FinViz, scanners, and social media \n\r\nTechnical Analysis\r\nUtilize technical analysis tools and methodologies to identify potential trading opportunities and create great looking charts for our members using TradingView. If you will also work with the Founder to convert his trading ideas into TV charts to share, so he has more time to grow the business. We primarily focus on support and resistance, trend lines, and use indicators as confluences for our trades but do not use indicators as the primary reasoning. \n\n\r\nLoading Alerts and Social Media \n\r\nYou will be responsible for loading all new alerts in our custom app for our community by following our new stock alert procedure. You will work with our social media team to ensure that certain alerts are sent out to non-paying members on social media to generate a buzz for our services. \n\r\nReporting and Documentation:\r\nTrack our alerts and their performance, including when targets are hit so that our social media team can promote our successful trades\r\nGenerate regular reports on trading performance, including profit and loss analysis\r\nMaintain accurate records of trades, strategies, and market analyses\r\nProvide insights and recommendations to optimize trading strategies\n\r\nCollaboration:\r\nCollaborate with cross-functional teams, including technology, social media, and founder. \n\r\nQualifications:\r\nExperience:\r\nProven experience as a stock or crypto markets analyst and trader.\n\r\nSkills:\r\nProficient in technical analysis tools and platforms.\r\nExcellent quantitative and analytical skills.\r\nStrong understanding of risk management principles.\r\nEffective communication and collaboration skills.\n\r\nTechnology:\r\nFamiliarity with trading platforms and order execution systems\n\r\nPay Structure:\r\nPay is listed at $7.50USD per hour, but bonuses can be offered based on new community member sign ups to encourage teamwork in the right direction. \n\r\nApply through Onlinejobs.ph and attached your resume or CV. Please mention a stock ticker in your application title so I know you read this post in depth, any stock ticker doesn't matter.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:08:30.560382",
      "reason": "Job first discovered"
    }
  ]
}