{
  "job_id": "1423125",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Assistant-Airbnb-STR-Property-Management-5hr-1423125",
  "scraped_at": "2025-07-15T14:36:43.432607",
  "title": "Sales Assistant | Airbnb - STR Property Management | $5/hr",
  "type_of_work": "Full Time",
  "salary": "$5/hr + bonus depending on performance",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a fast-growing U.S.-based short-term rental (Airbnb) property management company operating in over 10 states. Our team is remote-first and performance-driven. We specialize in turning underperforming vacation rentals into high-earning listings through smart pricing, guest support, and streamlined operations.\n\r\nWe’re looking for a Sales Assistant to help support our sales and onboarding process. You’ll be responsible for organizing leads, following up with potential property owners, preparing documentation, and assisting our team in converting prospects into long-term clients. This is a high-impact support role with room to grow into sales, onboarding, or account management.\n\n\r\nKey Responsibilities\r\n• Track and organize incoming leads in our CRM (HubSpot)\r\n• Assign leads to appointment setters or closers in real time\r\n• Monitor scheduled consultation calls and follow up on no-shows or reschedules\r\n• Respond to Meta (Facebook/Instagram) ad comments and DMs to identify potential leads\r\n• Help qualify leads based on property location, type, and fit\r\n• Draft and send contracts using DocuSign\r\n• Support onboarding by collecting key property information, photos, and documents\r\n• Communicate with internal team using Slack, Google Sheets, and HubSpot\r\n• Re-engage past leads through outbound campaigns\r\n• Conduct daily audits of sales team performance and share summary reports\n\n\r\nRequirements\r\n• Excellent written and spoken English\r\n• Previous experience in a sales assistant, CRM, or customer support role\r\n• Strong organizational skills and attention to detail\r\n• Tech-savvy and confident using HubSpot, Meta Business Suite, Google Workspace, and DocuSign\r\n• Highly reliable internet connection and professional home office setup\r\n• Willing to work EST hours consistently, and most likely weekends\r\n• Self-motivated and comfortable working independently in a fast-paced team\n\n\r\nSalary & Growth\r\n• $5/hr + bonus depending on performance\r\n• Bonuses for great performance and added value\r\n• Long-term position with opportunity to move into team lead roles\n\n\r\nBonus Tasks for Potential Bonuses/Raises\r\n• Help prepare lead reports, onboarding status updates, and campaign summaries\r\n• Build internal documentation, SOPs, or FAQs to improve sales team efficiency\r\n• Propose new tools or automations to improve our lead funnel\n\n\r\nHow to Apply (All Steps Required)\r\n1. Send a 2-minute voice recording introducing yourself:\r\n• Share your experience with sales support, lead tracking, or CRM management\r\n• Talk about a time you helped close a deal or made a sales process more efficient\r\n• Use Vocaroo or a Google Drive link (set to public)\n\r\n2. Answer this short prompt in writing:\r\n• What’s one idea you have to help a sales team stay better organized or convert more leads? Be specific and detailed.\n\r\n3. Attach your resume with your current work status and past experience\n\n\r\nWhy Join Us\r\n• Long-term remote job with stable bi-weekly pay\r\n• Bonus pay for high-quality work\r\n• Team that values results, initiative, and consistency\r\n• Fast-growing company in the Airbnb space\n\n\r\nWe’re actively interviewing. Apply now!",
  "skill_requirements": [
    "Property Management",
    "Sales Management",
    "Sales Support"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:34:45.161344",
      "reason": "Job first discovered"
    }
  ]
}