{
  "job_id": "1423042",
  "url": "https://www.onlinejobs.ph/jobseekers/job/AI-Specialist-Remote-Elevate-the-Way-We-Work-with-AI-1423042",
  "scraped_at": "2025-07-15T15:30:16.641385",
  "title": "AI Specialist (Remote – Elevate the Way We Work with AI)",
  "type_of_work": "Any",
  "salary": "Negotiable Depending on Experience",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "MadeEA – The Gold Standard in Remote Executive Support\r\nStrategic. Trusted. Seamless. Elite.\n\r\nAt MadeEA, we don't just support leaders, we empower them. As we expand our premium executive support services, we’re looking for a highly skilled AI Specialist who’s not only fluent in the latest tools, but can also train, implement, and optimize AI across our agency.\n\r\nThis is a strategic role: you’ll work directly with our leadership team to design intelligent workflows, deliver internal training, and ensure our Philippine-based Executive Assistants are equipped to use AI to enhance client outcomes.\n\r\nWhat You’ll Be Doing:\r\n• Audit our current workflows and identify areas for AI integration and automation\r\n• Build prompt libraries, GPT-based assistants, and smart internal tools using ChatGPT, Claude, Gemini, Notion AI, Zapier, Airtable, Make, etc.\r\n• Design AI-powered training materials, use-case demos, and real-world application walkthroughs for our EA team\r\n• Provide hands-on training and support to executive assistants and internal staff on prompt engineering, time-saving AI workflows, and ethical use\r\n• Stay on top of the fast-changing AI landscape, vet new tools, and recommend strategic adoption based on value\r\n• Collaborate with our Web Developer to integrate AI into our agency website, internal dashboards, and client-facing solutions\r\n• Build and maintain scalable SOPs for AI usage and prompt optimization best practices\n\r\nWe’re Looking For Someone Who:\r\n• Has 2–5+ years experience in AI/automation roles (agency, tech ops, consulting, or startups)\r\n• Can confidently use tools like ChatGPT (advanced mode), Claude, Perplexity, Notion AI, Zapier, Make, Google Apps Script, and more\r\n• Understands prompt engineering, LLMs, and real-time AI applications for executive support workflows\r\n• Is comfortable creating training decks, hosting live AI demos, and simplifying complex tools for non-technical users\r\n• Is fluent in English, with strong documentation and instructional writing skills\r\n• Has a proactive, curious mindset and thrives on building systems that reduce manual work and scale results\r\n• Bonus if you’ve worked in remote-first teams or trained virtual assistants in operational AI\n\r\nWhy You’ll Love This Role:\r\n• Help shape how AI powers elite executive support from the Philippines to the world\r\n• Work in a values-driven, non-corporate team that encourages bold ideas and ownership\r\n• Lead training and innovation for globally attuned executive assistants supporting CEOs, founders, and investors\r\n• Be recognized for your impact—not just your code\r\n• Collaborate directly with agency leadership to design high-level infrastructure\n\r\nCompensation & Terms:\r\n• Remote | Part-Time or Project-Based to Start (with path to long-term role)\r\n• Competitive USD-based rate depending on experience and project scope\r\n• Performance bonuses tied to successful AI implementations and training impact\n\r\nReady to Apply?\r\nPlease complete this application form:Upgrade to see actual info\n\r\nImportant: Incomplete answers or missing requirements in the application form, as well as inaccessible links will result in automatic disqualification.\n\r\nLet’s shape the future of support—with intelligence, efficiency, and excellence.",
  "skill_requirements": [
    "Training and Development",
    "AI Tools",
    "Prompt Engineering"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T11:36:22.658075",
      "reason": "Job first discovered"
    }
  ]
}