{
  "job_id": "1423188",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Funnel-Marketing-Strategist-1423188",
  "scraped_at": "2025-07-15T15:43:33.271511",
  "title": "Funnel & Marketing Strategist",
  "type_of_work": "Gig",
  "salary": "Php 45,000 - Php 60,000",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We're looking for a Funnel & Marketing Strategist who can help us design and map out an end-to-end client journey—from awareness to paid offer to long-term retention.\n\r\nThis is a strategy-first role.\n\r\nYou're not here to just write ads or build pages. You're here to architect our client acquisition, conversion, delivery, and retention systems—and make sure our funnel works like a well-oiled machine.\n\r\nYour Responsibilities:\n\r\n1. Audit our current marketing, offer, and sales process\n\r\n2. Map out a complete marketing funnel from:\r\n---->Lead Generation (content, ads, lead magnets)\r\n---->Lead Nurturing (VSL funnel, emails, DM strategy)\r\n----> Conversion (sales page, call booking, Messenger strategy)\r\n---->Delivery (client onboarding systems)\r\n---->Retention (post-retreat offers, memberships, email reactivation)\n\r\n3. Help us restructure and reprice our offers.\n\r\n4. Work with our VA to implement the strategy.\n\r\nYou’re a Great Fit If:\n\r\n1. You’ve built or planned funnels that have worked (with portfolio or references)\r\n2. You understand the full funnel journey: ads ? lead ? nurture ? sale ? delivery ? upsell\r\n3. You can confidently advise on offer structure, pricing, messaging, and client journey\r\n4. You’ve worked with coaches, consultants, or healing/wellness brands (big plus)\r\n5. You’re a great communicator who can work directly with the founder and our small team\n\r\nWe’re flexible with hours per week, as long as deadlines and outcomes are met.",
  "skill_requirements": [
    "Copywriting",
    "Facebook marketing",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:26:54.371841",
      "reason": "Job first discovered"
    }
  ]
}