{
  "job_id": "1423100",
  "url": "https://www.onlinejobs.ph/jobseekers/job/ClickFunnels-Email-Marketing-General-Support-1423100",
  "scraped_at": "2025-07-15T15:42:09.872732",
  "title": "ClickFunnels, Email Marketing + General Support",
  "type_of_work": "Part Time",
  "salary": "$500",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "I’m looking for a tech-savvy and highly organized Virtual Assistant who is experienced in:\r\n • ClickFunnels (or GoHighLevel)\r\n • Email marketing (Omnisend, Flodesk, or similar platforms)\r\n • Backend admin and support for mentorship programs, student management, and general operations\n\r\nI run a fast-paced 6-figure business in the hair and beauty industry, selling both digital and physical products — and I also run live mentorships and webinars.\n\r\nI need someone who can handle the tech and the backend, so I can focus on teaching and scaling.\n\r\n?\n\r\nRequired Skills:\r\n • Expert in building/editing funnels (ClickFunnels, GoHighLevel, or similar)\r\n • Email marketing: flows, campaigns, list management, A/B testing\r\n • Able to set up automations and tags for segmented email lists\r\n • Good English (for proofreading or lightly editing email copy if needed)\r\n • Experience managing communities (Skool, Kajabi, or FB groups a bonus)\r\n • Organised, reliable, and communicates updates daily\r\n • Bonus: Familiar with Shopify and Zapier integrations\n\r\n?\n\r\nDay-to-Day Tasks May Include:\r\n • Creating opt-in pages, webinar funnels, and thank-you pages\r\n • Scheduling & updating email campaigns\r\n • Managing mentees (sending reminders, tracking progress, updating CRM)\r\n • Uploading content replays and coordinating with my schedule\r\n • Simple customer service replies (refunds, FAQs, etc.)\r\n • Helping me stay on top of deadlines and launches\n\r\nThis is a long-term role for someone who wants to grow with the brand. If you’re reliable, solution-focused, and experienced with digital business backends, I want to hear from you.\n\r\nTo apply, please send:\r\n 1. A short message introducing yourself\r\n 2. Examples of ClickFunnels/email work you’ve done\r\n 3. Your availability \n\r\nLooking forward to bringing the right person into my team!\n\r\nBest,\r\nTay | TaysLuxe Academy",
  "skill_requirements": [
    "Email Marketing",
    "Clickfunnels",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:37:55.059904",
      "reason": "Job first discovered"
    }
  ]
}