{
  "job_id": "1423190",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-Representative-for-E-commerce-Store-Shopify-1423190",
  "scraped_at": "2025-07-15T14:26:52.378857",
  "title": "Customer Service Representative for E-commerce Store (Shopify)",
  "type_of_work": "Part Time",
  "salary": "$4 per hour",
  "hours_per_week": "16",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are looking for a dedicated and experienced Customer Service Representative to join our dropshipping business. You should be someone who truly values customer satisfaction, communicates professionally, and can stay calm under pressure.\n\r\nWhat we’re looking for:\r\n•?  ?Proven experience in customer service (mainly via email)\r\n•?  ?Experience with Shopify is required\r\n•?  ?Strong problem-solving skills, responsibility, and flexibility\r\n•?  ?Ability to work under pressure and handle stressful situations professionally\r\n•?  ?Clear and professional English communication\r\n•?  ?Long-term availability and commitment\n\r\nWhat we offer:\r\n•?  ?$4 USD per hour (with growth opportunities based on performance)\r\n•?  ?Start with 2 to 4 hours per day\r\n•?  ?Working hours between 2 PM and 6 PM Philippine time\r\n•?  ?Hours may increase as the business grows\r\n•?  ?Opportunity for a long-term and stable position\n\r\nImportant:\r\nIf you do not agree with the hourly rate, working hours, or any of the conditions above, please do not apply. We are looking for someone who fully supports and aligns with this role and its requirements.\n\r\nInterested?\r\nPlease reply with a short message including the following:\n\r\nDo you currently have any other job?\n\r\nWhat is your experience with Shopify and customer service?\n\r\nWe’re excited to find a reliable teaUpgrade to see actual infomber who’s ready to grow with us long-term. \n\r\nSincerely, \n\r\nOtison & Zyiliene",
  "skill_requirements": [
    "Shopify",
    "Email Support",
    "English"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:26:52.380321",
      "reason": "Job first discovered"
    }
  ]
}