{
  "job_id": "1423092",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Shopify-Landing-Page-Senior-1423092",
  "scraped_at": "2025-07-15T15:30:49.314531",
  "title": "Shopify Landing Page Senior",
  "type_of_work": "Any",
  "salary": "2000",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We’re hiring a Landing Page Designer / Funnel Builder with deep experience in crafting high-converting Shopify pages—from listicles and advertorials to direct product landers and offer pages.\n\r\nYou’ll be working closely with our performance marketing team to rapidly deploy, test, and optimize landing pages that not only look great—but convert traffic into customers. You should be comfortable working in GemPages, Figma, or any tool that gets the job done. Bonus if you can create or source high-converting visuals (e.g., headers, badges, illustrations, product imagery).\r\n? What You’ll Do:\n\r\n– Design and build Shopify landing pages, listicles, advertorials, and offer pages that drive conversions\r\n– Collaborate with marketers to turn briefs and angles into strategic page layouts\r\n– Use GemPages, PageFly, Figma, or similar tools to execute builds fast and effectively\r\n– Create or source conversion-optimized visuals (hero images, icons, guarantee badges, mockups, etc.)\r\n– Apply best practices in layout, copy hierarchy, and CRO principles\r\n– Continuously iterate based on A/B test data, heatmaps, and team feedback\r\n– Ensure responsive design and good mobile-first UX\r\n???? What We’re Looking For:\n\r\n– Proven experience building Shopify landing pages (portfolio required)\r\n– Strong understanding of conversion principles, direct-response layouts, and buyer psychology\r\n– Experience with GemPages, PageFly, Shogun, or equivalent page builders\r\n– Solid skills in Figma or Canva for visual design and layout\r\n– Ability to create or direct the creation of high-impact images that support page goals\r\n– Strong eye for design, structure, and clean page flow\r\n– Comfortable working closely with performance marketers and iterating quickly\r\n???? Bonus Points For:\n\r\n– Knowledge of copywriting principles (not required, but helps if you understand messaging)\r\n– Experience building out funnels or pre-sale landers for e-commerce\r\n– Familiarity with heatmap tools (Clarity, Hotjar) or A/B testing platforms\r\n– Being able to adapt brand guidelines across different angles\r\n? Please DO NOT Apply If:\n\r\n– You’ve only worked on generic Shopify themes or storefronts\r\n– You don’t have examples of performance-driven landing pages\r\n– You’re focused purely on visual design without understanding user behavior\r\n– You’re not comfortable with rapid feedback loops or working closely with marketing teams\r\n???? How We Work:\n\r\n– Fully remote team with async-friendly communication\r\n– Tight collaboration between marketing, design, and dev\r\n– Fast execution, high standards, and growth-focused culture\r\n– Long-term role with room to own creative funnel strategy\r\n???? To Apply:\n\r\nPlease send us:\r\n– A short intro about yourself\r\n– Portfolio or live examples of landing pages, listicles, advertorials you’ve built",
  "skill_requirements": [
    "Copywriting",
    "E-Commerce",
    "Landing Page Design"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:30:14.665539",
      "reason": "Job first discovered"
    }
  ]
}