{
  "job_id": "1423120",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Guest-Relations-Specialist-Airbnb-STR-Property-Management-5hr-1423120",
  "scraped_at": "2025-07-15T15:38:28.061221",
  "title": "Guest Relations Specialist | Airbnb - STR Property Management | $5/hr",
  "type_of_work": "Full Time",
  "salary": "$5/hr + bonus depending on performance",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a fast-growing U.S.-based short-term rental (Airbnb) property management company operating in over 10 states. Our team is remote-first and performance-driven. We specialize in turning underperforming vacation rentals into high-earning listings through smart pricing, guest support, and streamlined operations.\n\r\nWe’re hiring a Guest Relations Specialist to join our support team. You’ll be the front line of communication with our guests, ensuring smooth check-ins, quick responses to concerns, and consistent 5-star experiences. This is a critical role in keeping guest satisfaction high and our operations running smoothly.\n\n\r\nKey Responsibilities\r\n• Respond to guest messages across platforms quickly and professionally\r\n• Audit action items provided from your last work shift\r\n• Manage check-in coordination, booking issues, and special requests\r\n• Defer to appropriate teaUpgrade to see actual infomber for escalation items\r\n• Handle guest concerns and complaints with empathy and urgency\r\n• Monitor calendar conflicts and resolve reservation issues\r\n• Maintain consistent and clear communication with teaUpgrade to see actual infombers\r\n• Document key guest interactions and flag potential problem bookings\r\n• Support backend communication and admin tasks during low message volume\r\n• Follow processes and suggest improvements as you learn our systems\n\n\r\nRequirements\r\n• Excellent English, both spoken and written\r\n• Friendly, professional communication style with great problem-solving skills\r\n• Fast, reliable internet and a professional remote work setup\r\n• Willing to work EST hours\r\n• Tech-savvy and confident using Airbnb, Hostaway, Slack, and Google Workspace\r\n• Self-motivated, highly organized, and calm under pressure\r\n• Experience in Airbnb, hospitality, or guest services is a big plus\n\n\r\nSalary & Growth\r\n• $5/hr + bonus depending on performance\r\n• Bonuses for great performance and added value\r\n• Long-term position with opportunity to move into team lead roles\n\n\r\nBonus Tasks for Potential Bonuses/Raises\r\n• Improve or document internal workflows, FAQs, and guest SOPs\r\n• Ensure all action items are done and communicated to correct teaUpgrade to see actual infomber for further action\r\n• Help review and improve listings (titles, descriptions, photos, etc.)\r\n• Support our sales team by calling or messaging property owner leads\n\n\r\nHow to Apply (All Steps Required)\r\n1. Send a 2-minute voice recording introducing yourself:\r\n• Share your experience with STR/Property Management/Airbnb\r\n• Tell a short story about how you resolved a tough guest issue and what did you learn from it\r\n• Use Vocaroo or a Drive link (set to public)\n\r\n2. How would you proceed to improve this Airbnb listing: Upgrade to see actual info/rooms/Upgrade to see actual info• Provide 5 bullet points on how to improve this listing to drive more bookings, be very specific\r\n• Explain why you’d make each change\n\r\n3. Attach your resume with your current work status and past experience\n\n\r\nWhy Join Us\r\n• Long-term remote job with stable bi-weekly pay\r\n• Bonus pay for high-quality work\r\n• Team that values results, initiative, and consistency\r\n• Fast-growing company in the Airbnb space\n\n\r\nWe’re actively interviewing. Apply now!",
  "skill_requirements": [
    "Property Management",
    "Short Term Rentals",
    "Airbnb"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:36:03.530403",
      "reason": "Job first discovered"
    }
  ]
}