{
  "job_id": "1423008",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Product-Support-Specialist-GHL-Expert-1423008",
  "scraped_at": "2025-07-15T12:27:01.722486",
  "title": "Product Support Specialist - GHL Expert",
  "type_of_work": "Full Time",
  "salary": "Starting at 35,000 PHP",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Ascend Group is Singapore’s premier digital marketing company. We exist to equip entrepreneurs and purpose-driven businesses to thrive in the new AI economy through strategic marketing, education, and scalable systems with AI-first thinking.\r\nAt Ascend, we are a remote-first team of A-players who value growth, performance, and transparency. We move fast, build with clarity, and honor each teaUpgrade to see actual infomber’s ideas, ownership, and craft. If you want to expand your capabilities, contribute meaningfully, and grow in a no-politics, high-performance environment, this is your place.\n\n\r\nYou’ll be our Product Support Specialist – GHL Expert who turns strategic blueprints into seamless GoHighLevel builds and bullet-proof automations. From white-label account setups to complex internal workflows, you’ll translate “here’s the plan” into “it’s live and driving results,” while rescuing users when things go sideways and feeding real-world insights back to the Product team. If you love hands-on implementation, rapid troubleshooting, and squeezing every ounce of value from GoHighLevel, we’d love to work with you.\n\n\r\nIMPORTANT NOTE: Only those who have completed and submitted the job application form via the link below will be considered for the role.\n\n\r\nAPPLY NOW and FILL IN this APPLICATION FORM: Upgrade to see actual info/AG-JobApplicationForm\n\n\n\r\nROLE OBJECTIVES\n\r\n>End-to-End GHL Setup – White-label, brand, and integrate new GoHighLevel accounts (payment gateways, calendars, data imports) for clients and internal teams.\n\r\n>Build High-ROI Automations – Design, test, and refine email/SMS campaigns, CRM workflows, and pipeline triggers that hit project KPIs.\n\r\n>Launch Conversion Funnels & Sites – Deploy and troubleshoot funnels, landing pages, and websites, guaranteeing smooth hand-offs to other platform features.\n\r\n>Provide Rapid Technical Support – Diagnose and fix subscriber or team issues quickly, turning “I’m stuck” into “all good” with clear, step-by-step guidance.\n\r\n>Keep Docs & Training Fresh – Write practical how-tos/FAQs and run bite-size training so users can self-serve and scale.\n\r\n>Drive Internal Efficiency – Translate process maps into automated GHL workflows and cross-tool integrations that cut manual work.\n\r\n>Close the Feedback Loop – Feed ground-level insights on usability gaps and feature ideas back to the Product Manager for continuous improvement.\n\n\r\nREQUIREMENTS\n\r\n- 3 + years hands-on with GoHighLevel\r\n- Proven track record building automations, funnels, and websites that deliver measurable results.\r\n- Comfortable with integrations (APIs, webhooks, Zapier/Make, payment gateways, calendar sync).\r\n- Solid grasp of email/SMS best practices and basic HTML/CSS for troubleshooting.\r\n- Sharp problem-solver who enjoys talking to users through fixes and writing clear documentation.\r\n- Strong project-management habits—can juggle multiple builds and support tickets without dropping the ball.\r\n- Excellent written and spoken English; able to run live trainings and draft concise SOPs.\r\n- Bonus: experience supporting SaaS products in an agency or B2B environment.\n\n\r\nPlease note that only those who have completed and submitted the job application form will be considered for the role.\n\n\r\nIf you’re interested in joining us, apply here: Upgrade to see actual info/AG-JobApplicationForm\n\n\n\r\nJob Type: Full-time\n\n\r\nBenefits:\n\r\nAdditional leave\r\nFlextime\r\nOpportunities for promotion\r\nPaid training\r\nPromotion to a permanent employee\r\nWork from home\n\n\r\nSchedule:\n\r\n8-hour shift\r\nFull-time (Flexible)\r\nMonday to Friday",
  "skill_requirements": [
    "Marketing Automation",
    "Clickfunnels",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:25:15.231841",
      "reason": "Job first discovered"
    }
  ]
}