{
  "job_id": "1423224",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Go-High-Level-Specialist-Australia-based-1423224",
  "scraped_at": "2025-07-15T15:46:22.893675",
  "title": "Social Media & Go High Level Specialist (Australia-based)",
  "type_of_work": "Part Time",
  "salary": "30,000 to 33,000 PhP per month, (based on experience).",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "The Position\r\nWe're looking for an experienced and proactive Social Media & Go High Level Specialist to take their career to the next level. The ideal candidate will play a crucial role in strengthening the client’s online presence, managing CRM systems, and creating awesome social media content across their digital platforms.  \r\nIf you’re tech-savvy, highly organised, and love creating awesome social media content that strengthens a brand, we’d love to hear from you!\r\nAbout the company \r\nA forward-thinking and mission-led coaching brand based in Australia. The business focuses on empowering women to align their lives with their professional ambitions through mindset work, strategic coaching, and transformational guidance.\r\nAbout the role\r\nThis is a part-time, remote role with the potential to expand into a full-time position over time. You’ll work directly with the business owner to manage CRM workflows (using Go High Level), keep website content updated, and produce engaging social media content. The right candidate will: . This position suits someone. \r\nThe ideal candidate is someone who: \r\nKnows how to use GH, and can create amazing social media content.\r\nBrings both creativity and technical confidence and will feel comfortable owning processes and making improvements. \r\nIs a freelancer, has another part-time role, or is looking to grow from a part-time position into a full-time role over time. \r\nIs willing to work specific part-time hours - aligning with the Australian timezone.\r\nIf you have a tick on all of the above, we want to hear from you! \n\n\r\nThe Details\r\nJob Location: Remote, work from home.\r\nCompany Location: Australia\r\nJob Type: Part-time (20 hours per week), possibly transition to full-time.\r\nHours (in Philippine Time): 7am to 11am PHT (flexible)\n\r\nJob Perks \r\nWork From Home \r\nPackage that includes paid and sick leave + Paid public holidays \r\nOpportunity for career growth as the role expands to full-time \r\nAmazing company culture\n\r\nMAIN RESPONSIBILITIES\r\nCRM & SYSTEMS MANAGEMENT (GO-HIGH-LEVEL)\r\nBuild and maintain automations, funnels, and email sequences in Go High Level.\r\nSet up templates, payment integrations, and optimize customer workflows.\r\nManage CRM content areas including user access, course material, and scheduling tools.\r\nTroubleshoot and integrate third-party platforms to enhance functionality.\r\nWEBSITE MANAGEMENT\r\nMaintain and update the client’s websites using platforms such as Wix and Go High Level.\r\nUpload and optimize pages, blog posts, and multimedia content with SEO in mind.\n\r\nSOCIAL MEDIA MANAGEMENT\r\nPlan, design, and schedule engaging content for Instagram, Facebook, and other social channels.\r\nCreate visuals in Canva (reels, carousels, stories, etc.) that align with brand style.\r\nEdit and repurpose video content for various platforms, including YouTube.\r\nTrack engagement, respond to interactions, and refine the strategy based on data.\r\nSoftware skills\r\nIdeally, you have experience using:  \r\nGo-High-Level is a must\r\nWix: updating websites and designs\r\nOther tools: Canva, Trello, Slack, Google Workspace, and all Social Media Platforms.  \r\nWe want to hear from you if you are…\r\n4+ years of experience as a social media VA with GHL experience, offering direct support to online international businesses across Australia, the US, and/or Europe (No BPOs).\r\nProficient using GHL (as noted above).  \r\nExperience in content creation across multiple platforms with intermediate-level graphic design skills using Canva.\r\nExperience managing and updating websites using Wix or similar platforms\r\nConfident in video editing and content repurposing.\r\nStrong attention to detail, time management, and ability to meet deadlines.\r\nExcellent written and verbal communication in English\r\nComfortable working independently and contributing within a collaborative environment \r\nYou must also be someone that… \r\nCan speak up if you see a problem and are proactive in finding solutions. \r\nAlways seeks to create better systems, and make things more efficient. \r\nThrives in a fast-paced environment, and can work independently and collaboratively.\n\r\nThis role is NOT for you if you…\r\nDon’t have Go-High-Level and CRM experience. \r\nLack a dedicated remote workspace or structure for full-time work.\r\nAre seeking short-term employment or have another job.\r\nDo not prioritise client satisfaction or have poor attention to detail.",
  "skill_requirements": [
    "Content Creation",
    "Social Media Management",
    "GoHighLevel"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:46:22.895794",
      "reason": "Job first discovered"
    }
  ]
}