{
  "job_id": "1423124",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Brand-Expert-1423124",
  "scraped_at": "2025-07-15T15:32:21.742879",
  "title": "Amazon Brand Expert",
  "type_of_work": "Full Time",
  "salary": "$615",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "ABOUT US:\n\r\nAt Seller Candy, our vision is to give balance, certainty & peace of mind to e-commerce entrepreneurs. We’re a value-driven company that believes our team is as important as our customers. Our core values are; Own-it, Authenticity, Determination, Expertise, and Impact through Growth.\n\r\nTo accomplish our vision we remove the daily friction experienced by e-commerce entrepreneurs by handling their Amazon account issues and support cases with agency-level expertise and best practices in a fun and collaborative environment.\n\r\nSeller Candy bridges the gap from “online seller” to business owner. We enable millions of dollars in revenue and free hundreds of people from their jobs, transforming them into confident entrepreneurs accomplishing their dreams.\n\r\nSeller Candy is in an exciting phase of growth so join us and imagine yourself being part of changing lives!\n\n\r\nWHAT YOU WILL DO:\r\nWe’re looking for passionate, detailed problem solvers who can’t rest until things are right. As an Amazon Operations & Account Expert, you’ll be connecting to and impacting the lives of our customers and their families.\r\nLead client communications for all assigned Amazon brands/accounts.\r\nShare updates and results with the client on an ongoing basis.\r\nManage Listings via:\r\n1. The Seller Central backend\r\n2. Communication with Seller Support\r\nChange, update, manipulate, and build listings for Amazon US and EU using tools such as flat files.\r\nLiaise with Seller Support on behalf of clients\r\n1. Clients will specify their desired outcome, and we should continually push Seller Support to achieve that result.\r\n2. We never send our clients back a canned reply, we continue to open cases, email, and call via phone until we have a resolution.\r\n3. “Google it” to solve problems\r\nWhen difficult or new problems arise (they always will!) you must be able to google it, search through Amazon forums, and generally find the information available to guide your decisions or to give the client best practices advice. THIS IS ESSENTIAL.\r\nSeller Central Basics:\r\n1. Inventory management, shipping plans, sales reports, feedback removal, and more. All of the basic tasks are typically performed inside Seller Central.\r\nCreate Raving Fans\r\nWhen you speak to our clients, and when you service their accounts, we will give WHITE GLOVE SERVICE. That means you always maintain a positive attitude, give the client clean, concise instructions, go above and beyond their task if possible, and proactively give them information if available. We aim to surprise our clients with more than they expect!\n\n\r\nWHAT YOU NEED:\r\nExtreme self-motivation and problem-solving skills\r\nA heart-felt, emotional connection to customer happiness\r\nA natural aversion to letting problems be left unsolved.\r\nAttention to detail and prompt reporting adherence to deadlines\r\nMore than 1 year working in Amazon Industry\r\nExceptional verbal and written communication skills\r\nProficient in using computers to effectively solve and research resolutions online and communicate efficiently.\r\nAble to work CST/EST, depending on the needs of the company.\n\n\r\nWHAT'S IN IT FOR YOU:\r\nFull-time work\r\nHigh-paying job compared to similar roles\r\nOffer starts at $615 per month (Plus benefits, paid leave, bonuses, and more as described below)\r\nPerformance bonuses\r\nHMO upon regularization\r\nLeave benefits upon regularization\r\nGrowth potential within the company\r\nThe amazing opportunity to join a fast-growing company who is just as focused on their team as they are on their customers.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:41:30.866636",
      "reason": "Job first discovered"
    }
  ]
}