{
  "job_id": "1423014",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Performance-Marketing-Data-Analyst-1423014",
  "scraped_at": "2025-07-15T12:28:38.804135",
  "title": "Performance Marketing Data Analyst",
  "type_of_work": "Any",
  "salary": "$7-$11 per hr",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About the Role:\n\r\nWe are looking for a meticulous and data-driven Marketing Data Analyst to join our rapidly expanding team. In this role, you will gather, analyze, and present data from various advertising platforms and tracking systems, providing critical insights that will influence key strategic decisions within our media and management teams.\r\nKey Responsibilities:\r\n- Collect and structure data from ad platforms like Google Ads, Meta/Facebook, TikTok, and others.\r\n- Use tracking tools like Upgrade to see actual info and MMPs (e.g., Appsflyer, Adjust) to manage and analyze performance data.\r\n- Create and maintain dashboards and reports using Looker Studio, Excel, and other analytics tools.\r\n- Provide actionable insights and strategic recommendations for media and leadership teams.\r\n- Design and deliver visually engaging presentations to communicate data and performance metrics to internal stakeholders.\n\r\nMandatory Requirements:\r\n- 1+ years of experience in data analysis, marketing analytics, or business intelligence (BI).\r\n- Advanced skills in Excel and Looker Studio.\r\n- Strong knowledge of advertising platforms such as Google Ads, Meta/Facebook, and TikTok.\r\n- Exceptional analytical, organizational, and attention-to-detail skills, with a proven ability to turn data into actionable business insights.\r\n- Strong written and verbal communication skills in English.\n\r\nPreferred Skills:\r\n- Experience with Upgrade to see actual info.\r\n- Familiarity with MMP tools (Appsflyer, Adjust).\r\n- Knowledge of business intelligence tools and dashboard development.\r\n- Experience in performance marketing analytics.\n\r\nWhy Join Us:\r\nJoining our teaUpgrade to see actual infoans working in a fast-paced, dynamic environment where your contributions will have a tangible impact. You’ll have the opportunity to grow professionally, collaborating with industry experts in performance marketing. We offer a supportive, innovative culture with ample opportunities for career growth as the company continues to scale.",
  "skill_requirements": [
    "Marketing Analytics",
    "Data analysis",
    "Looker Studio"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:32:17.014551",
      "reason": "Job first discovered"
    }
  ]
}