{
  "job_id": "1423212",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Executive-Virtual-Assistant-1423212",
  "scraped_at": "2025-07-15T15:36:54.120644",
  "title": "Executive Virtual Assistant",
  "type_of_work": "Full Time",
  "salary": "$6-8/hr",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Us:\r\nAll You Need Services is a construction company based in North Fort Myers, Florida, dedicated to delivering exceptional services across various projects. Our team is passionate about excellence, innovation, and professionalism, and we are seeking an Executive Virtual Assistant to support our leadership team and contribute to our continued success.\n\r\nPosition Overview:\r\nThe Executive Virtual Assistant will play a critical role in providing high-level administrative support to the executive team. This individual will be responsible for managing schedules, coordinating communication, and ensuring the smooth operation of day-to-day activities, all while maintaining the highest level of confidentiality and professionalism.\n\r\nKey Responsibilities:\n\r\nManage and maintain executives’ calendars, including scheduling meetings, appointments, and travel arrangements.\r\nServe as the primary point of contact between executives, internal teams, clients, and external stakeholders.\r\nPrepare and organize documents, reports, and presentations for meetings and projects.\r\nRespond to emails, phone calls, and other correspondence on behalf of the executive team.\r\nCoordinate and facilitate virtual meetings, including creating agendas, distributing materials, and recording minutes.\r\nHandle confidential information with discretion and professionalism.\r\nConduct research and compile data for projects or reports as requested.\r\nManage and track deadlines, deliverables, and project statuses to ensure smooth workflow.\r\nAssist with invoicing, expense reporting, and other administrative tasks.\r\nProactively identify opportunities to improve administrative processes and efficiencies.\n\r\nQualifications:\n\r\nProven experience as an executive assistant, virtual assistant, or in a similar administrative role (experience in the construction industry is a plus).\r\nExceptional organizational and time-management skills, with the ability to multitask and prioritize effectively.\r\nStrong written and verbal communication skills.\r\nProficiency in Microsoft Office Suite, Google Workspace, and other relevant software/tools.\r\nAbility to work independently with minimal supervision and demonstrate a high level of initiative.\r\nProfessional demeanor and a commitment to confidentiality.\r\nFamiliarity with construction terminology and processes is a plus, but not required.\r\nHigh-speed internet and a reliable home office setup.\r\nComfortable working EST hours\n\r\nPreferred Qualifications:\n\r\n3+ years of experience as an Executive Assistant, preferably in the construction industry.\r\nKnowledge of permitting processes, construction drawings, and project estimating.\r\nStrong organizational and project management skills.\r\nExcellent verbal and written communication abilities.\r\nTech-savvy with proficiency in Google Workspace, Microsoft Office, and project management tools (e.g., Buildertrend, Procore, or similar platforms).\r\nAccounting support experience (QuickBooks or similar systems is a plus).\r\nAbility to work independently, multitask, and stay ahead of deadlines.\r\nReliable home office setup with high-speed internet.\r\nMust be available during Eastern Standard Time business hours.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:36:54.123923",
      "reason": "Job first discovered"
    }
  ]
}