{
  "job_id": "1423218",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Home-Healthcare-Admin-1423218",
  "scraped_at": "2025-07-15T15:40:53.262473",
  "title": "Home Healthcare Admin",
  "type_of_work": "Full Time",
  "salary": "$4 - $9",
  "hours_per_week": "45",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job description\r\nYellowstone Local is a staffing and recruiting agency dedicated to supporting the skilled trades industry. We connect high-performing talent with growing home service companies across the U.S. Our clients—leaders in HVAC, plumbing, electrical services, and beyond—depend on skilled professionals to help drive their business growth. At Yellowstone Local, we take pride in matching the right people with the right opportunities, ensuring long-term success for both our clients and candidates.\n\r\nPosition Overview:\r\nAs the Administrative Manager for a home healthcare operation, you'll be the operational backbone behind the scenes—owning the intake process, ensuring accurate and timely documentation, and maintaining full compliance with ever-evolving Medicare/Medicaid and regulatory standards. This is a mission-critical role for someone who is well-versed in home healthcare and can operate independently in a fast-paced, high-accountability environment.\n\r\nKey Responsibilities\r\nManage and oversee all administrative functions for a home healthcare agency operating in Miami, FL and Southern California\r\nHandle intake workflows, patient onboarding, and document uploads on a strict timeline\r\nEnsure compliance with Medicare, Medicaid, and home healthcare regulations\r\nMonitor and enforce licensing requirements and regulatory deadlines\r\nMaintain and manage documentation within EMR platform Datasoft Logic\r\nAct as a compliance checkpoint to ensure accurate billing, regulatory documentation, and audit readiness\r\nWork closely with executive leadership to uphold operational excellence and ensure long-term agency viability\n\r\nWhy Work With Yellowstone Local:\r\n100% remote work setup with flexibility based on client needs\r\nBe part of a growing team that supports top-tier brands in the skilled trades\r\nReceive dedicated training and support from both Yellowstone Local and the client\r\nUnlock long-term growth opportunities and stability based on your performance\n\r\nWhat’s In It For You:\r\nFull-time remote position (preferably based in the Philippines)\r\n$4–$9/hour base rate (depending on experience)\r\nConsistent 45-hour work week\r\nLong-term opportunity with a high-retention team\r\nWork with a mission-driven company in the healthcare space\n\r\nJob requirements\r\nProven administrative experience in home healthcare (2+ years strongly preferred)\r\nDeep understanding of Medicare/Medicaid regulations and compliance requirements\r\nExperience managing documentation, patient onboarding, and care coordination\r\nProficiency with Datasoft Logic EMR system\r\nHigh-level organizational and delegation skills\r\nAbility to self-direct and work independently without constant supervision\r\nExcellent English comprehension (written) Preferred\r\nExperience working with California-based home health agencies\r\nFamiliarity with DOH-compliant documentation, including manuals and audits\r\nPast leadership in home healthcare agency administration",
  "skill_requirements": [
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:40:53.264603",
      "reason": "Job first discovered"
    }
  ]
}