{
  "job_id": "1423007",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Project-Manager-for-a-Creative-Media-Studio-1423007",
  "scraped_at": "2025-07-15T12:22:48.459017",
  "title": "Project Manager for a Creative Media Studio",
  "type_of_work": "Part Time",
  "salary": "$400/month",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "A growing creative media studio is looking for a highly organized and proactive Project Manager with excellent communication skills to help keep content production running smoothly. The team produces videos, podcasts, and social media content—and needs someone who can bring structure, clarity, and clear coordination to the process.\n\r\nIf you thrive on organizing moving parts, love timelines and task boards, and enjoy collaborating with creatives, this role is for you.\n\r\nKey Responsibilities:\n\r\n1. Manage production timelines and deliverables across video, podcast, and social media projects\n\r\n2. Assign, track, and follow up on tasks using project management tools (e.g., Trello, Asana, ClickUp)\n\r\n3. Maintain the content calendar and ensure assets are ready for publishing\n\r\n4. Coordinate between the leadership team and creative assistant to ensure smooth workflow\n\r\n5. Help create and maintain SOPs and workflows for recurring tasks\n\r\n6. Prepare regular project updates and progress reports for leadership\n\r\n7. Support with scheduling, meeting coordination, and light admin tasks\n\r\n8. Identify bottlenecks early and offer solutions to keep production on track\n\r\n9. Recommend and implement improvements to internal systems as the studio grows\n\n\r\nYou’re a great fit if you:\n\r\nHave previous experience as a Project Manager, ideally in a content or creative field\n\r\nAre confident using tools like Trello, Asana, ClickUp, or Notion\n\r\nCommunicate clearly, promptly, and professionally in both written and spoken English\n\r\nAre highly organized, self-directed, and comfortable working remotely\n\r\nCan stay a step ahead and keep things moving without constant oversight\n\n\r\nNice to Have:\n\r\n- Familiarity with content creation workflows (YouTube, podcasting, social media)\n\r\nExperience working with creatives or freelancers\n\r\n- Comfort using tools like Google Drive, Loom, Buffer, or Canva\n\n\r\nIf you believe you're a strong fit for this position, please respond with the following:\n\r\n1. A link to your resume in PDF format. \r\n - Your resume should include your contact details, a recent professional photo, and a summary of your work experience, emphasizing tasks relevant to this role.\n\r\n2. A screenshot of your PC specifications and internet speed, \n\r\n3. Your WhatsApp number for easy communication. \n\r\nTo ensure you've read this message carefully, please include the word \"Leadership\" in the subject line of your email.\n\r\nWe look forward to reviewing your application!",
  "skill_requirements": [
    "Project Management",
    "Administrative Support",
    "Communication"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:22:22.574003",
      "reason": "Job first discovered"
    }
  ]
}