{
  "job_id": "1423220",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Trend-Savvy-VA-for-Calendar-Content-Admin-Magic-1423220",
  "scraped_at": "2025-07-15T15:34:50.887583",
  "title": "Trend Savvy VA for Calendar, Content & Admin Magic",
  "type_of_work": "Full Time",
  "salary": "$693",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you the kind of person who…\n\r\n? Gets a weird sense of satisfaction from a perfectly cleaned-up inbox?\n\r\n? Loves color-coding a calendar almost as much as curating your Canva designs?\n\r\n? Spots trends before they blow up on TikTok?\n\r\n? Can juggle invoices, DMs, and IG Reels without dropping your matcha?\n\r\n? Dreams of supporting a powerhouse female entrepreneur while having your own major glow up?\n\r\nIf you're nodding like “OMG she’s talking to me”... I probably am.\n\r\nHi, I’m Lindsay, mom of 3, multi business owner, coach to beauty industry pros, and on the hunt for a creative, tech savvy, wildly organized Virtual Assistant to help me manage my empire (and inbox) with confidence and a little sparkle. ????????\n\r\nThis is not your average VA gig.\r\nThis is your chance to be the right hand to a woman who’s building something big and to be part of something that could level you up too.\n\r\n???? Here’s what your days might look like:\r\nFirst thing? \n\r\n?? Email cleanup: Delete spam, archive receipts, and flag anything I need to personally respond to (across multiple inboxes).\n\r\n???? Calendar check: Review my day and send me the schedule (plus any heads-up messages I need to know).\n\r\n???? Facebook Group support: Manage our exclusive community by vetting member requests with our guidelines.\n\r\n???? Call back new salon guests: Track them, follow the script, and help us create magic from the very first hello.\n\r\n???? Canva & content work: Help design, polish, and prep assets for social and branding. (Trendy design sense = major bonus!)\n\r\n???? Weekly/monthly admin: Think QuickBooks entries, payroll prep, ordering supplies, submitting sales tasks.\n\r\n???? You’ll thrive in this role if:\n\r\nYou’ve got a creative eye and can make Canva content pop like a pro.\n\r\nYou’re detail-obsessed but flexible when things shift fast.\n\r\nYou’re organized AF (but not afraid to get scrappy when needed).\n\r\nYou love supporting women building big, beautiful businesses.\n\r\nYou’re not afraid to send the “hey girl, check your calendar” text. ????\n\r\nYou’re tech fluent and social media aware (even better if you’ve got a little editing flair too).\n\r\n???? This job’s not for you if:\n\r\nYou need step by step instructions for everything\n\r\nYou don’t like variety or fast-paced environments\n\r\nYou roll your eyes at glitter or Beyoncé (seriously, who's like this?!)\n\r\nThis is a remote, full time position (40 hrs/week) with reliable scheduling and serious room to grow—especially if you’re entrepreneurial or brand-minded yourself.\n\r\n???? How to Apply:\r\nSend a short video (or message) to --- Upgrade to see actual info --- (put it all together) with the subject line:\n\r\n\"Your New Virtual Assistant Reporting for Duty\"\n\r\nPlease share:\n\r\nWhy this role caught your eye\n\r\nOne thing you’re amazing at (that most people overlook)\n\r\nYour current favorite aesthetic or trend you’re loving on social\n\r\nLet’s glow up together.\r\nI’m hiring ASAP—so if your gut says “this is me,” don’t wait.\n\r\n???? Let’s make inboxes, businesses, and brands beautiful together.",
  "skill_requirements": [
    "Video Editing",
    "English Speaking",
    "Canva"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:34:50.889679",
      "reason": "Job first discovered"
    }
  ]
}