{
  "job_id": "1423147",
  "url": "https://www.onlinejobs.ph/jobseekers/job/VTuber-Content-Creator-Editor-Wanted-Full-Time-Remote-1423147",
  "scraped_at": "2025-07-15T15:34:55.314206",
  "title": "VTuber Content Creator & Editor Wanted (Full-Time, Remote)",
  "type_of_work": "Full Time",
  "salary": "$420-$750",
  "hours_per_week": "45",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Are you obsessed with VTubers? Watch their streams for hours? Know the difference between a mid-tier clip and a viral banger?\n\r\nIf yes, this job might be made for you\n\r\nWe run multiple fast-growing YouTube channels focused on the VTuber niche: short, high-retention clips that fans love to watch.\n\r\nNow, we’re looking for a talented clipper + editor to help us bring the best Upgrade to see actual infonts to life.\n\r\nYou’re a Great Fit If You:\r\n-> Already follow Hololive, VShojo, indies, or JP/EN VTubers\r\n-> Understand what fans want (awkward Upgrade to see actual infonts, spicy drama, emotional reveals, dating stories)\r\n-> Have basic editing experience (CapCut, Premiere, etc.)\r\n-> Can design simple thumbnails + write clickable titles\r\n-> Want a stable, long-term opportunity in the content world\n\r\nWhat You’ll Do:\r\n-> Watch stream VODs and spot viral-worthy Upgrade to see actual infonts\r\n-> Edit clips using zooms, subtitles (basic and simple video editing)\r\n-> Make simple thumbnails that pop\r\n-> Suggest titles that make sense and make people click\r\n-> Submit daily videos and grow over time with feedback\n\r\nExamples of What We’re Aiming For:\nUpgrade to see actual info\nUpgrade to see actual info\nUpgrade to see actual info\n\r\n(Note: These are just examples, and are NOT our channels)\n\r\nCompensation & Perks:\r\n-> $420–$750/month depending on skill, consistency, and results\r\n-> Performance bonuses as we scale\r\n-> 100% Remote: work from anywhere\r\n-> Flexible hours option: as long as the job gets done\r\n-> Long-term path to higher paying positions, such as team lead (manager) or even a lead manager role managing multiple channels and multiple people working under you\n\r\nApply Here:\nUpgrade to see actual info\n\r\nWe’re not looking for a freelancer. This is a long-term journey.\r\nIf you live and breathe VTuber content, let’s turn your passion into a paycheck.",
  "skill_requirements": [
    "Thumbnail & Social Media Design",
    "Video Editing",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:35:24.533407",
      "reason": "Job first discovered"
    }
  ]
}