{
  "job_id": "1423106",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Virtual-Dental-Assistant-1423106",
  "scraped_at": "2025-07-15T15:37:12.647355",
  "title": "Virtual Dental Assistant",
  "type_of_work": "Full Time",
  "salary": "$5 per hour in the first 3 months and $6 per hour in the succeeding months",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Position Type: Full-Time\r\nWork Hours: 9:00 AM – 6:00 PM CST\r\nWork Days: Monday – Friday\r\nSalary: $5 - $6 per hour, depending on experience\n\n\r\nPosition Summary\r\nWe are looking for a cheerful, outgoing, and professional Virtual Dental Assistant to join our team and support our front office operations. You will play a vital role in patient communication, appointment scheduling, insurance verification, and general administrative support. This is a remote position that requires prior experience in dental administration and a strong command of dental software and systems.\n\r\nKey Responsibilities\r\nManage patient scheduling within the EHR system, Practice Works\r\nConduct follow-ups and recall calls for unscheduled treatments and recare appointments\r\nConfirm upcoming appointments by phone and other communication platforms\r\nVerify dental insurance coverage and input accurate data and billing codes into the system\r\nProvide courteous, professional responses to patient inquiries via phone and messaging\r\nSupport administrative tasks such as document uploads, data entry, and patient record management\r\nUse platforms such as Weave, Vyne, and insurance websites to support daily operations\r\nEnsure a positive, empathetic patient experience in all interactions\r\nBe flexible with working hours to handle off-hour recalls or scheduling as needed\n\r\nExperience Requirements\n\r\nRequired:\r\nPrior experience working as a virtual assistant in a dental or medical setting\r\nExperience with dental EHR systems (Practice Works, Dentrix, or similar)\r\nFamiliarity with insurance verification and dental billing procedures\n\r\nPreferred but not required:\r\nMedical/dental-related education or certification\r\nExperience with software platforms like Weave, Vyne, and using insurance provider websites\r\nBackground in a clinical dental office setting\n\r\nPlease use ITALY as your sublject line\r\nAdditional Application Requirement:\r\nInclude a professional intro video/audio, providing your work experience related to this role (2mins. max.)\r\nProvide your most recent CV",
  "skill_requirements": [
    "Customer Support",
    "Insurance Verification"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:42:10.128705",
      "reason": "Job first discovered"
    }
  ]
}