{
  "job_id": "1423141",
  "url": "https://www.onlinejobs.ph/jobseekers/job/DIRECTOR-OF-GUEST-EXPERIENCE-HOSPITALITY-Renjoy-Short-Term-Rentals-1423141",
  "scraped_at": "2025-07-15T14:35:35.009069",
  "title": "DIRECTOR OF GUEST EXPERIENCE & HOSPITALITY - Renjoy Short Term Rentals",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "50",
  "date_updated": "Jul 15, 2025",
  "job_overview": "APPLY HERE: jobs.polymer.co/renjoy/35365\n\r\nDIRECTOR OF GUEST EXPERIENCE\n\r\nWHY JOIN US\\\r\nAt Renjoy, we’re redefining hospitality in the short-term rental industry. As one of Colorado’s fastest-growing vacation rental companies, we’re scaling from 200 to over 1,000 properties across multiple markets. Our success hinges on delivering 5-star guest experiences, powered by innovative systems and a team of global all-stars who thrive on ownership and excellence.\n\r\nRenjoy is proud to have a diverse and inclusive team of 78 full-time employees who are fully integrated into our mission. This includes 35 cleaners, 8 maintenance technicians, 10 teaUpgrade to see actual infombers in our Colorado Springs office, and 25 professionals worldwide, primarily in Latin America (LATAM) and the Philippines (PH). These dedicated teaUpgrade to see actual infombers support critical functions like customer service, accounting, HR, and revenue management, ensuring every aspect of our business runs smoothly. We are committed to fostering an inclusive global team where everyone is valued and empowered to succeed, no matter where they’re located.\n\r\nThis is your chance to join a future-focused, high-performance team as a key leader. If you’re ready to make a massive impact, shape the guest experience at scale, and grow with a company setting new standards in hospitality, this role is for you.\n\r\nROLE PURPOSE\\\r\nAs the Director of Guest Experience, you’ll take full ownership of our Guest Experience department at a leadership level. You’ll lead a 24/7 global communications team with agents in LATAM and the Philippines, driving exceptional service as we expand.\n\r\nThis mission-critical position puts you on our leadership team, where you’ll scale systems and processes for rapid growth, elevate guest satisfaction to maintain our reputation for excellence, and shape the direction of a department that’s pivotal to Renjoy’s success. You’ll collaborate cross-functionally with Operations and Housekeeping, act as the voice of the guest, and ensure our service standards soar as we grow from 200 to 1,000+ properties.\n\r\nOUR CORE VALUES\\\r\nSee Something, Do Something: Take initiative to solve problems.\\\r\nDo What You Say: Deliver on promises, even under pressure.\\\r\nMake It Better: Continuously improve processes and outcomes.\\\r\nOwn the Miss: Admit mistakes, fix them, and learn.\\\r\nSay the Hard Thing: Communicate honestly and constructively.\\\r\nWe’re looking for a leader who embodies these values and inspires their team to do the same.\n\r\nRESPONSIBILITIES\\\r\nLead a Global Team: Manage and mentor a 24/7 guest experience team (6-10 agents and growing) across LATAM and PH. Set ambitious goals and coach your team to exceed metrics like response times, resolution rates, and guest satisfaction.\\\r\nScale Systems & SOPs: Design and refine workflows and SOPs to ensure consistent, high-quality service as we grow. Leverage tech and automation to streamline operations.\\\r\nCollaborate Cross-Functionally: Partner with Operations, Housekeeping, and Maintenance to deliver seamless guest experiences. Turn feedback into actionable improvements.\\\r\nDrive Training & Quality: Build training programs to elevate service standards and problem-solving skills. Keep SOPs and knowledge bases cutting-edge.\\\r\nHandle Escalations: Resolve complex guest issues with professionalism and empathy. Coach your team on de-escalation and service recovery.\\\r\nBoost Satisfaction & Revenue: Lead initiatives to enhance guest loyalty and drive upsells (e.g., late check-outs, mid-stay cleanings).\\\r\nChampion the Guest: Use guest insights to recommend improvements in policies, amenities, or processes that elevate our portfolio.\n\r\nREQUIREMENTS\\\r\nHospitality Leadership: 5+ years managing large guest service teams, ideally in short-term rentals, hotels, or property management. You’ve scaled operations without compromising quality.\\\r\nSystems Expertise: Proven ability to build scalable workflows and SOPs. You’re a systems thinker who creates efficiency.\\\r\nTop-Notch Communication: Exceptional written and verbal skills (English fluency required). You’re clear, professional, and empathetic.\\\r\nPerformance Driven: A track record of improving team performance and guest satisfaction metrics using data.\\\r\nRemote Leadership: Experience leading distributed teams and collaborating across departments in a fast-paced, remote setting.\n\r\nPREFERRED QUALIFICATIONS\\\r\nTool Savvy: Familiarity with Guesty, Breezeway, Akia, Slack, or Airtable.\\\r\nGlobal Experience: Managed teams across time zones and cultures.\\\r\nStartup Mindset: Thrive in dynamic environments with a bias toward action and ownership.\n\r\nKEY METRICS YOU’LL OWN\\\r\nGuest rating scores (public and internal feedback)\\\r\nResponse time and resolution rate\\\r\nIssue recovery success rate\\\r\nUpsell & orphan night revenue\\\r\nAgent performance (conversation quality, schedule adherence)\n\r\nYOU’RE A GREAT FIT IF YOU…\\\r\nHave 5+ years in hospitality, with 3+ as a Guest Experience Manager or similar.\\\r\nHave led teams of 5+ across shifts/time zones.\\\r\nCan coach agents, build SOPs, and fix broken processes.\\\r\nThrive in fast-paced settings and love daily challenges.\\\r\nExcel in English with strong guest-facing communication.\\\r\nStay calm under pressure and de-escalate conflicts.\\\r\nAre tech-savvy, organized, and self-managing remotely.\n\r\nLOCATION\\\r\nFully remote, with a preference for LATAM for time zone alignment. Exceptional candidates from the Philippines or elsewhere are welcome. You’ll coordinate with a global team for 24/7 guest coverage.\n\r\nIN-PERSON OPPORTUNITIES\\\r\nJoin us in Colorado for our annual planning meeting to shape strategy with leadership (travel covered).\\\r\nRepresent Renjoy at U.S.-based conferences to network and stay ahead of trends (travel covered).\n\r\nPERKS & BENEFITS\\\r\nFlexible Remote Work: Enjoy freedom in a results-driven culture.\\\r\nMassive Impact: Shape the guest experience as we grow from 200 to 1,000+ properties.\\\r\nDynamic Culture: Join a high-trust, ambitious team that values innovation and initiative.\n\r\nREADY TO REDEFINE HOSPITALITY?\\\r\nIf you’re a rockstar leader ready to own the guest experience, scale systems, and grow with an innovative team, apply now. Be a key player in our exciting journey to 1,000+ properties and beyond!\n\r\nAPPLY HERE: jobs.polymer.co/renjoy/35365",
  "skill_requirements": [
    "Airbnb",
    "Customer Service",
    "Team Leadership"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:30:28.542628",
      "reason": "Job first discovered"
    }
  ]
}