{
  "job_id": "1423156",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Full-Time-YouTube-Content-Creator-700month-Long-Term-Job-1423156",
  "scraped_at": "2025-07-15T14:37:42.489781",
  "title": "Full Time YouTube Content Creator – $700/month (Long Term Job)",
  "type_of_work": "Full Time",
  "salary": "700",
  "hours_per_week": "45",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Hey lovely people - we have a new full-time job opening - see details below!\n\r\nJob position: Female YouTube Content Creator (not a video editor!)\r\nPay: $700/month\r\nSchedule: Full-time, long-term job (Monday to Friday 8-9 hrs daily)\r\nOutput: 10-15 long-form YouTube videos/week, ~10?minutes each\r\nLocation: Remote\n\r\nWhat You'll Do\r\nAppear on camera using a webcam talking about online business tools and strategies (training provided).\n\r\nDeliver engaging, high-energy videos in English - confident, clear, and charismatic.\n\r\nFollow our strategy and guidance (full training provided.)\n\r\nOptional basic video edit skills (e.g. trimming intros/outros) is a nice-to-have - but not mandatory\n\r\nMust-Have Skills\r\nFluent English (speaking & writing) with strong on-camera presence\n\r\nConfidence and personality: DON’T sound robotic or dull\n\r\nReliable full-time commitment - this is a full time job - not a gig\n\r\nComfortable filming yourself daily for YouTube videos about online business\n\r\nWhy Join Us?\r\nSteady monthly salary, stable UK business\n\r\nSupportive setup: strategy, scripts, coaching all provided\n\r\nEquipment covered: webcam purchase offered if needed\n\r\nOnce again, this job is for FEMALE content creator only. And also if you can make basic YouTube webcam videos and have a really good level of English (speaking and writing)! Also you must be available FULL TIME 40-50 hours per week.\n\r\nHow to apply: send us an email into Upgrade to see actual info\r\nNo need for CV - better send us some video examples or videos that you have created yourself as UGC creator (long form or short form for YouTube, TikTok or Instagram).\n\r\nP.S. we've been hiring people from Philippines for 7 years, some have worked for us for 5 years full time, so we are nice people and get along really well. Looking forward to speak to you!",
  "skill_requirements": [
    "Influencer Marketing",
    "Video Content Creation",
    "Influencer Content Creation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:37:42.491768",
      "reason": "Job first discovered"
    }
  ]
}