{
  "job_id": "1423103",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Senior-SEO-Specialist-1423103",
  "scraped_at": "2025-07-15T15:40:08.730753",
  "title": "Senior SEO Specialist",
  "type_of_work": "Any",
  "salary": "TBN",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Senior SEO Specialist\n\r\nCompany:\r\nWe are a dynamic marketing agency serving primarily North American clients with a strong focus on digital marketing strategies. Our team is dedicated to delivering exceptional results and exceeding client expectations through innovative solutions.\n\r\nPosition Overview:\r\nWe are seeking a Senior SEO Specialist who specializes in Search Engine Optimization (SEO) to join our team on a project-to-project or part-time basis. As an SEO Expert, you will collaborate closely with our team to enhance our clients' online presence and drive organic traffic to their websites.\n\r\nResponsibilities:\r\n- Conduct keyword research and analysis to guide content creation and optimization strategies.\r\n- Perform on-page SEO optimizations including meta tags, headers, internal linking, etc.\r\n- Execute off-page SEO activities such as link building, directory submissions, and outreach.\r\n- Monitor and report on SEO performance metrics using tools like Google Analytics, SEMrush, or similar platforms.\r\n- Stay updated with the latest SEO trends, algorithms, and best practices.\n\r\nRequirements:\r\n- Proven experience as an SEO Specialist or similar role with a strong portfolio of successful SEO projects.\r\n- Proficiency in SEO tools such as Google Analytics, Google Search Console, Ahrefs, Moz, etc.\r\n- Solid understanding of on-page and off-page SEO techniques.\r\n- Excellent written and verbal communication skills in English.\r\n- Ability to work independently and remotely with minimal supervision.\r\n- Detail-oriented and analytical mindset with a proactive approach to problem-solving.\r\n- Experience working with North American clients is a plus.\n\r\nSchedule:\r\n- Flexible hours depending on project requirements and deadlines.\n\r\nBenefits:\r\n- Competitive compensation based on experience and project scope.\r\n- Opportunity to work with diverse clients and industries.\r\n- Professional growth and development in the field of digital marketing.\r\n- Flexible work schedule and remote working environment.\n\r\nHow to Apply:\r\nInterested candidates are invited to send a message with their resume and portfolio showcasing relevant SEO projects.",
  "skill_requirements": [
    "Blogging",
    "Google Ads",
    "SEO"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:43:50.747490",
      "reason": "Job first discovered"
    }
  ]
}