{
  "job_id": "1423016",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Webflow-developer-1423016",
  "scraped_at": "2025-07-15T15:40:34.839549",
  "title": "Webflow developer",
  "type_of_work": "Gig",
  "salary": "N/A",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Webflow Developer\r\nLocation: Remote\r\nJob Type: Freelance (Flexible)\r\nSalary: Competitive, based on experience\n\r\nAbout Us:\r\nWe’re a growing digital team looking to bring on a talented Webflow Developer to help design, build, and optimize beautiful, functional websites. Whether it’s launching new marketing sites, improving existing user experiences, or building from Figma prototypes, you’ll play a critical role in creating web experiences that convert and inspire.\n\r\nKey Responsibilities:\r\n • Design, develop, and maintain responsive websites using Webflow\r\n • Translate Figma or Adobe XD designs into fully functional Webflow pages\r\n • Collaborate with designers, marketers, and content creators to implement site updates\r\n • Optimize websites for performance, SEO, and accessibility\r\n • Set up Webflow CMS collections and dynamic content\r\n • Troubleshoot bugs and provide technical support when needed\r\n • Stay up to date with Webflow updates, features, and best practices\n\r\nRequirements:\r\n • Proven experience building and maintaining websites in Webflow\r\n • Strong understanding of HTML, CSS, and Webflow’s visual development interface\r\n • Experience with Webflow CMS and site animations/interactions\r\n • Familiarity with SEO fundamentals and responsive design principles\r\n • Attention to detail and passion for clean, maintainable design\r\n • Ability to manage multiple projects and deadlines\r\n • Bonus: Experience with Zapier, Make (Integromat), or other automation tools\n\r\nNice to Have:\r\n • UI/UX design experience\r\n • JavaScript familiarity\r\n • E-commerce experience with Webflow (e.g., Webflow Ecommerce or Shopify integrations)\n\r\nWhy Join Us?\r\n • Fully remote work and flexible hours\r\n • Collaborative, supportive, and creative environment\r\n • Opportunities to grow and take ownership of projects\r\n • Work on diverse and exciting digital products\n\r\nHow to Apply:\r\nPlease send your portfolio, resume, and a brief note about why you’re a great fit to Include links to Webflow projects you’ve built",
  "skill_requirements": [
    "Webflow",
    "Webflow"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:23:03.940106",
      "reason": "Job first discovered"
    }
  ]
}