{
  "job_id": "1423172",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Credit-Repair-Disputer-1423172",
  "scraped_at": "2025-07-15T15:30:04.883053",
  "title": "Credit Repair Disputer",
  "type_of_work": "Any",
  "salary": "1000/month",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "The Credit Disputer is responsible for preparing and submitting credit disputes on behalf of clients to credit bureaus and creditors. This role requires strong attention to detail, excellent communication skills, and a solid understanding of credit reporting laws such as the Fair Credit Reporting Act (FCRA).\n\r\nKey Responsibilities:\r\nAnalyze client credit reports from major credit bureaus (Equifax, Experian, and TransUnion)\r\nIdentify inaccurate, outdated, or unverifiable information\r\nPrepare and submit dispute letters to credit bureaus and/or creditors\r\nTrack dispute statuses and follow up as needed\r\nUpdate client records with dispute outcomes\r\nMaintain compliance with all relevant regulations and company policies\r\nCommunicate with clients regarding progress and expectations\r\nStay up to date on credit repair industry trends and best practices\n\r\nQualifications:\r\nExperience in credit repair or financial services preferred\r\nKnowledge of credit reporting laws (FCRA, FDCPA, etc.)\r\nStrong written communication and organizational skills\r\nComfortable using CRM systems and digital tools\r\nHigh attention to detail and data accuracy\r\nAbility to manage multiple client files simultaneously\r\nBilingual is a plus, but not required\n\r\nFamiliar with CRC is Mandatory!!\r\nKnowledge of:\n\r\nEquifax data Breach\r\n3b sweep\r\nTransunion sweep\r\nFTC\r\nIdentity Theft Affidavits\r\ninquiry removal\n\n\r\nSomeone who is knowledgeable with Chex systems/ EWS processing",
  "skill_requirements": [
    "Credit Repair",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:37:37.925717",
      "reason": "Job first discovered"
    }
  ]
}