{
  "job_id": "1423142",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Digital-Marketing-Specialist-Content-Generator-Administrative-Assistant-1423142",
  "scraped_at": "2025-07-15T14:30:23.399242",
  "title": "Digital Marketing Specialist /Content Generator, Administrative Assistant",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Overview:\r\nWe are seeking a highly motivated and organized individual to serve as a Digital Marketing Specialist and Administrative Assistant. This dual-role position is ideal for someone with a strong understanding of digital marketing strategy and tools, paired with excellent administrative and organizational skills. The ideal candidate will manage digital marketing efforts across multiple companies while supporting day-to-day administrative operations.\n\r\nKey Responsibilities:\n\r\nDigital Marketing Duties\r\n • Develop and implement digital marketing strategies tailored to each company’s goals\r\n • Manage and grow multiple social media accounts including content scheduling, engagement, and analytics\r\n • Oversee SEO best practices, website updates, and search engine rankings\r\n • Create and manage Google Ads and other online advertising campaigns\r\n • Generate and post high-quality still content using provided images and information\r\n • Track campaign performance and prepare regular marketing reports\n\r\nAdministrative Duties\r\n • Handle day-to-day administrative tasks including filing, data entry, document organization, and scheduling\r\n • Assist in client communication and ensure a high level of customer service\r\n • Maintain organized records and support operational efficiency across the companies\r\n • Coordinate meetings, manage calendars, and support logistics for team or client engagements\n\r\nQualifications:\r\n • Proven experience in digital marketing and administrative support\r\n • Proficiency in social media platforms, Google Ads, SEO tools, and content creation\r\n • Strong written and verbal communication skills\r\n • Highly organized, self-motivated, and detail-oriented\r\n • Ability to manage multiple tasks and priorities efficiently\r\n • Comfortable working independently and as part of a team",
  "skill_requirements": [
    "Personal Assistant",
    "Digital Marketing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:30:23.400962",
      "reason": "Job first discovered"
    }
  ]
}