{
  "job_id": "1423225",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Blog-Writing-Social-Media-Specialist-1423225",
  "scraped_at": "2025-07-15T15:41:55.333903",
  "title": "Blog Writing / Social Media Specialist",
  "type_of_work": "Full Time",
  "salary": "$500",
  "hours_per_week": "50",
  "date_updated": "Jul 15, 2025",
  "job_overview": "You will need to dig and find from our customers account and our social media accounts to find blog projects. Save the photos/videos, add them to our website, and make YouTube videos as well. You must optimize the photos.\n\r\nWrite authentic blogs quickly and efficiently without using AI or ChatGPT programs. Must follow format and be easy to learn. Knowing Shopify and YouTube is needed to make videos from the photos customers send.\n\r\nThis role also includes administrative work, such as creating OEM inquiries and other assigned tasks as needed.\n\r\nBlog Example:\nUpgrade to see actual info\n\r\nQualifications and Requirements:\r\n- Must follow format and be easy to learn\r\n- Must be self motivated, quick learner\r\n- Attention to Detail is a must\r\n- Must write authentic blogs quickly and efficiently without using AI or ChatGPT programs\r\n- Must know Shopify and YouTube to create videos from customer photos\r\n- Must optimize photos and videos\r\n- Must be able to search our customers socials (Facebook, Instagram & TikTok) for Upgrade to see actual info or projects\r\n- Must complete administrative work, including creating OEM inquiries and other tasks\r\n- Must use Hubstaff (Time Tracker) to track all work hours\r\n- Must use assigned work email, Slack, and Asana\r\n- Must be available to work 7 AM – 6 PM EST (includes 1 hr unpaid break), including USA holidays\r\n- Must only work on Tamco Projects during work hours",
  "skill_requirements": [
    "Blogging",
    "Social Media Content Creation",
    "Writing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:41:55.336008",
      "reason": "Job first discovered"
    }
  ]
}