{
  "job_id": "1423209",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Support-Employee-1423209",
  "scraped_at": "2025-07-15T15:43:18.073150",
  "title": "Customer Support Employee",
  "type_of_work": "Part Time",
  "salary": "$3 per hour",
  "hours_per_week": "12",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Dear,\n\r\nWe run an eCommerce dropshipping business with a fashion store in the UK.\n\r\nWe are looking for a long-term employee to join our team. There is a great deal of growth opportunity for those that consistently make a positive contribution to our company. We are seeking great candidates that will represent the company with great customer service and dedication.\n\r\nSo essentially this is a Customer Support job where you would have to follow a very clear process to keep our customers happy, but which will become very simple when you understand every step.\n\r\nMUST HAVE KNOWLEDGE OF THESE PLATFORMS:\n\r\nGoogle Workspace (E-mail platform)\r\nShopify (eCommerce platform)\r\nSlack (communication channel)\r\nDeepL ( for translation)\n\r\nResponsibilities:\n\r\nHandling customer complaints.\r\nReporting on refunds/complaints.\r\nResponding to customer emails regarding refunds, tracking numbers, FAQs.\r\nContributing to our documentation and improving our support processes.\r\nRespond to all customer inquiries in a timely and accurate manner.\r\nWe maintain an ETA of 24 hours so you must reply to the emails within this timeframe.\r\nDemonstrate a high level of professionalism at all times.\n\r\nWe will provide you with:\n\r\nVideo training\r\nSOP to follow\r\nAccess to the Lead customer support to answer all your questions.\n\r\nApplicant needs to:\n\r\nSpeak fluent English both written and verbally\r\nMinimum 2 years of experience in Customer Support\r\nBe available for weekly team calls \r\nMust be organized, motivated, and willing to learn and grow.\r\nAvailable to join immediately\n\r\nBe available for a minimum of 12 hours per week, around 2 hours a day. Not currently working for other full-time jobs\n\r\nIdeally, you'll have some experience with customer support, but ultimately we want to work with someone who loves helping people and is interested in handling customer support issues. I don't want any inconsistency in the emails exchanged with the customer. Example: twice the same email, imprecise answer, off-topic answer, etc.\n\r\nPlease respond by telling me what similar experience you have had before and tell me why you think you are a good fit for this job!\n\r\nI look forward to your proposal.\n\r\nThank you.\r\nAsh",
  "skill_requirements": [
    "Customer Support"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:43:18.074721",
      "reason": "Job first discovered"
    }
  ]
}