{
  "job_id": "1423131",
  "url": "https://www.onlinejobs.ph/jobseekers/job/OnOffboarding-Optimization-Customer-Relations-Specialist-Airbnb-STR-Property-Management-6hr-1423131",
  "scraped_at": "2025-07-15T15:44:27.185561",
  "title": "On/Offboarding, Optimization, & Customer Relations Specialist | Airbnb - STR Property Management | $6/hr",
  "type_of_work": "Full Time",
  "salary": "$6/hr + bonus depending on performance",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a fast-growing U.S.-based short-term rental (Airbnb) property management company operating in over 10 states. Our team is remote-first and performance-driven. We specialize in turning underperforming vacation rentals into high-earning listings through smart pricing, guest support, and streamlined operations.\n\r\nWe’re looking for a highly detail-oriented and proactive teaUpgrade to see actual infomber to join our operations department. This role focuses on onboarding and offboarding property owners, optimizing listings for performance, and supporting night-shift guest/client relations. If you’re organized, tech-savvy, and ready to handle both behind-the-scenes systems and guest-facing tasks, this is for you.\n\n\r\nKey Responsibilities\n\r\nListing Optimization:\r\n• Audit, update, and align property listings across all platforms (Airbnb, VRBO, etc.)\r\n• Improve listing titles, descriptions, photo sequences, and amenities for better performance\r\n• Maintain and update our internal listing database with accuracy\r\n• Ensure internal teams are informed of listing changes or updates\r\n• Create and improve SOPs related to listing structure, edits, and standards\n\r\nOnboarding (New Properties):\r\n• Guide new owners through onboarding calls and gather key property information\r\n• Create listings based on client-provided details and supplemental research\r\n• Communicate with internal departments to ensure smooth handoff to operations and guest support\r\n• Ensure all internal documents and trackers are complete and accurate\r\n• Improve onboarding workflows and documentation over time\n\r\nOffboarding (Client Offboarding):\r\n• Lead the process for delisting and transitioning off departing properties\r\n• Secure and archive listing data before deletion\r\n• Notify accounting/finance and operations of offboarding timelines\r\n• Ensure all records and permissions are closed and properly removed\r\n• Create and maintain SOPs related to offboarding and client exits\n\r\nCustomer Relations Support (as needed):\r\n• Assist with guest/client messages and concerns during night hours\r\n• Handle time-sensitive check-in/property issues or urgent guest requests\r\n• Maintain high professionalism and service quality in overnight communications\r\n• Support the day team by prepping notes, updates, or escalations from the night shift\n\n\r\nRequirements\n\r\n• Excellent written and spoken English\r\n• Experience in Airbnb, STR operations, or property management is preferred\r\n• Organized and detail-oriented with strong follow-through\r\n• Confident using Hostaway, Slack, Airbnb, CRM tools, and Google Workspace\r\n• Strong communication and client-facing experience for onboarding calls\r\n• Willing to work night/overnight EST hours\r\n• Capable of working independently during overnight hours with minimal supervision\r\n• Fast learner with a systems mindset who’s confident improving processes\r\n• Reliable internet connection\n\n\r\nSalary & Growth\r\n• $6/hr + bonus depending on performance\r\n• Bonuses for great performance and added value\r\n• Long-term position with opportunity to move into team lead roles\n\n\r\nBonus Tasks for Potential Bonuses/Raises\r\n• Create and improve templates, SOPs, and internal materials\r\n• Take initiative on new tool integrations or process automations\r\n• Ensure all action items are done and communicated to correct teaUpgrade to see actual infomber for further action\r\n• Lead optimization reviews to improve property performance\r\n• Support our sales team by calling or messaging property owner leads\n\n\r\nHow to Apply (All Steps Required)\r\n1. Send a 2-minute voice recording introducing yourself:\r\n• Share your experience in onboarding, listing creation/editing, or STR operations\r\n• Talk about a time you improved a system, process, or listing outcome\r\n• Tell a short story about how you resolved a tough guest issue and what did you learn from it\r\n• Use Vocaroo or a Drive link (set to public)\n\r\n2. How would you proceed to improve this Airbnb listing: Upgrade to see actual info/rooms/Upgrade to see actual info• Provide 5 bullet points on how to improve this listing to drive more bookings, be very specific\r\n• Explain why you’d make each change\n\r\n3. Attach your resume with your current work status and past experience\n\n\r\nWhy Join Us\r\n• Long-term remote job with stable bi-weekly pay\r\n• Bonus pay for high-quality work\r\n• Team that values results, initiative, and consistency\r\n• Fast-growing company in the Airbnb space\n\n\r\nWe’re actively interviewing. Apply now!",
  "skill_requirements": [
    "Property Management",
    "Airbnb",
    "Customer Support"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:39:15.379726",
      "reason": "Job first discovered"
    }
  ]
}