{
  "job_id": "1423011",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Growth-Marketing-Demand-Generation-Specialist-B2B-Focus-1423011",
  "scraped_at": "2025-07-15T12:31:00.858329",
  "title": "Growth Marketing & Demand Generation Specialist (B2B Focus)",
  "type_of_work": "Any",
  "salary": "1000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Growth Marketing & Demand Generation Specialist (B2B Focus)\n\r\nLocation: Remote (Must be available during U.S. business hours)\n\r\nAbout the Role:\n\r\nWe’re looking for a seasoned B2B Growth Marketer with a strong track record of driving net new sales meetings through creative and data-driven marketing. This is not a role for someone who needs hand-holding. You’ll be expected to take high-level direction and rapidly translate it into well-executed, measurable campaigns across the digital ecosystem.\n\r\nIf you thrive in ambiguity, have mastery over AI tools for data/list creation and outreach, and can move from strategy to execution with confidence — this is your role.\n\r\n?\n\r\nKey Responsibilities:\r\n • Drive pipeline growth through full-funnel demand generation tactics (paid, organic, outbound, event-based, and referral programs).\r\n • Build and execute outbound list strategies using AI tools (e.g., Clay, ChatGPT, Apollo, LinkedIn Sales Navigator).\r\n • Design, launch, and optimize cold email and social outreach campaigns to book qualified meetings.\r\n • Create and iterate landing pages, lead magnets, and email sequences that convert.\r\n • Collaborate with leadership and sales to understand ICPs and messaging that resonates with buyers.\r\n • Monitor, report, and optimize KPIs across the funnel — from lead to booked meeting.\r\n • Own growth campaigns end-to-end with minimal direction and high output.\r\n • Manage marketing ops tools (HubSpot or similar) and workflows to ensure clean handoffs to sales.\r\n • Contribute to broader digital strategy and execution across paid media, SEO, and social if needed.\r\n • Support and collaborate on cross-functional initiatives (events, webinars, partnerships).\n\r\n?\n\r\nRequirements:\r\n • 5+ years of experience in B2B growth marketing and/or demand generation.\r\n • Strong command of English with persuasive writing chops (especially for outbound copy).\r\n • Demonstrated ability to generate pipeline through outbound channels and AI-powered workflows.\r\n • Mastery of modern marketing and automation tools (HubSpot, Clearbit, LinkedIn, N8N, etc.).\r\n • Deep understanding of how to segment, enrich, and nurture leads using data and behavioral triggers.\r\n • Strong grasp of positioning, testing, and rapid iteration.\r\n • Highly self-directed and able to execute without waiting for permission.\r\n • Availability during standard U.S. business hours (Eastern or Central preferred).\n\r\n?\n\r\nBonus Points:\r\n • Experience working in or with SaaS or Fintech (especially wealthtech).\r\n • Familiarity with the U.S. financial advisory space and/or private investing.\r\n • Experience running and optimizing B2B podcast or media-based demand campaigns.\r\n • Working knowledge of AI-enabled growth strategies (e.g., automating outbound, content repurposing, etc.).\r\n • Comfortable building and managing lightweight ad campaigns (LinkedIn, Meta, Google).\n\r\n?\n\r\nWhat Success Looks Like:\r\n • You consistently generate qualified sales meetings every week.\r\n • You reduce CAC and shorten the sales cycle through better targeting and messaging.\r\n • You build predictable, repeatable marketing motions that can scale.\r\n • You proactively identify new growth opportunities and act on them.\n\r\n?\n\r\nWhat You’ll Get:\r\n • The freedom to build your playbook — we care about results, not micromanagement.\r\n • A chance to work alongside founders and leadership to directly impact growth.\r\n • Exposure to a modern tech stack and opportunity to test your ideas rapidly.\r\n • Room to grow your role as the company scales.\n\r\n?\n\r\nTo Apply:\n\r\nSend us 2–3 short bullet points about:\r\n 1. The most successful growth play you’ve personally run.\r\n 2. Your favorite AI tool and how you use it.\r\n 3. A link to a campaign (or message) you wrote that worked.\n\r\n?\n\r\n? Additional elements you might want to include:\r\n • Clarify ownership of pipeline targets (e.g., are they solely responsible or part of a shared goal with sales?).\r\n • Clarify budget authority — can they run ads, hire freelancers, use tools freely?\r\n • Clarify structure — Will they report to a CMO, CEO, or work independently?\r\n • Mention tools you’re already using — HubSpot Pro, N8N, Snowflake, etc., to attract relevant experience.",
  "skill_requirements": [
    "Email Marketing",
    "Marketing Automation",
    "Lead Generation"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:28:02.944985",
      "reason": "Job first discovered"
    }
  ]
}