{
  "job_id": "1423195",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Looking-for-COO-ROLE-in-7-figure-Ecom-Business-serious-applications-only-1423195",
  "scraped_at": "2025-07-15T15:36:18.759725",
  "title": "Looking for COO-ROLE in 7-figure Ecom Business (serious applications only!!)",
  "type_of_work": "Full Time",
  "salary": "1280",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Dear Prospective Virtual Assistants,\n\r\nI am seeking a General Assistant to support various tasks essential for the smooth operation of our 7-figure ECOM business. \n\r\nInitially, this will be a part-time role with the potential to evolve into a full-time position as responsibilities increase. Fulltime can be more than just 40-H per week. Take in mind that if you like a work-life balance, than you shouldn't apply.\n\r\nKey Responsibilities:\n\r\n- Daily management of business emails.\r\n- Creation of a Shopify store following specific instructions.\r\n- Handling document and information submissions for Stripe and bank reviews.\r\n- Managing financial tasks, including data entry of daily profit and loss sheet.\r\n- Monitoring whether our teaUpgrade to see actual infoets their daily Key Performance Indicators (KPIs).\r\n- Facebook monitoring and replacements of accounts when needed. \n\r\nPotentially Additional Responsibilities (as the role expands):\r\n- Daily Facebook ads media buying.\n\r\nPreferred Qualifications:\n\r\n- Experience in finance\r\n- Experience in Shopify management.\r\n- Familiarity with facebook structures\n\r\nIf you possess these qualifications and are eager to discuss what you can bring to our company, I would be delighted to schedule a call with you.\n\r\nBut first send us a loom answering the following questions: \n\r\n1. Can you briefly introduce yourself and your background in managing e-commerce operations?\r\n(What brands have you worked with, what did you actually own?)\n\r\n2. Have you ever had full responsibility over a team, KPIs, financial performance or fulfillment?\r\n(Give 1 example where you made a major operational impact.)\n\r\n3. Are you willing and able to work 7 days per week, often beyond 40 hours, especially during critical periods like BFCM or launches? (Be honest — if work-life balance is a must for you, this is not a fit.)\n\r\n4. Tell me about a time where you had to make a fast decision with limited information. What did you do, and what was the result?\n\r\n5. How do you keep a team accountable on a daily basis? (What tools, systems, or methods do you use?)\n\r\n6. What’s your experience with Upgrade to see actual info and Facebook Ads? Can you walk us through the most technical task you’ve done in either?\n\r\n7. What do you think the role of a COO is inside a founder-led e-commerce company? (We're looking for someone who takes ownership — not just executes.)\n\r\n8. Why do you believe you're the right person to help scale and stabilize a 7-figure brand?\n\r\n9. This role requires high stamina, discipline, and personal energy. How do you maintain your physical and mental sharpness during high-pressure work weeks?\n\r\n10. Start your call with saying \"Apple\". \n\r\nLooking forward to your application!\n\r\nBest regards",
  "skill_requirements": [
    "Facebook marketing",
    "Shopify",
    "Team Leadership"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:36:18.762049",
      "reason": "Job first discovered"
    }
  ]
}