{
  "job_id": "1423091",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Pinterest-ads-1423091",
  "scraped_at": "2025-07-15T12:36:39.541459",
  "title": "Pinterest ads",
  "type_of_work": "Part Time",
  "salary": "500",
  "hours_per_week": "30",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are a fast-growing e-commerce company specializing in fashion dropshipping, and we're currently looking for a pinterest ads specialist to join our team for the long term. Make sure to include the word strawberry in your response so we know you’ve read the full job post. Please respond to this job posting only if you meet the requirements below..\n\r\nWe were active with Pinterest ads two years ago. Recently, we have focused solely on meta ads. We have been very successful with this and want to expand to Pinterest. That is why it is important that you know Pinterest inside out. You will have an important role, which comes with opportunities for growth. We are currently doing 6 figure in ad spend a month with META ads and we want to achieve this with you on Pinterest as well. So please only reply if you think you are capable and meet the requirements below. \n\r\nMUST HAVE KNOWLEDGE OF THESE PLATFORMS:\r\nMinimuUpgrade to see actual infodia buying experience of 1 year on Pinterest MUST\r\nHandled minimum of 100K total ad spend MUST\r\nShopify (eCommerce platform) PRE\r\nIf you do not meet the requirements, do not apply. (thank you)\n\r\nPlease answer the following questions, if you are interested and eligible:\r\n- What is your experience with media buying on Pinterest and for how long?\r\n- What is the total spend and the highest monthly spend you handled?\r\n- Do you have experience in dropshipping and in witch niches?\r\n- When was it the last time you worked as a media buyer?\r\n- What is your current job situation?\r\n- Why should we hire you?\r\n- How do you see your future with us?\n\n\r\nResponsibilities:\r\nLaunching new campaigns\r\nMonitoring all campaing\r\nDaily reporting through our google sheet\r\nAnalyzing new campaigns\n\r\nPlease understand that this job offers enormous growth opportunities. We will work with fast fee + bonusses. We are really looking for an A player who can grow with us and take on more responsibility over time. This will of course be rewarded. But on the contrary, we will immediately eliminate half-hearted efforts. So please only respond if you are thinking long term.\n\r\nArif",
  "skill_requirements": [
    "Performance Marketing",
    "Pinterest Ads",
    "Media Buying"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:36:39.543550",
      "reason": "Job first discovered"
    }
  ]
}