{
  "job_id": "1423101",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Ads-Expert-VA-for-6-Figure-Hair-Beauty-Brand-1423101",
  "scraped_at": "2025-07-15T15:34:19.191411",
  "title": "Ads Expert VA for 6-Figure Hair & Beauty Brand",
  "type_of_work": "Part Time",
  "salary": "400",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "I’m looking for a results-driven Virtual Assistant who specializes in Facebook Ads to join my team. I run a 6-figure brand in the hair and beauty space, and we sell both digital products (tutorials, mentorships, vendor lists) and physical products (wigs, lace products, etc.).\n\r\nI need someone who understands how to turn ad spend into high return, not just run basic traffic campaigns. You should be someone who lives in the data, optimizes aggressively, and is confident in scaling winning ads.\n\r\nRequired Skills & Experience:\r\n • Proven success running Facebook Ads for e-commerce or digital products\r\n • Experience scaling ad campaigns and optimizing for purchases, not just leads\r\n • Strong understanding of pixel tracking, A/B testing, audience building, and retargeting\r\n • Can create simple ad creatives (using Canva or basic editing tools) if needed\r\n • Familiar with ad metrics and can report performance clearly\r\n • Experience using Shopify or ClickFunnels is a plus\r\n • Bonus: Experience in beauty, hair, or fashion brands\n\r\nThis is for a long-term position with weekly hours and performance-based bonuses if results are strong. I’m only looking for someone who is proactive, analytical, and obsessed with hitting KPIs.\n\r\nIf that sounds like you, reply with:\r\n 1. Your portfolio of past campaigns and results\r\n 2. What your average ROAS has been across projects\r\n 3. What you would do first if hired to improve ads for the digital Side of my business\n\r\nLooking forward to hearing from you!\n\r\nBest,\r\n[Tay | TaysLuxe Academy]",
  "skill_requirements": [
    "Email Marketing",
    "Facebook Ads",
    "Snapchat Ads"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:37:18.377695",
      "reason": "Job first discovered"
    }
  ]
}