{
  "job_id": "1423194",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Support-Representative-1423194",
  "scraped_at": "2025-07-15T15:32:42.102565",
  "title": "Customer Support Representative",
  "type_of_work": "Full Time",
  "salary": "N/A",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Ready to Make an Impact at Brilliant Microschools?\n\r\nAt Brilliant Microschools, we’re not just about teaching—we’re about transforming education. With over 1,500 students thriving in our WASC-accredited online environment, we’re empowering the next generation to excel academically and build crucial 21st-century skills. And we’re looking for a Customer Success Representative who’s ready to join the movement.\n\r\nYour Role:\n\r\nAs the first point of contact for our families, you’ll be the heartbeat of our customer experience. Your energy, passion, and problem-solving skills will ensure our students and parents are supported in every way. You’ll be an integral part of our team, helping drive satisfaction and retention with every interaction.\n\r\nWhat You’ll Do:\n\r\nSolve Problems, Fast: Parents have questions? You have solutions. Provide timely, clear, and thoughtful responses.\r\nCollaborate Like a Pro: Work hand-in-hand with tutors and staff to create a seamless, unified experience for our families.\r\nMonitor Attendance: Stay on top of student attendance and address absenteeism with efficiency and care.\r\nBoost Satisfaction: Be proactive in ensuring every parent and student feels heard, supported, and satisfied.\r\nWhy You’ll Love It Here:\n\r\nA work environment that values collaboration and innovation.\r\nReal opportunities for growth and career development.\r\nThe chance to make a tangible impact on students' futures.\r\nIf you're ready to be a part of a team that's shaping the future of education, apply now. Let’s create something brilliant together.",
  "skill_requirements": [
    "Customer Support",
    "Customer Service",
    "English"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:32:42.104182",
      "reason": "Job first discovered"
    }
  ]
}