{
  "job_id": "1423071",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Evening-Operations-Client-Care-Coordinator-Remote-2-PM-10-PM-ET-TueSat-1423071",
  "scraped_at": "2025-07-15T14:34:36.224909",
  "title": "Evening Operations & Client Care Coordinator (Remote, 2 PM – 10 PM ET, Tue–Sat)",
  "type_of_work": "Full Time",
  "salary": "Php 25,000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "About Snaptique\r\nSnaptique is one of Canada’s leading photo booth and experiential event companies, known for handcrafted booths and custom activations. We create unforgettable Upgrade to see actual infonts at weddings, brand launches, festivals, and corporate functions from coast to coast.\n\r\nThe Role\r\nWe’re searching for a detail-oriented, people-focused Evening Operations & Client Care Coordinator to keep our events running smoothly after regular business hours. Working from home, you’ll be the evening “air-traffic controller” for our nationwide team, coordinating staff, finalizing itineraries, collecting retainers, and ensuring every client receives prompt, polished communication.\n\r\nWorking Hours:\r\n-1:00 PM – 10:00 PM Eastern Time (Toronto)\r\n-Tuesday to Saturday\r\n-1:00 AM – 10:00 AM Philippine Time (night shift)\n\r\nKey Responsibilities\n\r\nStaff Communication & Dispatch\n\r\n - Coordinate logistics for up to 20 events per day. Ensure all attendants have picked up the correct equipment, location tracking is enabled, and arrival at the venue is confirmed. Review setup photos and test prints submitted by the team to verify readiness.\n\r\n - Maintain active communication with crew throughout their shift. Respond to questions, provide support, and handle any last-minute changes or issues that may arise on-site.\n\r\nPayment Collection\n\r\n - Send retainer/final-balance requests, process payments, and reconcile nightly reports.\n\r\nItinerary Verification\n\r\n - Double-check load-in times, venue contacts, and add-on details; flag discrepancies immediately.\n\r\nTeam Briefings\n\r\n - Confirm key points (set-up notes, branded assets, Wi-Fi credentials) with each attendant before their shift. Communicate with the appropriate team lead or key person about what needs to be passed on to staff during times you are not on the clock.\n\r\nEvening Sales Support\n\r\n - Respond to new inquiries that come in after 5 PM; qualify leads using our templated responses and CRM.\n\r\nEvent Planning Collaboration\n\r\n - Work with the day-time sales & logistics team to schedule gear, vehicles, and crew for upcoming events.\n\r\nGallery Uploads\n\r\n  - Upload photo galleries, apply branding, and send delivery links to clients.\n\r\nLast-Minute Logistics & Client Communication\n\r\n  - Handle urgent client requests, venue changes, and last-minute instructions with professionalism and speed—ensuring updates are relayed to the team clearly and promptly.\n\r\nMust-Haves\r\n - Minimum 3 years of experience in event coordination, customer service, or dispatch (photo booth/AV a plus)\n\r\n - Minimum 3 years of voice-based experience in an inbound or outbound call center\n\r\n - Clear, confident written and spoken English\n\r\n - Must have worked in or supported operations across Canadian time zones\n\r\n - Comfortable pursuing payments—polite yet persistent\n\r\n - Tech-savvy: Google Workspace, CRMs, basic image uploads, and cloud file management\r\n - Quiet workspace with HD webcam, clear microphone, reliable high-speed internet, and backup power or hotspot\n\r\n - Ability to juggle multiple chats/calls calmly under time pressure\n\r\nNice-to-Haves\n\r\n - French language skills\n\r\n - Familiarity with venues, vendors, and courier platforms across Canada\n\r\n - Photo editing or light graphic-design skills using tools like Photoshop, Lightroom, or Illustrator\n\r\nWhat We Offer\n\r\n- Competitive hourly pay (in PHP, paid bi-weekly via direct deposit or Wise)\n\r\n- Paid training with our Operations and sales team\n\r\n - All-remote culture—zero commute, flexible workspace\n\r\nHow to Apply\n\r\nPlease reply directly to this Posting aplications sent to our emails with be deleted. \n\r\n - Subject: Evening Operations – Your Name\n\r\n - A brief cover letter (200 words max) telling us why night-owl operations is your jam\n\r\n - Your résumé (PDF)\n\r\n - One paragraph on how you’d handle an attendant reporting a printer jam 30 minutes before show-time\n\r\nApplications accepted until August 9, 2025 or until the role is filled. Interviews will be conducted via Zoom.                \n\n\n\n\n\n\n\nVIEW OTHER JOB POSTS FROM:\n\n\n\n\n\n\n\nSHARE THIS POST\n\n\n\n\n\n\n\n\n\n\n\n\nReport\n\n×\n\n\n\n\n\n\nJob Post\nReporter\nRank\nReason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark Note:\n\n×\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy is this blurred?\n\n                            For privacy and security reasons, you need to be logged into an OnlineJobs.ph account in order to view this link.\n                        \n        \n\n\n\n\n\n\n\n\n\nEmployers\n\n\n\nHow it works\nRegister\nPost a Job\nBlog\nReal Results\nFAQ\nTimeproof\n\n\n\n\n\nWorkers\n\n\n\nHow it works\nRegister\nJob Search\nEmployer Search\nBehind the Screen\n\n\n\n\n\ntalented va's\n\n\n\nVirtual Assistant\nSEO Experts\nWordPress Experts\nSocial Media Managers\nVideo Editors \nReal Estate Experts\nArticle Writers\nAmazon Experts\nGraphic Designers\nShopify Experts\nAdvanced VA Search\n\n\n\n\n\nother goods\n\n\n\nPress\nAffiliates\nAbout Us\nContact Us\nPrivacy Policy\nTerms of Use\nSPREAD THE WORD\n\n\n\n\n\ncontact us\n\n\n\n support@onlinejobs.ph\n\n\n\n\n\nconnect with us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\nCopyright © 2025 OnlineJobs.ph. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n \n\nQuestions? Feedback?powered byOlark live chat software",
  "skill_requirements": [],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:05:24.833917",
      "reason": "Job first discovered"
    }
  ]
}