{
  "job_id": "1423077",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Looking-for-an-Awesome-Virtual-Assistant-Fluent-Neutral-English-Speaker-1423077",
  "scraped_at": "2025-07-15T15:30:21.612982",
  "title": "Looking for an Awesome Virtual Assistant – Fluent, Neutral English Speaker",
  "type_of_work": "Part Time",
  "salary": "$6/hr + bonuses",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "IMPORTANT: TO BE CONSIDERED, YOU MUST SUBMIT AN AUDIO VOICE RECORDING WITH YOUR APPLICATION.\n\r\nLocation: Remote\r\nJob Type: Part-Time to Start (Potential for Full-Time Based on Performance)\r\nCompensation: $6 hourly rate + performance-based growth\r\nStart Date: ASAP\n\r\nLooking for Your Next Opportunity?\r\nAre you someone who thrives on building relationships, solving problems, and making things happen? Are you organized, self-driven, and eager to grow with a company that’s on the rise?\n\r\nWe’re a business providing products and services to federal, state, and local agencies. We’re looking for a reliable and resourceful VA to assist with Vendor / Project Management - you will take ownership of two critical areas:\r\n- Securing vendor/subcontractor quotes for proposals\r\n- Managing the successful execution of projects we win\n\r\nThis role starts part-time, with the potential to move into full-time hours based on your performance, initiative, and results. If you’re looking to get in on the ground floor of something with serious growth potential, this might be your ideal fit.\n\r\nWhat You’ll Be Doing\r\nVendor Management (Before Contract Award):\r\n- Research and reach out to potential vendors and subcontractors for products and services.\r\n- Request, collect, and negotiate quotes for bids and proposals.\r\n- Build strong vendor relationships and maintain a reliable supplier network.\r\n- Ensure vendors meet compliance standards (licenses, certifications, registrations).\r\n- Work closely with our proposal team to finalize accurate cost estimates.\n\r\nProject Management (After Contract Award):\r\n- Oversee awarded contracts to ensure on-time, on-budget delivery.\r\n- Serve as the main point of contact between vendors, subcontractors, and internal teams.\r\n- Track timelines, deliverables, and any issues that arise.\r\n- Handle documentation and compliance reporting.\r\n- Coordinate logistics and resolve challenges quickly and professionally.\n\r\nWho We’re Looking For\r\n- You’ve got 2–5 years of experience as a VA\r\n- You’re a strong communicator and negotiator, great on the phone and in writing.\r\n- You’re organized, detail-oriented, and able to juggle multiple projects with ease.\r\n- You’re proactive — you don’t wait to be told what to do; you take initiative.\r\n- You understand (or are eager to learn about) how our business works\r\n- Tech-savvy with tools like Microsoft Office, Google Workspace, and project management platforms (Asana, Trello, etc.).\n\r\nWhat’s In It for You?\r\n- Opportunity to grow – impress us, and we’ll reward you with more hours, higher pay, and promotions.\r\n- Ownership of your role – we’ll trust you to lead, and we’ll support you to succeed.\n\r\nReady to Apply?\r\nSend us your resume and a brief AUDIO message telling us:\r\n- Why this role excites you\r\n- How your past experience makes you a great fit\r\n- Any relevant projects you’ve led or supported\n\r\nWe’re moving fast — if this sounds like your kind of opportunity, we want to hear from you.\n\r\nDON’T FORGET – AN AUDIO VOICE RECORDING IS REQUIRED TO BE CONSIDERED. APPLY NOW AND SHOW US YOUR VOICE!",
  "skill_requirements": [
    "Data Entry",
    "English Speaking",
    "Virtual Assistant"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T12:13:28.088306",
      "reason": "Job first discovered"
    }
  ]
}