{
  "job_id": "1423197",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Financial-Planning-Analysis-Analyst-1423197",
  "scraped_at": "2025-07-15T15:38:54.412352",
  "title": "Financial Planning & Analysis Analyst",
  "type_of_work": "Full Time",
  "salary": "$2000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are looking for a dynamic and client-oriented FP&A Analyst to join our team. This role goes beyond traditional back-end analysis—you’ll work directly with clients to create insightful financial dashboards and models, present monthly financial results, and offer strategic business advice based on performance data.\n\r\nYou’ll be instrumental in helping clients understand their financial position and make sound, data-driven decisions. The ideal candidate has strong analytical and communication skills, thrives in a consultative environment, and enjoys turning numbers into meaningful insights.\n\r\nResponsibilities:\r\nClient Engagement & Advisory\r\nAct as the primary financial analyst point of contact for assigned clients.\r\nPresent dashboards and financial results post-month-end close, offering key insights and answering client questions.\r\nProvide tailored business recommendations based on financial performance, market trends, and client goals.\r\nDashboard & Financial Modeling\r\nBuild and maintain interactive dashboards and financial models to visualize client KPIs, forecast performance, and track goals.\r\nEnsure that reporting tools are both visually intuitive and analytically rigorous.\r\nFP&A Support\r\nAssist clients in developing and maintaining budgets, rolling forecasts, and long-term financial plans.\r\nAnalyze financial performance, variances, and trends to support decision-making.\r\nProvide scenario planning and sensitivity analyses for client-specific initiatives.\r\nReporting & Analysis\r\nPrepare clear and concise financial reports and summaries for internal and external use.\r\nEnsure accuracy and consistency in client-facing outputs.\r\nTranslate complex data into actionable insights and communicate them in a way that’s easy to understand for non-finance stakeholders.\r\nContinuous Improvement & Collaboration\r\nRecommend process improvements for internal reporting and client deliverables.\r\nWork closely with internal teams (accounting, operations, etc.) to ensure alignment and timely delivery of reports.\n\r\nQualifications:\r\n2+ years of experience in FP&A, financial consulting, or a similar role—preferably in a client-facing capacity.\r\nProficient in Excel (advanced formulas, pivot tables, etc.) and experienced in building dynamic financial models.\r\nExperience with financial visualization tools such as Tableau, Power BI, or similar platforms.\r\nStrong analytical skills with the ability to distill complex data into actionable insights.\r\nConfident presenter with excellent communication skills—both written and verbal.\r\nHighly organized, self-starter, and comfortable managing multiple client deliverables on tight deadlines.\r\nFamiliarity with month-end close processes and accounting fundamentals.",
  "skill_requirements": [
    "Microsoft Excel",
    "Financial Analysis",
    "Financial Planning"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:38:54.414615",
      "reason": "Job first discovered"
    }
  ]
}