{
  "job_id": "1423231",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Customer-Service-Bookkeeping-Coordinator-1423231",
  "scraped_at": "2025-07-15T15:28:10.882062",
  "title": "Customer Service & Bookkeeping Coordinator",
  "type_of_work": "Full Time",
  "salary": "negotiable",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We're looking for a detail-oriented and proactive Customer Service & Bookkeeping Coordinator to join our growing residential maintenance team. This hybrid role is essential for keeping communication, coordination, and operations running smoothly across clients, technicians, and internal teams.\n\r\nKey Responsibilities:\n\r\nRespond to client inquiries and manage the shared email inbox\n\r\nUpdate job statuses and documentation across multiple client portals\n\r\nCreate work orders and relay accurate info to techs, dispatch, and management\n\r\nOrder materials for technicians and track deliveries\n\r\nMonitor and follow up on open issues until resolution\n\r\nHandle basic bookkeeping: invoicing, payment tracking, expense entry, and reconciliations\n\r\nMaintain a high level of professionalism and responsiveness\n\r\nRequirements:\n\r\nCustomer service, dispatch, or operations experience in a service-based industry\n\r\nStrong communication and organizational skills\n\r\nTech-savvy: CRMs, spreadsheets, and client portals\n\r\nAble to manage multiple tasks independently and efficiently\n\r\nBonus Points For:\n\r\nBookkeeping experience (QuickBooks or similar)\n\r\nFamiliarity with property management or field service software\n\r\nBackground in maintenance, construction, or service trades\n\r\nWhy Join Us:\n\r\nFlexible remote/hybrid work\n\r\nSupportive, fast-growing team\n\r\nReal opportunity for growth in a mission-driven company",
  "skill_requirements": [
    "Quickbooks",
    "Bookkeeping",
    "Customer Service"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:28:10.883653",
      "reason": "Job first discovered"
    }
  ]
}