{
  "job_id": "1423152",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Anime-Theories-Lores-YouTube-Shorts-Creator-Full-Time-Remote-1423152",
  "scraped_at": "2025-07-15T14:38:41.998444",
  "title": "Anime Theories & Lores YouTube Shorts Creator (Full-Time Remote)",
  "type_of_work": "Full Time",
  "salary": "$420-$750",
  "hours_per_week": "45",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Hey! I run a few YouTube channels, and I’m now launching something new: a short-form channel that dives deep into anime theories, character breakdowns, and trending pop culture Upgrade to see actual infonts.\n\r\nWe’re talking One Piece, Squid Game, Demon Slayer, Code Geass, Jujutsu Kaisen, K-pop Demon Hunters… basically whatever’s hype + story-driven right now.\n\r\nWe’re not just looking for a “video maker.” We’re looking for someone who’s already living in the world of anime, pop culture, and fan theories: someone who’s probably paused an episode mid-scene just to go down a Reddit rabbit hole and figure out why Zoro hasn’t opened his eye yet.\n\r\nThe ideal person doesn’t need to be pushed and they’re already researching, analyzing, and creating this kind of content for fun. We’re just giving them the chance to do it for real.\n\r\nThis Job’s For You If:\r\n-> You love anime and storytelling, and always have fan theories brewing\r\n-> You know the difference between a recap and a hooked-in breakdown\r\n-> You’re on top of trends in anime, Movies, Netflix shows, etc.\r\n-> You can handle full video creation: research -> write -> edit\r\n-> You’ve worked with CapCut, Premiere, or something similar\r\n-> You want to grow with a channel, not just crank out videos\n\r\nYou’ll Be Doing:\r\n-> Coming up with theory topics (or working with ones we provide)\r\n-> Writing scripts that grab attention and flow smoothly (200–400 words)\r\n-> Editing short, vertical videos (30–60 secs) with subtitles, music, solid pacing\r\n-> Suggesting strong titles and creative angles\r\n-> Making content that real fans will go nuts for\n\r\nSample Content Style:\n\nUpgrade to see actual info\nUpgrade to see actual info\nUpgrade to see actual info\n\r\n(These aren’t our videos. Just examples of the tone and pacing we’re aiming for.)\n\r\nPay and Perks:\r\n-> $420–$750/month base salary based on skill and output\r\n-> Bonus opportunities as the channel grows\r\n-> 100% remote and flexible schedule\r\n-> Ability to grow into creative lead or channel manager roles (with higher salaries $$$)\n\r\nHow to Apply:\r\nFill out this short application form:\nUpgrade to see actual info\n\r\nIf you’ve ever paused an anime to Google a theory, or stayed up late to argue about a movie ending, you’ll thrive here.\n\r\nLet’s build a channel that fans can’t stop watching.",
  "skill_requirements": [
    "Scriptwriting",
    "Video Editing",
    "Social Media Video Editing"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:38:42.000141",
      "reason": "Job first discovered"
    }
  ]
}