{
  "job_id": "1423022",
  "url": "https://www.onlinejobs.ph/jobseekers/job/TikTok-Shop-Campaign-VA-1423022",
  "scraped_at": "2025-07-15T15:36:22.173655",
  "title": "TikTok Shop Campaign VA",
  "type_of_work": "Full Time",
  "salary": "$500",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "???? About the Role:\r\nWe’re looking for a smart, reliable, and proactive Virtual Assistant to support TikTok Shop campaigns for multiple UK-based brands. You'll act as the operational backbone — tracking performance, managing creator communication, posting links, updating sheets, and ensuring no detail is missed.\n\r\n???? This is not a social media content role. You’ll work behind the scenes to help us run smooth, scalable, and profitable campaigns.\n\r\n???? What You’ll Do (Daily Tasks):\r\nCheck TikTok Shop Seller Centres (3–4 brands) and log daily performance\n\r\nPost high-commission affiliate links in our Upgrade to see actual info server\n\r\nApprove sample requests from creators and update logs\n\r\nTrack which creators have posted and update campaign reports\n\r\nFollow up with creators who haven’t posted yet\n\r\nUpdate Google Sheets or Notion dashboards\n\r\nInvite creators to follow TikTok brand pages\n\r\nResearch trending content hooks and formats (basic level)\n\r\n???? Weekly Tasks:\r\nPull weekly reports for each brand (GMV, clicks, video posts, top creators)\n\r\nMaintain clean creator and campaign tracking sheets\n\r\nVet new creator applicants using a provided checklist\n\r\nAssist with campaign launches and document organisation\n\r\nTidy inboxes, label important messages, and track follow-ups\n\r\nBrand Outreach via Amazon UK:\n\r\nIdentify 10–20 UK-based Amazon brands not currently using TikTok Shop\n\r\nAdd brand leads to a Google Sheet (including product links + contact info)\n\r\nSend outreach emails (template and tools provided)\n\r\nTrack replies and update lead status for follow-up\n\r\n? Ideal Skills & Requirements:\r\nStrong written English and clear communication\n\r\nHighly organised with strong attention to detail\n\r\nConfident using Google Sheets / Excel\n\r\nQuick to learn tools like TikTok Shop, Upgrade to see actual info, Notion\n\r\nSelf-motivated and proactive — not afraid to take initiative\n\r\nReliable — consistent daily availability and strong work ethic\n\r\nBonus: TikTok Shop or affiliate marketing experience is a plus\n\r\n? Working Hours:\r\nFull-time, Monday to Friday\n\r\nUK business hours: 9:00 AM to 5:00 PM UK time\n\r\nOccasional flexibility is fine, but daytime UK availability is essential",
  "skill_requirements": [
    "Ecommerce",
    "Social Media Moderation",
    "Data Entry"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T10:23:47.099485",
      "reason": "Job first discovered"
    }
  ]
}