{
  "job_id": "1423184",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Product-Lister-for-Google-Store-Shopify-1423184",
  "scraped_at": "2025-07-15T14:41:14.368328",
  "title": "Product Lister for Google Store (Shopify)",
  "type_of_work": "Any",
  "salary": "$3,5 per hour",
  "hours_per_week": "25",
  "date_updated": "Jul 15, 2025",
  "job_overview": "$3.50/hour | Part-time (Start with 4 hours/day)\n\r\nWe are looking for a reliable and self-motivated virtual assistant to join our team and help manage our Google Store through Shopify. Your main tasks will include product research, uploading products to our Shopify store, and making sure the listings are optimized for Google Shopping.\n\r\nYour Responsibilities:\n\r\nResearch trending and high-potential products\n\r\nList and upload products to our Shopify store\n\r\nCreate attractive product images using Canva\n\r\nEnsure product listings meet Google Shopping requirements\n\r\nCommunicate with our Google Store agent and implement feedback\n\r\nRequirements:\n\r\nExperience with Shopify (especially product listing)\n\r\nFamiliarity with Canva and the ability to design clean, eye-catching product images\n\r\nStrong attention to detail and ability to work independently\n\r\nGood English communication skills\n\r\nWillingness to learn and grow with us over time\n\r\nWe will start with 4 hours of work per day. If you show strong performance, more hours can be added gradually. You’ll get guidance at the beginning, but we expect you to work independently after a few weeks.\n\r\nHow to Apply:\r\nIf you're interested, please reply with the word blue in your message. This helps us know you’ve read the full job post.\r\nAlso, include a short explanation of your experience with:\n\r\nShopify (especially product listing)\n\r\nCanva (and how you’ve used it to create product images)\n\r\nYour previous role(s) involving these tools\n\r\nWe look forward to working with someone who takes initiative and is ready to grow with us.\n\r\nSincerely, \n\r\nOtison & Zyiliene",
  "skill_requirements": [
    "Shopify",
    "ChatGPT",
    "English"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:41:14.370488",
      "reason": "Job first discovered"
    }
  ]
}