{
  "job_id": "1423213",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Accountant-1423213",
  "scraped_at": "2025-07-15T15:30:00.877788",
  "title": "Accountant",
  "type_of_work": "Full Time",
  "salary": "Php 50, 000 - Php 65, 000",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Job Title: Accountant\r\nPermanent Remote | Full-time\n\r\nWe’re looking for a detail-oriented Accountant with strong expertise in QuickBooks Online and Excel. If you have a solid grasp of accounting principles and love working with numbers, spreadsheets, and financial reports, you might be exactly who we need.\r\nThink you’re the QuickBooks pro we’ve been waiting for? Let’s talk!\n\r\nWhat You’ll Be Doing:\r\nManage end-to-end accounting processes using QuickBooks Online\r\nPrepare financial statements and reports\r\nConduct account reconciliations and ensure compliance with GAAP\r\nProcess accounts payable and receivable transactions\r\nUtilize Excel for data analysis and reporting\n\r\nWhat We’re Looking For:\r\nExcellent written and verbal communication skills\r\nBachelor’s degree in Accounting, Finance, or related field\r\nAt least 5 years of experience in accounting roles\r\nProficiency in QuickBooks Online and Excel (pivot tables, vlookups)\r\nStrong attention to detail and analytical skills\r\nCPA certification (nice to have!)\r\nExperience in the medical field as an accountant/bookkeeper (nice to have!)\r\nAvailable to work in US time zones (Graveyard shift in the Philippines)\r\nAvailable to start within 2 weeks from job offer\n\r\nTechnical Requirements:\r\nComfortable in using time-trackers (e.g. Time Doctor)\r\nOwn laptop/desktop, noise-cancelling headphones, and webcam\r\nReliable internet connection (at least 50 Mbps)\r\nAvailable backup equipment in cases of power and internet outages\r\nProficiency with Microsoft Office tools and Google Workspace\r\nProficiency in QuickBooks Online and Excel (pivot tables, vlookups)\n\r\nWhy You’ll Love Working Here:\r\nCompetitive Compensation\r\nWe offer a salary range of up to Php 65,000 per month, commensurate with experience and qualifications, for a full-time commitment of 40 hours per week. Your expertise is valued, and we ensure your efforts are fairly recognized and rewarded.\n\r\nComprehensive Health Coverage:\r\nYour health is our priority. We provide access to high-quality medical insurance, ensuring you and your loved ones have the support and care you need within your country.*\n\r\nPaid Time Off and Sick Leave:\r\nWe believe in work-life balance. Enjoy generous paid time off and sick leave policies, allowing you to recharge, travel, or rest when needed—all while knowing your role is secure.",
  "skill_requirements": [
    "Quickbooks",
    "Financial Accounting",
    "Analysis"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T15:30:00.879859",
      "reason": "Job first discovered"
    }
  ]
}