{
  "job_id": "1423180",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Amazon-Seller-Suspended-Account-Specialist-1423180",
  "scraped_at": "2025-07-15T14:38:00.863654",
  "title": "Amazon Seller Suspended Account Specialist",
  "type_of_work": "Full Time",
  "salary": "$900 - $1400",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Location: Remote\r\nSchedule: Philippines Night Shift – 8AM to 5PM PHT, Monday to Friday\r\nCompensation: $900–$1,400/month (depending on experience)\r\nPosition Type: Full-Time\n\r\nAbout the Role:\r\nWe’re looking for an experienced Amazon Suspended Account Specialist to join our team. This role requires someone with proven experience in reinstating suspended Amazon seller accounts and resolving a variety of account health issues including blocked listings, all types of violations, A-Z claims, and negative feedback.\n\r\nKey Responsibilities:\n\r\nTake full ownership of assigned tickets and resolution workflows.\n\r\nDraft and submit strong appeals to Amazon for a Seller Account or ASIN reinstatement.\n\r\nTroubleshoot and resolve violations, A-Z claims, negative feedback, and other health-related issues.\n\r\nCommunicate with Amazon Seller Support and escalate cases when necessary.\n\r\nCollaborate with our internal teams via Slack & Zoho Projects.\n\r\nQualifications:\n\r\nMinimum 2 years experience successfully reinstating suspended Amazon seller accounts.\n\r\nDeep understanding of Amazon Seller Central and Account Health policies.\n\r\nStrong written English and analytical thinking skills.\n\r\nMust be available to work Philippines night shift (8AM–5PM PHT, Monday to Friday).\n\r\nQuiet, distraction-free workspace with reliable internet.\n\r\nFamiliarity with tools like Zoho Projects, Slack, Salesforce, and Google Workspace is a plus.\n\r\nWhy Join Us?\n\r\nCompetitive monthly salary based on experience.\n\r\nFast-paced and growth-oriented environment.\n\r\nDirect impact on our clients' success.\n\r\nWork with a team that values excellence and accountability.\n\r\nTo Apply:\r\nPlease send your resume and written responses to the following three screening questions.\n\r\n?? Important: Your answers must reflect your own knowledge and experience. Do not use AI tools (such as ChatGPT) to generate responses. We’re looking for real, hands-on expertise — not copied or artificial content. Candidates who submit generic or AI-generated answers will be immediately disqualified.\n\r\nWhat are the key components of an effective Plan of Action (POA) for a suspended ASIN due to a “Used Sold as New” complaint?\n\r\nIf an account receives multiple A-Z Guarantee claims in a short period, what steps would you take to protect the Account Health rating and avoid suspension?\n\r\nExplain the difference between an Intellectual Property violation and a Product Authenticity complaint on Amazon — and how you would approach resolving each one.",
  "skill_requirements": [
    "Technical Writing",
    "Amazon",
    "English Proficiency"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:38:00.865286",
      "reason": "Job first discovered"
    }
  ]
}