{
  "job_id": "291626",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Account-Management-291626",
  "scraped_at": "2025-07-15T15:28:31.660297",
  "title": "Account Management",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Boost Media Group is looking for an Account Manager who will be in charge of managing a company's relationships with its customers. They are in charge of building long-term relationships with a group of customers and generally stay with customers for the length of their relationship with the company. The goal is to keep clients or accounts as long as possible. Account managers may be in charge of finding new business clients, be assigned prospects, given accounts, or a combination thereof. Tasks may involve project management, strategic planning, sales support, product design, service application, logistics, and marketing.\n\r\nPosition Benefits\r\n- Work remotely\r\n- Performance bonuses and incentive programs\r\n- Competitive salary based on experience\r\n- Opportunities for fast growth, advancement, and promotions\r\n- Large team based primarily in Philippines, Fun environment\n\r\nJob Duties :\r\nGenerate sales among client accounts, including upsetting and cross-selling\r\nOperates as the point of contact for assigned customers\r\nDevelops and maintains long-term relationships with accounts\r\nMakes sure clients receive requested products and services in a timely fashion\r\nCommunicates client needs and demands of the employer company\r\nForecasts and tracks client account metrics\r\nManage projects within client relationships, working to carry out client goals while meeting company goals\r\nIdentifies opportunities to grow business with existing clients\r\nCoordinate with staff members working on the same account to ensure consistent service\r\nCollaborates with the sales team to reach prospective clients\r\nService multiple clients concurrently, often meeting deadlines\r\nKeep records of client transactions\n\r\nThis position is for immediate hiring so we are looking forward to seeing your applications!\r\nPlease apply using this link :\nUpgrade to see actual info",
  "skill_requirements": [
    "Strategic Planning",
    "Account Management",
    "Sales"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:45:35.942953",
      "reason": "Job first discovered"
    }
  ]
}