{
  "job_id": "903293",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Digital-Marketer-903293",
  "scraped_at": "2025-07-15T14:36:23.199127",
  "title": "Digital Marketer",
  "type_of_work": "Part Time",
  "salary": "$720",
  "hours_per_week": "12",
  "date_updated": "Jul 15, 2025",
  "job_overview": "PLEASE NOTE\r\nImportant: Video Required to Apply\r\nApplications without a short video introduction will not be considered.\r\nWe're looking for someone who can communicate clearly, confidently, and professionally, especially since you'll sometimes be in direct contact with clients.\r\nTo apply, you must include a 2–3 minute video (Loom, Google Drive, or YouTube unlisted link). This helps us assess your English, presentation, and suitability for occasional video meetings or calls, details below…\n\r\nUs\r\nAt Digital Zest (Upgrade to see actual info), we help established businesses generate more sales! We help companies and organisations with Web Design, e-commerce and Digital Marketing. It’s important for us to exceed our clients' expectations and always deliver great results on time.\n\r\nWe strive for:\n\r\n• Quality of work and timely attention\r\n• Cost-effective solutions to client requests and issues\r\n• Creative solutions to business bottlenecks using the website as problem problem-solving tool\n\r\nWe accomplish this through:\n\r\n• A full website development process that includes discovery, design and development\r\n• Ongoing monthly website maintenance to improve the website on a monthly basis\r\n• Ongoing marketing services, including Social Organic / Paid, Email Campaigns & Content Creation to improve marketing on a regular basis\r\n• Partnerships with other companies and resources to offer clients further online strategy\n\r\nThe Role\r\nDigital Zest is looking for a motivated Virtual Assistant (VA) with good experience in social media, paid ads and email, who is up for becoming part of the team for long-term growth.\n\r\nReports to: Paul Taylor\n\r\nTypical Monthly tasks include:\n\r\n• Liaise with Account Manager & Communicate with TeaUpgrade to see actual infombers Accordingly\r\n• Draft social media posts for review, including\r\n• Facebook / Instagram / Google My Business (potentially Upgrade to see actual info or Twitter in future)\r\n• Creation of Social Graphics (Usually existing brand and photos to work with)\r\n• Write organic copy for posts\r\n• Schedule on Rella / Loomly\r\n• Write Ad Copy\r\n• Facebook / Instagram / LinkedIn\n\n\r\n• Create Email Marketing Newsletters & Email Templates for Clients (MailChimp)\r\n• Draft Email Copy for Clients\r\n• Draft Email Copy for Us\r\n• Create Visuals for Emails\r\n• Test All Emails\r\n• Schedule Emails\n\n\r\n• Organise / Clean audiences for clients (FB / Emails)\r\n• Manage Google Ads & Campaigns\r\n• Create New Ads\r\n• Optimise Existing Ads and Campaigns\r\n• Delete Poor-Performing Ads\n\n\r\n• Help Set Up Tracking\r\n• Google Analytics\r\n• Facebook Pixel\r\n• Manage Data & Analytics Overview\r\n• Collate Clients' Key Data Monthly (Impressions / Reach / Visitors)\r\n• Assist in the Creation of Potential Client Proposals / Presentations\r\n• Time and Plan Project Estimations\n\r\nQualities we are looking for:\n\r\n• Very Fluent in English (verbal and written)\r\n• At least 5+ years’ experience as a VA\r\n• At least 3+ years’ Organic Social Media experience in the UK market\r\n• At least 2+ years’ Paid Ads experience in FB / Instagram / LinkedIn / Google Ads\r\n• A free thinker, willing to look for answers, but not afraid to ask if stuck\r\n• Confidence in organisation, details and communication\r\n• A team player who is happy working in a small team of 5-6 people\r\n• Strong communication skills\r\n• Ability to utilise different styles depending on client needs/industry\r\n• Responsive: Quick with email and chat communication\n\r\nPreferred expert knowledge of:\n\r\n• Social Media Organic\r\n• Facebook / Instagram / Google My Business\n\n\r\n• Paid Ads\r\n• Facebook / Instagram / Google Ads\r\n• MailChimp\r\n• Rella or Loomly\r\n• Figma\r\n• Canva\r\n• Experience with GHL would be very beneficial\r\n• Experience with SEO copywriting would be very beneficial\r\n• Experience with Image Editing Software, eg Adobe Photoshop\r\n• Some experience with WordPress is also beneficial\n\r\nWorking Hours & Communication\r\nThis position is approximately. 8–12 hours per week (2–3 hours per day, Monday to Friday). \n\r\nRate: $15/hour (~?41,000/month) for approx. 8–12 hours per week.\n\r\nYou can complete your tasks at any time that suits you, as long as:\n\r\n• Deadlines are met\r\n• Communication is timely\r\n• Urgent or time-sensitive items are prioritised when needed\n\r\nThat said, you must be available to communicate during UK office hours (9 am–5 pm UK time) for occasional check-ins, updates, and collaboration with our team. We are flexible but expect reliability and responsiveness.\n\r\nWe anticipate that over the coming weeks/months that these hours will increase slightly, please bear this in mind when applying.\n\r\nClient Communication\r\nYou may occasionally be asked to communicate directly with clients, typically via email, for example, to request assets, clarify content, or confirm scheduling. For this reason, excellent written English is essential. You should feel confident representing our agency professionally and clearly in all communications.\n\n\r\nSpecial requirements:\r\n• A computer suitable to the role fulfillment\r\n• Your own Internet connection and some kind of backup internet connection\r\n• Have a headset or microphone and video camera (for teaUpgrade to see actual infoetings)\n\r\nHow to Apply (Must Include Video)\r\nPlease email Upgrade to see actual info with the subject line:\r\nApplication for Marketing VA Role – [Your Name]\n\r\nInclude the following in your email:\n\r\nLink to a 2–3 minute video introduction\r\nTell us about yourself, your experience, and why you’d be a great fit.\r\nSpeak naturally and confidently — no need for editing or fancy backgrounds. We just want to see how you communicate, as you would in a real team or client call.\n\r\nIn your email, please provide…\r\n• Brief email introduction\r\n• Your OnlineJobs.ph profile link\r\n• Your CV or relevant portfolio (if available)\r\n  *Please attach examples of your work or list companies you have worked with\r\n• Your expected monthly rate (in PHP) based on 8–12 hours/week\r\n• Your preferred working hours in Philippine time\n\r\nOnly applicants who submit all of the above, including the video, will move forward to the next stage.\n\r\nThank you for your time and interest in this position.\n\r\nLooking forward to seeing your application — we’re excited to find someone we can grow with!",
  "skill_requirements": [
    "Email Marketing",
    "Social Media Management",
    "Facebook Ads"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T02:26:16.469576",
      "reason": "Job first discovered"
    }
  ]
}