{
  "job_id": "949248",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Sales-Development-Representative-949248",
  "scraped_at": "2025-07-15T14:39:30.295630",
  "title": "Sales Development Representative",
  "type_of_work": "Full Time",
  "salary": "TBD",
  "hours_per_week": "20",
  "date_updated": "Jul 15, 2025",
  "job_overview": "Boost Media Group is seeking a motivated and driven Sales Development Representative (SDR) to join\r\nour remote team. This role will be critical in driving our internal sales division’s strategic approach to\r\nclient acquisition through a hybrid organizational model. Our SDRs operate within specialized and\r\nfunctional teams that focus on delivering value-driven client relationships.\n\r\nResponsibilities:\n\r\nMaster Digital Marketing Services: Gain in-depth knowledge of our SEO, PPC, web design, and\r\nsocial media offerings. Effectively communicate their value to potential clients.\r\nStrategic Lead Generation: Leverage our proven systems for organic, multi-channel outreach to identify and qualify leads.\r\nSales Appointment Setting: Schedule meetings with qualified prospects and align them with the appropriate service teams.\r\nSales Material Development: Create and refine pitch decks, proposals, and other sales materials. Collaborate with Service Specialists Teams for tailored solutions.\r\nDeal Management: Collaborate with internal Campaign Integration and Client Success Teams to ensure a smooth transition from lead qualification to closing.\r\nOngoing Learning: Research and keep abreast of new sales tools and processes to optimize lead generation and sales performance.\n\r\nQualifications:\n\r\nExperience: 2-3 years in sales, preferably in digital media, online advertising, or related fields.\r\nProven track record in cold calling, email outreach, or sales presentations (both in-person and via Zoom).\r\nConsultative Sales Skills: Strong ability to build relationships, assess client needs, and recommend appropriate digital marketing solutions.\r\nDigital Marketing Expertise: Familiarity with SEO, PPC, and social media marketing concepts.\r\nExperience with our service offerings is a strong plus.\r\nTech-Savvy: Proficient in Google Workspace, Zoom, and CRM systems. Ability to adapt to new tools as required.\r\nPersonal Attributes:\r\nSelf-starter who thrives in a fast-paced, growth-stage company.\r\nPersistent, fearless on the phones, and committed to continuous improvement.\r\nExceptional communication skills and a commitment to client satisfaction.\n\r\nWhat We Offer:\r\n?\r\nComprehensive Training: Our structured training programs cover everything from service specialization to advanced multi-channel sales strategies.\r\nRemote Flexibility: Work from anywhere while being a part of a supportive and innovative remote team environment.\r\nCollaborative Culture: Engage with functional teams, including SEO, PPC, Social Media, and Web Development, as well as cross-functional support teams like Content Strategy and Analytics.\r\nProfessional Growth: Opportunities to develop consultative and relationship-driven sales skills, with exposure to diverse client needs and services.\n\r\nOur Internal Sales Division Structure:\n\r\nYou will work in a hybrid organizational model, where our SDR team collaborates with specialized service\r\nteams (SEO, PPC, Social Media) and strategic support teams (Content & Creative, Data & Analytics, Client\r\nManagement). This setup allows us to align client needs with the right resources effectively.\n\n\r\nApply Now\n\r\nIf you are enthusiastic about digital marketing, excel at building strategic client relationships, and are\r\nready to contribute to a dynamic, results-oriented team, we’d love to hear from you! Join Boost Media\r\nGroup to help drive our clients' success through innovative and impactful digital marketing solutions.",
  "skill_requirements": [
    "Marketing",
    "Sales"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T13:29:08.062843",
      "reason": "Job first discovered"
    }
  ]
}