{
  "job_id": "964231",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Ads-Expert-with-Google-ads-experience-964231",
  "scraped_at": "2025-07-15T15:34:00.047347",
  "title": "Social Media Ads Expert with Google ads experience",
  "type_of_work": "Full Time",
  "salary": "70,000-90,000php",
  "hours_per_week": "40",
  "date_updated": "Jul 15, 2025",
  "job_overview": "We are seeking a skilled and experienced Media Buyer / Pay-Per-Click (PPC) Ads Expert to join our team at Brandlume. As a PPC Ads Expert, you will be responsible for managing and optimizing paid advertising campaigns to drive results for our clients across various digital platforms.\n\r\nResponsibilities:\n\r\nDevelop and implement effective PPC strategies to achieve client objectives, including lead generation, conversion optimization, and ROI maximization.\r\nManage and optimize paid advertising campaigns on platforms such as Facebook / Instagram Ads, LinkedIn Ads, and others.\r\nKnowledgeable in Google ads is a plus.\r\nConduct keyword research, ad copywriting, and audience targeting to ensure maximum campaign performance.\r\nMonitor and analyze campaign performance metrics, such as click-through rate (CTR), conversion rate, and cost per acquisition (CPA), and make data-driven optimizations.\r\nStay informed about industry trends, algorithm updates, and best practices in PPC advertising to drive continuous improvement.\r\nCollaborate with cross-functional teams, including account managers, designers, and developers, to ensure alignment and integration of PPC campaigns with overall marketing strategies.\r\nProvide regular reports and insights to clients on campaign performance and recommendations for optimization.\r\nCommunicate with the client thru meetings the reports and updates on the campaigns\r\nMust have experience working as PPC or Media buyer for a digital marketing agency\n\n\r\nRequirements:\n\r\nBachelor's degree in marketing, advertising, or a related field.\r\nMinimum of 3 years of experience in media buying and PPC advertising, preferably in a digital marketing agency or related industry.\r\nProven track record of managing successful PPC campaigns and achieving measurable results.\r\nIn-depth knowledge of PPC platforms, including Google Ads, Facebook Ads, and LinkedIn Ads, as well as advertising tools and analytics platforms.\r\nStrong analytical skills, with the ability to interpret data, draw insights, and make data-driven decisions.\r\nExcellent communication and collaboration skills, with the ability to work effectively with cross-functional teams and communicate complex ideas to clients.\r\nGoogle Ads certification and other relevant certifications (e.g., Facebook Blueprint) are a plus.\n\n\r\nBenefits:\n\r\nCompetitive salary and benefits package.\r\nFlexible remote work environment.\r\nOpportunities for professional development and growth.\r\nDynamic and collaborative team culture.\r\nIf you are a results-driven PPC expert with a passion for digital advertising and a track record of delivering exceptional results for clients, we want to hear from you! Join us at Brandlume and help us empower brands to succeed in the digital marketplace.\n\r\nHow to Apply:\r\nSubmit your application form to: Upgrade to see actual info and share your resume and cover letter outlining your relevant experience and why you are the ideal candidate for this position. Be sure to include \"OLJ - Media Buyer / PPC Expert Application - [Full Name]\" in the subject line. We look forward to hearing from you!",
  "skill_requirements": [
    "Facebook marketing",
    "Facebook Ads",
    "Ads Management"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T11:21:14.881520",
      "reason": "Job first discovered"
    }
  ]
}