{
  "job_id": "976408",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Property-Accountant-976408",
  "scraped_at": "2025-07-15T14:32:34.733427",
  "title": "Property Accountant",
  "type_of_work": "Full Time",
  "salary": "$1100/month",
  "hours_per_week": "TBD",
  "date_updated": "Jul 15, 2025",
  "job_overview": "SALARY: $1200/month\r\nJOB TYPE: Full-Time\r\nSCHEDULE: Available to work during US working hours (EST) and/or weekends\n\r\nJob Highlights:\n\r\n- HMO\r\n- Pay raise and promotion for experienced applicants\r\n- Fast-track career progression in a fast-growing company\r\n- Dynamic with a fun and talented team in a harmonious working environment\n\r\nYOUR NEW COMPANY:\n\r\nWe are looking for a highly organized and detail-oriented Property Accountant (CPA required) to oversee the financial operations of our property portfolio. The ideal candidate will have experience using AppFolio Property Management software and will be responsible for managing daily bookkeeping, maintaining accurate financial records, and supporting property management through financial reporting and reconciliation. This is a remote role, with working hours from 8 AM to 4 PM EST.\n\r\nJOB SUMMARY:\r\nWe're on the lookout for a superstar Property Accountant to join our dynamic team. As the maestro of our financial operations, you'll be in charge of overseeing and managing some of the daily tasks in our accounting department. You'll be helping our Head of Financial and Accounting to ensure that our financial reports are accurate and prepared in record time.\n\r\nBut that's not all! You'll also have the power to establish our financial status through the implementation of innovative systems. Your mission: collect, analyze, validate, and report data with flair and finesse. Think of yourself as a financial superhero, swooping in to save the day with your amazing skills and unwavering attention to detail.\n\r\nIf you're ready to embark on this thrilling adventure and take our accounting functions to new heights, join us! We promise a vibrant and supportive work environment where your expertise will shine and you'll have a blast along the way.\n\r\nJOB DESCRIPTION:\n\r\nManage and manage the daily operations of the accounting department, including:\r\n-month and end-of-year procedures\r\n-accounts payable and receivable\r\n-cash payments\r\n-the general ledger\r\n-wages and utilities\r\n-treasury and budgeting\r\n-cash projections\r\n-analysis of revenue and expenditure variance analysis\r\n-reconciliations of capital assets\r\n-reconciliation of trust account statements\r\n-check is executed\r\n-capital asset activity\r\n-debt-related activities\r\n-maintain and analyze accounting data to generate financial reports or statements\r\n-develop and implement suitable accounting procedures, policies, and concepts\r\n-coordination and completion of yearly audits\r\n-make recommendations\r\n-enhance systems and processes and implement corrective actions\r\n-assign tasks and supervise employees to guarantee compliance and correctness.\r\n-achieve financial accounting goals\r\n-create and manage fiscal files and records to document transactions.\n\r\nQUALIFICATIONS & EXPERIENCE:\r\n- Minimum of 2 years experience as an Accounts Payable Specialist, Accounting Supervisor, Property Accountant or Finance Manager.\r\n- Proficiency in Microsoft Applications, especially Excel, and knowledge of accounting software and databases\r\n- Experience with or knowledge of real estate management (Required)\r\n- Accounting experience in property management\r\n- Ability to manipulate large amounts of information\r\n- Ability to work independently\r\n- Excellent organizational skills and attention to detail\r\n- Excellent written and verbal communication skills\r\n- A positive attitude and a professional demeanor\r\n- Project Management skills a plus\n\r\nPlease follow the instructions carefully before applying.\n\r\n1. Make the subject title: Property Accountant_[Complete Name]\r\n2. Write a cover letter letting us know why you're the best candidate for this position. Maximum of 5 sentences.\r\n3. Include a 1-minute video introduction (First part of the video, let me know what you had for breakfast today. With 3 or more sentences, tell me what you've learned from your past professional experiences. Lastly, tell me what you know about the campground industry)\r\n4. Include your resume, computer specs, internet speed\r\n5. Available to work during US working hours (EST) and/or weekends.\n\r\nWe will not entertain any applications without the required information from above. Thank you!\n\r\nJob Type: Full-time\n\r\nSalary: Php50,000.00 - Php60,000.00 per month\n\r\nBenefits:\n\r\nHealth insurance\r\nOpportunities for promotion\r\nPay raise\r\nWork from home\r\nSchedule:\n\r\n8-hour shift\r\nEvening shift (Eastern Standard Timezone)\r\nHolidays\r\nWeekends\r\nExperience:\n\r\nAccounting: 2 years (Preferred)",
  "skill_requirements": [
    "Accounting Management",
    "Appfolio",
    "Attention to Detail"
  ],
  "is_active": true,
  "status_history": [
    {
      "status": "active",
      "timestamp": "2025-07-15T14:32:34.735804",
      "reason": "Job first discovered"
    }
  ]
}