{
  "job_id": "995850",
  "url": "https://www.onlinejobs.ph/jobseekers/job/Social-Media-Manager-and-Marketing-Assistant-995850",
  "scraped_at": "2025-07-15T12:31:24.440074",
  "title": "Social Media Manager and Marketing Assistant",
  "type_of_work": "Part Time",
  "salary": "US $4/hr",
  "hours_per_week": "20",
  "date_updated": "Jul 14, 2025",
  "job_overview": "Marketing Assistant – Key Responsibilities and Overview\n\r\nRole Overview:\r\nAs a UX/UI and Marketing Expert, you will combine your expertise in user-centered design and marketing strategies to elevate clients' digital presence. You’ll be responsible for crafting seamless user experiences, creating visually compelling content, and executing marketing campaigns that resonate with audiences and drive measurable business outcomes. This role blends creative design with strategic marketing to create engaging digital experiences across web, mobile, and social platforms.\n\r\nKey Responsibilities:\r\n1. Copywriting & Content Development\r\nContent Creation: Write persuasive blog posts, engaging social media content, and impactful email campaigns that align with the client's voice and marketing goals.\n\r\nLead Magnet Development: Design content (e.g., eBooks, whitepapers, webinars) to attract new leads and convert them into long-term clients.\n\r\nContent Planning & Scheduling: Maintain and update a content calendar to ensure consistent delivery of high-quality content across all channels.\n\r\n2. Social Media Management\r\nGrowth & Engagement: Develop and execute strategies to increase followers, engagement, and interactions on platforms such as Facebook, LinkedIn, and Instagram.\n\r\nBrand Interaction: Engage with followers, monitor social sentiment, and respond to inquiries in real-time, ensuring a positive and responsive brand image.\n\r\nPlatform-Specific Campaigns: Tailor content for each social media platform to maximize reach, engagement, and brand impact.\n\r\n3. Email Marketing & List Management \nEmail Campaigns: Design and implement eye-catching and effective email campaigns using platforms like Mailchimp, focusing on personalization and segmentation.\n\r\nAutomated Workflows: Set up and manage email automation sequences, including welcome series, lead nurturing, and re-engagement campaigns.\n\r\nAudience Segmentation: Organize and manage segmented email lists to deliver personalized, high-converting messages.\n\r\n4. Audio & Video Editing\r\nMultimedia Content Creation: Edit and optimize video and audio content for social media platforms, websites, and online courses, ensuring content is polished and professional.\n\r\nEngagement-Driven Media: Create short-form videos and audio snippets that capture attention and drive engagement across digital channels.\n\r\n5. Graphic Design & Visual Content\r\nDesign Creation: Use design tools such as Canva, Figma, or Adobe Creative Suite to produce visually engaging assets that align with brand guidelines and resonate with the target audience.\n\r\nConsistent Branding: Ensure all digital assets – from social media posts to email templates – reflect the client’s unique branding, keeping the design consistent and on-message.\n\r\nUI/UX Design Collaboration: Work with the product or web design teams to ensure digital interfaces are user-friendly, visually appealing, and aligned with marketing objectives.\n\r\n6. Tech Administration & CRM Management\r\nCRM Integration: Assist in managing client CRM systems (e.g., HubSpot, Salesforce) by maintaining customer data, tracking interactions, and refining workflows.\n\r\nData Management & Reporting: Track the effectiveness of marketing initiatives and provide detailed reports on key metrics like open rates, engagement, and conversion rates.\n\r\nTech Optimization: Collaborate with internal teams to optimize client websites and digital platforms using data and analytics.\n\r\n7. Project Coordination\r\nTask Management: Utilize project management tools (e.g., Trello, Asana) to coordinate tasks and ensure the timely execution of marketing campaigns and design initiatives.\n\r\nTeam Collaboration: Collaborate across departments, ensuring that all design and marketing efforts are aligned with project timelines and client goals.\n\r\n8. Vendor Research & Management\r\nVendor Relations: Source, manage, and maintain relationships with third-party vendors for paid media, design tools, content production, and more.\n\r\nVendor Coordination: Ensure the timely delivery of external services, froUpgrade to see actual infodia buys to content creation, while maintaining high-quality standards.\n\r\n9. SEO & Keyword Research\r\nSEO Optimization: Optimize web content, blog posts, and product pages for search engines through thorough keyword research and application of SEO best practices.\n\r\nMetadata Management: Update meta titles, descriptions, and alt texts to enhance search visibility.\n\r\nContent Strategy for SEO: Ensure that all content is aligned with SEO goals, focusing on user intent and search engine optimization.\n\r\n10. Community & Podcast Management\r\nCommunity Engagement: Manage and moderate online communities (forums, social media groups) to foster engagement, answer questions, and encourage discussions.\n\r\nPodcast Management: Oversee podcast guest outreach, handle recording schedules, and manage editing and publishing to ensure smooth operations.\n\r\n11. Course & Webinar Coordination\r\nCourse & Webinar Setup: Manage the logistics of creating and promoting online courses and webinars, tracking user participation and engagement.\n\r\nInteractive Sessions: Coordinate live sessions, manage participant feedback, and optimize the experience for both clients and learners.\n\r\nContractor Perks:\r\nHassle-Free Invoicing: Enjoy streamlined invoicing and payment processing through the company, allowing you to focus on your work.\n\r\nHealth & Financial Benefits: Access health and financial benefits through the contractor benefits partner.\n\r\nExclusive Job Board: Apply for high-impact marketing projects across a range of industries including consulting, real estate, finance, and nonprofit sectors.\n\r\nCommunity Support: Access an extensive library of resources including templates, upskilling opportunities, webinars, and networking events.\n\r\nWork from Anywhere: Enjoy 100% remote work with flexible hours that support your lifestyle.\n\r\nDedicated Success Consultant: Receive personalized support from a dedicated consultant to help you succeed in each engagement.\n\r\nPreferred Skills and Experience:\r\nSocial Media Expertise: Proven experience with social media marketing, especially across Facebook, LinkedIn, Instagram, and emerging platforms.\n\r\nContent Strategy Development: Demonstrated ability to create data-driven content strategies that engage audiences and achieve business goals.\n\r\nTech-Savvy: Comfortable with digital marketing platforms such as Google Analytics, Hootsuite, Buffer, Mailchimp, Canva, and others.\n\r\nRemote Work Proficiency: Proven track record of working independently and managing time efficiently in a remote environment.\n\r\nAnalytics & Optimization: Familiarity with data analysis tools to monitor campaign performance and optimize marketing strategies accordingly.\n\r\nKey Attributes:\r\nDetail-Oriented: Strong organizational and time-management skills, ensuring high-quality, precise work.\n\r\nSelf-Motivated: Able to work independently, managing multiple projects with a proactive and solution-oriented mindset.\n\r\nClear Communicator: Effective communication skills, capable of explaining complex concepts clearly to clients and teaUpgrade to see actual infombers alike.\n\r\nAdaptable Problem-Solver: A resourceful problem-solver who thrives under pressure and is capable of quickly adapting to new challenges.\n\r\nReliable: Consistently meets deadlines and delivers quality results that exceed expectations.\n\r\nContractor Requirements:\r\nAvailability: Must be available Monday through Friday, during standard business hours.\n\r\nHome Office Setup: A reliable computer (Mac or PC), smartphone, and stable internet connection are essential.\n\r\nMarketing Tools Proficiency: Experience using key marketing and design tools, including social media platforms, email marketing platforms, analytics tools, and design software.\n\r\nDigital Marketing Knowledge: A comprehensive understanding of digital marketing best practices, social media strategy, and compliance with legal standards (e.g., GDPR, copyright).\n\r\nAs a UX/UI and Marketing Expert, you will play a pivotal role in creating a cohesive online presence for clients, ensuring that both design and marketing strategies align seamlessly to engage customers and drive measurable growth. Your work will directly impact the success of clients by enhancing user experiences and crafting innovative marketing campaigns that lead to sustained business success.",
  "skill_requirements": [
    "Facebook marketing",
    "Canva",
    "CapCut"
  ],
  "is_active": true,
  "status_history": []
}